{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1461866070,"rating":74,"authorHandle":"RussianCodeCup","modificationTimeSeconds":1461866594,"id":44604,"title":"\u003cp\u003eRussian Code Cup 2016 — Announcement. Dates, Prizes, Rules.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, all!\u003c/p\u003e\u003cp\u003eWe are glad to announce the final version of Russian Code Cup 2016 rules! The most important news of this year is that Russian Code Cup goes international, now the problems are available in both Russian and English. Anybody can participate, to enter the competition, please register at \u003ca href\u003d\"http://www.russiancodecup.ru/?utm_source\u003dCodeforces\u0026amp;utm_medium\u003dAnnounce\u0026amp;utm_campaign\u003drcc2016\"\u003ehttp://russiancodecup.ru\u003c/a\u003e, participants of previous championships need to confirm their participation in their profile.\u003c/p\u003e\u003cp\u003eThis year the prize pool is again 750 000 rub. We have changed the structure of the prizes to give more money prizes away, so top 25 now get cash. The winner gets 150 000 rub, the second place gets 100 000 rub, the third place gets 65 000 rub. Those who take places from 4 to 10 get 30 000 rub, and places from 11 to 25 can account for 15 000 rub. Top 200 in elimination round get branded Russian Code Cup t-shirts.\u003c/p\u003e\u003cp\u003eThere are three levels of the championship. First you must qualify in one of the three Qualification Rounds (May 8, May 29 and June 5). Top 200 from each round proceed to Elimination Round (June 19), top 50 from it proceed to Final Round (September 18). If you fail to qualify in a Qualification Round you can still try in the following Qualification Rounds.\u003c/p\u003e\u003cp\u003eWe invite you to the Qualification Round 1 \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dRussian+Code+Cup+2016+Qual+1\u0026amp;iso\u003d20160508T19\u0026amp;p1\u003d166\u0026amp;ah\u003d2\"\u003eon Sunday, May 8, 19-00 Moscow Time\u003c/a\u003e, and wish everyone good luck!\u003c/p\u003e\u003c/div\u003e","tags":[]}}