{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1504608951,"rating":31,"authorHandle":"mkisic","modificationTimeSeconds":1504608951,"id":54338,"title":"\u003cp\u003eHeuristic solution for Arpa and list of numbers\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eYesterday I found interesting solution for \u003ca href\u003d\"/contest/850/problem/B\" title\u003d\"Codeforces Round 432 (Div. 1, based on IndiaHacks Final Round 2017)\"\u003e850B - Arpa and a list of numbers\u003c/a\u003e.\u003cbr /\u003e \u003cbr /\u003eLet G\u003dgcd of all numbers after all operations.\u003cbr /\u003e First observation was if I have some prime number p which divides G, then I can easy in O(number of different numbers in array a) calculate minimum cost to make list good. Now question is only for which prime numbers I will calculate minimum cost.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eI have some MAGIC constant and I will calculate minimum cost for first MAGIC prime numbers and MAGIC most frequent prime numbers which are not in first MAGIC primes. Frequency of some p is increased by 1 if p divides a[i].\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eFirst idea was to set MAGIC\u003d12, this will pass all official test data, but there is counter-example. We can choose some prime P which is not in first 12 primes and put in array a numbers: P, 2P-1, 2P-1, 4P-1, 4P-1, 6P-1, 6P-1, ... and so on while numbers are less than 10^6.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eBut there is way how to avoid this problem. We can see that numbers in array in that example grow very fast so N will be small and that means that we can calculate minimum cost for more primes, so if I set \u003cbr /\u003e MAGIC\u003dmin(3*10^7/number_of_different_numbers_in_array, number_of_primes_less_than_10^6) \u003cbr /\u003e then algorithm will work on that example.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003eIs there any counter-example for this algorithm and if counter-example doesn\u0027t exist, why is that?\u003cbr /\u003e Here is my solution: \u003ca href\u003d\"/contest/850/submission/30086367\" title\u003d\"Submission 30086367 by mkisic\"\u003e30086367\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["heuristics"]}}