{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1484406965,"rating":12,"authorHandle":"belowthebelt","modificationTimeSeconds":1484406965,"id":49766,"title":"\u003cp\u003eHackerEarth January Clash\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces community!\u003c/p\u003e\u003cp\u003eLink: \u003ca href\u003d\"https://www.hackerearth.com/january-clash-17/problems/\"\u003ehttps://www.hackerearth.com/january-clash-17/problems/\u003c/a\u003e\u003c/p\u003e\u003cp\u003eI want to invite all of you to participate in January Clash at HackerEarth. The contest has been running for 9 hours already, so we apologize for this late post. But, there\u0027s still a lot of time left: 15 hours to go. Let\u0027s see if we\u0027re going to see a change of the top-scorers on the leaderboard. The contest duration is 24 hours, so there should be some comfortable time for every timezone. :)\u003c/p\u003e\u003cp\u003eThere are six tasks in the problemset. Five of them are standard algorithmic problems with partial solutions allowed — you get points for every test that your solution passed. And the final task is an approximate problem — your score for this task depends on how good your solution is comparing to current best solution.\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Yury_Bandarchuk\" title\u003d\"Candidate Master Yury_Bandarchuk\"\u003eYury_Bandarchuk\u003c/a\u003e is the author of this problemset. He\u0027s done a great job preparing the problem-set. And I hope you guys will enjoy the questions prepared. \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/niyaznigmatul\" title\u003d\"International Grandmaster niyaznigmatul\"\u003eniyaznigmatul\u003c/a\u003e worked on this contest as the tester and editorialist — he is responsible for taking care of the problems. And not surprisingly, he has done a commendable job for testing the problem-set. I hope you guys will not be disappointed.\u003c/p\u003e\u003cp\u003eGood luck!\u003c/p\u003e\u003c/div\u003e","tags":["hackerearth","clash","january-clash","glhf"]}}