{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1525373234,"rating":71,"authorHandle":"farmersrice","modificationTimeSeconds":1525376192,"id":59232,"title":"\u003cp\u003eRepeal the changes that are bad for the health of Codeforces\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eRepeal the division cutoff change\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFirstly, it causes rating inflation. In all div1 + div2 rounds the div2 players boost the div1 players, so even if someone does really badly relative to div1, he or she will get a much reduced loss, or even a positive rating change! In these div2 rounds there will be no reds/yellows to counter the buffer as well, so candidate masters will benefit even more!\u003c/p\u003e\u003cp\u003eSecondly, it does not solve the problem it seeks to address, rather it shifts it to higher rating ranges. Now instead of barely 1900s being unable to solve anything, we will have barely 2100 “masters” being unable to solve anything! We all know these titles are just for show, but this is a little ridiculous.\u003c/p\u003e\u003cp\u003eIn addition, this shifting of the rating range also exaggerates existing problems. In rare occasions, even now, somebody will score 1st place in div2 and jump to master or high candidate master even if their skill level is low. With this change, we will have people jumping to grandmaster without even doing a single div1 contest! \u003c/p\u003e\u003cp\u003eWith this change, ratings will become a joke. And that is why we need to repeal the division cutoff change.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAmendments to the creation of division 3\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThanks to ppavic\u0027s insight, I revised my statement on repealing the creation of div3. There still need to be some key changes, however:\u003c/p\u003e\u003cp\u003eThe rounds should be limited to players with less than 1400 rating. 1600 is much too high if we are aiming to see the difference between beginner players who can solve only easy problems like A and B. If someone can solve A, B, C, then he/she should be in div2, as that is already solving 3 out of the 5 problems. In addition, we need a quota on the number of div3 contests in order to stop them from hampering the div2 or div1 contests, perhaps one per month.\u003c/p\u003e\u003c/div\u003e","tags":[]}}