{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1504872801,"rating":1,"authorHandle":"DR.MANHATTAN","modificationTimeSeconds":1505040443,"id":54412,"title":"\u003cp\u003eMy Performance analysis : Codeforces Round #432 (Div. 2, based on IndiaHacks Final Round 2017)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cem\u003eContest Talk\u003c/em\u003e ------------------  \u003ca href\u003d\"//codeforces.com/contest/851\"\u003eCodeforces Round #432 (Div. 2, based on IndiaHacks Final Round 2017)\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHighlights\u003c/strong\u003e : Did the 1st (A) question and Got AC in the first go, struggled till the end to get the 2nd question (B) right.\u003c/p\u003e\u003cp\u003e\u003cem\u003eAnalysis\u003c/em\u003e :\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/contest/851/problem/A\"\u003eA. Arpa and the Mexican Wave\u003c/a\u003e The first question seemed difficult at first , so I took a lot of time thinking about all the scenarios that could be possible, and finally typed in the solution ( all in all taking 42 minutes , in contrast, the person who submitted it the first who took less than a minute :O ) \u003c/p\u003e\u003cp\u003eAnd my code follows : \u003c/p\u003e \u003cpre\u003e\u003ccode\u003e\u003cbr /\u003e     int main(){\n\n     \tll n,k,t; // Unnecessarily taken long long ( int would have done )\n     \tcin\u0026gt;\u0026gt;n\u0026gt;\u0026gt;k\u0026gt;\u0026gt;t;\n     \tif(t\u0026gt;(n+k))t\u003d(t%(n+k)); // check out this UNNECESSARY STEP !! :-/\n\n     \tif(t\u0026lt;\u003dk){\n     \t\tcout\u0026lt;\u0026lt;t;\n     \t}\n     \telse {\n     \t\tif(t\u0026lt;\u003dn)cout\u0026lt;\u0026lt;k;\n     \t\telse cout\u0026lt;\u0026lt;k-(t-n);\n     \t}\n     \treturn 0;\n     }\n\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eShould have really given attention to this constraint :\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e\u003cbr /\u003e1 ≤ t \u0026lt; n + k\n\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eAll one had to do keeping the constraints in mind was this : \u003c/p\u003e \u003cpre\u003e\u003ccode\u003e\u003cbr /\u003e int main(){\n\n     \tint n,k,t;\n     \tcin\u0026gt;\u0026gt;n\u0026gt;\u0026gt;k\u0026gt;\u0026gt;t;\n     \tcout\u0026lt;\u0026lt;min(t,min(k,n+k-t)); \n     \treturn 0;\n     }\n\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eIn retrospect, this could very well have been done in under a minute if one understood the problem statement fast enough, as the implementation is easy and short ! \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/contest/851/problem/B\"\u003eB. Arpa and an exam about geometry\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIf you\u0027ve read my previous blog post , you know about my love for geometry problems and the deep rooted connection they have with Star Trek . This question is a perfect example of how I link those 2 things together . \u003c/p\u003e\u003cp\u003eThe question talks about a rotation of the triangle about an axis, so as to find out if the previous points once rotated would move to the subsequent points or not. The first thing that I imagined was an equilateral triangle ( As I would later find out this to be a case of not reading the question thoroughly enough ). I submitted the solution right away and failed the pretest :-| . Then I went on to again read the question slowly and carefully this time. So, we only had to ensure that 2 sides were of the same length ( that the only way you could the point from one point to the next ( of 2 points ) ), and not just any 2 sided needed to be same ( the side B and C were the ones that needed to have equal length ).\u003c/p\u003e\u003cp\u003eThis is the image that came to my mind right away : \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/5f/f4/5ff48f7844ce158bb0e0a48d573190e7ae7b5109.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eI finally got it !! ( or so I thought ) I used the distance formula and took all the values as doubles to compare the 2 sides that mattered, got it Wrong on the pretests. (NOTE TO SELF: Avoid floating points like the PLAGUE! )\u003c/p\u003e\u003cp\u003eAs I would later find out , almost every one who eventually got this problem right , got it wrong the first time ( because they too used floating points, but later realised that it was not needed and the length could be compared directly (in integer form ) as the square-roots of the integers could be cancelled on both sides ( and that would lead to integer numbers for comparison ) ).\u003c/p\u003e\u003cp\u003eI was still unable to get the problem accepted ( as I did not check for collinearity of all points ). Later I did it by using the point slope method ( which does not require floating points and gets an integer result ).\u003c/p\u003e\u003cp\u003eCode follow : \u003c/p\u003e \u003cpre\u003e\u003ccode\u003e#define sqr(x) (x)*(x)\ntypedef long long ll;\n\n   ll   length(ll  ax,ll  ay,ll  bx,ll  by){\n\n     \treturn (sqr(bx-ax)+sqr(by-ay));\n\n     }\n\n     int main(){\n\n     \tll  ax,ay,bx,by,cx,cy;\n\n     \tcin\u0026gt;\u0026gt;ax\u0026gt;\u0026gt;ay\u0026gt;\u0026gt;bx\u0026gt;\u0026gt;by\u0026gt;\u0026gt;cx\u0026gt;\u0026gt;cy;\n\n     \tll  l1\u003dlength(ax,ay,bx,by);\n\n     \tll  l3\u003dlength(bx,by,cx,cy);\n\n\n     \tif( (by-cy)*(bx-ax)\u003d\u003d(bx-cx)*(by-ay)  ){\n     \t\tcout\u0026lt;\u0026lt;\u0026quot;No\u0026quot;;\n\n     \t}\n     \telse if(l1\u003d\u003dl3){\n     \t\tcout\u0026lt;\u0026lt;\u0026quot;Yes\u0026quot;;\n     \t}\n     \telse cout\u0026lt;\u0026lt;\u0026quot;No\u0026quot;;\n     \treturn 0;\n     }\n\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003e....................\u003c/p\u003e\u003cp\u003eAll questions after this remain unsolvable by me because of my lack of enough algo-ds knowledge ...\u003c/p\u003e\u003cp\u003eEffect on my progress graph: My graph dipped lower! :-|\u003c/p\u003e\u003c/div\u003e","tags":["#for_beginners","#analisys","#self critique"]}}