{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1483330032,"rating":9,"authorHandle":"Sazzon","modificationTimeSeconds":1483330032,"id":49499,"title":"\u003cp\u003eA Competitive Paradox.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi everyone!\u003c/p\u003e\u003cp\u003eRecently I\u0027ve been taking notes on my behavior during contests (It can be some round here in Codeforces, Hackerrank or even at ACM-ICPC sub-regionals) and trying to come up with a way to setup my brain to perform well. Sad thing is: \u003cstrong\u003eI get too nervous\u003c/strong\u003e .\u003c/p\u003e\u003cp\u003eMy first attempt in a competitive envoriment was in 2014, an Brazillian ACM-ICPC sub-regional (not a very intense envorioment as you may guess). I was there, me and my colleages. No hopes on getting a good place. Just for fun. Trying my best to prove something to someone, I don\u0027t know. For our surprise, we came in 4ยบ out of 31 teams. That was a great result for our first try! But one year later, with other teammates (better ones, in my opinion!) and after one entire year of intense studying (I was definetly more prepared) we came in 5ยบ place. I was personally devastated. I couldn\u0027t pass even the easy ones, my teammates helped a lot and basicly carried me entirely.\u003c/p\u003e\u003cp\u003eAlso I\u0027m on a streak of highs and lows on contests here. All of them I get the feelling that a can do better in the next one (which I do in some of cases and others ... not so much). The thing I noticed was: \u003cstrong\u003eIf some contests is really important to me and I have big expectations on my performance, I do worse than I thought. If not, I get my regular performance.\u003c/strong\u003e. It seems that if I try to be calm and ready to do well and I fail 1 single time during the contest I get on spiral of failure that only seems to get worse. Like a \u003cstrong\u003eparadox\u003c/strong\u003e, if I force myself to do well, I do worse. Otherwise I do regular (most of the times).\u003c/p\u003e\u003cp\u003ePS: My latest results that prove this behaviour was the \u003ca href\u003d\"//codeforces.com/contest/750\"\u003elast contest of 2016 here\u003c/a\u003e. I wanted to start 2017 with the right foot and do well in this one and change my rank: \u003cstrong\u003eSolved 1 out of 8\u003c/strong\u003e. Joined \u003ca href\u003d\"https://www.hackerearth.com/january-easy-17/\"\u003ethis\u003c/a\u003e hacker earth contest with no hopes of getting a good place or even 2 questions right: \u003cstrong\u003eSolved 3 out of 6\u003c/strong\u003e... \u003c/p\u003e\u003cp\u003ePS2: And is not even about my knowledge barrier. Some questions I do naive errors or overkill questions. Or my mind is blocked during contest time and I can\u0027t solve an easy problem (I can solve it even after minutes out of contest area ...).\u003c/p\u003e\u003cp\u003eI can\u0027t be the only one, please!\u003c/p\u003e\u003cp\u003eIs this ever happened to you ? What did you do to overcome this problem ? Did you overcame this with time and patience or it was just a change in your mindset ?\u003c/p\u003e\u003cp\u003ePlease share your thoughts and behaviours so me and other troublesome people can be as good as you are. \u003c/p\u003e\u003cp\u003eSorry for the long post! Happy New Year !! \u003c/p\u003e\u003cp\u003e:-)\u003c/p\u003e\u003c/div\u003e","tags":["beginner","competitive programming","nervousness","mindset","psychological problem"]}}