{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1466158799,"rating":66,"authorHandle":"gKseni","modificationTimeSeconds":1466175173,"id":45486,"title":"\u003cp\u003eТехнологии успеха: Первый успех саратовских команд \u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ финале 2002 г. в Гонолулу впервые выступавшая в финале команда Саратовского ГУ, в которую входили Михаил Мирзаянов, Илья Эльтерман и Андрей Лазарев, произвела настоящую сенсацию. Более двух часов она шла во главе турнирной таблицы, и на финише ей не хватило удачи и одной решенной задачи для победы. В итоге — шестое место и звание чемпиона Европы, которые воспринимались бы как фантастический успех и огромная удача, если бы «судьба не подразнила» титулом чемпионов мира. О своем пути к этому счастливому и в то же время немного трагическому финалу рассказывает Михаил Мирзаянов, тогда студент, а сейчас создатель и руководитель Codeforces, в своей статье, посвященной становлению олимпиадного движения в Саратове.\u003c/p\u003e\u003cp\u003eПредыдущие части:\u003cbr /\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/45315\"\u003eТехнологии успеха: Стратегии для будущих чемпионов мира по программированию\u003c/a\u003e\u003cbr /\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/45259\"\u003eТехнологии успеха: Как начинался чемпионат Урала по программированию\u003c/a\u003e\u003cbr /\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/45235\"\u003eТехнологии успеха: Тернистый путь к полуфиналу\u003c/a\u003e\u003cbr /\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/45199\"\u003eТехнологии успеха: Начало пути\u003c/a\u003e \u003c/p\u003e \u003chr /\u003e\u003cp\u003eКак все начиналось? Это был май 2000 г. — то самое время, когда сессия еще не началась, а погода уже установилась. В тот май на каждом углу на проспекте Земфира пела о ромашках и кораблях.\u003c/p\u003e\u003cp\u003eГоворят, Илья Эльтерман (будущий капитан команды) долго советовался с нашими тренерами по поводу состава. После какого-то семинара, где я рассказывал о построении перестановок и о таблицах инверсий, Илья и Павел Комков подошли ко мне и предложили стать членом новой команды. Для меня это было трудное решение перейти в другую команду, так как я сам был капитаном Saratov SU#4, выступавшей в сезоне 1999/2000 гг., и к тому же считал этот состав вполне перспективным. \u003c/p\u003e\u003cp\u003eРешилось все просто: с одной стороны, мы договорились попробовать поучаствовать вместе (Илья Эльтерман, Андрей Лазарев и я) в наступающем интернет-соревновании IPSC 2000. С другой стороны, Илья Агошков, член моей команды, «вовремя» пропустил еще пару тренировок, что подтвердило систему его посещений: одна из пяти — уже много. \u003c/p\u003e\u003cp\u003eДата 19.05.2000 г. стала «днем рождения» нашей команды — в лаборатории номер 81 корпуса, «следующего за моргом», состоялось первое соревнование, которое мы писали вместе. Назывались мы тогда Saratov SU#l и заняли почетное 27 место. До сих пор вспоминается, как после безуспешных попыток решить одну из задач, Андрей понял, что она не работает на трех тестах. На каждый из тестов надо было выводить слово «YES» или «NO». Всего-то 2\u003csup\u003e3\u003c/sup\u003e варианта перебрать! С седьмой попытки, к нашей радости, мы ее сдали. Уже на летних тренировках было официально объявлено о новом составе, и наша команда получила скромное имя Saratov SU#3. \u003c/p\u003e\u003cp\u003eТак как Андрей уехал на турбазу отдыхать, было решено установить в команде систему штрафов за пропуск или опоздание. По приезду Андрея ждал сюрприз! \u003c/p\u003e\u003cp\u003eВ то лето я много решал один, по ночам — это стало правилом. Я с ностальгией вспоминаю то время, когда я писал дома в ночь по тренировке. Тогда было время больших открытий: мы придумывали, как решать новые задачи, составляли методы. Сейчас эти задачи кажутся смешными, методы вспоминаются в плохих снах. \u003c/p\u003e\u003cp\u003eЛетом мы писали много интернет-соревнований на известном испанском сервере, а также на только что появившемся, уральском. Мы шутили: места мы занимаем хорошие, но невысокие. На тренировках мы сразу расставили все точки над «ё» и лишь единожды уступили первое место. Илья бы добавил: «Да ладно, мы тогда часа на три раньше ушли, на пляж отправились». Тем летом я последний раз поговорил с Максимом Бабенко в Саратове. В следующий раз мне удалось это сделать только через два года в Гонолулу. Максим стал первым саратовским школьником, выступившим на Международной олимпиаде по информатике. Закончив ФТЛ №1, он уехал учиться в МГУ. Пару слов о нем: когда я учился решать квадратные уравнения, он брал интегралы, когда я научился брать интегралы, он пытался аналитически продолжить на R функцию вида N^N^ ...^N, высота степени равна N. \u003c/p\u003e\u003cp\u003eА потом был четвертьфинал. Это был своеобразный тест на прочность нашей команды. В тот год приехали две команды из Нижнего Новгорода — в одной были Владимир Мартьянов, четырехкратный чемпион России среди школьников, двукратный чемпион мира среди школьников, и Михаил Баутин, абсолютный чемпион мира среди школьников 2000 г. Баутина мы называли про себя не иначе как: «ну этот ... 700 баллов из 700», вспоминая его выступление на Международной олимпиаде. \u003c/p\u003e\u003cp\u003eТест на прочность наша команда прошла, соревнование провалила. Мы заняли второе место. На следующий день Андрей бил себя в грудь и кричал: «Да В простая задача! Ее надо было решать!». Я ему в ответ: «Я и говорю, в Е все понятно!» Хотя, говоря по правде, первое место мы бы все равно не заняли. Уж больно резво решал все «700 баллов из 700». \u003c/p\u003e\u003cp\u003eСледующим барьером был полуфинал. Именно перед ним Илья произнес ту фразу, которую он так не любит вспоминать: «Если Saratov SU #1 обойдет нас, я повешусь на своем собственном ремне». Готовились мы день и ночь. Андрей придумывал пачками задачи, я пытался их пачками решать. Решали все, что видели, а на глаза попадалось многое. \u003c/p\u003e\u003cp\u003eВ финал в тот год выходило команд шесть, и я помню те долгие часы телефонных разговоров между мной и Андреем: «Ну ты посчитай: Москва, ладно, это раз. Далее Питер, ну там два вуза. Еще Нижний Новгород. А остальные? Что мы Урал никогда не обходили? Или Беларусь?» \u003c/p\u003e\u003cp\u003eК полуфиналу 2000 г. нас уже знали... \u003c/p\u003e\u003cp\u003eДолгими зимними вечерами я вспоминаю полуфинальную задачу G. Ее решили все из первой тридцатки, кроме нас. Это был удар. Команда Saratov SU#l заняла 16 место, мы -18 место. Кто-то вспомнил про ремень. Далее был период осмысления. Он продлился до середины февраля 2001 г. Только тогда наша команда собралась снова. Было время, когда я думал, что команда Saratov SU#3 должна умереть. В феврале я думал уйти из команды, решив, что я — слабое звено. К счастью, мое решение так и осталось неосуществленным. Стабильно тренироваться мы стали только ближе к лету. И опять понеслось. Тренировки, контесты, опять тренировки. Четвертьфинал выпал на пик нашей формы, тем более, что команда ННГУ была дисквалифицирована на год за неявку на финал, и мы заняли на нем первое место. Участвуя в интернет-версии питерского четвертьфинала, мы заняли там первое место, опередив их лучшую команду на задачу. \u003c/p\u003e\u003cp\u003eК полуфиналу 2001 г. нас тоже уже знали... \u003c/p\u003e\u003cp\u003eНедавно я узнал, что Матвей Казаков (один из организаторов полуфинала) очень долго, с любовью, подбирал призы для второго места на полуфинале. Он считал, что оно достанется их команде ИТМО#l, в которую, кстати, входил «бывший» саратовец Александр Штучкин, нам он отдавал первое. Не вышло: споткнулись на одной задаче, не проявили прыти в другой — в итоге второе место после команды Штучкина. На самом деле это был триумф! Впервые команда Саратова в финале! Уже вице-чемпионы России, предстоящая поездка в Гонолулу (США, Гавайи) — все это могло вскружить голову. Во время подготовки к финалу 2002 г. на тренировках мы выступали стабильно. В интернет-соревнованиях расстраивались, когда не брали первые места. \u003c/p\u003e\u003cp\u003eПоездку на финал я не забуду никогда. Пляжи и дорогие отели, лучший климат на планете, курорт мирового уровня. Местные девушки постоянно украшали участников финала и тренеров венками цветов. \u003c/p\u003e\u003cp\u003eСам ход соревнования поразил нас, наверное, в первую очередь. Чем? Все было так, как на тренировках. Мы быстро сдали задачи попроще, вышли на первое место (первое в мире, я уже верю с трудом), стали решать задачи потруднее. За час до конца мы были на втором месте. Я помню тот миг, когда, отсылая последнюю шестую задачу, мы знали что, если она пройдет, титул чемпионов мира наш. Андрей нажал «Отправить», все ждали. Нам не повезло, пришел «Неправильный ответ», задачу не зачли. Оставшиеся минyт пятнадцать мы тщетно пытались найти ошибку. \u003c/p\u003e\u003cp\u003eЧемпионы Европы, серебряная медаль чемпионата мира, шестое место в мире. Вот тот набор титулов, с которым мы вернулись в Саратов. В финале мы более двух часов шли на первом месте. Так закончился сезон 2001/2002 гг. \u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/e1/2a/e12aeffd5c6604199b7eb425b43afa753f5d5f78.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eИлья Эльтерман, Андрей Лазарев, Михаил Мирзаянов\u003c/small\u003e \u003c/center\u003e\u003cp\u003eОпущу описание тренировок перед четвертьфиналом 2002 г. , а скажу лишь, что на самом соревновании у нас было лишь третье место. Команда Saratov SU#2 заняла второе, после нижегородцев, которые стали чемпионами четвертьфинального подрегиона. \u003c/p\u003e\u003cp\u003eНа полуфинале у нас тоже было третье место. Супер-команда МГУ, в которую входили Петр Митричев, Максим Бабенко и Евгений Черепанов, показала себя — постоянно опережая по ходу соревнования всех на две задачи, они решили весь комплект задач за час до конца. Вторым был Нижний Новгород. Прошлогодний чемпион России команда Университета ИТМО оказалась лишь шестой. \u003c/p\u003e\u003cp\u003eКак прошел финал в Беверли Хиллз? По ощущениям он был прямой противоположностью прошлогоднему. Он не задался сразу. Клавиатуру мы не привезли, и нам подсунули какую-то нестандартную, операционная система LINUX комфортности не прибавила. \u003c/p\u003e\u003cp\u003eК середине соревнования мы сдали две задачи (команда Митричева к этому времени решила пять) и написали еще пару, в которых посадили глупые ошибки, и их не принимали. Все казалось, если не катастрофой, то бедствием. Наверное, мы справились с ситуацией только благодаря большому тренировочному и соревновательному опыту. Ошибки нашли, придумали, как решать другие задачи. Некоторая интрига возникла в конце соревнования, когда до хорошего места нам не хватало одной решенной задачи. Оставалась одна задача, которую было реально решить за оставшиеся сорок минут. Ее решило большое число команд, но как ее решать мы не знали. После некоторого совещания было принято решение писать ее наиболее простым способом, при этом было абсолютно не ясно, как долго будет работать выбранный алгоритм. Интуиция подсказывала, что надо попытаться. За пятнадцать минут до конца мы ее сдали и переместились, как выяснилось позже, на седьмую строчку в мировом рейтинге, завоевав вторую серебряную медаль. Это было достойным завершением нашей карьеры. Правила таковы, что запрещают участвовать одному человеку, если он более раза участвовал в финале. \u003c/p\u003e\u003cp\u003eВ конце хочется написать искренние добрые слова в адрес наших постоянных и бессменных тренеров и руководителей. Вклад Натальи Львовны Андреевой и Антонины Гавриловны Федоровой в развитии всего движения олимпиад по программированию в Саратове переоценить нельзя. Результаты, достигнутые нашей командой, следствие огромной работы проделанной ими. Я не ошибусь, если скажу, что наша команда состояла из пяти человек. \u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news","технологии успеха"]}}