{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1521765682,"rating":3,"authorHandle":"arvindr9","modificationTimeSeconds":1521814514,"id":58520,"title":"\u003cp\u003e2017 NAIPC Problem A: Pieces of Parentheses\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThe link to the problem can be seen here: \u003ca href\u003d\"http://naipc.uchicago.edu/2017/_static/naipc2017.pdf\"\u003ehttp://naipc.uchicago.edu/2017/_static/naipc2017.pdf\u003c/a\u003e\u003c/p\u003e\u003cp\u003eBasically the problem gives a list of strings of parentheses (not necessarily valid) and asks to find the length of the longest valid string of parentheses by concatenating some of the strings from the list.\u003c/p\u003e\u003cp\u003eI was looking at the solution here: \u003ca href\u003d\"http://www.cs.ucf.edu/~dmarino/progcontests/mysols/northamerica/2017/pieces.java\"\u003ehttp://www.cs.ucf.edu/~dmarino/progcontests/mysols/northamerica/2017/pieces.java\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe solution involves placing the strings into a vector and then ordering them based on \u003cem\u003elow\u003c/em\u003e (the min value of open minus closed over all intermediary characters) then \u003cem\u003ediff\u003c/em\u003e (open minus closed) then \u003cem\u003elength\u003c/em\u003e. Then, DP is used to find the longest length that results when concatenating a subsequence from the vector into a valid string of parentheses.\u003c/p\u003e\u003cp\u003eWhat I am confused about is why the vector can be sorted that way. This seems to imply that any set of strings that form a valid string of parentheses can be rearranged in the sorting order explained above and still form a valid set of parentheses. This seems intuitive (of course you want to have a nonnegative \u003cem\u003elow\u003c/em\u003e value for the first string and you want a positive \u003cem\u003ediff\u003c/em\u003e value for more open parentheses at the beginning of the string), but why does this work?\u003c/p\u003e\u003cp\u003eIf anything I said was unclear, please let me know. Thanks!\u003c/p\u003e\u003c/div\u003e","tags":[]}}