{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1459279312,"rating":70,"authorHandle":"foundLoveOfMyLife","modificationTimeSeconds":1459402745,"id":44081,"title":"\u003cp\u003eEfficient way to improve my rating?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello CF,\u003c/p\u003e\u003cp\u003eI have been working on my rating for about 4-5 months very strongly now and all I see is not much change.\u003c/p\u003e\u003cp\u003eThough there was a great jump in last contest but it was not due to solving more problems, it was just because I solved the problems quickly(which does vary in my case , I am slower at mathematical problems).\u003c/p\u003e\u003ch4\u003eMy approach has been pretty much similar to DFS:\u003c/h4\u003e \u003col\u003e   \u003cli\u003ePick the topic in which you failed.\u003c/li\u003e   \u003cli\u003eSolve problems on the topic till 800~ submissions.( It get\u0027s out of my comfort zone whenever I start solving problems with \u0026lt;1000 submissions). I am many times unable to solve problems ahead! )\u003c/li\u003e   \u003cli\u003ePick new topic.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eNote : There is always a process of up solving going on with all this!\u003c/p\u003e\u003cp\u003eThe improvements I think I have achieved are I am always able to deduce something from the problem that I couldn\u0027t solve that too in the right direction mostly. \u003c/p\u003e\u003cp\u003eBut during the contest many times I fail to solve trivial brute problems too ( Probably with submissions around 600~ — 700~ during the contest ) that is out of my scope sometimes just because I haven\u0027t seen similar problems or I just give up in anxiety of contest.\u003c/p\u003e\u003cp\u003eI think I have started doing fine at problems which are from the genre which I have practiced sometimes I am able to solve problems with 500~ submissions in the contest too.\u003c/p\u003e\u003ch4\u003eNow the problems I am facing are:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003eDe-Motivation as you can see I failed at a DS problem in recent Virtual participation.\u003c/li\u003e   \u003cli\u003eDead locks at solving problems in problem set with \u0026lt;800 submissions.\u003c/li\u003e   \u003cli\u003eUnable to think of perfect or easier solutions to problems such as \u003ca href\u003d\"/contest/631/problem/C\" title\u003d\"Codeforces Round 344 (Div. 2)\"\u003e631C - Report\u003c/a\u003e .\u003c/li\u003e   \u003cli\u003eSometimes failing at even C.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eI think I have learnt sufficient algorithms to at least solve C problem and D problem every time (due to lower complexity). Algorithms and DS I know are : Fenwick tree , Segment Tree , Graph Theory( except Flow algorithms ) , DP , Greedy ,String Algorithms( except Suffix Structures ), Two Pointer , Binary Search , usage of STLs . I am weak at number theory and math.\u003c/p\u003e\u003cp\u003eI have solved around 800~ problems on various judges.\u003c/p\u003e\u003cp\u003eMy aim is probably to be a stable \u003cstrong\u003eCandidate master\u003c/strong\u003e ASAP and I am willing to do anything for it. So,\u003c/p\u003e \u003cul\u003e   \u003cli\u003eWhat am I doing wrong as I am unable to solve good problems still? What extra things I need to put in?\u003c/li\u003e   \u003cli\u003eWhat can be a better approach to increase my knowledge and problem solving skills?\u003c/li\u003e   \u003cli\u003eWhat are your suggestions?\u003c/li\u003e   \u003cli\u003eShould I try practicing on other judges too as I only give contests on them till now?\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThough I see most of the problems on 1000~ solutions in problemset are Div2D yet I sometimes fail at Div2C(last virtual contest)!\u003c/p\u003e\u003cp\u003eI think the contest anxiety will subside slowly for sure as there are many rounds on CodeForces.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eGiven That\u003c/strong\u003e: I don\u0027t really have a coder\u0027s circle in my college with whom I can discuss harder problems.\u003c/p\u003e\u003cp\u003eIf you want to know some more information about me to suggest something please Go on. This will only help me and probably others too.\u003c/p\u003e\u003cp\u003eThank You for your time\u003c/p\u003e\u003c/div\u003e","tags":["rating","growth","depression","aims"]}}