{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1475523911,"rating":65,"authorHandle":"gKseni","modificationTimeSeconds":1475528116,"id":47518,"title":"\u003cp\u003eSession with Bill Paucher on the Quora\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eOn the 26th of September there was the second \u003ca href\u003d\"https://www.quora.com/session/Bill-Poucher/2\"\u003esession with Bill Paucher on the Quora\u003c/a\u003e. There were less questions, but answers were not less interesting. For example, three of them: \u003cbr /\u003e \u003c/p\u003e\u003cdiv style\u003d\"background-color: rgb(250,250,250);padding: 1.0em;\"\u003e \u003cb\u003e\u003ca href\u003d\"https://www.quora.com/What-are-the-pre-requisites-for-starting-competitive-programming-aimed-at-developing-strong-coding-skills/answer/Bill-Poucher\" style\u003d\"color: black;\"\u003eWhat are the pre-requisites for starting competitive programming aimed at developing strong coding skills?\u003c/a\u003e\u003c/b\u003e \u003cbr /\u003e\u003cbr /\u003e I really don’t know. Look at the works of the younger generations of the ICPC extended family (pretty much everything out their on the Internet that relates to sports programming). But let me give it a try, assuming you don’t have resources. \u003cbr /\u003e\u003cbr /\u003e \u003cul\u003e \u003cli\u003eStart by building a small club.\u003c/li\u003e \u003cli\u003eStart recruiting the best professor teaching data structures and algorithms. Don’t look at credentials. Talk to the upperclass students.\u003c/li\u003e \u003cli\u003eStart training sessions. Contact others via the Internet. Go to The ACM-ICPC International Collegiate Programming Contest for some leads.\u003c/li\u003e \u003cli\u003eStart by attending a competitive programming workshop that lasts a few days or a week. Contact ICPC regional directors and coaches for advice.\u003c/li\u003e \u003cli\u003eStart competing in the many on-line contests and sign up through your coach to compete in the ICPC regional.\u003c/li\u003e \u003cli\u003eStart competing on-site at the ICPC regional. Don’t worry about your level of competition. The ICPC is a team sport. Everyone is at different levels. Team members support each other. So it fits that they are typically delighted to share what they have learned with other teams.\u003c/li\u003e \u003cli\u003eStart today.\u003c/li\u003e \u003c/ul\u003e \u003c/div\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/63/8e/638ed8053ce8beb3a370b358d25940a9e36a3d27.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003cdiv style\u003d\"background-color: rgb(250,250,250);padding: 1.0em;\"\u003e \u003cb\u003e\u003ca href\u003d\"https://www.quora.com/What-are-some-of-the-common-personal-traits-among-the-winners-of-the-ACM-ICPC/answer/Bill-Poucher\" style\u003d\"color: black;\"\u003eWhat are some of the common personal traits among the winners of the ACM-ICPC?\u003c/a\u003e\u003c/b\u003e \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003eTypically, they are young.\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e Many winners are young. In fact, people might say, “Wow, these students at the World Finals are a little on the awkward side.” Check them out 4 years later. \u003cbr /\u003e\u003cbr /\u003e They\u0027re brilliant and work hard! They\u0027re often 2 years younger than the average age of a contestant at the regional contest. Few have traveled outside of their comfort zone. \u003cbr /\u003e\u003cbr /\u003e So now they travel to Warsaw, Poland, or St. Petersburg, Russia or Ekaterinburg, Russia or Marrakech, Morocco or Phuket, Thailand or in the Rapid City, South Dakota and the Black Hills. They are picked up at the airport and given VIP treatment at the ACM-ICPC World Finals. There is pageantry and press. And there they are, ready to compete but wondering just how well they will measure up. \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003eThey are from all over the planet.\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e They may be standouts in on-line competitive programming. In 2011, one team were all track athletes. I know because they asked to come a day late. They were competing in a relay in the NCAA Track \u0026amp; Field Finals. A lot have musical talent. There is more about this in another post. \u003cbr /\u003e\u003cbr /\u003e Our model for the World Finals is visiting my grandmother in Verona, Mississippi. You had to get there. But you could count on a comfortable place to sleep, plenty of good food, gifts, treats, and lots of play in a family community. You never had to compete for affection. But, you might have to compete for attention. \u003cbr /\u003e\u003cbr /\u003e So the ICPC World Finals invites folks from every culture in the world. There is respect and a sense of family that affirms. An IBM executive attended once and asked me a question as we were leaving. He said, “Bill, I don’t understand how you do it!” I asked him, “Do what?” “There were absolutely no diversity issues, none at all!” I didn’t know he had that responsibility. This was a decade ago. I said, “When you bring together young problem solvers and greet them with affection and respect, I don’t think you have to do anything at all other than being just.” I still believe that. I also don’t believe that there is a substitute. \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003eThey are very nice and attentive.\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e We were at the Beverly Hilton during the Academy Awards one year. There were celebrities everywhere. There is a story there, but I will never tell the Saran Wrap story. Just be careful when inspecting the Honeymoon Suite. Even though you think that it is empty, you might find a big surprise intended for another. :) \u003cbr /\u003e\u003cbr /\u003e Anyway, the environment was very cool. Sean Connery came by to the IBM Chill Zone and enjoyed the play. He asked when and where it would be the next year so he might be able to attend. Elizabeth Taylor was at breakfast. Lionel Richie was performing at a parallel function. Jennifer Lawrence was there. Those folks were very nice. However, some of the other celebrities were pretty demanding. \u003cbr /\u003e\u003cbr /\u003e The hotel management team was edgy about bringing in several hundred college students during the Academy Awards. All U.S. hotels are very aware of the potential damage during college Spring Break. I had assured them that the ACM ICPC World Finals sponsored by IBM was an entirely different clientele. \u003cbr /\u003e\u003cbr /\u003e After the World Finals was over, the hotel manager told us ours was the nicest, most courteous group ever. He continued telling me that not only was there no damage, the group had actually fixed some problems in the rooms and helped them improve their Internet service! That is typical of the entire World Finals community. \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003eThey are problem solvers when not competing. They are attentive.\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e One of my favorite stories was a call from hotel management at the San Antonio Hilton about a team hanging around and operating the elevators. So I went down to see what was going on. There was a team there watching the elevators operate. I then heard one of them say, “That is the dumbest elevator algorithm I’ve ever seen.” They know their algorithms. Most of the problems of folks lingering at elevators are not from folks trying to figure out how the elevator works. \u003cbr /\u003e\u003cbr /\u003e Another distinctive is that they watch, they listen, and they ask good questions. There is a robust level of subtle communication that is not verbal. Teams are synchronized. \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003eTheir minds are transforming and their world is growing.\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e Afterward, I love to see what these students do post the World Finals. They now know that they can contribute. They know that they can compete with and work beside talent from all over the world. They also know how to get better doing just that. \u003cbr /\u003e\u003cbr /\u003e That’s what sports programming tells you. It’s just like golf. Playing with the best makes you better. \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003eICPC alumni and the ICPC community.\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e I regularly hear from ICPC alumni. There are a lot of success stories. It’s about raising aspirations. It’s about changing views about your life and possibilities. There is one common thing that really brings some warmth to my heart. \u003cbr /\u003e\u003cbr /\u003e There is the transition from resident to citizen. The trajectory rises from simply doing well to making a contribution. They have choices, global choices. And they have the experience of visiting grandma’s house. \u003cbr /\u003e\u003cbr /\u003e As an academic extra-curricular activity, folks that are attracted to coach, judge, produce, and assist the ICPC competition have a common view. We want all students to have a stake in life and make a difference. \u003cbr /\u003e\u003cbr /\u003e We want students to discover that there are gifted people everywhere in the world who are on a trajectory of excellence in problem solving. We\u0027ve got some global problems that they will need to solve — problems that folks can only solve by working together. \u003c/div\u003e \u003cbr /\u003e \u003cdiv style\u003d\"background-color: rgb(250,250,250);padding: 1.0em;\"\u003e \u003cb\u003e\u003ca href\u003d\"https://www.quora.com/What-resources-books-etc-you-recommend-for-preparing-for-ICPC/answer/Bill-Poucher\" style\u003d\"color: black;\"\u003eWhat resources (books etc) you recommend for preparing for ICPC?\u003c/a\u003e\u003c/b\u003e \u003cbr /\u003e\u003cbr /\u003e Use Quora to search for advice from coaches and contestants today. Also look at any of the great on-line competitive programming programs (CodeForces, CodeChef, HackerRack, TopCoder, (all are part of the greater ICPC family who love the sport). \u003cbr /\u003e\u003cbr /\u003e Ask folks who put on workshops and host on-line judges for preparation (Valladolid, Kattis, Peking U, Ekaterinburg, StPbITMO, Amrita U, Prince of Songkla U, Arab Collegiate Programming Contest). \u003cbr /\u003e\u003cbr /\u003e I’m sure I’m leaving out a host of friends. Sorry. Contact me and I will add you to the post. \u003cbr /\u003e\u003cbr /\u003e Of course, you want to search the Internet for ideas. Your most reliable sources will come from folks who have recent success and have a passion for sports programming. \u003c/div\u003e\u003cp\u003eFrom time to time Bill writes not during the session — \u003ca href\u003d\"https://www.quora.com/How-can-I-turn-10-000-into-100-000-at-18-years-old/answer/Bill-Poucher\"\u003ethat is his last answer\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news","bill poucher","quora"]}}