{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1485721215,"rating":51,"authorHandle":"Aksenov239","modificationTimeSeconds":1485721479,"id":50108,"title":"\u003cp\u003eHelp ICPCLive Team!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, everybody.\u003c/p\u003e\u003cp\u003eProbably, you know that we will have a broadcast of the ACM ICPC World Finals this year. (As in previous years. :-)) We want to make some flash interviews with participants and other people related to the contest. BUT, we are quite bored with the standard interviews and the standard questions that are asked. We will give some boring examples: What is the first step to become a successful competitor? When did you start to code? How much do you practice? How your team is training? I understand that for someone they are still interesting questions, but on the other hand, they are very impersonal.\u003c/p\u003e\u003cp\u003eWe would like YOU to HELP us create funny or interesting questions! (You could still pose the standard question and, probably, we will use it. But it is better to think out of the box)\u003c/p\u003e\u003cp\u003eHere are several examples: - AMD or Intel? - What music do you prefer? - How much the Chinese football team should pay you per year, so you would agree to play with them? - Your first/most memorable trophy/achievement in life? - If you have to teach programming to a (non-programming) celebrity, who would it be? And why?\u003c/p\u003e\u003cp\u003eHere comes the form: \u003ca href\u003d\"https://docs.google.com/forms/d/16I_fH2j8ljAoH9WFFMKoUNABTbDk29vd1FsbdSJnGhI/edit#responses\"\u003ehttps://docs.google.com/forms/d/16I_fH2j8ljAoH9WFFMKoUNABTbDk29vd1FsbdSJnGhI/edit#responses\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNote:\u003c/strong\u003e it is better not to post the questions inside the comments, so the inteviewees could not prepare. :-)\u003c/p\u003e\u003cp\u003eThanks!\u003c/p\u003e\u003c/div\u003e","tags":[]}}