{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1468791069,"rating":78,"authorHandle":"Ahmad_Elsagheer","modificationTimeSeconds":1468791611,"id":46098,"title":"\u003cp\u003eEducational Rounds\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello CF !\u003c/p\u003e\u003cp\u003eBefore you proceed further, I do appreciate the efforts from \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Edvard\" title\u003d\"Master Edvard\"\u003eEdvard\u003c/a\u003e and \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e about doing the Educational rounds, and putting their time for it. This post is solely based to try and make it better. \u003c/p\u003e\u003cp\u003eWhat got my thoughts about this was a recent conversation with \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/MedoWith11Es\" title\u003d\"Specialist MedoWith11Es\"\u003eMedoWith11Es\u003c/a\u003e about them.\u003c/p\u003e\u003cp\u003eThe goal of the educational rounds is to educate people about well known topics/techniques in Competitive Programming, right ?\u003c/p\u003e\u003cp\u003eWhile I really like Educational Rounds, I personally do not see that much of a difference between them and regular rated rounds, maybe C-D are easier than usual for Educational, but if someone puts up an Educational as a rated round, I don\u0027t think many will notice.\u003c/p\u003e\u003cp\u003eIMO, it would be really great if we can start seeing classical problems appear. ( Basic RMQ, Classic Maxflow applicatons, Popular but \u0026quot;classic\u0026quot; DP optimizations,etc). \u003c/p\u003e\u003cp\u003eMany of these types ( and of course others that I do not know about) hardly appear in Educational rounds, and if they do, they are often a little bit random. For example, the past 2 rounds were really great for learning Matrix Power applications, first one was classical Linear recurrence to let you know about them, and the other was an application using them to count paths in a graph, but I can’t think of something else similar that happened.\u003c/p\u003e\u003cp\u003eIf problems start to follow the same pattern but for a variety of topics, CF will have a plenty of classical problems similar to those on UVa/SPOJ that are used in trainings of different levels, and even make CF better than it is! And for sure, the problems will not be simple classical problems. They will need some creativity, as well ;)\u003c/p\u003e\u003cp\u003eI hope Edvard have a look at this. Thanks!\u003c/p\u003e\u003c/div\u003e","tags":["educational","rounds","classical"]}}