{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1528240366,"rating":346,"authorHandle":"Enchom","modificationTimeSeconds":1528288917,"id":59862,"title":"\u003cp\u003eWhy is Codechef like this?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThree months ago I got second place in the March Long Challenge on CodeChef. It took quite a lot of my time and falling behind on some uni work to do that, but I thought that if I manage to grab a top2 prize, it\u0027d definitely be worth it. The second place prize for long challenges is $300, so I was quite happy with my achievement.\u003c/p\u003e\u003cp\u003eFrom there on, trying to actually get the prize has been extremely annoying and so far unsuccessful.\u003c/p\u003e\u003cp\u003eI waited for about 20 days with no news from them at which point I sent an email, but got no response for a week. I asked on here in a \u003ca href\u003d\"/blog/entry/58711\"\u003eblog\u003c/a\u003e on what I should do. The only comment advised me to contact them on Facebook and so I did. They said that they will check it out and within a day, on April 4th, I got an email telling me that I\u0027ve won and asked me for my Paypal info, which I immediately sent .\u003c/p\u003e\u003cp\u003eOf course, no response or prize for another 20 days. I sent a follow-up email on the 23rd of April to ask about it, and received an email on the 25th, assuring me that they\u0027re having some technical problems and the prize should be there by a week.\u003c/p\u003e\u003cp\u003eAs you can already guess — no sight of the prize in a week. I send a follow-up email on 11th of May — no response whatsoever. Another one on 21st of May — no response as well.\u003c/p\u003e\u003cp\u003eFinally last Thursday (31st of May) I sent them a message on Facebook, as that had worked last time. Alas, no response or prize as of the time I\u0027m writing this.\u003c/p\u003e\u003cp\u003eSo I just want to ask if that\u0027s just a common practice? It seems ridiculous to me. Nobody forces them to announce cash prizes if they do not intend to give them, and any \u0026quot;technical problems\u0026quot; reasons are just crap. A company cannot successfully send $300 through Paypal for 3 months already? Seriously, they\u0027ve been having those long challenge rounds for years now, one would really expect the process of sending prizes to be played out enough times not to mess it up.\u003c/p\u003e\u003cp\u003eIf it\u0027s a common practice for them to act like this, making me feel as if I\u0027m trying to get money from a scammer, they should really be shamed about it.\u003c/p\u003e\u003cp\u003eFinally, I\u0027d love to say that I\u0027m pissed off because of principles and the money does not matter, but that\u0027s a lie. I\u0027m a student with high enough tuition and the main reason I spent so much time doing the long challenge round is the cash prize.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPDATE : I received my prize within a day of this post. This leads me to believe that the main problem is perhaps communication. I am thankful for the quick reaction of the admin and apologise if the post was too harsh.\u003c/strong\u003e \u003c/p\u003e\u003c/div\u003e","tags":[]}}