{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1430661108,"rating":32,"authorHandle":"nicky_ua","modificationTimeSeconds":1430764490,"id":17692,"title":"\u003cp\u003eOnline-площадки для тестирования программ\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДоброе время суток!\u003c/p\u003e \u003cp\u003eМой ноутбук выполняет всего порядка 10^6 операций в секунду(по крайней мере, в MSVS2010). Сервера Codeforces/TopCoder выполняют порядка 10^9 операций в секунду.\u003c/p\u003e \u003cp\u003eИногда это мешает оценить время программы на больших тестах(варианты засечь время на своем ноуте и разделить на 10^3 не подходит, ждать порядка 1000 секунд, особенно на контесте, не удобно).\u003c/p\u003e \u003cp\u003eОднако на TopCoder\u0027е я не нашел функцию \u0026quot;песочницы\u0026quot;, в которой можно запускать свои программы, а на Codeforces в выводе показывает всего 255 первых байт. \u003c/p\u003e \u003cp\u003eПоэтому мой вопрос такой: есть ли какие-нибудь достаточно мощные(сравнимые с Codeforces/TopCoder по мощности) online площадки для тестирования программ?\u003c/p\u003e \u003cp\u003e\u003cb\u003eUPD1:\u003c/b\u003e Ускорить VS помогло смена режима с Debug на Release. Скорость возрасла до порядка 10^9 операций в секунду.\u003c/p\u003e\u003cp\u003e\u003cb\u003eUPD2:\u003c/b\u003e Из online-площадок нашел для себя новые \u003ca href\u003d\"http://ideone.com/\"\u003eIdeone\u003c/a\u003e и на \u003ca href\u003d\"http://www.codechef.com/ide\"\u003eCodechef\u003c/a\u003e. \u003c/p\u003e Обе примерно в 2 раза слабее серверов CF. Однако на \u003ca href\u003d\"http://ideone.com/\"\u003eIdeone\u003c/a\u003e есть ограничения на время — 5с для незарегистрированных и 15с для зарегистрированных(в принципе не особо мешает), и ограничения по памяти — 256МБ для всех, что иногда может помешать. На \u003ca href\u003d\"http://www.codechef.com/ide\"\u003eCodechef\u003c/a\u003e ограничения по времени 1с, что не всегда удобно. \u003cp\u003eСпасибо всем отписавшимся, узнал много полезной информации. Надеюсь этот топик был полезен не только мне. \u003c/p\u003e\u003c/div\u003e","tags":[]}}