{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399087182,"rating":-43,"authorHandle":"realab4","modificationTimeSeconds":1399087182,"id":12127,"title":"\u003cp\u003econsistent with China\u0027s rapid\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eo 2010 almost doubled, which is consistent with China\u0027s rapid economic growth period, but has now reached a \u0026quot;serious\u0026quot; level of inequality, this result also confirms Many Chinese people\u0027s life experience. Reported that a survey in 2012, the Chinese respondents as the primary challenge of the uneven distribution of wealth in Chinese society faces, even in its ranking on the corruption and unemployment.Bloomberg quoted analysts \u003ca href\u003d\"http://www.shoejordan.fr/air-jordan-9-c-10.html\"\u003eair jordan 9 retro\u003c/a\u003e  on the 29th, said that if the gap between rich and poor continues to grow, will the political, social and economic stability have adverse impact on the Chinese leadership is aware of this problem. It is understood that the report will be officially announced during this week\u0027s meeting of the National Academy of Sciences. \u0026quot;Chinese people on the one hand recognizes the income gap has become a serious social problem, but on the other hand, they seem very high tolerance for this.\u0026quot; One of the report\u0027s author, University of Michigan sociologist Yu Xie said, \u0026quot; Despite not like it, but they seem to have accepted the reality: this is the price to pay for rapid economic growth. \u0026quot;Guangming Daily, September 7, 1998 publication of Communication \u0026quot;loyalty a spectrum Zhuangge — remember fighting in the front line of the fight against floods news reporter who\u0026quot; in reference to Bin Song: Anhui Branch of Xinhua News Agency reporters Song Bin a sweat, feet mud, and other risky sections Jiangxinzhou depth interviews, Little finished the eight hundred years across the board.According to Xinhua January 27, 2009 news, Xinhua News Agency senior reporter Song Bin was awarded \u0026quot;honorary Miner\u0026quot; title Wanbei Coal Group. It is said that more than a decade, Xinhua News Agency senior reporter Song Bin, Yu Jie has been very concerned about the \u003c/p\u003e\u003cp\u003esafety of production and business development in Anhui coal, mining depth interviews often only on weekdays, grasp the pulse of the coal economy, and for many years to abandon the Spring Festival holiday, stick-depth meters underground mining area in northern interview, along with the miners stick to their posts to greet the New Year, issued a total of text, pictures, video pass is issued hundreds of articles for the safe production of coal in Northern advocating, and mine forged strong feelings, deeply Miners love.Anhui Branch of Xinhua News Agency later served as vice president, editor in chief, Song Bin still a lot of news articles published, for example, reported that in 2011 the construction of new rural Anhui, 2012 reported Fengyang school bus run pilot. Chinese President Xi Jinping visits in Xinjiang on the 27th and the 28th. This is after the 18th CCP large Xi Jinping first visit to Xinjiang, causing foreign media attention. 29 reported Reuters headline: \u0026quot;China\u0027s\u003ca href\u003d\"http://www.shoejordan.fr/air-jordan-1-c-1.html\"\u003eair jordan 1 homme\u003c/a\u003e  top leaders rarely visited southern Xinjiang, to support the fight against terrorism.\u0026quot; \u0026quot;The Wall Street Journal,\u0026quot; said recent signs that China\u0027s new leadership has counter-terrorism as one work center. In recent months, at least 15 times Xi mentioned only in the public statements against terrorism. The President Xi Qi army to fight pirates in Kashi borrowing history to encourage the police, the Japanese media have \u0026quot;condemnation.\u0026quot; Japan\u0027s Jiji news agency said on the 29th, 13th century pirates refers to the 16th century pirates from Japan, Chinese leaders might remark Xinjiang separatist forces to compete with China and Japan over the Diaoyu Islands sovereignty contrast.Reuters quoted the Chinese official media reported that Xi Jinping on the 28th came to Kashi City Public Security Bureau police station were then Erba Ge, view video surveillance, police equipment, anti-terrorism watch riot drills. He said, I am very \u003c/p\u003e\u003cp\u003econcerned about your equipment and training to deal with violent terrorist criminals must have effective means. Training must act in real combat persevere. \u0026quot;The more you sweat in peacetime, the less you bleed in wartime can.\u0026quot; Xi said, Kashgar is located in the counter-terrorism front, the situation is grim complicated. \u0026quot;Police Station is fists and knives, must take the work well.\u0026quot;\u0026quot;The Wall Street Journal,\u0026quot; said remote western Kashgar in Xinjiang, and adjacent to Pakistan and other countries. In recent years, especially in the southern parts of Xinjiang region several violent terrorist attacks occurred. But the situation has recently been upgraded to a new height. March 31 this year, armed with knives assailants away from the Kunming Railway Station in Xinjiang public attack, killing about 30 \u003ca href\u003d\"http://www.shoejordan.fr/air-jordan-5-c-5.html\"\u003echaussure air jordan 5\u003c/a\u003e  people were killed. After that, put the Chinese leadership to counter-terrorism work increased significantly. April 25, the Politburo would safeguard national security and social stability be the fourteenth collective learning. Xi Jinping presided over the study pointed out that the fight against terrorism a matter of national security, is related to the vital interests of the masses, is related to the overall situation of reform, development and stability, is a safeguard national unity, social stability and people\u0027s happiness, struggle, must take resolute measures to keep the pressure up crackdown, resolutely terrorists brazenness. To carry out the various forms of prevention and treatment activities to build an impregnable fortress, so that terrorists become \u0026quot;street rat, people cry.\u0026quot;Xi Jinping visited the town center Zach Shufu Tok primary school, has become the focus of foreign media attention. Xi Jinping, Chinese teachers are \u003c/p\u003e\u003c/div\u003e","tags":[]}}