{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1526307549,"rating":38,"authorHandle":"nithinsanjey","modificationTimeSeconds":1526307549,"id":59458,"title":"\u003cp\u003eFirst 4 codeforces contests. Learning from mistakes.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI am a full time corporate programmer in Java for web development and a CS engineering graduate. Here I would like to share my experience through my first 4 Codeforces contests. \u003c/p\u003e\u003cp\u003eProgramming for web development is a lot different from programming in competitive contests. In web, much work depends on where the data comes from(customer/database) and where the data goes to (database/UI). But here, in Codeforces, programming is Math. And so depends on algorithm and data structures. As Knuth points out,\u003c/p\u003e\u003cp\u003eAlgorithm + Data structure \u003d Programming\u003c/p\u003e\u003cp\u003eI would like to write on my learning in each part separately.\u003c/p\u003e\u003ch3\u003eAlgorithm\u003c/h3\u003e\u003cp\u003eI was jumping into programming immediately on seeing the problem which worked well in A problems but not to others. I realize that I should I should take my pen \u0026amp; paper and make an algorithm before jumping into code. Otherwise I consumed a lot of time figuring out the algorithm while coding while paper is easier and more intuitive as a beginner(at least for me).\u003c/p\u003e\u003cp\u003eAlso, I missed to cover corner cases in a few submissions. Though the solution is like 99% correct with core logic figured out, it is not good enough(obviously).\u003c/p\u003e\u003ch3\u003eData Structures\u003c/h3\u003e\u003cp\u003eSome of my code failed/was hacked on submission because of the wrong data structure I choose. In C++ the range of various integer types should be known, Example : long long int for 10^10 values.\u003c/p\u003e\u003cp\u003eAlso, some basic data structures that were useful in cases of B problems like set, map, etc.(of course arrays are everything). I happen to learn the usage of set, map, etc. while the contest was running. But they come in handy.\u003c/p\u003e\u003ch4\u003eNote\u003c/h4\u003e\u003cp\u003eAlgorithm and data structure are equally important(as in Knuth\u0027s equation and knowing that addition is commutative). So my topic order should not be taken as to favor one over the other.\u003c/p\u003e\u003c/div\u003e","tags":["#for_beginners","#c++","#learning","#newbie"]}}