{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1467243076,"rating":38,"authorHandle":"gKseni","modificationTimeSeconds":1467243076,"id":45766,"title":"\u003cp\u003eТехнологии успеха: Финал АСМ 2003/2004 гг., Прага\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eФинал командного чемпионата мира по прогpаммированию АСМ 2003/2004 гг., Прага \u003c/p\u003e\u003cp\u003eПредыдущие части:\u003cbr /\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/45486\"\u003eТехнологии успеха: Первый успех саратовских команд\u003c/a\u003e\u003cbr /\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/45315\"\u003eТехнологии успеха: Стратегии для будущих чемпионов мира по программированию\u003c/a\u003e\u003cbr /\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/45259\"\u003eТехнологии успеха: Как начинался чемпионат Урала по программированию\u003c/a\u003e\u003cbr /\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/45235\"\u003eТехнологии успеха: Тернистый путь к полуфиналу\u003c/a\u003e\u003cbr /\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/45199\"\u003eТехнологии успеха: Начало пути\u003c/a\u003e \u003c/p\u003e \u003chr /\u003e\u003cp\u003eФинал XXVIII чемпионата мира по программированию проходил в красивейшем городе Европы, столице Чешской республики Праге, в которой находится самый сохранившийся в Европе исторический центр. Организатор финала Пражский технический университет сумел привлечь к проведению соревнований мэрию Праги, которая предоставила для финала одно из известнейших зданий города, Общественный Дом — Obecni Dum. Эта имеющая всемирную известность архитектурная жемчужина считается самым красивым зданием, построенным в начале ХХ века в стиле модерн — Art Nouveau. Непосредственно церемонии открытия и закрытия и сами состязания проходили в зале Сметаны (Сметана — известный чешский композитор, «отец национальной чешской музыки»), в котором обычно проходят различные музыкальные мероприятия и, в частности, концерты известного музыкального фестиваля «Пражская весна». В соответствии с музыкальными традициями зала живая музыка симфонического оркестра звучала на церемониях открытия и закрытия соревнований. За счет «ликвидации» запасных участников (с этого года командам запрещено вносить какие-либо изменения в состав, завоевавший путевку на финал) организационному комитету удалось увеличить число команд-финалисток до 73. Из них 21 команда пред ставляла «родину» чемпионата — США, а 11 команд — нашу самую большую в мире полуфинальную Северо-Восточную Европейскую группу, в которой в прошедшем сезоне боролись за выход в финал 550 команд. Отметим, что все остальные европейские группы имели девять финальных мест, и это, как принято говорить в дипломатических кругах, «не всем понравилось». В связи с этим на наши команды ложилась задача выступить так, чтобы доказать справедливость такого распределения. По числу команд финалисток вслед за США шли Россия — восемь команд, и Китай — шесть команд. \u003c/p\u003e\u003cp\u003eПо традиции в предшествующий финалу день проходил Java Challenge, на котором командам-участникам обычно предлагается решить какую-нибудь веселую задачу или реализовать искусственный интеллект на языке Java. В этом конкурсе наряду с командами-финалистками могли участвовать и команды, сформированные из тренеров и болельщиков. Несмотря на то, что это соревнование носит скорее шутливый характер, битвы разгораются не шуточные, потому что программы участников соревнуются между собой. Лучшая программа определялась по олимпийской системе с выбыванием, при которой программы «сражаются друг с другом вплоть до полного уничтожения соперников». В этом году командам-участницам предлагалось реализовать искусственный интеллект, управляющий государством. Для этого предлагалась некоторая упрощенная математическая модель окружающей среды, в которой программа-глава государства управляет крестьянами, замками и рыцарями. Государства находятся на одной территории и воюют между собой за земли и замки. Все программы, реализующие искусственный интеллект, помещаются на одну территорию. В итоге, как в кинофильме «Горец», остается только одно государство-победитель. \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/1f/60/1f60ffe571b35635c585a2d0158a48bcca120e82.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eСначала соревновались отдельно все программы участников, затем все программы тренеров, а затем проводился суперфинал, в котором три лучшие «главы государств» от участников соревновались с тремя лучшими «главами» от команд тренеров и болельщиков. Команду тренеров и болельщиков России представляли три российские знаменитости прошлых сезонов — Андрей Лопатин из СПБГУ, Андрей Станкевич из СПБГУ ИТМО и Петр Митричев из МГУ. Все эти ребята в предыдущие сезоны выигрывали золотые медали на чемпионатах мира по программированию, а Андрей Лопатин дважды становился чемпионом мира. Они дали своей программе руководителя государства символическое название — «Мистер Путин». Нужно ли говорить, что их программа прошла в суперфинал, в котором после разгрома четырех из шести программ главным со перником нашей программы в «битве титанов» стала программа под названием United Nations. Каково же было удовольствие всех российских участников олимпиады, когда комментатор соревнования программ, которое отображалось на большом экране, сказал: «Мистер Путин добивает остатки United Nations», чем вызвал большое оживление среди собравшейся элитарной программистской публики . \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/85/9c/859ce5f9d41fc1a41e5e8b4c6614f437cb37da6f.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eСудя по результатам тренировок, «основной ударной силой» нашей полуфинальной группы являлся чемпион России 2003 г. — команда СПБГУ ИТМО. Основная проблема петербургской команды была связана с молодостью ее участников, поскольку в ее состав входили два второкурсника и один третьекурсник. Команда была противоречива, как противоречив Санкт- Петербург, который она представляла. Три бледных петербуржца внешне напоминали молодых героев из романов Достоевского и персонажей из песен Вертинского. Из этих трех, казалось, склонных к рефлексии любителей поэзии серебряного века тренер Андрей Станкевич собрал и воспитал команду, демонстрирующую на состязаниях поистине железную хватку и способность исключительно сильно выступать в заключительной части соревнований. \u003c/p\u003e\u003cp\u003eВ Университете ИТМО долго ждали мировой победы. С момента первого выступления команды университета в полуфинале в 1994 г. прошло десять лет. Три раза команды Университета ИТМО завоевывали места в тройке лучших команд мира, но, честно го воря, ни разу по ходу финальных туров не имели реальных шансов стать чемпионами мира. У руководителей и тренеров команд Университета ИТМО возникли опасения, что им так никогда и не улыбнется фортуна, пройдут годы, а они так и будут все время «бродить» на подступах к вершине и «уйдут на пенсию», не взяв высший мировой титул. \u003c/p\u003e\u003cp\u003eС тайной надеждой на хороший результат на соревнования в Прагу впервые за всю историю рискнул приехать ректор СПБГУ ИТМО В.Н. Васильев. Перед отъездом В.Г. Парфенов ознакомил ректора со основными проверенными временем приемами психотерапии, которые он, правда, без особого успеха использовал на предыдущих восьми финалах: \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eглавное — не победа, а участие, выход в финал — уже большое достижение;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eмы выигрывали достаточно много и в силу этих заслуг можем позволить себе спокойно философски наблюдать за происходящим;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eмы приехали не выигрывать, а участвовать в организации замечательного творческого конкурса и наслаждаться общением с приехавшими со всего мира студентами и преподавателями; \u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eя приехал просто отдохнуть в замечательном месте с интересными людьми, результат соревнований меня не очень волнует; \u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eгенеральный директор Билл Паучер вообще без команды приезжает и «бескорыстно» дарит людям свой труд, не имея возможности что-либо выиграть, и т.д. и т.п. \u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eПройдя краткий сеанс психологической поддержки на указанных принципах, Владимир Васильев понял, что самое лучшее для него — вообще не присутствовать на соревнованиях. \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/7b/06/7b0698843fe7f14ae332f75c999a43aba3d57845.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eКомандам было предложено для решения десять задач. Сразу после раздачи тренерам и болельщикам условий был сделан общий вывод о том, что они сложнее, чем год назад, и решения девяти или восьми задач ждать не приходится. Первой задачу на 33 минуте решила команда из немецкого города Ульм, второй — китайская команда Zhejiang University, третьей -команда Ижевского ГТУ. Спустя час после начала соревнований пятнадцать команд решили по одной задаче. В их число вошли команды ИжГТУ (третье место), СПБГУ ИТМО (пятое место), СПБГУ (шестое место), Киргизоко-Российского Славянского университета и БГУ.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/fc/d8/fcd824e04d9cf180444ca009a48c6bbd9d9ccc7e.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eНа 69, 72, 76, 86 и 89 минутах вторые задачи сдали соответственно команды Ульма, СПБГУ ИТМО, Норвежского университета науки и технологий, Киргизии и СПБГУ, образовав лидирующую группу после истечения полутора часов тура. У руководителей команды СПБГУ ИТМО старт команды «скинул камень с души», поскольку именно со стартом у нее обычно были проблемы — ребята часто не отличали простых задач от средних и начинали состязания «не с тех задач». \u003c/p\u003e\u003cp\u003eНа 102, 118, 121, 124, 126 и 131 минутах третьи задачи сдали соответственно команды Стэнфорда, Корейского института науки и технологий, Королевского университета из Канады (одновременно с корейской командой), СПБГУ ИТМО, Королевского института технологии из Швеции, Калифорнийского технологического института и университета Тайваня. Эти семь команд и образовали лидирующую группу на рубеже двух часов состязаний. Причем на первое место вышла команда СПБГУ ИТМО, ставшая единственной командой, решившей задачу В, за ней разместились команды Стэнфорда, Кореи, Тайваня, Калифорнийского института, Канады и Швеции. На 139 минуте решила третью задачу и переместилась на четвертое место команда СПБГу, но, к сожалению, этот успех оказался у нее последним. \u003c/p\u003e\u003cp\u003eСледующее крупное перемещение команд произошло на промежутке времени окончания третьего — начала четвертого часа соревнований. Подтвердила свою репутацию сильно проводящей вторую половину соревнований команда СПБГУ ИТМО, сдавшая на 173 минуте четвертую задачу. На 181 и 188 минутах четвертые задачи сдали команды Гарварда и Королевского института технологий. На 210 минуте сложнейшую четвертую задачу J решила команда Киргизско-Российского Славянского университета и, произведя небольшую сенсацию, вышла на второе место. У ребят из Киргизии остались для решения задачи D и F, которые к тому времени сдали уже довольно много команд. Для завоевания медалей им осталось сделать только один шаг, решив одну из этих задач. К сожалению, киргизским студентам это не удалось. Тем не менее, выступление впервые участвовавшей в финале «киргизско-славянской» команды заслужило самую высокую оценку. \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/51/e5/51e50c94c2fec41c181d075059700813a6bbd506.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eНа 219 минуте весомую заявку на победу сделала лидировавшая команда СПБГУ ИТМО, которая сдала сложнейшую геометрическую задачу G, которая, как выяснилось позже, поддалась только ей. После этого стало ясно, что петербуржцам нужно сосредоточить усилия на задачах С и Р, с которыми они, вроде бы, должны были справиться без больших проблем. Решение задачи G, по идее, могло направить на «ложный путь» команды-соперницы, однако получилось так, что завязли в этой задаче земляки из команды СПБГУ. \u003c/p\u003e\u003cp\u003eВ последние двадцать минут перед замораживанием таблицы четвертые задачи сдали еще десять команд, среди которых была и команда БГУ. Таким образом, в замороженной таблице команда СПБГУ ИТМО имела пять решенных задач и 13 команд — по четыре решенные задачи. Казалось, призовая дюжина будет сформирована из этих четырнадцати команд. Однако в результате напряженной финишной борьбы из этой группы выбыли команды китайского университета Фудан, Киргизско- Российского Славянского университета, университета Нового Южного Уэльса и знаменитого университета Ватерлоо, которые так и не сумели что-либо сдать в последний час борьбы. Их места заняли команда Пермского государственного университета, сдавшая в последний час три (!) задачи и поднявшаяся с 21 на четвертое место, и три команды, решившие по две задачи: команда Ижевского государственного технического университета, переместившаяся с двадцатого на восьмое место, команда Королевского университета из Канады, перешедшая с 18 на 12 место, и, наконец, команда Стэнфорда, которая из-за груза штрафных очков из-за неудачных попыток поднялась только на два места вверх — с пятнадцатого на тринадцатое, и осталась без медалей.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/59/cb/59cb62ab48ddc0f57c89bd9bfab166c67e560554.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eКазалось, что лидировавшая команда СПБГУ ИТМО, не принося больших переживаний своим руководителям, доведет дело до победы. Однако события повернулись по-другому. В начале заключительного часа борьбы, понадеявшись на то обстоятельство, что таблица заморожена, в зал пришел посмотреть «без излишнего нервного на пряжения» выступление своей команды ректор СПБГУ ИТМО В.Н. Васильев. Однако совершенно неожиданно он получил массу впечатлений, позволивших ему составить адекватное представление о нервных нагрузках, испытываемых руководителями команд в финале. Сидящие на балконах петербуржцы с нетерпением ожидали, когда команде СПБГУ ИТМО принесут желанный шестой воздушный шарик, который практически гарантировал ей первое место из-за подавляющего преимущества по времени. Однако минута шла за минутой, истекли десять минут последнего часа, двадцать минут, тридцать минут, тридцать пять... Многим командам уже принесли пятые шарики, и они догнали лидера по числу решенных задач. Сидящие на балконе тренер петербуржцев Андрей Станкевич и вице-чемпион мира прошлого года Петр Митричев даже не могли сказать, послала ли команда на тестирование шестую задачу. Сверху было видно, что работа идет, как говорится, полным ходом, но без всякого видимого результата. Андрею оставалось лишь выслушивать жалобные вопросы руководителей и болельщиков типа «Андрей, что же они не сдают задачу Р? Ведь оранжевые шарики уже прямо потоком текут в зал! Как думаешь, решают ее все же? Она ведь не самая сложная! Вон сколько команд ее уже решили! Неужели упустим победу?». Описать нервную реакцию Андрея на эти слова не представляется возможным. \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/48/dd/48dd91066e9ae7fd8f441ee6a227543edd94634a.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eСтали приходитъ на ум печальные мысли и аналогии, вспомнилось недавнее минувшее, как в Гонолулу команда Саратовского ГУ так и не сдала в последний час шестую задачу, упустив наивернейший шанс на абсолютную победу. Возникло знакомое каждому участнику соревнований неприятное чувство, когда внутри все холодеет при осознании за полчаса до окончания тура того факта, что добиваемая задача решается по принципиально ошибочному алгоритму, а времени на написание нового варианта программы уже нет. В этот момент Владимир Николаевич Васильев принял для себя окончательное решение, оглашенное им после окончания тура, что этот первый выезд на финал будет для него в обозримом будущем и последним. И, действительно, в следующий раз он приехал на финал в 2008 г. для подписания документов о проведении финала в Санкт-Петербурге. Наконец, за двадцать минут до конца соревнований эта становящаяся невыносимой ситуация благополучно разрешилась — команде СПБГУ ИТМО принесли шестой шарик за задачу С. После окончания тура выяснилось, что эту небольшую нервную встряску болельщикам петербургской команды устроили организаторы финала. Как оказалось, шестую задачу команда СПБГУ ИТМО сдала на 16 минуте заключительного часа, но, чтобы охранить интригу состязаний и не оказать морального давления на другие команды, вынос шестого шарика был отсрочен до момента, когда остальные команды стали сдавать свои пятые задачи. В оставшееся время команда СПБГУ ИТМО послала четыре различных варианта программы решения задачи Р, и все они были приняты, как удалось выяснить спустя пять минут после окончания тура из случайно посланного команде сообщения. Причем первый раз положительный результат был достигнут на 280 минуте. \u003c/p\u003e\u003cp\u003eМного приятных переживаний принесла своим наставникам в заключительный час и команда БГУ. Белорусские студенты начали неспешно, сдав первую задачу на 58 минуте, а вторую -лишь на 149. После сдачи на 225 минуте четвертой задачи D команда имела достаточно проблематичные шансы на успех, поскольку для решения оставались только весьма сложные задачи. В Гонолулу и Беверли Хиллз перед последним часом команды БГУ имели и лучшие позиции, но не реализовывали свои возможности. Однако на этот раз дело пошло по-иному. Белорусские студенты, среди которых выделялась очаровательная блондинка Виктория Лебедь, преподнесли замечательный подарок своей стране, решив еще две задачи, и впервые за всю шестилетнюю историю своих выступлений в финале не просто вошли в призовую дюжину, а завоевали золотую медаль. Команда БГУ, подготовленная Владимиром Михайловичем Котовым и Людмилой Владимировной Певзнер, в состав которой входили Максим Осипов, Иван Метельский и Виктория Лебедь, стала третьей командой мира. \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/6e/e5/6ee572e41cc9a8720469ab674d8525921bfca210.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eКоманды Пермского ГУ и Ижевского ГТУ финишировали исключительно сильно, они получили в заключительный час соревнований четвертый и пятый шарики, сделав заявки на высокие места в итоговой таблице. \u003c/p\u003e\u003cp\u003eОглашение результатов финала проводилось, как обычно, начиная с двенадцатого места. После оглашения мест с двенадцатого по девятое стало ясно — ижевские студенты завоевали серебро, что и подтвердил Билл Паучер, когда назвал команду, занявшую восьмое место. Команда Ижевского государственного технического университета в составе Тимура Давлетшина, Руслана Ковычева и Николая Пермякова, подготовленная тренером Владимиров Георгиевичем Тарасовым, выступая в финале первый раз, не дрогнула и показала блестящий результат. \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/f4/7e/f47e1ada356f0d88a03a85198c03127a165a5185.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eДалее Билл Паучер стал называть команды, занявшие седьмое, шестое, пятое места. Все ожидали название Пермского государственного университета, но его все не было. Возникли опасения — «Неужели он не вошел в призовую дюжину?» И вот, наконец, из уст Билла Пучера прозвучала фраза, которая показалась фантастикой пермским ребятам и их руководителю: «Четвертое место — Пермский государственный университет, шесть решенных задач — золотая медаль». Шестую задачу пермяки послали на последних минутах, по их мнению, без всяких шансов на успех, поскольку для нее проходи ли не все тесты. Поэтому сообщение о зачете этой задачи было воспринято поначалу чуть ли не как ошибка жюри, хотя в принципе вероятность такой ошибки была весьма мала, поскольку все решения призеров перетестируются в обязательном порядке. И только позже при разборе возникшей ситуации выяснилось, что пермская команда по теряла лист с «clarification» для этой задачи, и с учетом этого потерянного листа у них было правильное решение. Золотая медаль и четвертое место в мире подготовленной Еленой Юрьевной Никитиной команды, в состав которой входили Антон Фирсов, Ренат Муллаханов и Илья Немец, стали главной сенсацией финала.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/6b/04/6b04af3f7e28e6b78fdda7de01384a9c2e909f75.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eДалее были оглашены уже ожидаемые третье место Белорусского государственного университета и второе место Королевского института технологий (вспомнились шестое и четвертое места шведского университета Умеа в 1997 и 1998 гг.). И, наконец, назван новый чемпион мира — команда Санкт-Петербургского государственного университета информационных технологий, механики и оптики. \u003c/p\u003e\u003cp\u003eЧемпионами мира 2004 г. стали студенты кафедры компьютерных технологий факультета информационных технологий и программирования второкурсники Павел Маврин и Дмитрий Павлов и третьекурсник Сергей Оршанский, Тренер — студент шестого курса этой же кафедры Андрей Станкевич — готовил свою чудо-команду почти четыре года. Выпускники знаменитого петербургского физико-математического лицея № 239 Сергей Оршанский и Дмитрий Павлов начали заниматься у Андрея с десятого класса. В одиннадцатом классе Дмитрий получил серебряную медаль на Международной олимпиаде школьников по информатике в Сеуле. Павел Маврин, закончивший среднюю школу в городе Тольятти, тоже получил серебряную медаль в Сеуле. Несмотря на молодость, эти ребята имели уже большой и в том числе, что очень важно, не всегда успешный опыт участия в командных соревнованиях. Хотелось бы отметить, что они много времени посвящают работе со школьниками, принимают участие в работе жюри командных и личных всероссийских и петербургских олимпиад по информатике и программированию, ведут кружки. \u003c/p\u003e\u003cp\u003eКоманды СПБГУ ИТМО принимали участие с 1996 г. в девяти финалах, за это время сменилось семь составов, в которых входили 16 студентов. Из выступавших в финалах команд вышли тренеры Роман Елизаров, Марк Сандлер, Матвей Казаков, Андрей Станкевич, которые накапливали и передавали друг другу опыт подготовки высококлассных команд. Тренер команды -чемпион мира Андрей Станкевич поднял методику подготовки на качественно новый уровень. За последние три года его команды два раза выигрывали звание чемпионов России по программированию, завоевали в финале 2003 г. третье место и золотую медаль, а в финале 2004 г. — титул чемпионов мира. Эти достижения позволили Андрею стать самым успешным российским тренером за всю десятилетнюю историю участия наших команд в чемпионатах мира. \u003c/p\u003e\u003cp\u003eНебывало успешным было и выступление в финале команд Северо-Восточного Европейского региона в целом. Еще бы — они завоевали три из четырех золотых медалей и одну серебряную! \u003c/p\u003e\u003cp\u003eОстальные команды нашего региона выступили также весьма успешно. Команды Нижегородского государственного университета и Киргизоко-Российского Славянского университета решили по четыре задачи (такой результат показали еще 11 команд). Команды Новосибирского, Петрозаводского, Санкт-Петербургского государственных университетов и университета Тарту оказались в числе 17 команд, решивших по три задачи. Неудачно, решив только одну задачу, выступила лишь команда Московского государственного университета. \u003c/p\u003e\u003cp\u003eЗа выдающийся многолетний вклад в организацию соревнований чемпионата мира по программированию почетные награды Международного организационного комитета были вручены преподавателям СПБГУ ИТМО профессору Владимиру Парфенову, доценту Евгению Степанову, ассистентам Роману Елизарову и Андрею Станкевичу.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news"]}}