{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1528584479,"rating":-9,"authorHandle":"mouse_wireless","modificationTimeSeconds":1528586977,"id":59932,"title":"\u003cp\u003eEfficient solution for query problem?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eDuring one of my problem solving sessions, I thought about this problem somewhat related to what I was solving:\u003c/p\u003e\u003cp\u003eSay you have a set of numbers \u003ccode\u003ea_1, a_2, ..., a_n\u003c/code\u003e and some values \u003ccode\u003ex_1, x_2, ..., x_n\u003c/code\u003e.\u003c/p\u003e\u003cp\u003eOn this set, you can make the following operation:\u003c/p\u003e\u003cp\u003e\u003ccode\u003ea_1, a_2, ..., a_n    ------\u0026gt;     a_1 + x_1, a_2 + x_2, ..., a_n + x_n\u003c/code\u003e\u003c/p\u003e\u003cp\u003e(in other words, you add to each number its corresponding \u003ccode\u003ex\u003c/code\u003e value).\u003c/p\u003e\u003cp\u003eYou have to repeat this operation \u003cem\u003emany\u003c/em\u003e times and after each time answer what is the \u003cstrong\u003eminimum\u003c/strong\u003e element in the set. By \u003cem\u003emany\u003c/em\u003e I mean (for example) that the number of elements and the number of queries have the same order.\u003c/p\u003e\u003cp\u003eIf all \u003ccode\u003ex\u003c/code\u003e values are equal, it\u0027s easy to solve with something like segment tree. However, the way the problem is, I have tried different approaches (including some algebraic ones) but I can\u0027t seem to come up with a solution that is better than quadratic. It seems like it should be a simple problem, is there a simple solution I am not seeing?\u003c/p\u003e\u003cp\u003eUPDATE: reading random (completely unrelated) posts on codeforces, I have by chance found something called \u0026quot;Convex hull trick\u0026quot; which can be used to determine the minimum element from a set of linear functions evaluated at a certain point. It seems like it could be applied in this situation, since the value of \u003ccode\u003ea_i\u003c/code\u003e after \u003ccode\u003ek\u003c/code\u003e steps can be expressed a linear function in \u003ccode\u003ek\u003c/code\u003e: \u003ccode\u003ef_i(k) \u003d a_i + k * x_i\u003c/code\u003e. This method would provide a linearithmic solution. I will check it out tomorrow.\u003c/p\u003e\u003c/div\u003e","tags":["problem","query","efficient","numbers"]}}