{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1491493759,"rating":538,"authorHandle":"matthew99","modificationTimeSeconds":1499616274,"id":51462,"title":"\u003cp\u003eBrief Introduction to CNOI contests\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eUPDATE: China team leader Hong Wang\u0027s introduction of these contests can be found \u003ca href\u003d\"https://youtu.be/mOoupvZbNZ0?t\u003d9425\"\u003ehere\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eIf you were a Chinese high school student, what would you need to do to become a member of IOI China Team?\u003c/p\u003e\u003cp\u003eAs you know, China is a hugely populated country, and we have our own special system of contests.\u003c/p\u003e\u003cp\u003eThe following is only a brief introduction to our system. Details information in Chinese can be found \u003ca href\u003d\"http://www.noi.cn/\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003ch3\u003eNOIP(联赛)\u003c/h3\u003e\u003cp\u003eNOIP, namely National Olympiad of Informatics in Provinces, is an annual nationwide contest that nearly everybody can participate in. As the name suggests, it\u0027s held in provinces---in each province there\u0027s a site where this contest is held.\u003c/p\u003e\u003ch3\u003eProvincial Selection Contests(省选)\u003c/h3\u003e\u003cp\u003eThis contest is held annually in every province. Members of the Provincial Teams(省队) are selected based on their performances on this contest combined with those on NOIP.\u003c/p\u003e\u003ch3\u003eNOI(SC)(全国赛)\u003c/h3\u003e\u003cp\u003eNOI(SC), or CNOI, namely (Chinese) National Olympiad of Informatics (Summer Camp), is an annual nationwide contest held in different cities every year. 50 members of the National Training Team(国家集训队) are selected based solely on their performances on this contest. Moreover, every member of this team receives the chance to get admitted(保送) by top universities in China.\u003c/p\u003e\u003ch3\u003eTsinghua University Training(清华集训)\u003c/h3\u003e\u003cp\u003eEvery winter, all members in the NTT are gathered in Tsinghua University(清华大学, abbr. THU) to have a 4-day long competition, which is called Tsinghua University Training.\u003c/p\u003e\u003ch3\u003e(NOI)WC(冬令营)\u003c/h3\u003e\u003cp\u003e(NOI)WC, namely (National Olympiad of Informatics) Winter Camp, in an annually contest where 15 candidates for the Chinese National Team(国家集训队候选队员) are selected based on their performances on this contest combined with those on THU training and their scores on assignments. WC is usually held in the same place where NOI was held the same year.\u003c/p\u003e\u003ch3\u003eCTSC(中国国家队选拔赛)\u003c/h3\u003e\u003cp\u003eCTSC, namely China Team Selection Contest, is, as its name suggests, a contest where 4 members of Chinese National Team are selected based on their performances on this contest combined with their scores on THU training, WC and all kinds of assignments. Although 6 top-scorers have the chance to enter the final Interview with a speech in English and several Q\u0026amp;A in Chinese, most of the time 4 top-scorers are selected regardless of their performances in the interview. CTSC is always held somewhere in Beijing.\u003c/p\u003e\u003cp\u003eSo, that\u0027s all you would have to do: \u003c/p\u003e\u003cp\u003eTravel to the capital of your province and do NOIP\u003c/p\u003e\u003cp\u003eTravel to the capital of your province and do the provincial selection contest in your province\u003c/p\u003e\u003cp\u003eIf you are lucky enough to enter the provincial team, travel to a new city and do NOI\u003c/p\u003e\u003cp\u003eIf you are lucky enough to enter the NTT, travel to Beijing and do THU training and in the meantime do all the assignments\u003c/p\u003e\u003cp\u003eTravel to a new city and do WC\u003c/p\u003e\u003cp\u003eIf you are lucky enough to be a candidate, travel to Beijing and do CTSC.\u003c/p\u003e\u003cp\u003eAll these processes together take more than a year. So if you want to participate in IOI2017, start your NOIP in 2015.\u003c/p\u003e\u003cp\u003eFinally, if you enjoy reading it, don\u0027t forget to click the like button.\u003c/p\u003e\u003c/div\u003e","tags":["china","cnoi","ctsc","noi"]}}