{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1474008859,"rating":5,"authorHandle":"Knight_of_Thirteen","modificationTimeSeconds":1474008859,"id":47138,"title":"\u003cp\u003eNeed Help in UVA 11971\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eProblem link: \u003ca href\u003d\"https://uva.onlinejudge.org/index.php?option\u003dcom_onlinejudge\u0026amp;Itemid\u003d8\u0026amp;page\u003dshow_problem\u0026amp;problem\u003d3122\"\u003eHere\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSo I came around this problem in a practice contest and after reading the statement I thought it would be simple. But when I noticed that the cuts were to be made totally in random places (not in integer portions), I was confused how to handle this kind of problem. Then I thought that in how many ways could I NOT make a polygon. Then I noticed that the largest side must be greater than or equal to half of the length of the stick. So if I slide this portion to a side, then all the k cuts must be made on the same side of the midpoint of the stick. Thus all possible choices become 2^k. But in how many ways I can place k cuts? I thought hard and I couldn\u0027t figure it out. Then I jumped to intuition and made some guesses and cross-checked with sample cases and the answer seemed to be 1-(k+1)/2^k. I implemented it and it was Accepted. But actually I don\u0027t have a clue why this worked. Later I found online that almost every solution was similar to mine. But no clear explanation was there. There is an explanation in CSDN blog but I didn\u0027t get it as it was in Chinese. And also, there are some explanations in mathStackExchange but they are for smaller cases like k\u003d2 or 3. I was actually looking for a nice explanation for a general value of K. Please, is there anyone who can explain this to me in simple terms? I would be really grateful. Thanks in advance.\u003c/p\u003e\u003c/div\u003e","tags":[]}}