{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1470421214,"rating":74,"authorHandle":"yaroslavtsev","modificationTimeSeconds":1471012870,"id":46438,"title":"\u003cp\u003eOpen Problems in Algorithms Research for Ph.D. at Indiana University\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi all,\u003c/p\u003e\u003cp\u003eThis is a follow-up on my previous blog post about Ph.D. positions in Algorithms and Machine Learning at Indiana University, USA (\u003ca href\u003d\"//codeforces.com/blog/entry/45559\"\u003ehttp://codeforces.com/blog/entry/45559\u003c/a\u003e ). For the details about the application process see the original post and this link: \u003ca href\u003d\"http://grigory.us/phd-call.html\"\u003ehttp://grigory.us/phd-call.html\u003c/a\u003e (deadline for full applications is Dec 01, 2016).\u003c/p\u003e\u003cp\u003eSince that post generated some interest I have compiled a list of possible open problems in algorithms research to consider during a Ph.D.: \u003ca href\u003d\"https://www.dropbox.com/s/4mf2b6f9fa9rx91/open-new.pdf?dl\u003d0\"\u003ehttps://www.dropbox.com/s/4mf2b6f9fa9rx91/open-new.pdf?dl\u003d0\u003c/a\u003e It is also intended to give one a sense of how modern research in algorithms looks like. The list includes a diverse set of problems covering massively parallel computation, clustering, various forms of graph sparsification, algorithmic questions in testing analytic properties of high-dimensional functions used in machine learning and topics in communication complexity.\u003c/p\u003e\u003cp\u003ePlease, note that most of these problems are quite hard and have been studied by many researchers in the past. While I encourage you to send me solutions I can\u0027t promise to reply to your e-mail unless one of the following two conditions holds: 1) You have clearly resolved the problem. 2) You made some progress and/or have questions AND are applying for a Ph.D. position at Indiana University during this application cycle.\u003c/p\u003e\u003cp\u003eGood luck! \u003c/p\u003e\u003cp\u003e-- Best, Grigory \u003ca href\u003d\"mailto:grigory@grigory.us\"\u003egrigory@grigory.us\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["algorithms","research","ph.d."]}}