{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1456610802,"rating":16,"authorHandle":"I_love_natalia","modificationTimeSeconds":1456679818,"id":43419,"title":"\u003cp\u003eVI (XVII) открытый командный студенческий чемпионат Поволжья по спортивному программированию \u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003e31 марта — 3 апреля 2016 года\u003c/strong\u003e Самарский университет при поддержке Министерства образования Самарской области, Департамента информационных технологий и связи Самарской области, компаний Mercury Development, Altarix, Maxifier, Magenta Technology, Вебзавод проводит \u003cstrong\u003eVI (XVII) открытый командный студенческий чемпионат Поволжья по спортивному программированию\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eПодробная и регулярно обновляемая информация содержится на \u003ca href\u003d\"http://contest.uni-smr.ac.ru/ru/championship2016/\"\u003eстранице чемпионата\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eЧемпионат проводится в один тур в формате ACM ICPC.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eОриентировочное количество участников — 70 команд. \u003c/p\u003e\u003cp\u003e\u003cem\u003eОргвзнос за участие в чемпионате не предусмотрен.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eПервый этап регистрации — до 15 марта (порядок регистрации описан на \u003ca href\u003d\"http://contest.uni-smr.ac.ru/ru/championship2016/\"\u003eстранице чемпионата\u003c/a\u003e).\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://contest.uni-smr.ac.ru/Volga/chPovolzhje_2016.pdf\"\u003eИнформационное письмо\u003c/a\u003e о чемпионате доступно в формате pdf. Персональные приглашения предоставляются командам по запросу. \u003c/p\u003e\u003cp\u003eВопросы можно задавать по почте jury.contest.samara[at]gmail.com, а также в ЛС (для оперативной связи — \u003ca class\u003d\"rated-user user-black\" href\u003d\"/profile/elena\" title\u003d\"Не в рейтинге, elena\"\u003eelena\u003c/a\u003e).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eПредварительное расписание чемпионата\u003c/strong\u003e (может быть изменено)\u003c/p\u003e\u003cp\u003e\u003cem\u003eОбратите внимание — в расписании указано местное время, т.е. московское + 1 час\u003c/em\u003e\u003c/p\u003e\u003cp\u003eВсе мероприятия будут проходить в корпусе Самарского государственного аэрокосмического университета по адресу ул. Академика Павлова, 1. Время и аудитории будут уточнены.\u003c/p\u003e\u003cp\u003e31 марта 2016 г.\u003c/p\u003e\u003cp\u003eДень прибытия иногородних участников\u003c/p\u003e\u003cp\u003e11:30 — 13:00 Регистрация\u003c/p\u003e\u003cp\u003e1 апреля 2016 г.\u003c/p\u003e\u003cp\u003e09:00 — 10:00 Регистрация \u003cbr /\u003e 10:15 — 10:45 Встреча с разработчиками игрового тура (вопросы и ответы) (документация по игровому туру будет выложена ориентировочно 25 марта) \u003cbr /\u003e 11:00 — 14:00 Игровой тур \u003cbr /\u003e 15:30 — 16:00 Открытие. Встреча с членами оргкомитета, жюри и технического комитета \u003cbr /\u003e 16:30 — 18:00 Пробный тур \u003cbr /\u003e 18:10 — 18:30 Разбор задач пробного тура \u003cbr /\u003e 18:30 — 19:30 Объявление результатов игрового тура \u003cbr /\u003e\u003c/p\u003e\u003cp\u003e2 апреля 2016 г.\u003c/p\u003e\u003cp\u003e09:30 — 09:45 Сбор команд у аудиторий перед основным туром \u003cbr /\u003e 10:00 — 15:00 Основной тур \u003cbr /\u003e 17:00 — 18:00 Закрытие \u003cbr /\u003e 18:00 — 19:30 Разбор задач основного тура \u003cbr /\u003e\u003c/p\u003e\u003cp\u003e3 апреля 2016 г.\u003c/p\u003e\u003cp\u003eДень отъезда иногородних участников\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eК участию в чемпионате\u003c/strong\u003e приглашаются команды, составленные из трех студентов или аспирантов одного вуза. \u003cbr /\u003e Каждый участник на момент проведения Чемпионата должен являться студентом или аспирантом очной формы обучения, не более одного раза принимавшим участие в финалах ICPC ACM. Для каждого из участников должно быть выполнено по крайней мере \u003cstrong\u003eодно из\u003c/strong\u003e следующих условий: \u003cbr /\u003e — в год проведения чемпионата участнику исполняется не более 24 лет \u003cbr /\u003e — в год проведения чемпионата исполняется не более 5 лет с того момента, как участник впервые приступил к получению послешкольного образования. \u003cbr /\u003e Команду может сопровождать тренер и / или руководитель. Если у команды есть тренер (руководитель), он является официальным контактным лицом команды.\u003c/p\u003e\u003cp\u003eЗадачи чемпионатов прошлых лет можно посмотреть (и порешать): \u003cbr /\u003e \u003ca href\u003d\"//codeforces.com/gym/100703\"\u003eV чемпионат\u003c/a\u003e\u003cbr /\u003e \u003ca href\u003d\"http://codeforces.ru/gym/100186\"\u003eIII чемпионат\u003c/a\u003e\u003cbr /\u003e \u003ca href\u003d\"http://codeforces.ru/gym/100052\"\u003eII чемпионат\u003c/a\u003e\u003cbr /\u003e \u003ca href\u003d\"http://contest.uni-smr.ac.ru/ru/contests/244/\"\u003eI чемпионат\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["чемпионат поволжья","самара"]}}