{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1490163379,"rating":21,"authorHandle":"schezo","modificationTimeSeconds":1490452331,"id":51134,"title":"\u003cp\u003eInvitation to TOKI Open Contest March 2017\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces Community, TOKI Open Contest is back! :D\u003c/p\u003e\u003cp\u003eWe would like to invite you to participate in this TOKI Open Contest March 2017. TOKI Open Contest is our (Indonesian\u0027s) monthly/bi-monthly online contest. Starting last month, we had decided to make this contest international! You may see the information of last month contest \u003ca href\u003d\"//codeforces.com/blog/entry/50318\"\u003ehere\u003c/a\u003e. Every problem is written in both Bahasa Indonesia and English.\u003c/p\u003e\u003cp\u003eStarting this month, we divide the contest into \u003cstrong\u003etwo divisions\u003c/strong\u003e: Division 1 and Division 2. It is pretty similar to the divisions in Codeforces. You are free to register in any division (it\u0027s extremely OK if you are a Div2 Codeforces user and register to our Division 1 contest)! The expected difficulties of the problems are much the same with the first four Codeforces\u0027 contest problems (A to D).\u003c/p\u003e\u003cp\u003eTOKI Open Contest March 2017 will be held on \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dTOKI+Open+Contest+March+2017\u0026amp;iso\u003d20170325T19\u0026amp;p1\u003d108\u0026amp;ah\u003d2\"\u003eSaturday, 25 March 2017, 19.00 — 21.00 Western Indonesian Time (UTC+7)\u003c/a\u003e. This contest is written by Agus Sentosa Hermawan (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/aguss787\" title\u003d\"Candidate Master aguss787\"\u003eaguss787\u003c/a\u003e), Ammar Fathin Sabili (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/athin\" title\u003d\"Candidate Master athin\"\u003eathin\u003c/a\u003e), Anthony Ng (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/anthonyhkf\" title\u003d\"Candidate Master anthonyhkf\"\u003eanthonyhkf\u003c/a\u003e), and Muhammad Ayaz Dzulfikar (\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/ayaze\" title\u003d\"International master ayaze\"\u003eayaze\u003c/a\u003e).\u003c/p\u003e\u003cp\u003eSeveral details related to the contest:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eThe contest will use ACM-ICPC scoring type.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eFor each division, there will be FOUR (4) problems with various difficulties but the weight for each problem is the same. The contest time is 2 hours.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe problems are sorted by their expected difficulty from easy to hard. Participants are recommended to read all the problems.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAny non-Accepted submission will get 8 minutes penalty (but the penalty will only be counted after the respective problem got Accepted).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe rank will be sorted according to the most number of solves (problems with Accepted verdict). If there are ties, it will be determined by least (sum of solving time + sum of penalty). The rank will be different for Division 1 and Division 2.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe allowed programming languages are C, C++11, Pascal, Python 3, and Java 8. However, please note that we do not ensure that every language can solve all the problems on the given time limit.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe contest will be held on \u003ca href\u003d\"https://competition.ia-toki.org/contests/170\"\u003ehttps://competition.ia-toki.org/contests/170\u003c/a\u003e for division 1 and \u003ca href\u003d\"https://competition.ia-toki.org/contests/171\"\u003ehttps://competition.ia-toki.org/contests/171\u003c/a\u003e for division 2. Registration is already opened at the same place. Registering the contest requires a TLX (\u003ca href\u003d\"http://competition.ia-toki.org\"\u003ehttp://competition.ia-toki.org\u003c/a\u003e) account. You may need to register for an account if you don\u0027t have one.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eGood luck and have fun! See you at the leaderboard! :)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD 1\u003c/strong\u003e : The contest will be held in less than 24 hours, make sure you are already registered! :D\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD 2\u003c/strong\u003e : The contest is over, thanks for participating the TOKI Open Contest March 2017! :D\u003c/p\u003e\u003cp\u003eThis contest has 27 contestants in Division 1 and 67 contestants in Division 2 with at least one submission.\u003c/p\u003e\u003cp\u003eThe following are the winner of the TOKI Open Contest March 2017:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDivision 1\u003c/strong\u003e:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/jonathanirvings\" title\u003d\"Grandmaster jonathanirvings\"\u003ejonathanirvings\u003c/a\u003e solved 3 problems with 142 minutes total penalty.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/pwypeanut\" title\u003d\"Master pwypeanut\"\u003epwypeanut\u003c/a\u003e solved 3 problems with 192 minutes total penalty.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/wifi\" title\u003d\"Candidate Master wifi\"\u003ewifi\u003c/a\u003e solved 3 problems with 295 minutes total penalty.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003e\u003cstrong\u003eDivision 2\u003c/strong\u003e:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003e[numberking] solved 3 problems with 278 minutes total penalty.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e[yogahmad] solved 2 problems with 19 minutes total penalty.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e[kevlee] solved 2 problems with 44 minutes total penalty.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eCongratulation to winners! :D\u003c/p\u003e\u003cp\u003eThe problems are available at \u003ca href\u003d\"https://training.ia-toki.org/problemsets/82/problems\"\u003ehttps://training.ia-toki.org/problemsets/82/problems\u003c/a\u003e for upsolving. See you at the next TOKI Open Contest! :D\u003c/p\u003e\u003c/div\u003e","tags":["toki","toki-open-contest","indonesia"]}}