{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1525025255,"rating":351,"authorHandle":"VLamarca","modificationTimeSeconds":1525239556,"id":59170,"title":"\u003cp\u003ePlease allow rated participation of purple-rating users in Div. 2 contests\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi!\u003c/p\u003e\u003cp\u003eThe main objective of my post is to make most \u003cstrong\u003eDiv. 2 only\u003c/strong\u003e rounds rated for purle users. \u003c/p\u003e\u003cp\u003eThis is beneficial because it would distinguish their rating better. It would also mean a more frequent participation for those people, which is good for the growth of the plataform. It makes no sense to make a purple coder wait for a Div. 1 round, which is rare due to the difficulty to come up with a Div1 D/E problem, when in most cases those users don\u0027t even read these harder problems at all.\u003c/p\u003e\u003cp\u003eAnother reason is because most Div. 2 rounds are hard enough for people with purple rating. I assume the difficulty of contests should be sufficient to not transform them in a \u0026quot;type race\u0026quot;, which means that it is good that few people solve all the problems. I will try to convince you that we can make div2 contests rated for people with higher rating without breaking this principle. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEDIT:\u003c/strong\u003e Originally the title of this blog was \u0026quot;Please increase div2 upper rating limit\u0026quot; but this was missleading as I only want to allow div. 2 participation from purple guys in \u003cstrong\u003eDiv. 2 only\u003c/strong\u003e contests. By Div. 2 only I mean the \u003cstrong\u003econtests that do not have a corresponding Div. 1 rated problem set\u003c/strong\u003e.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eThe distribution of participants in div. 2 and div. 1 (when there is a corresponding Div. 1 contest) could and should remain the same.\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eSome data to back my suggestion:\u003c/strong\u003e \u003c/p\u003e\u003cp\u003eIn \u003ca href\u003d\"//codeforces.com/contest/965/standings\"\u003eCodeforces Round #476 (Div. 2 only) [Thanks, Telegram!]\u003c/a\u003e only 1 person solved all the problems officially, and I would say that more than 95% of all the unofficial purple contestants solved at most 4 out of the 5 problems.\u003c/p\u003e\u003cp\u003eIn \u003ca href\u003d\"//codeforces.com/contest/966/standings/page/3\"\u003eCodeforces Round #477 (rated, Div. 1, based on VK Cup 2018 Round 3)\u003c/a\u003e, let\u0027s assume that the contestants who solved 4 problems would have a chance of solving all problems in the \u003ca href\u003d\"//codeforces.com/contest/967/standings\"\u003ecorresponding div. 2 round\u003c/a\u003e. Less than 50 (including red and yellow rated people) out of more than 450 div1 contestants solved at least 4 problems.\u003c/p\u003e\u003cp\u003eIn \u003ca href\u003d\"//codeforces.com/contest/962/standings\"\u003eEducational Codeforces Round 42 (Rated for Div. 2)\u003c/a\u003e only one red rated person solved all the problems and the vast majority of purple rated unofficial contestants could not solve 2 of the contests\u0027 problems. Also 3 legendary grand masters contestants could not solve all the problems.\u003c/p\u003e\u003cp\u003eWith that being said I suggest that most div. 2 only contests should allow rated participation of users with rating up to 2200, or less depending on the difficulty of the specific round. But please do allow participation of more users in Div. 2 rounds when the difficulty is sufficient, this is healthy for the plataform!\u003c/p\u003e\u003cp\u003eI am open to discussing ideias in this regard.\u003c/p\u003e\u003cp\u003eThanks for reading :)\u003c/p\u003e\u003c/div\u003e","tags":[]}}