{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1469723986,"rating":103,"authorHandle":"csacademy","modificationTimeSeconds":1469728349,"id":46310,"title":"\u003cp\u003eRound #9 contest analysis and winners\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces!\u003c/p\u003e\u003cp\u003eThe latest \u003ca href\u003d\"https://csacademy.com/\"\u003ecsacademy\u003c/a\u003e contest, \u003ca href\u003d\"https://csacademy.com/contest/round-9/\"\u003eRound #9\u003c/a\u003e took place on Tuesday, July/26/2016. First of all congratulations to the winners:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/FatalEagle\" title\u003d\"International Grandmaster FatalEagle\"\u003eFatalEagle\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/uwi\" title\u003d\"International Grandmaster uwi\"\u003euwi\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/anta\" title\u003d\"International Grandmaster anta\"\u003eanta\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/I_Love_Tanya_Romanova\" title\u003d\"International Grandmaster I_Love_Tanya_Romanova\"\u003eI_Love_Tanya_Romanova\u003c/a\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eIn addition to the top 5 finishers, we initially announced that we\u0027re going to have 2 more special prizes. Meanwhile we changed our mind and decided to have \u003cstrong\u003e3\u003c/strong\u003e special prizes:\u003c/p\u003e \u003col\u003e   \u003cli\u003eThe first special prize is awarded to \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/snuke\" title\u003d\"Grandmaster snuke\"\u003esnuke\u003c/a\u003e, for being the first one to solve \u003ca href\u003d\"https://csacademy.com/contest/round-9/#task/sum-of-squares\"\u003eSum of Squares\u003c/a\u003e, which proved to be the second hardest problem after \u003ca href\u003d\"https://csacademy.com/contest/round-9/#task/jetpack\"\u003eJetpack\u003c/a\u003e.\u003c/li\u003e   \u003cli\u003eThe second special prize is awarded to \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Kostroma\" title\u003d\"International Grandmaster Kostroma\"\u003eKostroma\u003c/a\u003e for a correct solution at \u003ca href\u003d\"https://csacademy.com/contest/round-9/#task/jetpack\"\u003eJetpack\u003c/a\u003e that unfortunately got TLE.\u003c/li\u003e   \u003cli\u003eFor the third special prize, we decided to assign weights to all the contestants who solved at least one problem, but were not among the top 5. The contestant placed 237th had a weight equal to \u003cstrong\u003e1\u003c/strong\u003e, while the one placed 6th had a weight of \u003cstrong\u003e5\u003c/strong\u003e, with everyone in between linearly distributed. Using these weights we randomly chose the winner: \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/anubhav94\" title\u003d\"Candidate Master anubhav94\"\u003eanubhav94\u003c/a\u003e.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eAll the winners, check your email for more details about collecting the prizes.\u003c/p\u003e\u003cp\u003eThis round was special for us, as we had the first external problem authors. Thanks again to \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/enot.1.10\" title\u003d\"Grandmaster enot.1.10\"\u003eenot.1.10\u003c/a\u003e and \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/mgch\" title\u003d\"Master mgch\"\u003emgch\u003c/a\u003e for authoring \u003ca href\u003d\"https://csacademy.com/contest/round-9/#task/jetpack\"\u003eJetpack\u003c/a\u003e and \u003ca href\u003d\"https://csacademy.com/contest/round-9/#task/101-palindromes\"\u003e101 Palindromes\u003c/a\u003e. Also, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Yury_Bandarchuk\" title\u003d\"Candidate Master Yury_Bandarchuk\"\u003eYury_Bandarchuk\u003c/a\u003e did a great job translating the statements in Russian. To our big surprise, there were 248 users who submitted at least one solution. Even though it\u0027s not much, for us it was a record breaking number. We hope you had fun participating and we hope to see you all again at \u003ca href\u003d\"https://csacademy.com/contest/round-10/\"\u003eRound #10\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eUnfortunately though, not everything went smoothly, as we encountered some issues:\u003c/p\u003e \u003col\u003e   \u003cli\u003eThe website froze 50 minutes into the contest for about 10 minutes. This was due to a bug on our side that got fixed :).\u003c/li\u003e   \u003cli\u003eThe dynamic scores were not calibrated properly. The first 4 tasks all got a final score of 100 points, with a huge gap between them and the last 3. Maybe the set was not that balanced either, but we\u0027re learning from every mistake. We are still waiting for our user base to grow a bit more before introducing divisions. The format of the contests will then change, with 4 tasks to be solved in 100 minutes.\u003c/li\u003e   \u003cli\u003eThe time limits were too strict for some of the problems. Usually we set it to be twice the running time of the official implementation, but when there\u0027s no obvious brute force in sight we should be more generous.\u003c/li\u003e   \u003cli\u003eFinally, as you could notice after the contest, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/FatalEagle\" title\u003d\"International Grandmaster FatalEagle\"\u003eFatalEagle\u003c/a\u003e\u0027s solution for \u003ca href\u003d\"https://csacademy.com/contest/round-9/#task/jetpack\"\u003eJetpack\u003c/a\u003e had some hardcoded input values. Given that we have full feedback there\u0027s no way we can stop this from happening again. One can always binary search the input values using the judge message: TLE if N \u0026lt;\u003d some fixed value, MLE otherwise. Sure, there are some quick fixes like not showing as much feedback as we currently do, but we don\u0027t want to change the system yet. The long term plan is to implement pretests, so this kind of hack can be avoided completely. Until then though, a line needs to be drawn somewhere. So from now on, we reserve the right to delete a submission that got AC if we can find a test respecting the constraints that makes the solution fail. Of course, this doesn\u0027t apply in the case of weak tests on our side, or some legit randomised solutions. We just want to make sure nobody \u0026quot;games the system\u0026quot; in the future.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eThat being said, we had lots of feedback from you guys and we already started working on everything. Thank you all!\u003c/p\u003e\u003c/div\u003e","tags":[]}}