{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1473275167,"rating":6,"authorHandle":"RostVel","modificationTimeSeconds":1473283774,"id":46998,"title":"\u003cp\u003eДобро пожаловать!\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПриветствую вас в группе INF POISK. Сюда были добавлены все кто заполнил анкету, про которую я писал в чатике, а так же те, чьи логины я знал.\u003c/p\u003e\u003cp\u003eЧто это такое? Это группа codeforces, здесь можно проводить контесты, вести блог и еще делать много чего полезного.\u003c/p\u003e\u003cp\u003eВ разделе \u0026quot;БЛОГ\u0026quot; будут появляться важные объявления, а также конспекты, интересные ссылки и статьи. А еще я буду здесь анонсировать темы предстоящих лекций (наверно), поэтому если вам не интересна лекция вы можете не приходить, или если наоборот вы учитесь в другой группе и вам очень хочется послушать определенную лекцию, то буду рад вас видеть на лекции.\u003c/p\u003e\u003cp\u003eВ разделе \u0026quot;СОРЕВНОВАНИЯ\u0026quot; будут появляться контесты. Чтобы участвовать в контестах нужно на них зарегистрироваться, регистрация открывается за сутки до старта контеста. Если вы в указанное время не можете написать контест, после окончания контеста появиться возможность виртуального участия. После того как вы напишите контест (официально или через виртуальное участие), появиться возможно дорешать задачи.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/group/W4kp3A0MsA/contest/208577\"\u003eУже в это воскресенье, в 9 утра пройдет первая тренировка.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЕжедневно будет обновляться общий рейтинг, в котором будут учитываться все результаты контестов, а также результаты письменных тестов (если они будут).\u003c/p\u003e\u003cp\u003eЗа помощь в подготовке этой группы и контестов спасибо Чунаеву \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/ch_egor\" title\u003d\"Candidate Master ch_egor\"\u003ech_egor\u003c/a\u003e Егору!\u003c/p\u003e\u003cp\u003eЕсли у вас возникли вопросы, то задайте их в общем чатике или \u003ca href\u003d\"https://vk.com/rost_vel\"\u003eнапишите мне в личку VK\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":[]}}