{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1519099481,"rating":28,"authorHandle":"SebasJM","modificationTimeSeconds":1519099481,"id":57895,"title":"\u003cp\u003eAdvice about where you compile your code\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eToday, the CF Round #465 ocurried.\u003c/p\u003e\u003cp\u003eImagine you have some time to participate in a contest but you are not using the computer you always use (for example, a work\u0027s borrowed laptop). You enter to Ideone and code your solutions. Suppose you solve some problems. It seems to be a regular round. When the contest is over you receive one message:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/dc/a9/dca9aaeaa7c9d5458aa06fc2f1c59b997303e6b6.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSo, \u0026quot;what happened??\u0026quot; I thought.\u003c/strong\u003e Well, some mediocre person was updating the \u0026quot;Recent Codes\u0026quot; page of Ideone, looking for solutions to steal from a distracted and naive guy.\u003c/p\u003e\u003cp\u003eThis is the cheater\u0027s profile/submissions: \u003ca href\u003d\"//codeforces.com/profile/iwillwintoday\"\u003ehttp://codeforces.com/profile/iwillwintoday\u003c/a\u003e\u003c/p\u003e\u003cp\u003eAs you can see, he copied identically my today\u0027s two submissions: \u003ca href\u003d\"//codeforces.com/submissions/SebasJM\"\u003ehttp://codeforces.com/submissions/SebasJM\u003c/a\u003e\u003c/p\u003e\u003cp\u003eYou can see that I\u0027ve been using this template since months ago.\u003c/p\u003e\u003cp\u003eThis post is not about excuses, but about lessons. So, I have two things to say:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTo the community:\u003c/strong\u003e This is a basic and well known advice, but is always good to remember that you should be aware of where you compile your code. Preferably, compile locally, in your computer. If you use Ideone, don\u0027t forget to toggle the scope button to \u0026quot;secret\u0026quot;. It can happen to anyone. Unfortunately, we have to live with dishonest people, who do not respect the effort of others. In conclusion: DON\u0027T BE NAIVE.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTo the cheater:\u003c/strong\u003e Probably I won\u0027t ever gonna know the reason why you did this and certainly I don\u0027t care. However, what I really care is that you\u0027re harming with your decisions. Happily, I did not get an account blocking but, what about the effort? I got kicked for that contest for being naive, but this doesn\u0027t justify your action. Actions like yours are not just a dissapointment, but also discourage people who want to overcome themselves. Please, change for the community\u0027s wellness.\u003c/p\u003e\u003cp\u003eFinally, I want to admit my mistake. This, although bitter, is another experience to learn about.\u003c/p\u003e\u003cp\u003eSincerely, Sebastián.\u003c/p\u003e\u003c/div\u003e","tags":["stop","the","cheating","please"]}}