{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1474117050,"rating":16,"authorHandle":"azgod","modificationTimeSeconds":1474117100,"id":47166,"title":"\u003cp\u003eGet you full code fixed and reviewed by other members of your level based on codeforces ratings.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello friends,\u003c/p\u003e\u003cp\u003eWe feel overjoyed to inform you that \u003ca href\u003d\"http://codereview.orgfree.com\"\u003ecodereview.orgfree.com\u003c/a\u003e reboot is done and ready for big release.\u003c/p\u003e\u003cp\u003eWe had built the original version many months back with a great idea i.e. codeforces ratings of users are used to put them in one of the 5 levels. Now suppose you are level 3 user and you want your code reviewed then a member a level above you i.e. level 4 would review your code. However if you want your next code reviewed you have to first review the code of a member a level below you i.e. level 2. So everyone is benefitted. But the work on platform was stopped due to some reasons.\u003c/p\u003e\u003cp\u003eNow we are back and much better.\u003c/p\u003e\u003cp\u003eThe following are some of the main features added-\u003c/p\u003e \u003cpre\u003e1. Instead of 5 levels, there are now only Div1 and Div2. Later on as users increase, level system would come up.\n2. Number of views, number of answers, reporting of every question.\n3. All statistics of site available on the stats page.\n4. Many small details like forgot password page, notifications, etc.\u003c/pre\u003e\u003cp\u003eMany awesome features like chatting (private and group), forum and tagging system is being built.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSO WHY WAITING, QUICKLY REGISTER AND REAP THE BENEFITS. Competitive programmers from all over the world are waiting to help you there.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eAlso we hope you spread the word about the site to your friends, family, training camp partners, ICPC team members, facebook and twitter friends and everywhere that you find it should be as this one is surely a required thing for all competitive programmers. As the number of users on this site grows, so does the usage of its whole idea and features.\u003c/p\u003e\u003cp\u003eNote — If you are already a member of the site and have forgotten your password on codereview.orgfree.com, use the forgot password link on index page below login form. If you have any other problem, feel free to use contact us page.\u003c/p\u003e\u003cp\u003eThanking you,\u003c/p\u003e\u003cp\u003eMANISH SHARMA\u003c/p\u003e\u003cp\u003eCodeReview | \u003ca href\u003d\"http://codereview.orgfree.com\"\u003ecodereview.orgfree.com\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["#platform","#coding","#website"]}}