{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1467977075,"rating":48,"authorHandle":"I_love_Tanya_Romanova","modificationTimeSeconds":1468136258,"id":45944,"title":"\u003cp\u003eInvitation to July Clash 2016\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003eI want to invite you to participate in \u003ca href\u003d\"https://www.hackerearth.com/july-clash-16/\"\u003eJuly Clash\u003c/a\u003e at \u003ca href\u003d\"https://www.hackerearth.com/\"\u003eHackerEarth\u003c/a\u003e. Contest is scheduled on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dJuly%20Clash%20%2716\u0026amp;iso\u003d2016-07-09T01:30:00\u0026amp;p1\u003d64\"\u003eJuly, 9\u003c/a\u003e. Contest duration is 24 hours, so there should be some comfortable time for every timezone :)\u003c/p\u003e\u003cp\u003eThere will be six tasks in a problemset. Five of them are standard algorithmic problems with partial solutions allowed — you get points for every test that your solution passed. And the last task is an approximate problem — your score for this task depends on how good your solution is comparing to current best solution.\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/lewin\" title\u003d\"Гроссмейстер lewin\"\u003elewin\u003c/a\u003e is author of this problemset. He is experienced contestant and experienced setter as well, you can check his previous contests to know what to expect :) \u003c/p\u003e\u003cp\u003eI was working on this contest as a tester, and I enjoyed solving given problems a lot — I hope you\u0027ll have same feeling :) I hope that some tasks will be not too hard for beginners \u003cem\u003e(don\u0027t give up and show your best with partial scoring — even very naive solution may give you some decent points; and 24 hours should be enough for you to read all problems and find some tasks which you can solve)\u003c/em\u003e while some tasks are challenging enough to make this contest interesting for more experienced contestants. Each problem will have subtasks mentioned, so you can figure out how much your partial solution should get for sure before even implementing it ;) Also I want to thank \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/belowthebelt\" title\u003d\"Эксперт belowthebelt\"\u003ebelowthebelt\u003c/a\u003e for handling all technical aspects of contest preparation.\u003c/p\u003e\u003cp\u003eAs usual, here is one more reason for you to participate in this contest:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTop5 of leaderboard will also receive some nice prizes:\u003c/strong\u003e\u003c/p\u003e \u003col\u003e   \u003cli\u003e$100 Amazon gift card + HackerEarth T-shirt\u003c/li\u003e   \u003cli\u003e$75 Amazon gift card + HackerEarth T-shirt\u003c/li\u003e   \u003cli\u003e$50 Amazon gift card + HackerEarth T-shirt\u003c/li\u003e   \u003cli\u003eHackerEarth T-shirt\u003c/li\u003e   \u003cli\u003eHackerEarth T-shirt\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eGood luck to everybody — I hope to see you at the scoreboard :) \u003c/p\u003e\u003cp\u003e\u003cem\u003eUpd. Contest has ended, thanks to everyone for participating! Congratulations to winners:\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e1) \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/anta\" title\u003d\"Легендарный гроссмейстер anta\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003ea\u003c/span\u003enta\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e2) \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ecnerwal\" title\u003d\"Международный гроссмейстер ecnerwal\"\u003eecnerwal\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e3) \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/LayCurse\" title\u003d\"Международный гроссмейстер LayCurse\"\u003eLayCurse\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e4) \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/y0105w49\" title\u003d\"Кандидат в мастера y0105w49\"\u003ey0105w49\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e5) \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/cjtoribio\" title\u003d\"Кандидат в мастера cjtoribio\"\u003ecjtoribio\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eAll solutions are public, solutions by setter and tester are also available now. Editorials for most of the problems have been published; in a few days remaining editorials will be added / published editorials will be improved and also updated with some alternative approaches from contestants (some of them look quite interesting).\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e","tags":["hackerearth","contest","invitation","announcement","prizes","clash"]}}