{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1496112665,"rating":3,"authorHandle":"Unlimited_Time","modificationTimeSeconds":1496113060,"id":52253,"title":"\u003cp\u003eNotes on Codeforces Testing Round #1, A, B, C(RMQ problem [Help])\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eA. 123-sequence\u003c/p\u003e\u003cp\u003eSuppose that the number of integers 1, 2 and 3 are denoted as x[1], x[2] and x[3]. To obtain the minimum number of replacements, we should find out the minimum value among x[1]+x[2], x[1]+x[3] and x[2]+x[3], and output it as the answer. One could also find out the maximum value of x[3], x[2] and x[1], and then use x[1]+x[2]+x[3]-x[i] as the answer.\u003c/p\u003e\u003cp\u003eB. Right Triangles\u003c/p\u003e\u003cp\u003eWe count the number of right triangles based on the intersection from which two sides that form a 90 degree extend. We use R[r] to denote the number of \u0027*\u0027 in the r-th row, and C[c] to denote the number of \u0027*\u0027 in the c-th column. Then, if we select any \u0027*\u0027 as the point where two sides that form a 90 degree intersect with each other, the number of different right triangles is just (R[r]-1)*(C[c]-1). The reason is that the first side can be selected from all the (R[r]-1) points at the current row, except for the intersection. Similarly, the second side can be selected from all the (C[c]-1) points. Therefore, we can enumerate all the \u0027*\u0027 points, and add the corresponding (R[r]-1)*(C[c]-1) together, which is the final answer.\u003c/p\u003e\u003cp\u003eC. Circular RMQ\u003c/p\u003e\u003cp\u003eI find out that this is a famoue RMQ problem, where range minimum query is asked, with range modification, i.e., increase all the elements belonging to some range by the same constant number. \u003c/p\u003e\u003cp\u003eI searched on the internet, however only found out some materials that did not provide quite many details talking about how to solve such a problem (Most of them just show the codes but without many arguments or principles...). \u003cstrong\u003eMay any coders recommend me some articles talking about this :D\u003c/strong\u003e \u003ca href\u003d\"/contest/52/problem/C\" title\u003d\"Codeforces Testing Round 1\"\u003e52C - Циклические RMQ\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}