{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1524772646,"rating":450,"authorHandle":"vlecomte","modificationTimeSeconds":1528334571,"id":59129,"title":"\u003cp\u003eWriting a book on geometry — Update\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi,\u003c/p\u003e\u003cp\u003eI\u0027ve updated my geometry book over at \u003ca href\u003d\"https://vlecomte.github.io/cp-geo.pdf\"\u003ehttps://vlecomte.github.io/cp-geo.pdf\u003c/a\u003e. I hope you like the new content, and I would really appreciate any feedback: suggestions, comments, typos you found, etc. :)\u003c/p\u003e\u003cp\u003eThe changes I made:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eFinished the chapter on \u0026quot;basics\u0026quot; and made some changes based on your feedback from last time.\u003c/li\u003e   \u003cli\u003eAdded a whole chapter on precision issues and how to deal with them. I think some of the problems and ideas in this chapter are not obvious to all and I think they can be useful for people who don\u0027t feel very confident in geometry.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe codes are mostly untested for now so take them with a grain of salt (and tell me about the mistakes you find).\u003c/p\u003e\u003cp\u003eIn a few weeks, I will hold a Gym contest showcasing geometry techniques/concepts that are not very common at the moment but could help make interesting problems and add some variation to geometry in ICPC-style or online contests.\u003c/p\u003e\u003cp\u003eThere will be 5 problems for 3-4 hours. They will be hard but (I hope) interesting. After the contest, along with the editorial, my book will be updated to include all the topics that are linked to the contest. I will post an announcement as soon as the time is fixed. I hope many of you will participate. :)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e: I added a chapter on 3D geometry. As usual, feedback of any kind is very appreciated. It\u0027s probably full of errors. :)\u003c/p\u003e\u003c/div\u003e","tags":["geometry","book"]}}