{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1404897406,"rating":10,"authorHandle":"Omar_ElAzazy","modificationTimeSeconds":1404902954,"id":12985,"title":"\u003cp\u003eIntroduction\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Everyone,\u003c/p\u003e\u003cp\u003eIt is apparent that our performance in the world finals has never been good enough to be comparable to teams from other regions, our champions are always the champions with the least solved problems with a huge margin from champions of other regions. \u003c/p\u003e\u003cp\u003eTo change that, we are starting a new method of practice. Instead of limited camps, we will be starting a practice league from this week and till the week before the world finals. This will require persistence, hard work and a lot of your time and efforts.\u003c/p\u003e\u003cp\u003eAhmad Mamdouh, Mahmoud Radwan and me (Omar ElAzazy) will be the managers for this practice. \u003c/p\u003e\u003ch4\u003eOur responsibilities are:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eProvide problems of high quality that serve our practice purposes\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eProvide solutions for them\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eWe will do our best assisting you\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eMake sure the practice is not hindered by anything\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003ch4\u003eThe plan for the practice:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eThere will be a contest every 2 weeks\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe first week will be for you to try as hard as possible in the problems\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eProblems will be added in the first week on daily basis (problems will not be added all at once in the beginning of the first week)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eEditorials will be posted in the second week with discussions about the problems\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIn the second week you continue solving any problem you haven\u0027t solved already\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAdditional problems might be added in the second week\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAdditional thing is that, as long as you have no reason not to, you must participate in all Topcoder SRMs and Codeforces rounds. Don\u0027t worry about your ratings and ranks, just participate in all of them, this is important for you to experience other factors that are not covered in our practice, like time pressure, speed, ... etc They are different across different contests but still it is useful to enter those online contests to work on these factors.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe plan is bound to change at anytime the managers feel that there is a better way to do it, you can mail us your suggestions too.\u003c/p\u003e\u003ch4\u003eThe practice structure:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eYou have already been invited to a Codeforces private group\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eEditorials, tutorials and notes will be added to the group\u0027s blog\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eContests will be held on different websites, each contest will be announced in the beginning of it\u0027s first week.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eDiscussions will be held as comments on the blog or if it is a long one, it can be held in a chat.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThis whole practice idea is solely to improve our performance at the world finals and get much better ranks. It is expected from members in this practice to devote so much of their time and effort for the practice and based on that there are some rules to follow.\u003c/p\u003e\u003ch4\u003eRules:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eAt anytime if 2 managers agree that a member is slacking off, (s)he will be given a notice and on a second notice (s)he will be removed form practice\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eBy the end of the first week, every member must have at least read all problems and ready to discuss them\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eYou must be committed to this practice regardless of any other practice running\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThis practice should be a secret among us\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003ePlease think about this as our summed up efforts to do something better at the world finals. It is our responsibility to be able to do this for our region.\u003c/p\u003e\u003cp\u003eBest Regards,\u003c/p\u003e\u003cp\u003eManaging Team\u003c/p\u003e\u003c/div\u003e","tags":[]}}