{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1473862907,"rating":90,"authorHandle":"gKseni","modificationTimeSeconds":1473945568,"id":47110,"title":"\u003cp\u003eСентябрь 2016: Мини-сборы по программированию в Ростове и Самаре\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ сентябре пройдут мини-сборы по программированию в двух региональных вузах — ЮФУ в Ростове (19-24 сентября) и СГАУ в Самаре (26 сентября-1 октября) — подготовка к четвертьфиналу ACM-ICPC, который \u003ca href\u003d\"https://contest.sgu.ru/\"\u003eпройдет в октябре в Саратовском ГУ\u003c/a\u003e. Подобное мероприятие проводится впервые — это инициатива фонда \u003ca href\u003d\"http://botaninvestments.com/\"\u003eBotan Investments\u003c/a\u003e с целью помочь развитию программирования в региональных вузах. \u003c/p\u003e\u003cp\u003eАртем \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/VArtem\" title\u003d\"Международный гроссмейстер VArtem\"\u003eVArtem\u003c/a\u003e Васильев и Николай \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Niko\" title\u003d\"Мастер Niko\"\u003eNiko\u003c/a\u003e Ведерников — аспиранты и преподаватели ИТМО, организаторы сборов по программированию в России и за рубежом, члены жюри олимпиад по информатике для школьников и студентов, авторы задач по программированию. Недавно они выступили организаторами \u003ca href\u003d\"//codeforces.com/blog/entry/46717\"\u003eМеждународной олимпиады по информатике IOI 2016\u003c/a\u003e в составе научного и технического комитета. Артем Васильев — победитель финала ACM-ICPC 2015 (Марракеш, Марокко), победитель NEERC ACM-ICPC 2015; Николай Ведерников — призер NEERC ACM-ICPC 2012. \u003c/p\u003e\u003cp\u003eУчастников сборов отберут преподаватели университетов — по вопросам участия обращайтесь к Гайделю Андрею Викторовичу в СГАУ (Самара) и Штейнбергу Роману Борисович в ЮФУ (Ростов), которые участвуют в \u003ca href\u003d\"//codeforces.com/blog/entry/46900\"\u003eпрограмме фонда для преподавателей\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eВ первый день студенты напишут вводный контест, который покажет, какие темы они знают, затем — тематические контесты с лекциями, в пятницу — заключительный контест на разные темы.\u003c/p\u003e\u003cp\u003eАртем и Николай прочитают в каждом городе по две открытые лекции для школьников и студентов, которые интересуются спортивным программированием. На лекциях они расскажут об олимпиадном программировании и объяснят базовые алгоритмы динамического программирования. После лекции состоится личный контест, на котором слушатели закрепят полученные на лекции знания. \u003c/p\u003e\u003cp\u003eМеста и даты открытых лекций: \u003c/p\u003e\u003cp\u003eЮФУ ИММиКН, ауд. 120: \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003e21 сентября 17:00 Что такое олимпиадное программирование\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e24 сентября 16:00 Основы динамического программирования\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eСГАУ Межвузовский медиацентр, Конференц-зал, 4 этаж: \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003e27 сентября 17:00 Что такое олимпиадное программирование\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e28 сентября 17:00 Основы динамического программирования\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eЛекции планируется транслировать онлайн, в контесте возможно онлайн-участие. Михаил \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Штаб, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e Мирзанов просил провести трансляцию на Codeforces :)\u003c/p\u003e\u003cp\u003eГрядущее мероприятие — лишь первый шаг к развитию спортивного программирования в региональных вузах. \u003cbr /\u003e \u003c/p\u003e \u003ccenter\u003e\u003cimg src\u003d\"/predownloaded/e9/3f/e93ff6bfb36ae572ee2d8dd1ae33d24e03b79e92.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e          \u003cimg src\u003d\"/predownloaded/3e/6d/3e6dc3cb9bc0937821885c0c1c987f178452d6b4.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003eНиколай Ведерников и Артем Васильев\u003c/small\u003e\u003c/center\u003e\u003c/div\u003e","tags":["codeforces::news","acm-icpc 2017","botan investments"]}}