{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1401138903,"rating":22,"authorHandle":"zholnin","modificationTimeSeconds":1401138903,"id":12430,"title":"\u003cp\u003eAl Zimmermann\u0027s Programming Contests — новый раунд\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eСовсем недавно — всего лишь неделю назад — началось новое соревнование на сайте \u003ca href\u003d\"http://azspcs.net/\"\u003eAl Zimmermann\u0027s Programming Contests\u003c/a\u003e Для тех кто не знает про этот сайт: - соревнования на нём проводятся в течение трёх месяцев - Задачки, как правило, \u0026quot;полное NP с наворотами\u0026quot; (кроме последнего раунда, где автор не учёл существования Wichmann rulers) - приз выигрывает участник, представивший лучшее решение — доказательств оптимальности или объяснения использованного алгоритма не требуется — можно даже без компьютера решать ;).\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://www.azspcs.net/Contest/AlphabetCity\"\u003eНовая задачка\u003c/a\u003e — про игру Эрудит (Scrabble): Вам даётся последовательность букв и словарь возможных слов. Пользуясь правилами оригинального Scrabble вам нужно набрать как можно больше очков с имеющимися буквами. Основная сложность задачи в том, что вы получаете буквы по семь штук — т.е. каждый раз у вас на руках семь первых неиспользованных букв из последовательности — и в отличие от настоящего Scrabble менять буквы нельзя.\u003c/p\u003e\u003cp\u003eЕсли кому-нибудь интересно — предлагаю поучаствовать. Я сам ещё не определился — может быть после того, как в эти выходые вылечу из Google Codejam — подумаю над этой задачей. Я участвовал в предыдущем раунде, но так как в тот раз нашлось конструктивное решение (хоть и с недоказанной оптимальностью), участие \u0026quot;не получилось\u0026quot;.\u003c/p\u003e\u003cp\u003eАвтор разрешает некоторую кооперацию при решении — можно сообщать друг другу количество очков набранных в каждом сете и обсуждать high-level используемые алгоритмы и приёмы. Предлагаю если будет желание общаться в этой теме.\u003c/p\u003e\u003c/div\u003e","tags":["azspcs","np-полнота","optimization"]}}