{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1433351670,"rating":117,"authorHandle":"brycesandlund","modificationTimeSeconds":1433351752,"id":18307,"title":"\u003cp\u003eDQed from Google Code Jam Round 3\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI competed in Google Code Jam Round 2 last Saturday and managed to get 341st place. Unfortunately, I now sit in 1215th place. What happened was that in my solution to B-large, I encountered a bug after downloading the input file. It wasn\u0027t until I had only 40 seconds left on the counter that I found it. I managed to fix it, rerun the program, and upload the output file in that 40 seconds, but I had about 3 seconds to find and upload the source file, among a directory with 200 other files (I\u0027m kicking myself for forgetting to create a new directory for the competition as I usually do). So I double clicked some random file and got the submission in literally as the countdown hit 0. The output was correct, but on Monday, Google informed me that they rejected my submission since I didn\u0027t have the proper source file, dropping me to 1215th place.\u003c/p\u003e\u003cp\u003eIt doesn\u0027t look like there is anything I can do at this point, but I wanted to inform the community: Google manually checks every submission! I pulled something similar in Facebook Hacker Cup, manually changing 0\u0027s to 1\u0027s in an output file, and they did not catch it. Anyway, people ranked between 341st and 1215th in GCJ Round 2 will see a change in their ranking from after the contest, something I have never had happen to me, so I can only assume is quite rare. I also found out, if you upload the incorrect source file, you can resubmit it via the \u0026quot;Ask a question...\u0026quot; link, which must be done during contest time: \u003ca href\u003d\"https://code.google.com/codejam/terms.html\"\u003ehttps://code.google.com/codejam/terms.html\u003c/a\u003e (see the section \u0026quot;(E) Submission \u0027Erros\u0027 — oh the irony — and Discrepancies\u0026quot;). If only I had known this sooner!\u003c/p\u003e\u003c/div\u003e","tags":[]}}