{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1493631644,"rating":609,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1493929630,"id":51787,"title":"\u003cp\u003eCodeforces: Domains For Groups\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello!\u003c/p\u003e\u003cp\u003eAre you missing something new? I have something to please you.\u003c/p\u003e\u003cp\u003eRegularly I host some events — Olympiads, onsites, and eventually, examinations and tests for students. On the one hand, Codeforces already offers a unique functionality — groups, the integration with Polygon, the possibility of choosing tasks from the archive and so on. But it doesn’t enough!\u003c/p\u003e\u003ch3\u003eDomains for groups\u003c/h3\u003e\u003cp\u003eHere is an example of such group. It is open for all — join it and look: \u003ca href\u003d\"//example.contest.codeforces.com\"\u003ehttp://example.contest.codeforces.com\u003c/a\u003e\u003c/p\u003e\u003ch5\u003eDomain\u003c/h5\u003e\u003cp\u003eNow when you are editing a group, you can specify its subdomain (from 3 to 20 alphanumeric characters, starts with a letter). When you specify the domain, the group will be accessible by a link \u003ca href\u003d\"//yourgroupdomain.contest.codeforces.com\"\u003ehttp://yourgroupdomain.contest.codeforces.com\u003c/a\u003e. According to this link, the following is correct:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eNothing extra will be displayed — the site contains only the information about competitions and blogs of your group and nothing else.\u003c/li\u003e   \u003cli\u003eAll you need to display — is an HTTP access to 212.193.33.6. If you host the official contest, important coaching or examination — block all the rest of the Internet, except for this IP-address.\u003c/li\u003e   \u003cli\u003eToday such groups can only contain private competitions and trainings. For example, you can make your mashup and set it up as you need. Maybe, later we will make something with this restriction, but for now — it is like this.\u003c/li\u003e \u003c/ul\u003e\u003ch5\u003ePermitted subnets for the domain\u003c/h5\u003e\u003cp\u003eTo be sure that extra people will not click on your link \u003ca href\u003d\"//yourgroupdomain.contest.codeforces.com\"\u003ehttp://yourgroupdomain.contest.codeforces.com\u003c/a\u003e, you can block the access to it by IP. Specify the exact IP or subnet address. For example, \u003ccode\u003e188.93.56.35;212.193.32.0/19\u003c/code\u003e.\u003c/p\u003e\u003ch5\u003eThe language of the interface of the domain\u003c/h5\u003e\u003cp\u003eProbably, when you host the event, only the English (or only Russian) interface is enough for the participant. Use this setting to select the desired behavior.\u003c/p\u003e\u003ch5\u003eHeader html\u003c/h5\u003e\u003cp\u003eYou can change the site header at \u003ca href\u003d\"//yourgroupdomain.contest.codeforces.com\"\u003ehttp://yourgroupdomain.contest.codeforces.com\u003c/a\u003e, so that there will be not the familiar logo of Codeforces, but the logo or name of your event. For example, when I host the inter-university Olympiad in Saratov, I set it to \u003ccode\u003e\u0026lt;h3\u0026gt;Interuniversity Olympiad on programming 2017 (Saratov)\u0026lt;/h3\u0026gt;\u003c/code\u003e.\u003c/p\u003e\u003ch5\u003eUsers of the domain (sidebar)\u003c/h5\u003e\u003cp\u003eIt is very likely that if you hold an Olympiad or something similar, participants may not have the Codeforces account, the information about participants comes from a separate registration, and you want to see usual names in the interface, such as ‘John Doe, Berliandsky SU, 3 Course’, rather than the participant’s handle.\u003c/p\u003e\u003cp\u003eYou can add synthetic users to your group with a domain (using these accounts, you can only log the group through the domain). Use the special function “Users of the domain”. Each line corresponds to one user and must be written in the format: \u003ccode\u003econtest ids (separated by commas) | Handle | Password | Name\u003c/code\u003e. Here\u0027s an example of this setting for the domain example.contest.codeforces.com:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e213380 | u01 | 371111 | Petr Korotkevich\n213380 | u02 | 627492 | Gennady Soejima\n213380 | u03 | 491591 | Makoto Knuth\n213380 | u04 | 581711 | Donald Cormen\n213380 | u05 | 057259 | Thomas Mitrichev\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eYes, you can feel like Peter Korotkevich, log on \u003ca href\u003d\"//example.contest.codeforces.com\"\u003ehttp://example.contest.codeforces.com\u003c/a\u003e, and use the login u01 and the password 371111.\u003c/p\u003e\u003ch5\u003ePrivacy settings\u003c/h5\u003e\u003cp\u003eYou have a possibility to set all as you wish. For example, to maximally block the access to the group (only by the domain, do not allow extra users), make the \u003ccode\u003eclosed’ group, and the policy of registering of its members\u003c/code\u003eonly by invitation`. In this case, only domain users (see the point above) and users invited to the group will be able to access the domain address.\u003c/p\u003e\u003cp\u003eFor private contests you can set additional settings:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eAllow practice — whether it is possible to solve problems after the official termination in an informal mode of upsolving.\u003c/li\u003e   \u003cli\u003eAllow virtual participation — whether it is possible to participate virtually after the official termination (or whenever you want, if there is no start time).\u003c/li\u003e   \u003cli\u003eAllow out of competition participation — it is reserved for out of competition participation, while only the users of the domain can be registered as out of competition (for the right users, add the symbol \u0027o\u0027 after the contest id, for example “213380o | u01 | 371111 | Petr Korotkevich”).\u003c/li\u003e   \u003cli\u003eAllow self-registration — whether it is possible for participant to make a self-registration (if no — register him).\u003c/li\u003e   \u003cli\u003eAllow unregistered users to observe the competition — whether it is possible for the participant of the group who is not registered to a contest enter the contest and see the problems, status, standings and other details.\u003c/li\u003e   \u003cli\u003eTurn on common status — whether it is possible for participants to see the information about other participants’ submissions, or the information about their own attempts is the only available.\u003c/li\u003e   \u003cli\u003eThe duration of freezing and unfreeze time. Be careful during transfer of the contest — unfreeze time must be changed independently.\u003c/li\u003e   \u003cli\u003eThe policy for showing tests. Here are possible options: \u0026quot;do not show at all\u0026quot;, \u0026quot;show failed tests of own solutions\u0026quot;, \u0026quot;show all tests completely\u0026quot;.\u003c/li\u003e   \u003cli\u003eThe policy of showing other people\u0027s attempts. Here are possible options: \u0026quot;do not show at all\u0026quot;, \u0026quot;show to participants who solved the problem,\u0026quot; \u0026quot;show to everyone.\u0026quot;\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":["codeforces","groups","domains"]}}