{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1512198756,"rating":45,"authorHandle":"tmwilliamlin168","modificationTimeSeconds":1512234907,"id":56113,"title":"\u003cp\u003eProblem from Taiwan Regional Contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI\u0027ve been thinking for one month and I still don\u0027t know how to solve this problem:\u003c/p\u003e\u003cp\u003eThere is a park of size (A\u0026lt;\u003d100)x(B\u0026lt;\u003d100) (consider it as a grid), with (1, 1) as the top-left corner. There are C\u0026lt;\u003d1000 trees on the park, all of which have distinct locations. You want to place as many VIP lounges on the park as possible, such that every VIP lounge is adjacent to a tree on its top, bottom, left, or right. But because of privacy issues, a VIP lounge cannot be adjacent to another VIP lounge (including diagonally). Note that you cannot place a VIP lounge on a tree.\u003c/p\u003e\u003cp\u003eFor example, consider the following park of size 9x7:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/73/63/736327f35178625a651b190487769955a00ef152.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThe \u0026quot;T\u0026quot;s represent the trees, the grey shaded areas represent possible locations for VIP lounges. If there were to be a VIP lounge on where the \u0026quot;V\u0026quot; is located, then the \u0026quot;x\u0026quot;s represent the locations where there cannot be VIP lounges.\u003c/p\u003e\u003cp\u003eTime limit: 1s\u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eSamples\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eSample 1:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eInput:\nT__\n___\n_T_\n\nOutput:\n3\n\nTV_\n___\nVTV\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eSample 2:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eInput:\n______\n_T____\n__T___\n____T_\n______\n\nOutput:\n5\n\n______\nVTV___\n__T_V_\n__V_T_\n____V_\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eMy thoughts:\u003c/p\u003e\u003cp\u003eFinding the maximum independent set of a bipartite graph can be done in polynomial time. Create a graph in which the possible VIP lounge placements are nodes and there are edges between 2 nodes if the 2 VIP lounges are adjacent. The maximum independent set of this graph is the answer. Notice that this graph is quadripartite (all combinations of x, y mod 2). Maybe there is also a way to find the maximum independent set of a quadripartite graph efficiently.\u003c/p\u003e\u003cp\u003eOr maybe I\u0027m thinking too much and there is a greedy solution.\u003c/p\u003e\u003c/div\u003e","tags":[]}}