{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1466100564,"rating":-9,"authorHandle":"HolkinPV","modificationTimeSeconds":1466100564,"id":45471,"title":"\u003cp\u003eУчастие в тренировке\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eЭто специальная группа, в которую я добавил три тренировки по классам. Для того чтобы поучаствовать нужно:\u003c/p\u003e\u003cp\u003e1) Зарегистрироваться на этом сайте (если вы еще не зарегистрированы)\u003c/p\u003e\u003cp\u003eМне в целом неважен ваш логин (хэндл), однако я обязательно прошу всех \u003cstrong\u003eуказать в профиле свои настоящие фамилию, имя и школу\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003e2) Не смотреть задачи до того, как вы непосредственно начнете их решать. Это тренировка, давайте будем решать задачи честно, после завершения будет разбор.\u003c/p\u003e\u003cp\u003e3) Выделить указанное время (2 часа) для тренировки, для того чтобы спокойно и без перерыва решать задачи. Для этого у вас есть два дня (суббота и воскресенье). \u003cstrong\u003eТренировка является обязательной, однако время вы можете выбрать сами\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003e4) Чтобы приступить к участию нажмите \u003cstrong\u003eВиртуальное участие\u003c/strong\u003e напротив нужной тренировки в разделе соревнования, выберете время и приступайте к решению задач, как только соревнование начнется. В таблице результатов вы будете видеть участников, уже решивших или параллельно решающих с вами. Задачи тестируются автоматически как на большинстве олимпиад и онлайн-сайтов, ввод-вывод стандартный (не файловый).\u003c/p\u003e\u003cp\u003ePS: можете порешать несколько тренировок, но свою обязательно. Также задачи можно будет дорешивать, после окончания тренировки. Также, передавайте эту всем вашим друзьям, одноклассникам и участникам летней школы.\u003c/p\u003e\u003cp\u003eЕсли вдруг возникнут какие-то проблемы или вопросы постараюсь ответить на почту \u003ca href\u003d\"mailto:p.v.holkin@gmail.com\"\u003ep.v.holkin@gmail.com\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЖелаю всем удачи!\u003c/p\u003e\u003cp\u003eПавел Холкин\u003c/p\u003e\u003c/div\u003e","tags":[]}}