{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1408980490,"rating":331,"authorHandle":"BYN","modificationTimeSeconds":1409303496,"id":13542,"title":"\u003cp\u003eBayan Programming Contest 2014-2015\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eYou enjoyed Bayan Programming Contest \u003ca href\u003d\"//codeforces.com/bayan201213\"\u003e2012-2013\u003c/a\u003e? Now we are happy to unveil Bayan Programming Contest 2014-2015! This will be Bayan\u0027s 3rd public programming contest and we have made several improvements and did our best to make the whole tournament even more fun! To register visit \u003ca href\u003d\"http://contest.bayan.ir/\"\u003econtest.bayan.ir\u003c/a\u003e right now!\u003c/p\u003e\u003ch2\u003eIntroducing the rounds\u003c/h2\u003e\u003cp\u003e\u003ca href\u003d\"http://contest.bayan.ir/\"\u003e\u003cimg alt\u003d\"Bayan Programming Contest\" src\u003d\"/predownloaded/c8/a8/c8a81eb353d97a17a94cda9f1720e6206d0830fc\" style\u003d\"float: right;margin: 20.0px 10.0px;padding: 1.0px;width: 50.0%;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e We are going to host 5 rounds:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eThe first round is named \u003cstrong\u003eShortcut!\u003c/strong\u003e. Shortcut! round is mainly meant to help us actively test our new contest platform, but since we\u0027d like to thank all the people participating in this round, the winner will bypass \u0026quot;all\u0026quot; intermediate rounds, and directly advance to the final onsite event! Top 5 contestants will also get a \u003ca href\u003d\"http://bayanbox.ir/id/2486223970916195531?view\"\u003eT-shirt\u003c/a\u003e. Shortcut! round is not going to be too hard and there is only 1 hour to solve 3 problems, making it harder to predict the round winner!\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003eWarm-up\u003c/strong\u003e is our second round and honoured to be hosted on Codeforces. Warm up is also not a required round but it is going to be rated for both divisions and the top 50 are going to win t-shirts.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eBayan Programming Contest officially begins with the \u003cstrong\u003eQualification\u003c/strong\u003e round. It is going to be an easy event, and solving one problem is enough to advance to Elimination round. If you missed Shortcut! Round, make sure to get familiar with our new platform during this round. Also, 5 random participants will be receiving t-shirts.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003eElimination\u003c/strong\u003e round is the most challenging online round in this tournament. Top 100 participants will be receiving t-shirts, but only top 20 from 20 countries will get the chance to compete in the final (onsite) event.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003eFinal\u003c/strong\u003e round will be an onsite event. To find the onsite event\u0027s look and feel, you can watch \u003ca href\u003d\"http://vimeo.com/104377782\"\u003ethis 4 minute video clip\u003c/a\u003e. More details will be announced later.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/bb/18/bb18dd2ba6a16638e504c7af204f03f1ba1dc571\" style\u003d\"margin: 20.0px 10.0px;padding: 1.0px;width: 80.0%;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg src\u003d\"/predownloaded/35/07/3507356a87e7fae4b53533d75bf16cbde828c6b1.png\" style\u003d\"margin: 20.0px 10.0px;padding: 1.0px;width: 80.0%;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eUPDATE:\u003c/b\u003e\u003c/p\u003e\u003ch2\u003eShortcut! Round Terms \u0026amp; Rules\u003c/h2\u003e \u003cul\u003e \u003cli\u003eShortcut! round will start at \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?day\u003d29\u0026amp;month\u003d8\u0026amp;year\u003d2014\u0026amp;hour\u003d13\u0026amp;min\u003d00\u0026amp;sec\u003d0\"\u003e13:00 UTC, 29 August 2014\u003c/a\u003e.\u003c/li\u003e \u003cli\u003eShortcut! round consists of three programming tasks and competitors will have just one hour to solve them.\u003c/li\u003e \u003c/ul\u003e\u003ch2\u003eSolving Problems\u003c/h2\u003e \u003cul\u003e \u003cli\u003eCompetitors may solve problems by any means and are free to use any programming language, library or computational application to solve problems. Given an input file, you should submit a correct output together with the source code used to produce that output within the specified time limit.\u003c/li\u003e \u003cli\u003eNot submitting any file during the time limit, will be considered as an unsuccessful attempt.\u003c/li\u003e \u003cli\u003eBoth input and output formats are crucial. Adhere them precisely to avoid getting solutions judged as wrong.\u003c/li\u003e \u003c/ul\u003e\u003ch2\u003ePenalties\u003c/h2\u003e \u003cul\u003e \u003cli\u003eCompetitors may not use more than one user account.\u003c/li\u003e \u003cli\u003eCompetitors may not communicate with each other during the contest.\u003c/li\u003e \u003cli\u003eYour output must be reproducible using the source code you provided.\u003c/li\u003e \u003cli\u003eAll submitted source codes will automatically get analyzed for code plagiarism detection.\u003c/li\u003e \u003cli\u003eCheaters will be banned forever from Bayan programming contests\u003cfont face\u003d\"b traffic, Verdana, Times New Roman, serif\"\u003e.\u003c/font\u003e \u003c/li\u003e \u003c/ul\u003e\u003ch2\u003eJudging\u003c/h2\u003e \u003cul\u003e \u003cli\u003eDo not submit irrelevant clarifications during the contest.\u003c/li\u003e \u003cli\u003eThe decision of the judges are final in all matters.\u003c/li\u003e \u003cli\u003eAll source codes of the competitors will be published after each round.\u003c/li\u003e \u003cli\u003eBayan\u0027s staffs are not allowed to participate in the contest.\u003c/li\u003e \u003c/ul\u003e\u003ch2\u003eScore Calculation Method\u003c/h2\u003e \u003cdiv\u003eScore for each solved problem is calculated based on these values:\u003c/div\u003e \u003cp\u003e \u003c/p\u003e\u003cul\u003e \u003cli\u003en \u003d No. of accepted submissions\u003c/li\u003e \u003cli\u003et \u003d Contestant\u0027s submission time\u003c/li\u003e \u003cli\u003eT \u003d Total contest duration\u003c/li\u003e \u003cli\u003ep \u003d Number of contestant\u0027s wrong attempts\u003c/li\u003e \u003c/ul\u003e  \u003cp\u003e\u003cspan style\u003d\"text-align: center;margin: 10.0px;\"\u003e\u003ca href\u003d\"http://bayanbox.ir/id/6256496063519130517?view\" style\u003d\"float: none;\"\u003e\u003cimg src\u003d\"/predownloaded/6a/72/6a7257cc2dbbe3dd2c3dce8801866dd5f656e58e\" style\u003d\"width: 540.0px;height: 19.0px;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e","tags":["bayan"]}}