{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1506200720,"rating":331,"authorHandle":"zeliboba","modificationTimeSeconds":1506333954,"id":54721,"title":"\u003cp\u003eПочему на NEERC не дают использовать Team Notebook на контесте?\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eОчень давно задаюсь этим вопросом и ни разу не получал ни от кого вразумительного ответа. При этом очевидно, что у этого решения, которое скорее всего является примером принципа \u0026quot;это плохо, но исторически сложилось, давайте не будем ничего менять\u0026quot;, много минусов:\u003c/p\u003e\u003cp\u003e1) На финал могут не отобраться команды, которые выступили бы там лучше.\u003c/p\u003e\u003cp\u003e2) Для команд, которые имеют шансы пройти на финал, сильно усложняется подготовка к нему, потому что им нужно писать тренировки до декабря в режиме без Team Notebook. По сути эти команды существенно ухудшают свое качество подготовки к финалу в течение этих четырех месяцев. Особенно болезненны такие переключения для команд, которые ездили на финал в прошлом году, для меня в свое время это было довольно некомфортно.\u003c/p\u003e\u003cp\u003e3) Это приводит к тому, что некоторые сильные команды готовят свой Team Notebook некачественно или вообще его не готовят. Понятно, что это может сильно ухудшить их результаты на финале.\u003c/p\u003e\u003cp\u003e4) Чем дольше развивается acm icpc, тем больше разных тем будет встречаться на контестах. Держать реализацию всех базовых алгоритмов в голове становится все сложнее и сложнее. Не хочется превращать добавлять в neerc соревнование по трерировки памяти, кажется, что это не самое интересное в acm.\u003c/p\u003e\u003cp\u003e5) Запрет на использование уже реализованных базовых алгоритмов делает acm еще менее похожим на промышленное программирование, имхо это выглядит слегка по-детски. В идеале бы конечно разрешить приносить на контест либу ограниченного размера прямо в электронном виде, не знаю точно почему на финале до сих пор не так, но слышал, что они обдумывают изменение этого правила.\u003c/p\u003e\u003cp\u003eИз плюсов я слышал только то, что это стимулирует начинающие команды учить алгоритмы, но я если честно этот аргумент не понимаю, о каких начинающих командах можно говорить на полуфинале?\u003c/p\u003e\u003cp\u003eОтдельно хотелось бы отметить неординарную любовь жюри к задачам про кактусы (которые кроме NEERC не встречаются более или менее нигде), которая в совокупности с невозможностью использовать заготовку создает необходимость тратить кучу времени на умение быстро писать не особо интересный код.\u003c/p\u003e\u003cp\u003eP.S. Очень хотелось бы услышать комментарии от жюри NEERC.\u003c/p\u003e\u003cp\u003eP.P.S. Личные мнения членов жюри также приветствуются.\u003c/p\u003e\u003c/div\u003e","tags":[]}}