{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1493119147,"rating":80,"authorHandle":"vlecomte","modificationTimeSeconds":1493119147,"id":51709,"title":"\u003cp\u003eMaster\u0027s thesis about competitive programming?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi!\u003c/p\u003e\u003cp\u003eNext year I\u0027ll start working on my Master\u0027s thesis (in computer science), and we have to choose the subjects now. I\u0027m not very enthusiastic about the subjects that are suggested by default but we are allowed to suggest our own topics if we want. So I got an idea: what if I could work on a topic related to competitive programming?\u003c/p\u003e\u003cp\u003eI have good relationships with some of the teachers so I should be able to convince one of them to accept it if it\u0027s an interesting subject. But it\u0027s not that easy to find a good subject on that theme.\u003c/p\u003e\u003cp\u003eAn example I thought of would be to study the current state of the art in a subfield like geometry: which kinds of problems appear in which competitions, which algorithms are considered common knowledge, which kinds of implementations are used, how precision issues are dealt with, etc. I would try to summarize that and to figure out by reviewing the research litterature which new algorithms or techniques might appear in the future, thanks to which implementations.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSo, do you have any ideas on interesting subjects to study?\u003c/strong\u003e It can be about any aspect of competitive programming, also including coaching, contest creation, etc. I\u0027m also a trainer for future IOI contestants and a novice problem setter so those subjects interest me too. I\u0027m excited to hear your ideas!\u003c/p\u003e\u003cp\u003eOf course, if the subject gets accepted, I would keep you informed and post regular updates over here (your feedback would be a great help)!\u003c/p\u003e\u003cp\u003eThanks in advance!\u003c/p\u003e\u003c/div\u003e","tags":[]}}