{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1421921442,"rating":0,"authorHandle":"KayacanV","modificationTimeSeconds":1421998358,"id":15939,"title":"\u003cp\u003eCOCI 2014/2015 CONTEST #5\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"http://hsin.hr/coci/contest5_tasks.pdf\"\u003eSORULAR\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://hsin.hr/coci/archive/2013_2014/contest5_testdata.zip\"\u003eGirdiler-Ciktilar\u003c/a\u003e Soru 1 Funghi:\u003c/p\u003e\u003cp\u003eCalliope ve Caliborn 8 dilimlik bir pizzayı eşit olarak bölüşüp yiyecek olan iki kardeştir. Fakat alacaklari 4\u0027er dilim birbirine temas eder durumda olacaktır. (yani bölüşmek için pizzayı tek bir doğru ile ayıracaklardır) Fakat pizzanin her diliminde farklı sayılarda(aynı da olabilir) mantarlar bulunmaktadir ve ikisi sadece et yediğinden mantarları ayıklamak zorunda kalacaklardır. Caliborn Calliope\u0027ye mümkun olan en fazla sayida mantar düşecek sekilde kesim yapmak istemektedir böylece kendisi yemeye başladığında Calliope hala mantar ayıklamakla uğraşıyor olacaktır.\u003c/p\u003e\u003cp\u003eGirdi Biçimi:\u003c/p\u003e\u003cp\u003eSırasıyla her dilimde kaçar tane mantar olduğunu belirten 8 adet sayı (0 \u0026lt;\u003d m_i \u0026lt;\u003d 50).\u003c/p\u003e\u003cp\u003eÇıktı Biçimi:\u003c/p\u003e\u003cp\u003eCaliborn\u0027un Calliope\u0027nin dilimlerine en fazla kaç adet mantar düşmesini sağlayabileceği.\u003c/p\u003e\u003cp\u003eÖrnek Girdi:\u003c/p\u003e\u003cp\u003e5 2 1 4 5 1 2 3 \u003c/p\u003e\u003cp\u003eÖrnek Çıktı:\u003c/p\u003e\u003cp\u003e12\u003c/p\u003e\u003cp\u003eÖrneğin Açıklaması:\u003c/p\u003e\u003cp\u003eCaliborn pizzayı 2. dilim ile 5. dilim arasını Calliope ye verecek şekilde keser. 5 / 2 1 4 5 / 1 2 3 Kardeşine 2 + 1 + 4 + 5 \u003d 12, Kendisine ise 5 + 1 + 2 + 3 \u003d 11 mantar düşer.\u003c/p\u003e\u003cp\u003eSoru 2 Zmija:\u003c/p\u003e\u003cp\u003e2 boutlu bir matrise bırakılmış uzaktan kumandalı bir robot böcek sadece iki komutla yönetilmektedir. A) O anda dönük olduğu yöne doğru bir birim ilerlemek B) Bir birim yukarı kuzeye gidip arkasına dönmek(doğuya bakıyorsa batıya dönmek vs.) Böcek matrise dağıtılmış robot yemlerini toplayacktır ve başlangıçta haritanın en güneybatısında doğuya dönük durumdadır. En az kaç komutla bu görev başarılabilir. Girdi Biçimi:\u003c/p\u003e\u003cp\u003eİki sayı n,m (2 \u0026lt;\u003d n,m \u0026lt;\u003d 1000) matrisin boyutları. n e m lik bir harita. Boş yerler \u0027.\u0027 Robot \u0027Z\u0027 Yemler ise \u0027J\u0027 ile gösteriliyor.\u003c/p\u003e\u003cp\u003eÇıktı Biçimi:\u003c/p\u003e\u003cp\u003eYemleri toplamak için minimum komut sayısı.\u003c/p\u003e\u003cp\u003eÖrnek Girdi:\u003c/p\u003e\u003cp\u003e5 5 ...J. ..... J..J. J.... Z.... \u003c/p\u003e\u003cp\u003eÖrnek Çıktı:\u003c/p\u003e\u003cp\u003e7\u003c/p\u003e\u003cp\u003eÖrneğin Açıklaması:\u003c/p\u003e\u003cp\u003eBBAAABB komut dizisi ile görev başarılabilir.\u003c/p\u003e \u003chr /\u003e\u003cp\u003eSoru 3 Traktor:\u003c/p\u003e\u003cp\u003eBir gün Jakiro savaştayken bir tane IcePath kullanacak kadar manası vardır.\u003c/p\u003e\u003cp\u003eIcePath:İstenilen bi zamanda İstendigi dogrultuda sonsuza kadar giden bir buz parcası\u003c/p\u003e\u003cp\u003eJakironun istediği en az K tane heroyu Icepathe maruz bırakmak.\u003c/p\u003e\u003cp\u003eJakiro aptal olduğundan sadece diegonallere ve kenarlara parralel kullanabiliyor.\u003c/p\u003e\u003cp\u003eToplamda N tane hero vardır.Herbiri birer saniye arayla doğcakları kordinat bellidir. hepsi doğana kadar hareket etmiyorlardır.Jakiro sizden en az K tane heroyu Icepathe maruz bırakcak \u003c/p\u003e\u003cp\u003eIcepathi en erken ne zaman atabileceğini istiyordur.Eğer boyle bir durum yoksa -1 yazınız.\u003c/p\u003e\u003cp\u003eGirdi İlk satırna N (2\u0026lt;N\u0026lt;1000000) ve K (2\u0026lt;K\u0026lt;N). Sonraki N satırda heroların doğma sırasıyla verilmiş her heronun X ve Y kordinatları.i (1\u0026lt;X,Y\u0026lt;100000).\u003c/p\u003e\u003cp\u003eÇıktı En az K heroya isabet edecek tek bir doğrultuda atılabilecek Icepathin en erken kaçıncı saniyede atılabileceği.\u003c/p\u003e\u003cp\u003eÖrnek Girdiler\u003c/p\u003e\u003cp\u003eGirdi\u003c/p\u003e\u003cp\u003e4 3\u003c/p\u003e\u003cp\u003e1 2\u003c/p\u003e\u003cp\u003e3 4\u003c/p\u003e\u003cp\u003e3 2\u003c/p\u003e\u003cp\u003e4 5\u003c/p\u003e\u003cp\u003eÇıktı\u003c/p\u003e\u003cp\u003e4\u003c/p\u003e\u003cp\u003eAçıklaması 4. saniyede (1,2),(3,4),(4,5) daki Herolara İsabet edecek şekilde.\u003c/p\u003e\u003cp\u003eGirdi\u003c/p\u003e\u003cp\u003e7 4\u003c/p\u003e\u003cp\u003e3 1\u003c/p\u003e\u003cp\u003e2 2\u003c/p\u003e\u003cp\u003e4 1\u003c/p\u003e\u003cp\u003e3 2\u003c/p\u003e\u003cp\u003e2 3\u003c/p\u003e\u003cp\u003e1 4\u003c/p\u003e\u003cp\u003e1 3\u003c/p\u003e\u003cp\u003eÇıktı\u003c/p\u003e\u003cp\u003e6\u003c/p\u003e\u003cp\u003eAçıklaması 6. saniyede (1,4),(2,3),(3,2),(4,1) daki Herolara İsabet edecek şekilde.\u003c/p\u003e\u003cp\u003eGirdi\u003c/p\u003e\u003cp\u003e5 2\u003c/p\u003e\u003cp\u003e1 1\u003c/p\u003e\u003cp\u003e2 1\u003c/p\u003e\u003cp\u003e1 2\u003c/p\u003e\u003cp\u003e1 3\u003c/p\u003e\u003cp\u003e1 4\u003c/p\u003e\u003cp\u003eÇıktı\u003c/p\u003e\u003cp\u003e2\u003c/p\u003e\u003cp\u003e._________________________________________________________________________________________________________________________________________________________________________________________________\u003c/p\u003e\u003cp\u003eSoru ZGODAN:\u003c/p\u003e\u003cp\u003eEğer bir sayıda hiç bir basamktaki sayı komşu basamaktakilerle değeri mod 2 de aynı değilse YAKIŞIKLI sayıdır.\u003c/p\u003e\u003cp\u003eSize Verilen N sayısına en yakın YAKIŞIKLI sayıyı bulunuz.\u003c/p\u003e\u003cp\u003eEğer En yakın iki tane sayı varsa ilk küçük sonrada büyük olacak şekilde yazınız.\u003c/p\u003e\u003cp\u003eGirdi\u003c/p\u003e\u003cp\u003eEn fazla 100 basamaklı Yakışıklı olmayan bir sayıdır.\u003c/p\u003e\u003cp\u003eÖrnek Girdi\u003c/p\u003e\u003cp\u003e13\u003c/p\u003e\u003cp\u003eÇıktı\u003c/p\u003e\u003cp\u003e12 14\u003c/p\u003e\u003cp\u003eÖrnek Girdi\u003c/p\u003e\u003cp\u003e5801001\u003c/p\u003e\u003cp\u003eÇıktı\u003c/p\u003e\u003cp\u003e5810101\u003c/p\u003e\u003c/div\u003e","tags":["coci"]}}