{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1440429871,"rating":168,"authorHandle":"Z0RR0","modificationTimeSeconds":1440429975,"id":19955,"title":"\u003cp\u003eMaking sure one is participating in codeforces round !\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThis might not be a real matter of concern but specially in Div1 contests a lot of contestants do not submit anything if they are not able to solve any problem. Last round(round #317) their was an opportunity to get t-shirts and top 200 is quite achievable if it is a lucky day for you. So,normally you would expect a lot of contestants in that contest. But their was less than 700 participants. The round was really a tough round and I think more than 300 people were there who tried but could not solve any,thus they do not submit any. It is quite disappointing for them who solved some and would get better rating if they all attended as they went zero solve in that contest.\u003c/p\u003e\u003cp\u003eAgain,In some contests participants usually try for B rather than A because solving only A would not boost his rating.And when they can not solve B then they do not submit any. This is looking quite disappointing to me. So, I am asking if it is possible to make any system that one has to make sure that he is rated for this contest either he submits any or not and it is at the very beginning of the contest ? If you do not make sure at the very beginning then you are not rated for the contest. People can not even cheat with another account because they have to make sure at the beginning of the contest if they are attending or not. In few initial minutes they will not be able to decide if they can manage to solve that task they decide. So actually one has to be predetermined if he is really attending the contest or not.\u003c/p\u003e\u003cp\u003eIf someone can not manage to prepare any solution to submit for any problem why would he want to make lower his ratings (Although I saw one of my friend got WA on testcase1,problem A because he tried the whole contest and can not generate any solution and he wrote that he did not deserve to be in div1) ! But the fact is he deserves the lower rating and one who solves deserves higher rating as there would be more participants. So,is it possible to do something to make sure that one is participating ?\u003c/p\u003e\u003c/div\u003e","tags":[]}}