{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1462384901,"rating":159,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1462386429,"id":44699,"title":"\u003cp\u003eНовостной подпроект Codeforces::News\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДобрый день!\u003c/p\u003e\u003cp\u003eВот что я точно не люблю, так это стоять на месте. Я регулярно наблюдаю ситуацию, что какие-то небольшие, но интересные сообществу новости не появляются на страницах Codeforces. Конечно, писать полноценные посты о небольших новостях то еще занятие, да и мониторинг жизни сообщества спортивного программирования требует определенной концентрации и усилий. \u003c/p\u003e\u003cp\u003eЯ рад представить вам авторский подпроект Codeforces, с незатейливым кодовым названием Codeforces::News. Этот подпроект будет поддерживать и вести студентка факультета КНиИТ (компьютерных наук и информационных технологий) Саратовского государственного университета Ксения \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/gKseni\" title\u003d\"Специалист gKseni\"\u003egKseni\u003c/a\u003e Гусева. Как говорится, прошу любить и жаловать! Ксения пока еще не капитально погружена в жизнь и новости спортивного программирования, но с моей и вашей помощью быстренько восполнит этот пробел. В наших планах — регулярные небольшие тематические новости, иногда анонсы, шутки и напоминания о мероприятиях. Если хорошо пойдет и будет потребность, то будем ретранслировать в соцсети, но пока сделаем небольшой раздел на страницах Codeforces.\u003c/p\u003e\u003cp\u003eПервое время новости будут только на русском языке, а как процесс встанет на понятные рельсы, то многие новости будем переводить и на английский. Надеюсь, вам станет интереснее регулярно заходить на Codeforces, а Ксения постарается чтобы так и было. Кто знает, чем закончится эта затея? Может через несколько лет у нас будет своя редакция и периодическое издание “Codeforces Times”.\u003c/p\u003e\u003cp\u003eМ.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news"]}}