{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1399388487,"rating":6,"authorHandle":"zholnin","modificationTimeSeconds":1399388934,"id":12221,"title":"\u003cp\u003eУстановка C++ под Windows — многочасовые мучения\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВчера и сегодня пытался установить C++ под Windows. Попробовал три пакета, ни в одном не удалось добиться того, что мне нужно. Нужно мне совсем немного — Win32 Console Application, возможность подсовывать файл в stdin, и чтобы всё работало без проблем.\u003c/p\u003e\u003cp\u003eEclipse Начал с Eclipse, так как пользую её для Python. Нашёл некий СDT C++ для Eclipse, установил. Компилятор в пакет не входил — начал искать компилятор. Вспомнил, что когда-то давно устанавливал Visual Studio — но не смог найти его у себя на диске. Почитал про GCC — не захотелось сразу заморачиваться с установкой MinGW, поэтому следующим пунктом стала установка Visual Studio Express.\u003c/p\u003e\u003cp\u003eVisual Studio Express Установил, выбираю новый проект -\u0026gt; C++. Вылезает список шаблонов. Вижу незнакомое слово XAML и кучу шаблонов про Windows Phone, Windows Tile Application и прочие навороты. Набираю в поиске Win32 Console Application — не найдено. Там есть ссылка на \u0026quot;магазин шаблонов\u0026quot; — захожу туда, опять ищу Win32 Console app — никакого эффекта. Попробовал один из имеющихся шаблонов — объём кода после нажатия ОК сразу превысил что-либо, что я когда-то писал на C++. Испугался.\u003c/p\u003e\u003cp\u003eПопытлся прикрутить микрософтовский компилятор к Eclipse — не получилось. Прочитал про Codeblocks — написано типа устанавливаешь и всё сразу работает, плюс в пакет включён компилятор.\u003c/p\u003e\u003cp\u003eCodeblocks\u003c/p\u003e\u003cp\u003eУстановил. Попробовал тестовую програмку — работает. Супер. Попытался загнать файл в stdin — никак. Пробовал в Command line arguments писать всё, что только можно — \u0026lt; input.txt (так работает в консоли), \u0026lt; .\\input.txt, \u0026lt; C:\\полный путь\\input.txt — результат ноль. И хотя в заголовке консоли написана вроде бы правильная строка запуска, приложение файл по stdin не видит, хоть умри.\u003c/p\u003e\u003cp\u003eEclipse Eclipse сам увидел что у меня появился GCC и сам его подключил — меня это порадовало. Попробовал тестовую программу — не найден iostream. Хорошо. Нашёл все заголовочные файлы, прописал в Header paths для компилятора. Ошибка с include исчезла — вроде бы всё видит. Осталась ошибка — и при компиляции она тоже вылезает — undefined function fprint. Мучился долго, пытаясь научить Eclipse этой стандартной функции, но ничего не получилось — уже всё, что относится к C++, все пути где мог прописал, а ошибка никуда не девается.\u003c/p\u003e\u003cp\u003eЧто имею в остатке (после где-то пяти часов):\u003c/p\u003e \u003cul\u003e   \u003cli\u003eEclipse, который не признаёт fprint\u003c/li\u003e   \u003cli\u003eCodeblocks, который работает, но отказывается передавать файлы в stdin\u003c/li\u003e   \u003cli\u003eMicrosoft Visual C++ Express, которые не понимает, зачем нужен Win32 Console и хочет чтобы я уже написал что-нибудь для Windows Phone.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eВопрос — может ли кто-нибудь что-нибудь порекомендовать? Я уже начинаю думать, что может быть забить на C++ и тренировать Java — она у меня с самого начала прекрасно работала в Eclipse. Второй вопрос — скажите мне, это я такой тупой, или что-то не то хочу от своего компьютера?\u003c/p\u003e\u003cp\u003eДа — я писал на C++ в 1997-2000 годах, с тех пор \u0026quot;в руки\u0026quot; не брал, потом был период PHP. В 2009-2010 игрался с Objective C++, потом изучал Java, но ничего большого на Java не написал. С 2012 года на Python — но в соревнованиях, где тайм лимит устанавливает в 1 секунд с Python трудно. Поэтому пытаюсь выбрать, к чему мне вернулся — к C++ или Java.\u003c/p\u003e\u003c/div\u003e","tags":["codeblocks","eclipse","visual studio"]}}