{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1418814339,"rating":83,"authorHandle":"mathlover","modificationTimeSeconds":1418814339,"id":15213,"title":"\u003cp\u003eReview my ACM career in Codeforces\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eGood afternoon, now it is 18 o\u0027clock in China(GMT+8). Tonight I will take part in my 50th contest in Codeforces officially. Therefore I want to review what I have experienced in this 49 contests in the past 566 days (It was my first time to participate in the contest on 2013 May 30th \u003ca href\u003d\"/contest/313\" title\u003d\"Codeforces Round 186 (Div. 2)\"\u003eCodeforces Round #186 (Div. 2)\u003c/a\u003e)//excluding the contest during the black days of Codeforces at the beginning of this year.\u003c/p\u003e\u003cp\u003e-------------------------I\u0027m a dividing line!-------------------------------------------------\u003c/p\u003e\u003cp\u003eMany friends have asked me why my rating graph is so amazing, in the talks in Codeforces or in the chatting software. \u003c/p\u003e\u003cp\u003eBefore \u003ca href\u003d\"/contest/406\" title\u003d\"Codeforces Round 238 (Div. 1)\"\u003eCodeforces Round #238 (Div. 1)\u003c/a\u003e, I was struggled between expert and specialist, I even became pupil. At that time, becoming a candidate was my dream! I desire to enter the div1 room in order to take part in the contest with my friends [user:Cyin][user:d891320478][user:dlhham][user:eggeek]. These four users are my schoolmates and it is they that not only showed me the attraction of ACM as well as coding, but taught me a lot of algorithms and useful data structures. Now all of them are graduated from my university. It costed me nearly one years to learn the skill of programming and algorithm. This is all what I have done before \u003ca href\u003d\"/contest/406\" title\u003d\"Codeforces Round 238 (Div. 1)\"\u003eCodeforces Round #238 (Div. 1)\u003c/a\u003e. My teachers are my schoolmates (not only above four), the books (written by Liu Rujia in Chinese, I am sorry that it may not suitable for other countries ACMers) as well as the blog of my friends(millions of knowledge).\u003c/p\u003e\u003cp\u003e-------------------------I\u0027m a dividing line!-------------------------------------------------\u003c/p\u003e\u003cp\u003eDuring the \u003ca href\u003d\"/contest/414\" title\u003d\"Codeforces Round 240 (Div. 1)\"\u003eCodeforces Round #240 (Div. 1)\u003c/a\u003e, I found that A is about number theory, B is a dp problem, D is about dp on the tree too! All of them are what I am good at because I love dp and maths(my nickname can show that~)! It was my first time to solve div1 D during the contest! \u003c/p\u003e\u003cp\u003eThen it comes to my summer holiday, it is the time my skill improved fastest, so does my rating. At that time, a series of \u0026quot;Chinese Round\u0026quot; appeared! What does it mean? It means a series of maths problems are waiting for me!! Amazing happen! The Chinese round makes my rating up up up! I became Grandmaster during \u003ca href\u003d\"/contest/468\" title\u003d\"Codeforces Round 268 (Div. 1)\"\u003eCodeforces Round #268 (Div. 1)\u003c/a\u003e. However I know this rating is so much higher than my real strength. As what I think, my rating get down back to International master until now.\u003c/p\u003e\u003cp\u003eNow I have two dreams: I wish I can become an International Grandmaster in the future, I think it is the dream of most of Codeforces users. And the other one is I hope I can get a gold medal during the regional contest of China before I am graduation!\u003c/p\u003e\u003cp\u003eThanks for reading this blog, Good luck and Have fun in the contest tonight! Hope you can get a satisfying rank tonight!\u003c/p\u003e\u003c/div\u003e","tags":["review","codefoces","acm"]}}