{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1486138686,"rating":81,"authorHandle":"gKseni","modificationTimeSeconds":1486138686,"id":50226,"title":"\u003cp\u003eЖурнал РБК: Карьера победителей мировых IT-чемпионатов\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"http://www.rbc.ru/magazine/2017/01/584eb3ea9a79471430b4dad7\"\u003eЖурнал РБК\u003c/a\u003e опубликовал истории карьеры нескольких финалистов ACM-ICPC. Опустим часть об объяснении принципов соревнования для широких масс, ниже истории Дмитрия Егорова, Глеба Леонова и Петра Митричева.\u003c/p\u003e\u003ch4\u003eДмитрий Егоров\u003c/h4\u003e\u003cp\u003eЧемпионом мира ICPC Дмитрий Егоров стал в 20 лет — в 2014 году, когда учился на третьем курсе математико-механического факультета СПбГУ. Сейчас он возглавляет отдел разработки и оптимизации баз данных крупнейшей соцсети России «ВКонтакте» и продолжает учиться в магистратуре НИУ Высшей школы экономики. Впрочем, совмещение университета с работой — привычное для Егорова дело.\u003c/p\u003e\u003cp\u003eБудущий чемпион мира окончил физико-математический лицей № 239 в Санкт-Петербурге — престижную школу, в которой учились, к примеру, математик Григорий Перельман, доказавший гипотезу Пуанкаре, и родной брат основателя «ВКонтакте» Павла Дурова Николай, вместе с ним работавший над созданием и развитием соцсети.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/18/38/1838c4b3093612c83cded796b3bc60c0081f8131.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eДмитрий Егоров год назад возглавил отдел «ВКонтакте». Под его руководством — четыре чемпиона мира по программированию. Фото: Асхат Бардынов для РБК\u003c/small\u003e \u003c/center\u003e\u003cp\u003eВ 2014 году финал чемпионата ICPC проходил в первых числах июля в Екатеринбурге. Команда СПбГУ, в которой выступал Егоров, заняла первое место — это была третья подряд победа России на мировом турнире. В первые годы учебы в университете Егоров стажировался в «Яндексе» — с 2012 по 2014 год. В компании прием «практикантов» поставлен на поток, поэтому при желании и «некотором уровне базовой подготовки» попасть туда совсем несложно, рассказывает студент. Стажировку в «Яндексе» он называет «крайне полезной» — не только с точки зрения полученных навыков программирования, но и с точки зрения организации внутри большой компании. После стажировки Егоров понял, что не видит себя рядовым сотрудником большой корпорации. «Я всегда был готов работать заметно больше и лучше других, но и ожидаю большей отдачи», — объясняет бывший студент СПбГУ. В больших компаниях недостаточно возможностей для роста и развития, им не хватает индивидуального подхода, сетует Егоров. И это касается не только «Яндекса», но и других IT-гигантов вроде Google. «Если хочется спокойной жизни с хорошей зарплатой и уверенностью в завтрашнем дне, то крупные IT-компании — отличный вариант. Но это не для меня», — считает чемпион ICPC.\u003c/p\u003e\u003cp\u003eСразу же после церемонии награждения к Егорову подошел один из сотрудников «ВКонтакте» и предложил присоединиться к команде. Через несколько месяцев студент пришел на работу в крупнейшую соцсеть. Перспективы для него очевидны: весной 2014 года из «ВКонтакте» ушел Павел Дуров, вслед за ним компанию покинули многие разработчики. «Несмотря на десятки миллионов пользователей в день, вокруг вновь витал дух стартапа», — улыбается чемпион. Меньше чем через год Егоров возглавил отдел, в который пришел на рядовую позицию. В его отделе — семь человек: все они в разные годы участвовали в ICPC, четверо становились чемпионами мира.\u003c/p\u003e\u003cp\u003eНаправление разработки и оптимизации баз данных идеально подходит для бывших олимпиадников, уверен Егоров. Еще несколько лет назад все высоконагруженные части сайта «ВКонтакте» перевели на собственные и оптимизированные под нужды компании базы данных, поскольку все имеющиеся на рынке решения оказались для компании неэффективными. «Если говорить простым языком, то я отвечаю за то, чтобы килотонны пользовательских котиков никуда не терялись», — смеется Егоров.\u003c/p\u003e\u003cp\u003eСтепень важности своего отдела для компании студент магистратуры оценивать не готов: во «ВКонтакте» сложно выделить ключевые и второстепенные отделы разработки. Для полноценной работы и развития необходимы все составляющие — и базы данных, и бэк-энд, и фронт-энд, и группа системных администраторов, и мобильная разработка. Без любой из этих частей сайт начнет деградировать довольно быстро, уверен Егоров. «Вы же не спрашиваете, какой орган у человека важнее — мозг или сердце? Без любого из них человек может жить разве что в анекдотах», — говорит он.\u003c/p\u003e\u003cp\u003eВсе победители чемпионатов ICPC, как правило, могут выбирать место работы из довольно большого списка. Например, генеральный спонсор чемпионата мира компания IBM во время награждения раздает всем призерам приглашение связаться с их HR-службой и обсудить вакансии, вспоминает Егоров. Для себя он сразу решил, что не хочет уезжать из России.\u003c/p\u003e\u003cp\u003e«Для многих айтишников переезд за границу — нечто вроде навязчивой идеи, которую они культивируют друг в друге», — говорит Егоров. О выборе «ВКонтакте» в качестве работодателя он не жалеет, а массовую миграцию IT-специалистов за рубеж называет «абсолютной катастрофой для страны».\u003c/p\u003e\u003ch4\u003eГлеб Леонов\u003c/h4\u003e\u003cp\u003eСтудент 1-го курса механико-математического факультета СПбГУ Глеб Леонов и двое друзей увидели на стенде университета объявление о наборе желающих заняться олимпиадным программированием. Выпускник математической школы — Академической гимназии СПбГУ, в которой учился Павел Дуров, — заинтересовался. Так он попал в «класс» Андрея Лопатина. Дважды Леонов становился финалистом ICPC, один раз завоевал серебряную медаль.\u003c/p\u003e\u003cp\u003eВо время учебы в СПбГУ Леонов не подрабатывал: в этом не было особой необходимости, а учеба и тренировки по программированию занимали много времени, вспоминает он. После университета Леонов поступил в аспирантуру, но через год ушел: захотел сконцентрироваться на программировании.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/9c/93/9c933b063b973f33c8cc209f74a668dee2136a93.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eГлеб Леонов с детства любил решать математические задачи, а уже в университете увлекся олимпиадным программированием. Фото: Асхат Бардынов для РБК\u003c/small\u003e \u003c/center\u003e\u003cp\u003eСейчас финалисты ICPC получают массу предложений от потенциальных работодателей: десять лет назад их возможности были скромнее. Впрочем, уже тогда Google звал программистов на собеседования. Леонова перспектива работы в одной из крупнейших американских IT-корпораций никогда не прельщала.\u003c/p\u003e\u003cp\u003eЛеонов уверяет, что участникам ICPC теперь не составляет труда уехать за рубеж и найти там работу: к примеру, уровень письменного английского языка олимпиадников автоматически поднимается до высокого, так как на соревнованиях и тренировках все условия задач указаны на английском языке. Кроме того, большинство специальной обучающей литературы можно найти только на этом языке, разводит руками медалист ICPC.\u003c/p\u003e\u003cp\u003eУчастие в чемпионатах и работа в компаниях — не одно и то же. Если речь идет о спортивном программировании, то твоя цель — как можно быстрее решить задачу и написать программу. А во время работы в компании цель специалиста — разработать софт, который можно модифицировать. Иногда необходимо «порезать» программу на части и заменить одну из «деталей», не трогая остальные, поэтому главное в работе программиста — практический навык. В университете его приобрести сложно, говорит Леонов. Более того, чем выше должность, тем больше дополнительных навыков необходимо.\u003c/p\u003e\u003cp\u003eУже семь лет Леонов работает в компании JetBrains в Санкт-Петербурге. Созданная в 1999 году в Праге российскими программистами Сергеем Дмитриевым, Евгением Беляевым и Валентином Кипятковым JetBrains разрабатывает софт для IT-специалистов. Сейчас помимо Праги и Санкт-Петербурга у компании работают офисы в Москве, Мюнхене, Бостоне и Новосибирске. На работу в JetBrains Леонов устраивался сам — попросил контакты у сотрудников компании и отправил резюме.\u003c/p\u003e\u003cp\u003e«Если студент дошел до финала чемпионата мира, то у него, скорее всего, есть способности и он достаточно легко пройдет собеседование на должность младшего программиста», — улыбается Леонов.\u003c/p\u003e\u003cp\u003eСейчас финалист ICPC занимается разработкой инструментов, правда не для программистов. Для кого — Леонов отвечать отказался, сославшись на внутренние правила компании. Несколько раз в год он участвует в индивидуальных соревнованиях по программированию, которые проводят Google, Facebook, Mail.Ru Group и др. Отборочные этапы проходят через интернет, а финалистов зовут на итоговый этап в разные города мира. «В финалы я, конечно, не попадаю, поскольку занимаюсь больше для себя», — признается Леонов.\u003c/p\u003e\u003ch4\u003eПетр Митричев\u003c/h4\u003e\u003cp\u003eУвлечение математикой Петр Митричев перенял у старшего брата, который также занимался программированием. Мама, химик по образованию, покупала Петру книги по математике. Когда в доме не было компьютера, Митричев-младший читал литературу о программировании и ходил с братом в Центр детского и юношеского творчества, где они занимались в компьютерном кружке. В семь лет он поступил в районную школу № 827, а в 14 лет перешел в специализированный класс школы № 57 в Москве, а затем подал документы на мехмат МГУ.\u003c/p\u003e\u003cp\u003eВ школе учительница по информатике предложила Митричеву поучаствовать в олимпиаде Северо-Западного округа Москвы по программированию. «После того как ты попадаешь в эту систему, легче участвовать в других олимпиадах», — вспоминает Митричев. Он также участвовал во Всероссийской олимпиаде для школьников, ездил несколько раз на двухнедельные сборы в разные города, где тренируют в том числе будущих участников ICPC.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/11/65/116589da0533c4621567935cf3d24eb40aac8e5d.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eПетр Митричев еженедельно участвует в соревнованиях для программистов онлайн. После победы на ICPC это стало его хобби. Фото: Асхат Бардынов для РБК\u003c/small\u003e \u003c/center\u003e\u003cp\u003eВ отличие от студентов СПбГУ и ИТМО у Митричева и его одногруппников с мехмата не было одного тренера. В качестве неформальных наставников выступали бывшие участники ICPC, которые делились своим опытом как онлайн, так и на сборах. Ведущий научный сотрудник лаборатории вычислительных методов мехмата МГУ Евгений Панкратьев помогал участвовать в соревнованиях: организовывал поездки и содействовал в оформлении документов. Митричев дважды дошел до финала ICPC — в 2003 году в США и в 2005-м в Китае, когда учился на первом и на третьем курсах соответственно. Оба раза в составе команд он занял второе место.\u003c/p\u003e\u003cp\u003eВо время учебы Митричев иногда подрабатывал, но не искал работу с полной занятостью. Победа в ICPC не дает стопроцентной гарантии получения интересного предложения от потенциального работодателя, уверен он. «ICPC служит скорее социальным средством связи профессионального игрока и хорошей компании-работодателя», — улыбается Митричев. Соревнования учат хорошо программировать, после этого любая работа по специальности становится по плечу, рассказывает он. Однако на олимпиаде важно программировать быстро и без ошибок, а в работе можно не торопиться. При этом он признает: умение писать код быстро и без ошибок приводит к тому, что не приходится переделывать работу по нескольку раз.\u003c/p\u003e\u003cp\u003eФиналисты ICPC могут заниматься организацией похожих соревнований внутри крупных корпораций или аналитикой (например, торговля на бирже). Последний вариант Митричев рассматривал для себя после окончания университета. «Там можно за более короткий срок заработать себе на старость», — признает он.\u003c/p\u003e\u003cp\u003eОднако с 2007 года Митричев работает в Google — сначала в московском офисе, с 2015 года — в швейцарском. На собеседовании в одну из крупнейших IT-компаний мира Митричеву пришлось решать задачи, которые похожи на те, что встречаются в финалах ICPC, вспоминает программист. Правда, сейчас он занимается поисковым ядром сайта Google, и эта работа больше связана с теорией вероятностей, которую Митричев изучал в университете. Скорость, приобретенная в ходе соревнований, помогает, когда нужно, к примеру, создать прототип программы и понять, работает ли она.\u003c/p\u003e\u003cp\u003eСейчас Митричев помогает Google проводить собственные соревнования по программированию — Google Code Jam, придумывает задачи для турниров вместе с коллегами. Митричев сам дважды принимал участие в этом конкурсе и занимал третье место в 2005 году и первое в 2006-м. Программист признается, что обсуждал возможное сотрудничество с представителями «ВКонтакте», Facebook и «Яндекс», но сейчас ему кажется, что Google — лучший вариант, «потому что компания решает интересные задачи, а ее сотрудники — умные люди, с которыми приятно работать».\u003c/p\u003e\u003cp\u003eПосле ICPC Митричев еженедельно участвует в онлайн-соревнованиях. По его словам, для решения некоторых задач ему приходится переучиваться: «Новому поколению в этом плане проще: они сразу учат современные методы программирования». Сейчас Митричев возглавляет один из ведущих рейтингов американской корпорации Topcoder.com, которая проводит соревнования по спортивному программированию с 2001 года.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news","интервью"]}}