{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1472805345,"rating":73,"authorHandle":"savinova","modificationTimeSeconds":1472883129,"id":46900,"title":"\u003cp\u003eГрантовая программа фонда Botan Investments для преподавателей\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ccenter\u003e\u003cimg src\u003d\"/predownloaded/85/42/854216c31ed4442916d353d3158112220bc6e239.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" width\u003d\"100%\" /\u003e\u003c/center\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003eНачался новый учебный год, а вместе с ним — тренировки в вузах по программированию. И сразу же отличная новость для преподавателей и тренеров: Михаил \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik\" title\u003d\"Мастер MikhailRubinchik\"\u003eMikhailRubinchik\u003c/a\u003e Рубинчик, тренер команд УрФУ, согласился написать серию постов, посвященных тренерской работе по спортивному программированию в вузе. Михаил рассмотрит вопросы мотивации студентов, изучения теории, прорешивания архивов и многие другие. Посты будут выходить раз в неделю в сообществе фонда \u003cstrong\u003eBotan Investments\u003c/strong\u003e \u003ca href\u003d\"https://vk.com/botaninvestments\"\u003ehttps://vk.com/botaninvestments\u003c/a\u003e. Приглашаем всех желающих принимать участие в обсуждении.\u003c/p\u003e\u003cp\u003eНа данный момент в грантовой программе \u003cstrong\u003eBotan Investments\u003c/strong\u003e участвуют преподаватели из 15 вузов, это СГУ (Саратов), УлГТУ (Ульяновск), СГАУ (Самара), МГУ (Саранск), САФУ (Архангельск), СибГУТИ (Новосибирск), ТПУ (Томск), ЮФУ (Ростов-на-Дону и Таганрог), ТвГУ (Тверь), УГАТУ (Уфа), ПГНИУ (Пермь), ДВФУ (Владивосток), а также УрФУ (Екатеринбург), КФУ (Казань) и ТГТУ (Тамбов), которые присоединились к программе совсем недавно. \u003c/p\u003e\u003cp\u003eА для тех, кто только планирует к нам присоединиться, напомним основные положения программы поддержки развития спортивного программирования в региональных российских вузах: — Фонд \u003cstrong\u003eBotan Investments\u003c/strong\u003e выплачивает 10.000 рублей в месяц преподавателям в качестве вознаграждения за организацию и проведение тренировок на Сodeforces. \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eПреподаватель в удобное для себя время проводит тренировки для студентов посредством решения задач на Сodeforces: участия в официальных раундах, виртуальные участия в официальных и учебных раундах, участия в тренировках (виртуальные или во время ее проведения), виртуальные участия в мэшапах. \u003cstrong\u003eВнимание\u003c/strong\u003e: дорешивание задач за тренировку не считается!\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eКаждый раз, когда преподаватель проводит очную тренировку, он должен в течение недели предоставить отчет с указанием идентификатора тренировки, даты и фотографией (опционально) в системе Codeforces. Место очной тренировки не имеет значения. Одну фотографию с тренировок в месяц необходимо добавлять в группу ВК: \u003ca href\u003d\"https://vk.com/botaninvestments\"\u003ehttps://vk.com/botaninvestments\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВ каждой тренировке должно очно поучаствовать не менее 6 студентов. Как только за календарный месяц набирается 4 тренировки и не менее 10 участников в объединении, каждый из которых сдал не менее 2 новых задач на Codeforces за месяц (в январе и июне 3 тренировки и не менее 8 участников), а к одной из тренировок прикреплена фотография, то в системе Codeforces отправляется личное сообщение о том, что преподаватель выполнил норматив по тренировкам. \u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПосле того, как все требования за месяц выполнены, преподавателю выплачивается денежное вознаграждение. Оплата производится с 1 по 15 числа каждого месяца (то есть за сентябрь перевод будет произведен не позднее 15 октября).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eДоговор о сотрудничестве мы строим на создании доверительных отношений (согласно законодательству РФ, документально договор между физическими лицами может быть заключён в устно-письменной форме, без участия юридических посредников).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПреподаватель – сотрудник вуза, чей юридический адрес относится к региону РФ отличному от Москвы и Санкт-Петербурга. Преподаватель не должен являться студентом бакалавриата или магистратуры. Преподаватель может быть как штатным, так и внештатным сотрудником/совместителем, также допустим вариант с оформлением по договору подряда.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПри возникновении подозрений на недобросовестную работу преподавателя мы оставляем за собой право запросить дополнительные сведения о проводимых тренировках и приостановить сотрудничество с преподавателем.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eЧтобы вступить в программу, необходимо заполнить следующую форму: \u003ca href\u003d\"https://docs.google.com/forms/d/e/1FAIpQLScKLpQbzpFZ-yuQwbzYUQ4uYpz4mpRZxTfnTJDwGBa-nrLqTA/viewform\"\u003ehttps://docs.google.com/forms/d/e/1FAIpQLScKLpQbzpFZ-yuQwbzYUQ4uYpz4mpRZxTfnTJDwGBa-nrLqTA/viewform\u003c/a\u003e. В течение недели после ее заполнения координатор программы свяжется с Вами и даст разъяснения по организационным моментам.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВсе вопросы Вы можете задать по электронной почте \u003ca href\u003d\"mailto:edu@botaninvestments.com\"\u003eedu@botaninvestments.com\u003c/a\u003e или тел. 89996525628.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eКоманда Botan Investments.\u003c/p\u003e\u003c/div\u003e","tags":[]}}