{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1521654661,"rating":57,"authorHandle":"wag.","modificationTimeSeconds":1521657286,"id":58494,"title":"\u003cp\u003eSTAND-UP Евгения Недашковского S02E01\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eПредыдущие выпуски\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cul\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/50304\"\u003eВступление\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/50308\"\u003eS01E01\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/50356\"\u003eS02E02\u003c/a\u003e\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eНа часах 19-35, на календаре вторник, а значит настало время нового выпуска стэндапа Евгения Недашковского. За этот год в мире юмора многое поменялось, и самое главное — благодаря группе дай антвурд люди начали любить постиронию, поэтому во втором сезоне ей будет уделено особое внимание. Пытливый читатель мог заметить, что уже первое предложение является постиронией, ведь сегодня суббота. Но не будем забегать вперед и расскажем обо всем по порядку.\u003c/p\u003e\u003cp\u003eЧто есть постирония? Это сокращение от \u0026quot;постовая ирония\u0026quot;, иными словами, пост и ирония, то есть то что вы видите прямо сейчас. Разумеется, проще объяснить на примере. Рассмотрим такой пост: \u003ccode\u003eПетр Митреевич дурак\u003c/code\u003e. Но все отлично знают, что он не дурак и в этом и заключается ирония. Вспоминая, что это был пост, понимаем очевидное: это постирония. Ваш покорный слуга будет следовать моде и использовать постиронию, будьте осторожны. \u003c/p\u003e\u003cp\u003eКак сказал Чарли Чаплин Сталину, демократия на корабле называется бунтом. На что тот ему ответил: \u0026quot;ты никогда не вернешься в эту поганую школу\u0026quot;.\u003c/p\u003e\u003cp\u003eВ связи с этим приведу пример еще одной постовой иронии. \u003ccode\u003eПетр Митреевич не дурак\u003c/code\u003e. Но все и без меня отлично знают, что он не дурак, и в это иронично. В предположении, что это был пост, он был постироничен. \u003c/p\u003e\u003cp\u003eВы спросите: \u0026quot;Евгений, в чем суть перформанса? Чем отличается постирония от обычного английского юмора?\u0026quot;. Тут, друзья мои, ситуация схожа с той, когда хоронишь толстого человека: надо копнуть поглубже. \u003c/p\u003e\u003cp\u003eПеределаем ту же самую шутку на манер английского юмора: \u003ccode\u003ePetr Mitreyevich is not fool\u003c/code\u003e. Наконец, чтобы это можно было сравнить с постовой иронией, переведем ее на русский язык: \u003ccode\u003eПетр Митреевич есть не водить за нос\u003c/code\u003e. Что из этого смешнее — решать читателю, но как я уже упоминал, постиронии в этом сезоне будет больше чем английского юмора.\u003c/p\u003e\u003cp\u003eНадеюсь, я доступно объяснил, что же такое постовая ирония и можно наконец перейти от теории к практике. \u003c/p\u003e\u003cp\u003eОднажды заходят в бар Петр Митреевич, турист и китаец, который постоянно меняет хэндлы (отныне будем называть его КиКоПоМеХ). Бармен спрашивает, что им налить. Петр Митреевич заказал 1 кружку пива. Турист заказал 1 кружку піва. Кикопомех заказал 1 кружку 啤酒.\u003c/p\u003e\u003cp\u003e\u003ccode\u003eКак говорил Альберт Эйнштейн, ты не андер, если не в относительно дырявых кроссах.\u003c/code\u003e\u003c/p\u003e\u003cp\u003eКогда я учился на первом курсе, мне часто задавали слишком много домашних заданий и чтобы их не делать я придумывал поситроничные оправдания. Например, однажды я не сделал уроки и утром написал на своей странице в социальной сети ВКонтакте, что я забыл свою тетрадку дома. Мой преподаватель был у меня в друзьях, и, разумеется, прочитал эту запись. Он, как и Петр Митреевич, дураком не был и понял, что это ирония и поставил лайк. Попробуйте сами понять, почему это была постирония.\u003c/p\u003e\u003cp\u003eКак-то раз у кикопомеха спросили, почему он не ставит \u003cstrong\u003eПЛЮСИКИ\u003c/strong\u003e стэндапам Евгения Недашковского. Он ответил: \u0026quot;Cейчас они мне нравятся, но через год я свое мнение могу поменять\u0026quot;.\u003c/p\u003e\u003cp\u003eВ следующий раз мы с вами поговорим еще и о метаиронии, не переключайтесь, подписывайтесь на мой блог, ставьте \u003cstrong\u003eПЛЮСИКИ\u003c/strong\u003e, берегите себя и своих близких.\u003c/p\u003e\u003cp\u003eЯ понимаю, что аудитория кодефорсеса это в основном дети, и они еще не понимают постиронию и не поставят \u003cstrong\u003eПЛЮСИКИ\u003c/strong\u003e. Но я призываю взрослых читателей поддержать меня \u003cstrong\u003eПЛЮСИКАМИ\u003c/strong\u003e, они мотивируют меня скорее делать новые выпуски.\u003c/p\u003e\u003c/div\u003e","tags":["юмор","постирония","молоко","шутки","недашковский"]}}