{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1516050062,"rating":-11,"authorHandle":"Rules","modificationTimeSeconds":1517160069,"id":57153,"title":"\u003cp\u003eДерево отрезков Как решить?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЗдравствуйте! Написано что эта задача из раздела \u0026quot;деревья отрезков\u0026quot; А я не знаю как ее решить с помощью дерева отрезков (или хотябы просто решить...)\u003cbr /\u003eВасилий Пупкин владеет фирмой по выпечке блинчиков. Выпекаемые блинчики Василий стремится продать, а не проданные съедает сам. Ежедневно Василий записывает количество проданных блинчиков. Кроме того, каждый день за исключением первого дня существования фирмы, Пупкин вычисляет и записывает отдельно количество прошедших дней, за которые было продано не больше блинчиков, чем за текущий день. Последнюю величину он считает показателем процветания своей фирмы. Однако, с каждым днём Василию становится всё труднее и труднее вычислять показатель процветания, и он решил заказать вам специальное программное обеспечение. \u003c/p\u003e\u003cp\u003eИтак, фирма В. Пупкина изготовила и продала a1, a2, …, an блинчиков за первые n дней своего существования. Эти данные Пупкин вам предоставит. В каждый из дней, начиная со второго, вы должны вычислить величину bj, равную количеству чисел, не превосходящих aj среди a1, …, a[j-1]. Чтобы проверить, насколько правильно работает ваша программа, заказчик попросил для начала вычислить сумму b2 + b3 + … + bn. \u003c/p\u003e\u003cp\u003eВход\u003cbr /\u003eВ первой строке входного файла записано число n – время существования фирмы в днях (2 ≤ n ≤ 100000). В остальных строках записаны числа a1, a2, …, an (0 ≤ ai ≤ 10^9). \u003c/p\u003e\u003cp\u003eВыход\u003cbr /\u003eЗапишите в выходной файл сумму b2 + b3 + … + bn. \u003c/p\u003e\u003cp\u003eПримеры входа и выхода\u003cbr /\u003epancakes.in\u003cbr /\u003e5\u003cbr /\u003e4 3 2 1 0 5\u003cbr /\u003e0 1 2 3 4 pancakes.out\u003cbr /\u003e0\u003cbr /\u003e10 \u003c/p\u003e\u003c/div\u003e","tags":["segment tree"]}}