{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1490986617,"rating":87,"authorHandle":"Nickolas","modificationTimeSeconds":1491066954,"id":51351,"title":"\u003cp\u003eApril Fools Day Contest 2017: editorial\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIncredibly, 34 people managed to solve all problems! 1032 participants solved at least one problem, and it wasn\u0027t always A :-)\u003c/p\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/784/problem/A\" title\u003d\"April Fools Contest 2017\"\u003e784A - Numbers Joke\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eTraditionally the first problem of April Fools Day contest asks to recognize a sequence of integers by problem title and (this time) a single data point. OEIS search for just the given number isn\u0027t going to give a result — or rather is going to give too many to be useful. However, if you look for the problem title, the first result for \u0026quot;numbers joke\u0026quot; query will give you \u003ca href\u003d\"https://oeis.org/A006753\"\u003ehttps://oeis.org/A006753\u003c/a\u003e \u0026quot;Smith (or joke) numbers\u0026quot;, which has 27 as its 3rd element.\u003c/p\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/784/problem/B\" title\u003d\"April Fools Contest 2017\"\u003e784B - Kids\u0027 Riddle\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eThis problem is a variation on a \u003ca href\u003d\"//codeforces.com/predownloaded/31/a2/31a26647d3b860e3a6e9cb82acf532d1059b1da0.jpg\"\u003ekid\u0027s riddle\u003c/a\u003e in which you have to count closed loops in digits of the number — one in 4, 6, 9 and 0 and two in 8. Since we\u0027re programmers here, we had to count loops in digits in hexadecimal notation of the number (writing A..F in upper case).\u003c/p\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/784/problem/C\" title\u003d\"April Fools Contest 2017\"\u003e784C - INTERCALC\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eEach line of the statement is a compilation/runtime error message in the truly April Fools language INTERCAL, which differ from the real ones in a single word. If you compare them with \u003ca href\u003d\"http://www.catb.org/~esr/intercal/ick.htm\"\u003ethe real error messages\u003c/a\u003e, modifies words will spell the task: FIND XOR OF LARGEST AND LAST ARRAY ELEMENTS.\u003c/p\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/784/problem/D\" title\u003d\"April Fools Contest 2017\"\u003e784D - Touchy-Feely Palindromes\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eHow can a palindrome be \u0026quot;touchy\u0026quot;? You have to write the number in \u003ca href\u003d\"https://en.wikipedia.org/wiki/Braille\"\u003eBraille font\u003c/a\u003e and check whether the resulting notation is a palindrome. In Braille digits 3 and 7 stay themselves when mirrored, digits 4-6, 5-9 and 8-0 become each other, and 1 and 2 stop being digits.\u003c/p\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/784/problem/E\" title\u003d\"April Fools Contest 2017\"\u003e784E - Twisted Circuit\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eThe picture shows \u003ca href\u003d\"https://en.wikipedia.org/wiki/Logic_gate\"\u003ea logic circuit\u003c/a\u003e which converts four input signals into one output. To make things more complex, logic gates OR and XOR are pictured swapped (i.e. image of OR gate actually means apply XOR gate).\u003c/p\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/784/problem/F\" title\u003d\"April Fools Contest 2017\"\u003e784F - Crunching Numbers Just for You\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eChecker verdict \u0026quot;Results unsatisfactory, try harder\u0026quot; combined with the problem title was supposed to hint that the program must show how hard it is to solve the task, i.e. not to output the result immediately :-) The submission was accepted if it spent at least a second on each test.\u003c/p\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/784/problem/G\" title\u003d\"April Fools Contest 2017\"\u003e784G - BF Calculator\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eThe only problem with a proper solution this year asked to generate a Brainfuck program which would evaluate the given expression. One could take a long way: generate commands to write numbers to memory cells, to add and subtract them and to print the result (this last part is the nasties, requiring dividing by 10 to get individual digits of the result). Or one could use a shortcut: evaluate the expression in a normal language (preferably Python with its eval) and generate a program which would print each digit of the answer.\u003c/p\u003e\u003c/div\u003e","tags":["april 1st"]}}