{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1491751911,"rating":108,"authorHandle":"jonathanirvings","modificationTimeSeconds":1512834529,"id":51512,"title":"\u003cp\u003eInvitation to TOKI Open 2017\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello!\u003c/p\u003e\u003cp\u003eAfter we successfully organized \u003ca href\u003d\"//codeforces.com/blog/entry/12286\"\u003eTOKI Open 2014\u003c/a\u003e, we are going to do the similar thing this year. We will open our current IOI Selection Contest to international participants. We call it \u003cstrong\u003eTOKI Open 2017\u003c/strong\u003e. TOKI stands for Tim Olimpiade Komputer Indonesia, or Indonesian Computing Olympiad Team in English.\u003c/p\u003e\u003cp\u003eObjectives of us opening this contest include, but not limited to:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eMeasure the performance of our IOI trainee compared to other countries\u0027 IOI trainee.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eFoster friendship between Indonesia and other IOI participating countries.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eTest Indonesia\u0027s scientific committee capability in setting IOI-level problems.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eTest Indonesia\u0027s technical committee capability in hosting IOI-level contests.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe contest will have very similar format with IOI, as this contest will be used to select our Top 4 and train our Top 4 for IOI. We expect that the difficulty of the contest is almost the same as IOI. Therefore, this contest is suitable for those who are preparing for IOI. The problems will be available in both Bahasa Indonesia and English. \u003c/p\u003e\u003cp\u003eThe rules of TOKI Open 2017 are\u003c/p\u003e \u003cul\u003e   \u003cli\u003eThere will be 3 IOI-style problems for each competition day.\u003c/li\u003e   \u003cli\u003eYou can only submit at most 50 submissions for a problem.\u003c/li\u003e   \u003cli\u003eYou will get full feedback for each submission.\u003c/li\u003e   \u003cli\u003eFor each problem, there are several subtasks:\u003c/li\u003e   \u003cli\u003eFor each subtask, there are points assigned to it.\u003c/li\u003e   \u003cli\u003eEach subtask contains several test cases.\u003c/li\u003e   \u003cli\u003eYou get the points from that subtask if the program passes all the test cases in that subtask.\u003c/li\u003e   \u003cli\u003eThe score of a submission is the sum of all the points that you get from completing subtasks.\u003c/li\u003e   \u003cli\u003eThe final score for a problem is the maximum of all the submission scores for that problem.\u003c/li\u003e   \u003cli\u003eUnfortunately only C++11 is supported. We will use g++ (Ubuntu 4.8.2-19ubuntu1) 4.8.2 (flags: -std\u003dc++11 -O2 -lm) compiler\u003c/li\u003e   \u003cli\u003eYou will only need to implement several functions described in problem statement (i.e. no I/O is needed)\u003c/li\u003e   \u003cli\u003eYou can submit clarification requests in either Bahasa Indonesia or English.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe contest will be conducted on \u003ca href\u003d\"https://competition.ia-toki.org/contests\"\u003eTLX Online Judge\u003c/a\u003e. You may need to register for a TLX Account if you do not have one. If you have a TLX account, you can login and go to the contest link to register for the contest. There will be two competition days, each having three problems. Each competition day will have two open windows containing the same problemset, so you can participate in either one of the window depending your time preference. \u003c/p\u003e \u003col\u003e   \u003cli\u003eDay 1 : Wednesday, 10 May 2017\u003c/li\u003e \u003c/ol\u003e \u003cul\u003e   \u003cli\u003eWindow 1 : 1.30AM — 6.30AM UTC (8.30AM — 1.30PM Western Indonesian Time). \u003ca href\u003d\"https://competition.ia-toki.org/contests/178\"\u003eContest Link\u003c/a\u003e.\u003c/li\u003e   \u003cli\u003eWindow 2 : 12.00PM — 5.00PM UTC (7.00PM — 12.00AM Western Indonesian Time). \u003ca href\u003d\"https://competition.ia-toki.org/contests/184\"\u003eContest Link\u003c/a\u003e.\u003c/li\u003e \u003c/ul\u003e \u003col\u003e   \u003cli\u003eDay 2 : Friday, 12 May 2017\u003c/li\u003e \u003c/ol\u003e \u003cul\u003e   \u003cli\u003eWindow 1 : 6.30AM — 11.30AM UTC (1.30PM — 6.30PM Western Indonesian Time). \u003ca href\u003d\"https://competition.ia-toki.org/contests/179\"\u003eContest Link\u003c/a\u003e.\u003c/li\u003e   \u003cli\u003eWindow 2 : 12.00PM — 5.00PM UTC (7.00PM — 12.00AM Western Indonesian Time). \u003ca href\u003d\"https://competition.ia-toki.org/contests/185\"\u003eContest Link\u003c/a\u003e.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eA practice contest to get familiarised with TLX and the problem format is available \u003ca href\u003d\"https://competition.ia-toki.org/contests/186\"\u003ehere\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eIMPORTANT:\u003c/strong\u003e You are not allowed to \u003cstrong\u003eregister\u003c/strong\u003e on both windows for the same competition day, since they will have the same problemset. If you have registered on a wrong window, you can go to the contest link to unregister.\u003c/p\u003e\u003cp\u003eWe invite everyone (especially eligible IOI participants) to participate in this contest. See you at the leaderboard.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD1 :\u003c/strong\u003e Due to several requests in our country, we have decided to adjust the contest time. The contest will be conducted on 9.00AM — 2.00PM UTC for both competition days. The competition date is remain unchanged (10 May and 12 May). Thank you\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2 :\u003c/strong\u003e Even after we adjust the contest time, we still received several requests. Therefore, we decided to open two windows for both competition days. See the detail on the updated post above. The competition date is remain unchanged (10 May and 12 May). We have thought about this decision carefully and have finalized the schedule. We promise there will not be any future changes to the schedule. Thank you and apologize for the changes.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD3 :\u003c/strong\u003e Detailed rules and practice session posted.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD4 :\u003c/strong\u003e The post-contest post (includes problems repository, problems discussion, etc.) is available \u003ca href\u003d\"//codeforces.com/blog/entry/52005\"\u003ehere\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}