{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1474665080,"rating":3,"authorHandle":"greencis","modificationTimeSeconds":1474665080,"id":47313,"title":"\u003cp\u003eЛицейский факультатив по информатике 2016-2017. Лекция первая\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eВ этот четверг прошла первая лекция факультатива по теме \u0026quot;Теория чисел\u0026quot;. Мы разобрали расширенный алгоритм Евклида и функцию Эйлера, а также их применения. Если вы что-то не до конца поняли по теоретической части, не расстраивайтесь: бо́льшую часть теории можно найти на сайте \u003ca href\u003d\"http://e-maxx.ru/algo/\"\u003ehttp://e-maxx.ru/algo/\u003c/a\u003e в разделе \u0026quot;Алгебра\u0026quot;. Очень рекомендую разобраться с этими вопросами, потому что задачи на теорию чисел бывают довольно часто.\u003c/p\u003e\u003cp\u003eТеперь по задачкам на дом. После каждой лекции я буду выкладывать список задач по теме лекции. Если вы хотите многому научиться и побеждать на контестах, то эти задачки необходимо прорешивать, желательно как можно больше. По данным задачам устраивается зачёт, и ребята, наиболее активно сдававшие задачи в течение года, будут соответствующим образом поощрены. То есть мотивация к работе возрастает как минимум в 2 раза. :)\u003c/p\u003e\u003cp\u003eЗадачи делятся на две категории: обычные (\u0026quot;простые\u0026quot;) и сложные (\u0026quot;гробы\u0026quot;). Простые задачи чаще всего используют уже рассказанные на лекции идеи и приёмы; сложные же требуют некоторых глубоких познаний и, иногда, безумных идей. Хотя я не исключаю, что кому-то гроб может показаться легче какой-нибудь \u0026quot;халявы\u0026quot; — по-разному ведь бывает! Так что не стесняйтесь использовать фантазию при решении сложных задач.\u003c/p\u003e\u003cp\u003eПростые задачи:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d2070\"\u003ehttp://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d2070\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"https://projecteuler.net/problem\u003d70\"\u003ehttps://projecteuler.net/problem\u003d70\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1430\"\u003ehttp://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1430\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/contest/509/problem/D\"\u003ehttp://codeforces.com/contest/509/problem/D\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/problemset/problem/711/E\"\u003ehttp://codeforces.com/problemset/problem/711/E\u003c/a\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eВторая задача — с сайта \u0026quot;Проект Эйлер\u0026quot;. На этом сайте собрано много математических задачек, связанных с информатикой. Это отличное место, где можно потренировать вычислительную математику, а в частности — и теорию чисел. Остальные задачи — с сайтов acm.timus.ru и Codeforces, по темам первой лекции.\u003c/p\u003e\u003cp\u003eА теперь сложные задачи:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003ca href\u003d\"http://acmp.ru/index.asp?main\u003dtask\u0026amp;id_task\u003d644\"\u003ehttp://acmp.ru/index.asp?main\u003dtask\u0026amp;id_task\u003d644\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"https://projecteuler.net/problem\u003d243\"\u003ehttps://projecteuler.net/problem\u003d243\u003c/a\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eШестая задача не совсем по теме, но её решение использует один классный трюк, который в будущем может пригодиться. Седьмая — на функцию Эйлера, но для эффективного решения нужен более умный подход. В зачёт гробы идут как две задачи, так что решить один гроб ценнее, чем решить одну халяву.\u003c/p\u003e\u003cp\u003eРешать можно в любом порядке. Я упорядочил их по возрастанию сложности (на мой взгляд), но если вы чувствуете, что долго не можете решить какую-то задачу, то лучше пропустите её, посмотрите другие. В понедельник мы разберём часть задач, чтобы вы смогли их дорешать. Когда вы решили задачу, сделайте скриншот вашего Accepted-вердикта и пришлите мне в почту \u003ca href\u003d\"mailto:greencis@mail.ru\"\u003egreencis@mail.ru\u003c/a\u003e, чтобы я мог поставить вам галочку по этой задаче. Не забудьте указать фамилию!\u003c/p\u003e\u003cp\u003eНа этом пока что всё. Успешного решения задач и до встречи в понедельник!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eP. S.\u003c/strong\u003e Барташ Максим и Анищенко Денис, пожалуйста, заполните \u003ca href\u003d\"https://docs.google.com/forms/d/e/1FAIpQLSfhrBZWK2NFr1-dndrdsu9zkN0G97ZT9JK5bpFALsFpLUAY9w/viewform\"\u003eформу\u003c/a\u003e! Ваше мнение очень важно для нас!\u003c/p\u003e\u003c/div\u003e","tags":[]}}