{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1459056223,"rating":102,"authorHandle":"poikniok","modificationTimeSeconds":1459056223,"id":44017,"title":"\u003cp\u003eCS Research Fields, and Intersection with Competitive Programming\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI was curious to ask the Codeforces community what they think of the current CS research fields, and how possibly mediocre people in competitive programming can fit in / contribute. I am trying to find / think of a research field that I could possibly work in, and find productive and possibly contribute in, that is accessible to those who are weak intellectually. \u003c/p\u003e\u003cp\u003eIt is very discouraging for instance thinking about theoretical CS, as the people are so strong mathematically and otherwise, and then even I see lots of red people on CF who it seems never try or have anything happen research wise. So to me then it seems clear, if there are red people of CF who never accomplish anything research wise in theoretical CS, then for somebody like me the situation is beyond hopeless, and therefore that is not the field. \u003c/p\u003e\u003cp\u003eHowever the issue with more applied fields is that they seem somewhat less interesting at times, and there is a lot of very specific knowledge required. So far thinking about things it seems that maybe computer vision or something like that could be better than theory / algorithms, however there seem to be downsides to this too.\u003c/p\u003e\u003cp\u003eI am curious if there are people on CF who have thought in similar way, and come up with any interesting conclusions? Because otherwise it seems that it is off to industry, however is that really the only option? Basically I guess to rephrase the question, does anybody think there are fields where having marginal programming ability in addition to marginal mathematical skills can amount to something? And maybe ideally the field would be interesting too… \u003c/p\u003e\u003c/div\u003e","tags":[]}}