{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1466026247,"rating":82,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1466091872,"id":45454,"title":"\u003cp\u003eSurprise Language Round #8\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThe language of the round is \u003cstrong\u003eKotlin\u003c/strong\u003e. Kotlin is a statically-typed programming language that runs on the Java Virtual Machine and also can be compiled to JavaScript source code. Its primary development is from a team of JetBrains programmers based in Saint Petersburg, Russia (the name comes from the Kotlin Island, near St. Petersburg).\u003c/p\u003e\u003cp\u003eHere is an example of the simplest program on Kotlin to print sum of two numbers:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003efun main(args: Array\u0026lt;String\u0026gt;) {\n    val (x, y) \u003d readLine()!!.split(\u0027 \u0027).map(String::toInt)\n    println(x + y)\n}\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eHere are some links to help you with Kotlin:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003ca href\u003d\"https://goo.gl/gYZ5xD\"\u003ehttps://en.wikipedia.org/wiki/Kotlin_(programming_language)\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"https://kotlinlang.org/docs/reference/\"\u003ehttps://kotlinlang.org/docs/reference/\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"http://try.kotlinlang.org/\"\u003ehttp://try.kotlinlang.org/\u003c/a\u003e — be careful: reading from the console in the web-IDE is not allowed\u003c/li\u003e   \u003cli\u003eand Google!\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eYou can download standalone compiler (version 1.0.1) by the link \u003ca href\u003d\"//s.codeforces.com/files/kotlin-compiler-1.0.1.zip\"\u003ehttp://s.codeforces.com/files/kotlin-compiler-1.0.1.zip\u003c/a\u003e Also you need JRE (virtual Java machine), you can find it by the link \u003ca href\u003d\"http://www.oracle.com/technetwork/java/javase/downloads/jre8-downloads-2133155.html\"\u003ehttp://www.oracle.com/technetwork/java/javase/downloads/jre8-downloads-2133155.html\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe password from the archives with IDEA (IDE supporting Kotlin out of the box): c8bf9dd9b91ad9ff Links to IDEA are below or you can download it from the \u003ca href\u003d\"https://www.jetbrains.com/idea/download/\"\u003eofficial website\u003c/a\u003e\u003c/p\u003e\u003cp\u003eGood luck!\u003c/p\u003e\u003cp\u003e\u003d\u003d\u003d\u003d\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e You can predownload development pack (sorry, 300MB). In fact, you can take part without it — the Custom Invocation tab will be available during the contest. Also we will publish more compact tools 30 minutes before the start.\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eOS\u003c/th\u003e       \u003cth\u003e \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003eLinux \u003c/td\u003e       \u003ctd\u003e\u003ca href\u003d\"//s.codeforces.com/files/683-linux.7z\"\u003ehttp://s.codeforces.com/files/683-linux.7z\u003c/a\u003e \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003eWindows \u003c/td\u003e       \u003ctd\u003e\u003ca href\u003d\"//s.codeforces.com/files/683-windows.7z\"\u003ehttp://s.codeforces.com/files/683-windows.7z\u003c/a\u003e \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003eMac OS \u003c/td\u003e       \u003ctd\u003e\u003ca href\u003d\"//s.codeforces.com/files/683-macos.7z\"\u003ehttp://s.codeforces.com/files/683-macos.7z\u003c/a\u003e \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eAll archives are encrypted. The password will be announced 30 minutes before the contest.\u003c/p\u003e\u003cp\u003e\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003c/p\u003e\u003cp\u003eSurprise Language Round #8 will start on \u003ca href\u003d\"http://timeanddate.com/worldclock/fixedtime.html?day\u003d16\u0026amp;month\u003d6\u0026amp;year\u003d2016\u0026amp;hour\u003d19\u0026amp;min\u003d0\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003eJune 16, 16:00 (UTC)\u003c/a\u003e. It will be \u003cem\u003eunusual entertaining contest\u003c/em\u003e. \u003cstrong\u003eSolutions on the only programming language will be allowed.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThus, it is expected that during the round, participants can get acquainted with the language and solve a few simple problems. \u003cstrong\u003eThe language will be announced 30 minutes before the start of the round.\u003c/strong\u003e At the same time (or earlier but encrypted archives) we will publish the archives with the tools to write programs in this language.\u003c/p\u003e\u003cp\u003eI am pleased to announce that the top 20 participants will receive an exclusive t-shirt, and another 10 random participants among those who solved at least three problems will receive an exclusive t-shirt too.\u003c/p\u003e\u003cp\u003eThe rules of the contest are as follows:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eThe contest is \u003cstrong\u003eunrated\u003c/strong\u003e for everybody.\u003c/li\u003e   \u003cli\u003eThe round uses ACM ICPC rules: the standing is defined by the number of solved problems, ties are resolved based on penalty time. Initially the penalty is 0, and for each solved problem it is increased by submission time (since the start of the contest) + 20 minutes for each failed submission. The solution is considered to be correct if it passes all tests from a predefined test set; you know whether the solution is right immediately after sending it. There are no hacks.\u003c/li\u003e   \u003cli\u003eThe round will have 8-10 problems, sorted by estimated complexity, and you have 2 hours to solve it.\u003c/li\u003e   \u003cli\u003eSolutions are accepted \u003cstrong\u003eonly in one language\u003c/strong\u003e, which will be announced in 30 minutes before the contest.\u003c/li\u003e   \u003cli\u003ePlease \u003cstrong\u003ereread this post\u003c/strong\u003e at the beginning of the contest: we will announce the language and add instructions to install the compiler (the contest interface will provide an option to run your solutions online as well) and links to useful manuals. Other than that, learning the language is up to the competitor. You can use any resources to solve the problems (as long as you remember that this is an individual competition); you don\u0027t have to limit yourself to the manuals provided in the post.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eGood luck!\u003c/p\u003e\u003c/div\u003e","tags":["surprise","surprise language","surprise language round","unknown language"]}}