{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1506129734,"rating":35,"authorHandle":"Ask","modificationTimeSeconds":1506129734,"id":54697,"title":"\u003cp\u003eКвалификация на Дальневосточный четвертьфинал ACM ICPC\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eОтборочный этап (1/8 финала) командного чемпионата мира среди студентов по Дальневосточному региону будет проходить 7 октября \u003ca href\u003d\"https://imcs.dvfu.ru/cats/main.pl?lang\u003dru;f\u003dproblems;cid\u003d1179963\"\u003eна базе Дальневосточного федерального университета\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eОтборочный этап организуется дистанционно на площадках в каждом из вузов или городов. Для официального участия в отборочном этапе необходимо зарегистрироваться на площадке в своём городе/вузе. Участие вне конкурса доступно для всех желающих.\u003c/p\u003e\u003cp\u003eЗадачи отборочного этапа будут доступны помимо английского также и в переводе на русский язык. Сложность части задач снижена и рассчитана в том числе на только что поступивших абитуриентов. Количество участвующих в отборочном туре команд не ограничено и зависит только от возможностей каждой из площадок. Результаты отборочного этапа могут использоваться как аргумент для обоснования необходимости выделять ресурсы на подготовку и участие в соревнованиях по программированию.\u003c/p\u003e\u003cp\u003eВ сезоне 2017/2018 года каждому региону Дальнего Востока предоставляется квота в 1 команду на 1/4 финала независимо от результатов отборочного этапа. Остальные места будут распределяться в зависимости от результатов отбора. Руководителям и тренерам вузов рекомендуется использовать результаты отборочного этапа (1/8 финала) для выбора команд, которые будут заявлены на 1/4 финала. С сезона 2018/2019 прохождение отборочного этапа станет необходимым для каждой команды для участия в 1/4 финала и дальнейших этапах.\u003c/p\u003e\u003cp\u003eПредставители вузов Дального Востока, которые ещё не организовали своих площадок, могут связаться со мной по адресу \u003ca href\u003d\"mailto:klenin@gmail.com\"\u003eklenin@gmail.com\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eАлександр Кленин, директор четвертьфинальных соревнований ACM ICPC по Дальневосточному подрегиону.\u003c/p\u003e\u003c/div\u003e","tags":[]}}