{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1499876044,"rating":49,"authorHandle":"love_codchef","modificationTimeSeconds":1499876044,"id":53263,"title":"\u003cp\u003eUnfair Codechef IPC camp selection\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eDear codechef\u003c/p\u003e\u003cp\u003eI have been one of your biggest fans and have seen you grow over the years. You were the reason I started doing competitive programming in school and you were the reason I got selected for the IOI camp (IOITC). I am your biggest fan and love your initiative of the IPC camp. It is implicitly obvious that the aim of the camp is to train the future IOI and ICPC WF participants for India. So, the people in the camp should be the ones who are most \u0027eligible and qualified\u0027 for them. I know it is very hard to quantify \u0027eligibility and qualifications\u0027 without an actual contest. But, is not it unfair that a person who got selected for the IOITC and still has one or two years left for IOI is not selected for the IPC camp while a few people who did not get selected for the IOITC made it to the IPC camp? I know of at least 3-4 people who made it to IOITC but were not selected for the IPC camp. I can also name 3 people who couldn\u0027t clear IOITC this year, have the same number of years left for high school and got selected. One of the guys who got selected for the IPC camp has been consistently failing to make it to IOITC for three years. I know that their are \u0027special\u0027 cases but the counter examples tell another story. I even know of an APIO medallist that got rejected. It just feels that instead of merit, some personal hidden agenda was used to select the students. I mean we just filled a google doc form to get selected. Codechef uses contests for every little thing and here, nothing. Anyways, I hope that codechef would learn from its mistakes and will take care not to make such \u0027blunders\u0027 in the future.\u003c/p\u003e\u003cp\u003eYour longtime well wisher A true fan\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.facebook.com/pg/CodeChef/photos/?tab\u003dalbum\u0026amp;album_id\u003d10154851176432799\"\u003ehttps://www.facebook.com/pg/CodeChef/photos/?tab\u003dalbum\u0026amp;album_id\u003d10154851176432799\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codechef","codechef snackdown 2017","training camp"]}}