{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1475212642,"rating":82,"authorHandle":"stgatilov","modificationTimeSeconds":1475468060,"id":47427,"title":"\u003cp\u003eXVII открытая Всесибирская олимпиада по программированию им. И. В. Поттосина\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003eВ этом году состоится XVII Открытая Всесибирская олимпиада им. И. В. Поттосина — соревнование по программированию, в котором принимают участие студенты вузов со всей России, а также стран СНГ.\u003c/p\u003e\u003cp\u003eОлимпиада состоит из отборочного и очного этапов. Отборочный этап (известный также как \u0026quot;интернет-тур\u0026quot;) проходит через интернет в формате ACM, и участвовать в нём могут все желающие команды. Основной язык олимпиады, на котором написаны условия задач и происходит общение с жюри, — русский. В очный этап проходит ориентировочно 50 команд, при этом для команд от Сибири и Дальнего Востока выделяется квота не менее 50% от общего числа участников очного тура.\u003c/p\u003e\u003cp\u003eОчный этап традиционно состоит из двух туров. Один из них проходит по правилам ACM-олимпиад: 8-12 задач, на решение которых отводится 5 часов. На другом туре участникам предлагается решать одну \u0026quot;большую\u0026quot; задачу в течение 5 часов. Тематика задач такого тура разнообразна: игровые задачи на написание AI (\u003ca href\u003d\"//codeforces.com/blog/entry/9438\"\u003eпример\u003c/a\u003e), не имеющие идеального решения задачи, параллельное программирование. Более подробно правила и положение олимпиады можно прочитать \u003ca href\u003d\"http://olympic.nsu.ru/widesiberia/2016/info\"\u003eздесь\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eОтборочный тур состоится в воскресенье, 2 октября, в 11:00 по московскому времени. Очный тур пройдёт в Новосибирске с 4 по 7 ноября. Параллельно с отборочным соревнованием на этом же наборе задач будет проходить этап Открытого Кубка. Команды, желающие участвовать в отборочном раунде и бороться за выход в очный тур, должны регистрироваться и писать контест в системе тестирования NSUTs. Остальные команды, желающие просто написать хороший контест, могут решать его как обычный этап Открытого Кубка. Регистрация в системе тестирования открыта \u003ca href\u003d\"https://olympic.nsu.ru/nsuts-new/login.cgi\"\u003eздесь\u003c/a\u003e (форма регистрации пока переживает не лучшие времена, но мы всё ещё работаем над этим).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPDATE\u003c/strong\u003e: Прошу прощения у всех тех, кто решал контест в системе тестирования nsuts, за малоприятные пять часов жизни. Могу лишь надеяться, что не все пять часов были потрачены зря. Также хочу извиниться за отсутствие ответов на вопросы об очереди и проблемах тестирования.\u003c/p\u003e\u003cp\u003eСейчас рейтинг разморожен. Дорешивание в nsuts открыто в олимпиаде \u0026quot;Тренировки\u0026quot;, в туре \u0026quot;Интернет-тур Всесибирской олимпиады (2016): дорешивание\u0026quot;. Чуть более подробная инструкция среди ответов на вопросы в самом интернет-туре. Кроме того, многие из вас могут дорешивать задачи в Открытом Кубке (GP of Eurasia).\u003c/p\u003e\u003c/div\u003e","tags":["всесибирская"]}}