{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1459844532,"rating":105,"authorHandle":"raj454raj","modificationTimeSeconds":1508338402,"id":44190,"title":"\u003cp\u003eStopStalk: Tool to maintain your algorithmic progress\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello guys! I want to present before you an awesome tool \u003cstrong\u003eStopStalk\u003c/strong\u003e to keep track of your friends\u0027 submissions on various competitive websites(Codeforces, UVa, Codechef, Spoj, HackerEarth, HackerRank).\u003c/p\u003e\u003cp\u003eAnd that is just not it. It has a lot of other features — \u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eStreak notifier of your friends\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eFeel like solving algorithmic problems — Why go to Codeforces and search for a problem? Solve problems from across all the platforms. Search a problem by tag. See which friends have solved that problem and what is the difficulty level of the problem.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eWant to solve problems that other coders are solving recently - We got a list of trending problems both globally and also amongst your friends.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eA global leaderboard along with a unique rating which includes submissions from all the websites.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eDo you forget contests? — We got a list of upcoming contests and an option to remind you 30 mins before the contest starts.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eDo you often remember some friend\u0027s submission on a particular site and want to view that submission — We got you covered. We have a filter page to find exactly what you want.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIf you add a custom friend only you can see his/her submissions. This is useful when one of your friend is not on StopStalk or not accepting your friend request! Though the better method will be to invite him/her on StopStalk. And a lot more!!!\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eThe goal is to keep people motivated in algorithmic programming and solve more and more problems. And yeah we do have a referral program. Just share your StopStalk handle after registering with your friends and ask them to enter while registering.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/c5/97/c597511cec2053ed609d40624835d6129753f026.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e Also you get these awesome Laptop Stickers for just making friends. Increase your network of friends and enjoy its perks. Stickers will be dispatched on 11th April.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.stopstalk.com/default/user/register\"\u003eRegister now\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIf you already have start making friends to get more and more stickers.\u003c/p\u003e\u003cp\u003eThe code is completely Open Source: \u003ca href\u003d\"https://github.com/stopstalk/stopstalk-deployment\"\u003eGithub\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.facebook.com/stopstalkcommunity/\"\u003eFacebook page\u003c/a\u003e\u003c/p\u003e\u003cp\u003eLike/Upvote/Share/Comment/Star !\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e5100+\u003c/strong\u003e users globally started StopStalking !\u003c/p\u003e\u003cp\u003eHappy StopStalking! ‪#‎StopStalk‬\u003c/p\u003e\u003c/div\u003e","tags":["stopstalk","competitive","programming","stalk","friends"]}}