{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1498277040,"rating":18,"authorHandle":"hiddentesla","modificationTimeSeconds":1498277040,"id":52860,"title":"\u003cp\u003ePartitioning an array into K subarrays to minimize the maximum difference\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003ehere is a (shortened) question from one of my old national olympiad\u003c/p\u003e\u003cp\u003egiven N and K and an array of N integers 1 and 10^6 inclusive.\u003c/p\u003e\u003cp\u003epartition the array into exactly K subarrays and calculate their sum. find the minimum possible difference of the maximum sum and the minimum sum.\u003c/p\u003e\u003cp\u003e(1\u0026lt;k\u0026lt;\u003dn\u0026lt;\u003d40)\u003c/p\u003e\u003cp\u003efor example for N\u003d6 and K\u003d3 and array\u003d{5 1 1 1 3 2}\u003c/p\u003e\u003cp\u003ethe optimal way is to split it into [5][1 1 1][3 2] so the maximum sum is 5, minimum sum is 3 so the answer is 5-3\u003d2.\u003c/p\u003e\u003cp\u003ei think the right step is to use prefix sum so pref[i] -\u0026gt; sum of element from 1..i\u003c/p\u003e\u003cp\u003ei thought about DP[pos][k][lmin][rmin][lmax][rmax] where it means the answer for subarray 1..pos where we already made k subarray and the subarray with minimum sum is in lmin..rmin and the subarray with maximum sum is in lmax..rmax. transition is O(n) so the complexity is O(n^7)\u003c/p\u003e\u003cp\u003ei also have an idea of fixing Lmin,Rmin,Lmax,Rmax (O(n^4)) and find if we can get K-2 subarrays from the remaining elements with the sum between (pref[Rmin]-pref[Lmin-1]) and (pref[Rmax] — pref[Lmax-1]). but i need an O(n) way to do that but it seems i cant find one (think about a greedy strategy which moves from left to right and increase cnt whent the current sum is \u0026gt;\u003dmin and reset sum to 0. but it does not work the cnt\u0026gt;k because its not certain that we can split something and keep the sum\u0026gt;\u003dmn\u003c/p\u003e\u003cp\u003eso can i have some hints for this problem?\u003c/p\u003e\u003c/div\u003e","tags":[]}}