{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1438281629,"rating":85,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1438282352,"id":19519,"title":"\u003cp\u003eVK Cup 2015: хотите работать ВКонтакте?\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЗакончен VK Cup 2015. Я очень рад, что получился большой интересный Чемпионат с захватывающим Финалом. Такой драматической развязки и неожиданного хода соревнования я не видел очень давно.\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/af/4c/af4c084b6bc9eec8876fa1053000ae5d54e02eca.png\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eНе знаю как финалисты, а я уехал из Санкт-Петербурга с ощущением чего-то незавершенного. Уже в пути я понял, что чего же мне не хватило — очень хотелось спокойно погулять по городу, насладится красивейшими архитектурными видами, посмотреть на развод мостов и ночной Петербург.\u003c/p\u003e\u003cp\u003eЕсли вы понимаете о чем я, и:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eвы прошли в Раунд 3 чемпионата\u003c/li\u003e   \u003cli\u003eили имеете титул \u0026quot;Мастер\u0026quot; (оранжевый цвет) или выше,\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eто у вас есть замечательная возможность присоединиться к разработке самой большой соцсети Европы (и, ИМХО, лучшей в мире). Обратите внимание, что команда ВКонтакте целиком русскоязычная, а разработка ведется из Санкт-Петербурга.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e \u003c/p\u003e\u003ccenter\u003e \u003ca href\u003d\"/vk2015/apply\" style\u003d\"background-color: rgb(69,102,142);font-size: 20.0px;color: white;text-decoration: underline;padding: 6.0px;border-color: rgb(37,70,110);\"\u003eЗаинтересовались работой ВКонтакте?\u003c/a\u003e \u003c/center\u003e \u003cbr /\u003e\u003cp\u003eОт себя отмечу, что партнерство ВКонтакте и Codeforces имеет большую историю. ВКонтакте был основным спонсором Codeforces несколько лет. Вот уже два раза мы вместе проводили Чемпионат — с ВКонтакте работать очень приятно и комфортно. Коллектив разработчиков в большой степени ориентирован на олимпиадников, так что уверен, здесь вы будете чувствовать себя в своей тарелке.\u003c/p\u003e\u003c/div\u003e","tags":["vk","вконтакте"]}}