{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1478788910,"rating":3,"authorHandle":"GoTo","modificationTimeSeconds":1478788910,"id":48316,"title":"\u003cp\u003eGoToHack 2: анализ данных и машинное обучение\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/12/3e/123e090b8562f3d52506958046735fd6ea48b478.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eС 9 по 11 декабря в Москве пройдет \u003ca href\u003d\"http://goto.msk.ru/hackathon\"\u003eвторой хакатон GoToHack\u003c/a\u003e, посвященный применению технологий машинного обучения в сфере образования и HR. Участники хакатона вместе с экспертами в области анализа данных и машинного обучения проведут исследования и реализуют проекты в области образования и HR на основе реальных данных. \u003c/p\u003e\u003cp\u003eК участию приглашаются школьники и студенты в возрасте до 20 лет включительно, но попробовать свои силы вне конкурса могут все желающие любых возрастов. В рамках отборочного онлайн-этапа хакатона всем желающим будут предложены задания на Kaggle по предсказанию результата прохождения онлайн-курса на основе реальных данных партнёра – платформы Stepik.org. Как и в первый раз, хакатон проводится прежде всего как образовательное мероприятие, в рамках которого участников ждет обучающий интенсив и работа над проектом под руководством опытного куратора. В связи с этим по итогам отбора будет сформированы потоки для начинающих и продвинутых, в рамках которых участников ждут мастер-классы от экспертов Google, Яндекс, КРОК, E-Contenta и других. \u003c/p\u003e\u003cp\u003eПо итогам хакатона каждая команда презентует результаты перед экспертами, лучшие будут награждены организаторами и партнерами призами, приглашениями на обучение и стажировки. Победители получат возможность принять участие в международной конференции по ML. \u003c/p\u003e\u003cp\u003eА также организаторы выберут из участников 5 старшеклассников, которые смогут попасть на финал \u003ca href\u003d\"http://nti-contest.ru\"\u003eОлимпиады НТИ\u003c/a\u003e без прохождения всех отборочных этапов.\u003cbr /\u003eГенеральный партнер хакатона – АО Российская венчурная компания, место проведения – Точка кипения Агентства стратегических инициатив. \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://goto.msk.ru/hackathon\"\u003eПодробности и регистрация для участников\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eОзнакомиться с заданием можно \u003ca href\u003d\"https://stepik.org/lesson/GoToHack-2-30283/\"\u003eздесь\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["хакатон","машинное обучение","анализ данных","олимпиада","kaggle"]}}