{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1423653123,"rating":-27,"authorHandle":"zamazan4ik","modificationTimeSeconds":1423653123,"id":16326,"title":"\u003cp\u003eПроблемы с решением одной интересной задачи\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДоброго времени суток! Имеются проблемы с задачей.Предыдущую тему удалил из-за другой проблемы, возникшей с этой задачей. Вот ссылка (задача С, Турнир) \u003ca href\u003d\"http://informatics.mccme.ru/py-source/source/dir/16727\"\u003eYour text to link here...\u003c/a\u003e\u003c/p\u003e\u003cp\u003eВот само условие. Для тех, кто не хочет переходить по ссылке :\u003c/p\u003e\u003cp\u003eВ турнире по хоккею участвовало K команд, каждая сыграла с каждой по одному матчу. За победу команда получала 2 очка, за ничью – 1, за поражение – 0 очков.\u003c/p\u003e\u003cp\u003eИзвестно, сколько очков в итоге получила каждая команда, однако результаты конкретных матчей были утеряны. Требуется восстановить одну из возможных турнирных таблиц. Входные данные\u003c/p\u003e\u003cp\u003eВ первой строке входных данных содержится одно натурально число K, не превосходящее 100 – количество команд. Во второй строке задаются через пробел K целых неотрицательных чисел, не превосходящих 2(K–1), – количество очков, набранных командами, занявшими первое, второе, …, K-е места соответственно (то есть каждое следующее число не больше предыдущего). Выходные данные\u003c/p\u003e\u003cp\u003eВыведите турнирную таблицу в следующем формате. Таблица должна состоять из K строк с результатами игр команд, занявших первое, второе, …, последнее место (команды, набравшие одинаковое число очков, могут быть расположены в таблице в любом порядке). В каждой строке должно быть записано K чисел через пробел – количество очков, набранных в игре данной команды с первой, второй, … командами соответственно. Количество очков – это число 0, 1 или 2. В клетках на главной диагонали (соответствующих не существующей игре команды \u0026quot;самой с собой\u0026quot;) нужно записать нули.\u003c/p\u003e\u003cp\u003eГарантируется, что входные данные соответствуют реальному турниру, то есть хотя бы одна таблица, соответствующая входным данным, может быть построена. Если таких таблиц несколько, выведите любую из них.\u003c/p\u003e\u003cp\u003eЯ перепробовал множество алгоритмов : максимальный поток, много версий жадных алгоритмов, но максимум беру 70 % баллов.\u003c/p\u003e\u003cp\u003eПолного решения я просто не могу придумать. Может кто поможет с какой идеей?\u003c/p\u003e\u003cp\u003eИдей уже просто не осталось. Если кому-то понадобятся предыдущие исходники мои по этой задаче — то сразу же предоставлю их.\u003c/p\u003e\u003c/div\u003e","tags":["таблицы","жадный алгоритм","потоки"]}}