{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1410876696,"rating":76,"authorHandle":"zholnin","modificationTimeSeconds":1410876740,"id":13814,"title":"\u003cp\u003eСоциализация.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет,\u003c/p\u003e\u003cp\u003eТак как мне на данный момент довелось жить в курортном регионе (причём довольно необычном), хотел воспользоваться возможностью и предложить встретится и пообщаться с теми из вас, кто окажется проездом на нашем маленьком острове. Сообщение сознательно на русском языке, и приглашение направлено русскоговорящей части этого сообщества.\u003c/p\u003e\u003cp\u003eДля проживающих в США и Канаде, Каймановы острова в принципе являются неплохим выбором для проведения отпуска, хотя могут быть немного скучноваты для тех, кому нужен очень активный отдых. Большинство туристов здесь именно из США и Канады и русская речь слышна в основном от приехавших из Нью-Йорка.\u003c/p\u003e\u003cp\u003eОтдыхающие из России сюда приезжают обычно на круизных кораблях, в один из дней круиза по карибским отсровам. Плывут, конечно, не прямо из России, а приплывают из Майами :), просто место здесь дорогое и ехать только сюда из России — не самый выгодные способ потратить отпускные деньги. А круиз — это много стран сразу + январские праздники в России не совпадают с рождественскими в США и можно рассчитывать на некоторые скидки.\u003c/p\u003e\u003cp\u003eПредложение простое — если спишемся через личку и по времени всё получится — покажу остров, поболтаем (в том числе о спортивном программировании :)) и просто познакомимся — мир маленький, может ещё где-то когда-то пересечёмся.\u003c/p\u003e\u003cp\u003eЕсли кому-то будет интересно приехать сюда на недельку, то есть возможность предоставить дешёвое (по кайманским меркам) жильё на неделю (есть у меня тут один местный timeshare). Но не рекламирую, только если кто-то заинтересуется.\u003c/p\u003e\u003cp\u003eВ общем, как говориться — будете в наших краях — пишите.\u003c/p\u003e\u003cp\u003eP.S. Включено — знакомство с лучшим спортивным программистом Каймановых Островов. Для тех кто хочет пошутить, что будучи единственным спортивным программистом на Кайманах, я значит и худший программист тоже — неправда, есть ещё один пользователь из наших краёв на Topcoder.\u003c/p\u003e\u003c/div\u003e","tags":["отпуск","каймановы острова"]}}