{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1491313065,"rating":41,"authorHandle":"LoppA","modificationTimeSeconds":1491315129,"id":51421,"title":"\u003cp\u003e2-CNF Problem — Doubts\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi I\u0027m having trouble with the 2-CNF (Conjuctive Normal Form) problem, not just 2-SAT but the more general case of Conjuctive Normal Forms, ie: a \u003d\u0026gt; b (a implies b), c \u003d\u0026gt; ¬d (c implies not d). I\u0027ve got some doubts, if you can help me with any of them it would help me a lot.\u003c/p\u003e\u003cp\u003e1 — What is the answer for the case (a \u003d\u0026gt; b) and (b \u003d\u0026gt; ¬a) and (¬a \u003d\u0026gt; c) and (c \u003d\u0026gt; d) and (d \u003d\u0026gt; ¬c)? I think its not satisfiable but if you solve like 2-SAT by just checking for all x if x and ¬x are in the same SCC then getting the variable with higher toposort between (x and ¬x) as the answer you may come to a diferrent result.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/0f/f5/0ff56fdf4f2277d0127f47a77761f910ac366d85.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e2 — There is an algorithm to find if some 2-CNF is solvable? And if its solvable how can we get some solution?\u003c/p\u003e\u003cp\u003e3 — If x or ¬x has not in edge nor out edge in the graph of implications, its correct to just set it as the answer? If you just get the toposort values like in 2-SAT algorithms, x or ¬x can be set as answer depending of how you do the toposort, but in some cases I think it doenst work.\u003c/p\u003e\u003cp\u003eEx: (a \u003d\u0026gt; b) and (b \u003d\u0026gt; ¬a) and (¬a \u003d\u0026gt; c). If we dont treat it the toposort of ¬c can be grater than toposort of c and ¬c may be setted as the answer, but it is mandatory that ¬a is in the answer so c is in the answer.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/9d/15/9d15b42a7703edca3eb30149caaac7bb13b800dc.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e4 — There is a way to calculate the total number of ways of chose the values of variables to get a satisfiable solution?\u003c/p\u003e\u003c/div\u003e","tags":["graph","2-cnf"]}}