{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1501649127,"rating":225,"authorHandle":"dotorya","modificationTimeSeconds":1501649599,"id":53626,"title":"\u003cp\u003ePersonal view to output-only problem in IOI \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cul\u003e   \u003cli\u003eDisclaimer : This article was originally written by \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/zigui\" title\u003d\"Гроссмейстер zigui\"\u003ezigui\u003c/a\u003e. I\u0027m just translating original Korean article in English, but still, I totally agree with this article.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIn 2017 IOI Day 1, there was one output-only task, \u0026quot;nowruz\u0026quot;. When I first saw this problem in GA meeting, I couldn\u0027t see the input file (which I think is very important in output-only problem). I expected there will be various type of inputs, such as totally empty, almost empty, almost full, and so on. I could look at I/O dataset when the problem was revealed, and it was out of my expectation. Almost all of input cases are almost empty. It means that there was an important condition about input data, which was not mentioned in the problem description.\u003c/p\u003e\u003cp\u003eScore distributions of contestants in \u0026quot;nowruz\u0026quot; problem were very strange. It had no correlation with contestants\u0027 skill, previous records, other problems\u0027 score, or anything else. Students who got low score in this task said: \u0026quot;I thought about heuristic solution (which turned out to give 80+ partial score), but I thought that solution will give me low score.\u0026quot; Actually, tudent with good mathematical intuition will never think that this \u0026quot;heuristic\u0026quot; solution whill give good score in general situation. So they didn\u0027t try, and got a low score. Definitely, it will not be an easy task building an algorithm performs well in general cases.\u003c/p\u003e\u003cp\u003eI think that output-only tasks are not appropriate problems for IOI. There are some reasons about it. First, output-only problems have little logical steps to solve tasks, and it\u0027s contradictive to IOI\u0027s goal, evaluating students\u0027 logical thinking ability. For example, I\u0027ll show you two easy problems:\u003c/p\u003e \u003col\u003e   \u003cli\u003eWhat is \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/zigui\" title\u003d\"Гроссмейстер zigui\"\u003ezigui\u003c/a\u003e \u0027s Codeforces rating? 1) 1234 2) 2345 3) 2456 4) 2488\u003c/li\u003e   \u003cli\u003e1 + 2 \u003d ? 1) 1 2) 2 3) 3 4) 4\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eIn first problem, there is no clue to solve this problem. If you don\u0027t know about \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/zigui\" title\u003d\"Гроссмейстер zigui\"\u003ezigui\u003c/a\u003e (maybe true, right?), it\u0027s all about 25% probability. In second problem, everybody knows that answer is 3).\u003c/p\u003e\u003cp\u003eThese two problems all have one description and four possible answers, but they are very different in difficulty. The reason is simple. Second problem has logical steps to solve, but first one doesn\u0027t. Everyone knows that 1 + 2 \u003d 3. It\u0027s well-known, can be proved, and based on mathematical knowledge that everybody knows. In first problem, no one will memorize about \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/zigui\" title\u003d\"Гроссмейстер zigui\"\u003ezigui\u003c/a\u003e \u0027s rating, and it\u0027s impossible to get the answer through logical steps.\u003c/p\u003e\u003cp\u003eAlthough it\u0027s a bit exaggerated, I believe that output-only problems are not quite different from this case. You have to \u0026quot;find out\u0026quot; some important conditions. They are not in description, just in input files. There would be more conditions or not, but if you can find it, you will get high score. In solving problem, no mathematical proofs are required. To be even worse, it\u0027s better to not prove it, if you want to perform well in contest!\u003c/p\u003e\u003cp\u003eIn case of \u0026quot;nowruz\u0026quot;, there were no special description about limitation about K. It just said \u0026quot;at least one possible solution exists.\u0026quot; There are no additional talk about conditions. For example, all input datas were composed of only one connected component, which was not the case in sample input. If you are writing papers about heuristic algorithms, you have to be very careful in time-complexity proof. You have to \u0026quot;prove\u0026quot; that this heuristic algorithms give almost correct result in almost every cases. But in \u0026quot;nowruz\u0026quot;, it needed no mathematical analysis, because there were actually no conditions. Analyze what?\u003c/p\u003e\u003cp\u003eSecond problem of output-only tasks is that the only way to solve task is trial-and-error. In science, logical steps are very important issue. It\u0027s not a science to just show how to do it, and prove by results. In output-only problems you can\u0027t find out the results before you actually code it, and it\u0027s very hard to mathematically prove it. This means contestants should \u0026quot;gamble\u0026quot; with their solutions, whether it will get a high score or not.\u003c/p\u003e\u003cp\u003e2013 IOI\u0027s \u0026quot;artclass\u0026quot; problem will be a good example. If you don\u0027t try, you can\u0027t predict results. (Translator notes: Art class is task like this, \u0026quot;Get an painting as input file, and find out what\u0027s the style of this painting, between modern art, landscapes, expressionist action paintings, and colour field paintings.\u0026quot; This problem had a lot of issues back then, and current IOI syllabus explicitly exclude this kind of problems. you can see problem in this link : \u003ca href\u003d\"http://www.ioi2013.org/wp-content/uploads/tasks/day1/artclass/artclass.pdf\"\u003ehttp://www.ioi2013.org/wp-content/uploads/tasks/day1/artclass/artclass.pdf\u003c/a\u003e) There was an 100 point solution which only uses G values (among RGB values). If you say to artists \u0026quot;This painting has less green color, so it seems like modern art!\u0026quot;, they will think you an idiot. But if you are in output-only problems, it\u0027s perfectly fine idea. If you try it, you can get a score, even though it\u0027s correct solution or not.\u003c/p\u003e\u003cp\u003eI think \u0026quot;nowruz\u0026quot; is also the same case. It seems that they wanted many high scores (possibly 100+ contestants), but in contestants\u0027 view, it\u0027s impossible to try every possible ideas in their head and get a high score in 5 hours. If then, it\u0027s only about who tried, and who didn\u0027t.\u003c/p\u003e\u003cp\u003eBecause of these reasons, I think that output-only tasks like \u0026quot;nowruz\u0026quot; don\u0027t fit in IOI at all. If they want to give these kind of tasks, include heuristic algorithms in IOI syllabus, write every information about input tasks in description, and give some good input restrictions, which can make problem \u0026quot;solvable\u0026quot;. Solution itself also should be clear, can be solved by clear logical steps. If they can\u0027t do these, it\u0027s better giving this problem to some other competitions. At least, it\u0027s not a science at all.\u003c/p\u003e\u003c/div\u003e","tags":[]}}