{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1500296259,"rating":181,"authorHandle":"E869120","modificationTimeSeconds":1500381556,"id":53341,"title":"\u003cp\u003e[Tutorial] A Way to Practice Competitive Programming : From rating 1000 to 2000\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eDear Codeforces Community.\u003cbr /\u003e \u003cbr /\u003e Today I want to share some ways to practice competitive programming and getting rating. I think this is helpful for those who is practicing competitive programming hardly but rating is sluggish. (By the way, on July 17th, I have a project of competitive programming said CombNaf in Japan. I did a lecture about this. Great thanks to the CombNaf\u0027s organizer is \u003ca class\u003d\"rated-user user-gray\" href\u003d\"/profile/Nafmo2\" title\u003d\"Newbie Nafmo2\"\u003eNafmo2\u003c/a\u003e.)\u003cbr /\u003e \u003cbr /\u003e I will write this by \u003cstrong\u003e4 steps\u003c/strong\u003e: rating \u003cstrong\u003e\u003cfont color\u003d\"grey\"\u003e1000\u003c/font\u003e --\u0026gt; \u003cfont color\u003d\"green\"\u003e1250\u003c/font\u003e\u003c/strong\u003e, \u003cstrong\u003e\u003cfont color\u003d\"green\"\u003e1250\u003c/font\u003e --\u0026gt; \u003cfont color\u003d\"aqua\"\u003e1500\u003c/font\u003e\u003c/strong\u003e, \u003cstrong\u003e\u003cfont color\u003d\"aqua\"\u003e1500\u003c/font\u003e --\u0026gt; \u003cfont color\u003d\"blue\"\u003e1750\u003c/font\u003e\u003c/strong\u003e, \u003cstrong\u003e\u003cfont color\u003d\"blue\"\u003e1750\u003c/font\u003e --\u0026gt; \u003cfont color\u003d\"purple\"\u003e2000\u003c/font\u003e\u003c/strong\u003e, in Codeforces Rating System.\u003cbr /\u003e \u003cbr /\u003e Before writing about each step, I wrote it as premise: You don\u0027t have to do this way. This is just a way to practice. Ways to practice is different among people, so I think this may not the best, but I hope this is useful.\u003cbr /\u003e \u003cbr /\u003e \u003cbr /\u003e\u003c/p\u003e\u003ch3\u003eStep 0: Some types of contest (A knowledge)\u003c/h3\u003e\u003cp\u003eIn order to explain step 1-5, I wrote about the types of programming contest.\u003cbr /\u003e \u003cbr /\u003e \u003cstrong\u003eCodeforces\u003c/strong\u003e\u003cbr /\u003e \u003c/p\u003e\u003cul\u003e \u003cli\u003eThis judge. There are Div.1 problems and Div.2 problems. The number of contest is mainly 5-6.\u003c/li\u003e \u003cli\u003eThe problems of Div.2 said Div2 A, Div2 B, Div2 C, Div2 D, Div2 E,... in order.\u003c/li\u003e \u003cli\u003eThe problems of Div.1 said Div1 A, Div1 B, Div1 C, Div1 D, Div1 E,... in order.\u003c/li\u003e \u003cli\u003eProblems are sorted by difficulty in each contest.\u003c/li\u003e \u003c/ul\u003e \u003cbr /\u003e \u003cstrong\u003eAtCoder\u003c/strong\u003e\u003cbr /\u003e \u003cul\u003e \u003cli\u003eThere are ABC (AtCoder Beginner Contest) / ARC (AtCoder Regular Contest) / AGC (AtCoder Grand Contest) in AtCoder, but in this blog I will explain about ABC / ARC.\u003c/li\u003e \u003cli\u003eThere are 4 problems in ABC and ARC.\u003c/li\u003e \u003cli\u003eEach problem in ABC is said ABC-A, ABC-B, ABC-C, ABC-D, and each problem in ARC said ARC-C, ARC-D, ARC-E, ARC-F.\u003c/li\u003e \u003cli\u003eProblems are sorted by difficulty.\u003c/li\u003e \u003cli\u003eIn each contest, ABC-C and ARC-C is the same problem, and ABC-D and ARC-D is the same problem.\u003c/li\u003e \u003c/ul\u003e \u003cbr /\u003e \u003cstrong\u003eTopCoder\u003c/strong\u003e\u003cbr /\u003e \u003cul\u003e \u003cli\u003eThere are Div.1 and Div.2, and there are contest for each division.\u003c/li\u003e \u003cli\u003eIn Division 2, there are three problems, which is said that Div2 Easy, Div2 Medium, Div2 Hard.\u003c/li\u003e \u003cli\u003eIn Division 1, there are three problems too, which is said that Div1 Easy, Div1 Medium, Div1 Hard.\u003c/li\u003e \u003cli\u003eEasy is the easiest question of three, and hard is the hardest question in these three as naming.\u003c/li\u003e \u003c/ul\u003e \u003cbr /\u003e \u003cbr /\u003e\u003ch3\u003eStep 1: Rating 1000 --\u0026gt; 1250\u003c/h3\u003e\u003cp\u003eIn order to gain rating from 1000 to 1250, you should solve at \u003cstrong\u003eleast one problem\u003c/strong\u003e in Div.2 contest in Codeforces. In AtCoder, \u003cstrong\u003e300 points\u003c/strong\u003e problem is the level of rating 1100-1250. So I suggest these two ways:\u003cbr /\u003e \u003cbr /\u003e \u003c/p\u003e\u003cul\u003e \u003cli\u003eSolve Div2 A 50 problems. When you solved 50 problems, you might be able to solve \u0026gt;80% of Div2 A.\u003c/li\u003e \u003cli\u003eSolve ABC-C in AtCoder. There are many educational problems in AtCoder Beginner Contest.\u003c/li\u003e \u003c/ul\u003e \u003cbr /\u003e In order to solve problems, you should make a Bingo like \u003ca href\u003d\"https://goo.gl/12CMqS\"\u003eexample\u003c/a\u003e.\u003cbr /\u003e In addition, most of these problem is easy, especially concept. So you should see editorials if you can\u0027t reach idea 10 minutes.\u003cbr /\u003e \u003cbr /\u003e\u003ch3\u003eStep 2: Rating 1250 --\u0026gt; 1500\u003c/h3\u003e\u003cp\u003eIn order to gain rating from 1250 to 1500, you have to solve at \u003cstrong\u003eleast 2 problems faster\u003c/strong\u003e in Div.2 contest. In addition, the level is as same as \u003cstrong\u003eTopCoder Div2 Med\u003c/strong\u003e and \u003cstrong\u003eAtCoder ABC-D\u003c/strong\u003e. (ABC-D is little high level for 1250) In addition, there is many educational problems in AtCoder, there is some point to do fast-solving practice in TopCoder, and Codeforces is the target judge. So I suggest these three ways:\u003cbr /\u003e \u003cbr /\u003e \u003c/p\u003e\u003cul\u003e \u003cli\u003eSolve Div2 B 50 Problems. (Most of problems are good quality)\u003c/li\u003e \u003cli\u003eSolve Div2 Med 50 Problems. (The quality of problem is good, but Java Applet is inconvenience...)\u003c/li\u003e \u003cli\u003eSolve ABC-D / ARC-D in AtCoder. (A little high level for 1250)\u003c/li\u003e \u003c/ul\u003e \u003cbr /\u003e In addition, I think that you should mind fast-solving in latter problems. (After solved 15-30 problems)\u003cbr /\u003e In order to mind fast-solving, you should use timer. You should count from \u0026quot;opening problem statement\u0026quot; to \u0026quot;getting AC\u0026quot;. If you can, I think that you should make a spreadsheet of problem, solved and time.\u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/12/72/12721098b7eaf88ee937f4cca4fb017b3a56ead0.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003cbr /\u003e\u003ch3\u003eStep 3: Rating 1500 --\u0026gt; 1750\u003c/h3\u003e\u003cp\u003eIn order to gain rating from 1500 to 1750, you have to solve at least 3 problems faster in Div.2 contest. There are a lot of concept problems in Div1 A \u003d Div2 C, and in Div2 only contest you have to solve as fast as possible. I made a table of judge and points to see what to solve easier.\u003cbr /\u003e  \u003ctable\u003e  \u003ctbody\u003e\u003ctr\u003e  \u003cth\u003eJudge\u003c/th\u003e  \u003cth\u003eConcept\u003c/th\u003e  \u003cth\u003eImprementation\u003c/th\u003e  \u003cth\u003eFast solving\u003c/th\u003e  \u003cth\u003eLevel\u003c/th\u003e  \u003c/tr\u003e  \u003ctr\u003e  \u003cth\u003eCodeforces Div2 C\u003c/th\u003e  \u003ctd\u003e50%\u003c/td\u003e  \u003ctd\u003eo\u003c/td\u003e  \u003ctd\u003e50%\u003c/td\u003e  \u003ctd\u003e1500-1800\u003c/td\u003e  \u003c/tr\u003e  \u003ctr\u003e  \u003cth\u003eTopCoder Div1 Easy\u003c/th\u003e  \u003ctd\u003eo\u003c/td\u003e  \u003ctd\u003ex\u003c/td\u003e  \u003ctd\u003eo\u003c/td\u003e  \u003ctd\u003e1500-2000\u003c/td\u003e  \u003c/tr\u003e  \u003ctr\u003e  \u003cth\u003eAtCoder ABC/ARC-D\u003c/th\u003e  \u003ctd\u003e50%\u003c/td\u003e  \u003ctd\u003eo\u003c/td\u003e  \u003ctd\u003e50%\u003c/td\u003e  \u003ctd\u003e1400-1600\u003c/td\u003e  \u003c/tr\u003e \u003c/tbody\u003e\u003c/table\u003e \u003cbr /\u003e I suggest these two ways to improve rating as far as see the table:\u003cbr /\u003e \u003c/p\u003e\u003cul\u003e \u003cli\u003eSolve Div1 Easy and Codeforces Div2C as the same period. I think if you solve \u0026lt;50 problems for each type, your rating will increase strongly, but I suggest you should solve until satisfied yourself.\u003c/li\u003e \u003cli\u003eFirst solve ABC/ARC-D in AtCoder until solve 80% of ARC-D. Second solve Div1 Easy in TopCoder for concept-practice or fast-solving practice.\u003c/li\u003e \u003c/ul\u003e \u003cbr /\u003e My rating increased sharply when I started TopCoder Div1Easy, and solved ~50 Div1Easy problems. This is why I suggest TopCoder Div1 Easy for concept-practice.\u003cbr /\u003e In addition, you should use timer for practicing fast-solving. You can use \u003ca href\u003d\"https://competitiveprogramming.info/\"\u003ecompetitiveprogramming.info\u003c/a\u003e to solve TopCoder Div1Easy, and you can make spreadsheet like following picture to solve TopCoder. (This is example of Div1Med that I am using.)\u003cbr /\u003e \u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/73/58/73582e6a0b8426b60514acb7afdef52ded2ad345.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003cbr /\u003e\u003ch3\u003eStep 4: Rating 1750 --\u0026gt; 2000\u003c/h3\u003e\u003cp\u003eThis is the last step that I can write. In order to gain rating 1750 to 2000, first you must go up to Div1, and you have to compete a little better in Div1. You have two steps, so I divided into two range.\u003cbr /\u003e \u003cbr /\u003e \u003cstrong\u003e1. Rating 1750 --\u0026gt; 1900\u003c/strong\u003e\u003cbr /\u003e You should solve Div2C faster and stably. So I suggest that practice these two:\u003cbr /\u003e \u003c/p\u003e\u003cul\u003e \u003cli\u003eOvercome your weakness (For example, DP problems, Graph Theory, Imprementation, etc.)\u003c/li\u003e \u003cli\u003eMake your library (For example, RMQ, BIT, Segment-Tree, etc.)\u003c/li\u003e \u003c/ul\u003e I think making library is good because you can shorten the time that writing RMQ class, BIT class, etc.\u003cbr /\u003e And to overcoming your weakness, I suggest that analyze your time in contest and practice, scoring and make a spreadsheet as follows:\u003cbr /\u003e \u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/98/31/983109596ef5288f9ad71b4b9d50c2f161dfa1e9.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003cbr /\u003e \u003cstrong\u003e2. Rating 1900 --\u0026gt; 2000\u003c/strong\u003e\u003cbr /\u003e This step\u0027s range is only 100, but I think this is difficult as far as see \u003ca href\u003d\"//codeforces.com/blog/entry/52470\"\u003eA mystery of CF rating distribution\u003c/a\u003e. There are many people in [1900, 2000), but there aren\u0027t many people in 2000+. In Div1, there are many concept-main problems. So I think these two are useful for practice:\u003cbr /\u003e \u003cbr /\u003e \u003cul\u003e \u003cli\u003eCodeforces Div1 B. In the story, the goal is becoming 2000+ in Codeforces. So practicing in Codeforces is the best too to get rating in CF.\u003c/li\u003e \u003cli\u003eAtCoder ARC-E. ARC-E is 600-900pts in AtCoder, and this is level of rating 1900-2200. In addition, these problem is very like to Codeforces.\u003c/li\u003e \u003c/ul\u003e \u003cbr /\u003e These problems are so difficult, so I suggest that you should give up and see the editorials if you can\u0027t get any idea though you try over 80-150 minutes. In addition, ARC-E is difficult for 1900, so I think you don\u0027t have to mind fast-solving.\u003cbr /\u003e \u003cbr /\u003e \u003cbr /\u003e\u003ch3\u003eStep 5: Extra corner\u003c/h3\u003e\u003cp\u003eIn extra corner, I suggest two ways to compete well in Codeforces. This is also out of the problem-practice, but I think this is effective. (I did this and I feel this is effective.)\u003cbr /\u003e \u003c/p\u003e\u003cul\u003e \u003cli\u003eDo Virtual Contest / Virtual Participation in Codeforces. This is a way of get use to contests.\u003c/li\u003e \u003cli\u003eTake a rest for 10 minutes before real contests. This is a way to not get panic in the contest. It is also important in the contest on the mental side.\u003c/li\u003e \u003c/ul\u003e \u003cbr /\u003e \u003cbr /\u003e\u003ch3\u003eConclusion\u003c/h3\u003e\u003cp\u003eI suggest that five steps to practicing competitive programming. Ways to practice is different from a person to a person, so I don\u0027t think you must do this way. But this is one of the effective way I guess. (I think this is not the best because the way to fit is different among people.) I hope it will be useful even a little. (Also, sorry for my poor English.)\u003cbr /\u003e \u003cbr /\u003e Please comment if you have suggestions and questions of this entry, and my way to practice.\u003cbr /\u003e \u003cbr /\u003e\u003c/p\u003e\u003ch3\u003eThank you for reading!\u003c/h3\u003e\u003c/div\u003e","tags":["way","practice","codeforces","tutotial","2000","rating","thankyou!"]}}