{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1469902763,"rating":0,"authorHandle":"1am","modificationTimeSeconds":1469902763,"id":46346,"title":"\u003cp\u003eDay 2 (7/30)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eToday we solved problems from last weeks homework and learn about vectors and arrays and some useful functions. Once again, any new power-points will be put here: \u003ca href\u003d\"https://drive.google.com/folderview?id\u003d0B54r2jukjz9wZ2JOcDJiWWdfZnc\u0026amp;usp\u003dsharing\"\u003ehttps://drive.google.com/folderview?id\u003d0B54r2jukjz9wZ2JOcDJiWWdfZnc\u0026amp;usp\u003dsharing\u003c/a\u003e\u003c/p\u003e\u003cp\u003eNot much to say this week, other than solve all the problems from day 1 contest and get as much done from day 2 as possible. Even though i didn\u0027t have time to go through the problems from day 2, all the topics that were needed to solve them were either explained this week or last week. (Hint question A, you will need to know how to convert an int into a binary string — complexity power point slide O(log(n)) ).\u003c/p\u003e \u003cul\u003e   \u003cli\u003eHere is the code for kefa and first steps — question B from day 1: \u003ca href\u003d\"http://ideone.com/PAlpCo\"\u003ehttp://ideone.com/PAlpCo\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eHere is the code for cards — question C from day 1: \u003ca href\u003d\"http://ideone.com/SvyypT\"\u003ehttp://ideone.com/SvyypT\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eHere is the code for infinite sequence — question F from day 1: \u003ca href\u003d\"http://ideone.com/refXXk\"\u003ehttp://ideone.com/refXXk\u003c/a\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eFor anyone who didn\u0027t hear, there will be no class next week due to Amman Competition. I\u0027ll upload problems though by the end of the week for fun because problem solving is fun.\u003c/p\u003e\u003cp\u003eI\u0027m surprised no one is emailing me, if you have any questions, ill gladly take a look at your code for you. I know the beginning is tough when learning new topics and you may understand have to solve it but not how to implement it, but it will get easier with time inshallah. So please let me be of assistance and email me at \u003ca href\u003d\"mailto:reem_obaid_10@hotmail.com\"\u003ereem_obaid_10@hotmail.com\u003c/a\u003e and i will be sure to get back to you as soon as i see it :)\u003c/p\u003e\u003cp\u003eBitawfeeq and good luck :)\u003c/p\u003e\u003c/div\u003e","tags":[]}}