{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1437049851,"rating":761,"authorHandle":"Rubanenko","modificationTimeSeconds":1437049959,"id":19270,"title":"\u003cp\u003eYandex Internship Interview Experience\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThere was a discussion, where I \u003ca href\u003d\"//codeforces.com/blog/entry/18463#comment-234368\"\u003epromissed\u003c/a\u003e to write this blog. My intention was supported by the community by a number of upvotes. I really loved to see that some people want to hear from me, despite of the pretty personal subject and absence of any previous well-written blogs. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDisclaimer\u003c/strong\u003e \u003cbr /\u003eI would like to say that I strongly appreciate what people at Yandex do, their help for CP and I personally know some super smart and nice people that work/worked there. \u003cbr /\u003e They are free to hold the interviews as they like it and hire whoever they want. I am ok to think that I am far from perfect candidate. Here I\u0027m just sharing my vision and experience. I am aware that after posting this I will never work at Yandex(YOLO). I also think that it\u0027s ok to use a couple of hot words towards impolite and somehow unprofessional people.\u003c/p\u003e\u003cp\u003eIf you don\u0027t feel like reading a lot, you can go straight to the \u003cstrong\u003einterview\u003c/strong\u003e part.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eIntroduction\u003c/strong\u003e\u003cbr /\u003e The things that made me apply to Yandex probably deserve a separate post and they are even more personal that this one, but I will try to cut long story short. I was 19-years first-year ITMO student. It was April and at that time I was pretty sure that I won\u0027t be \u0026quot;second-year ITMO student\u0026quot;. The people at ITMO are quite loyal — they give you plenty of opportunities for exam retake, if you have been to WF, PTZ Camp, or playing video games. The point is that I somehow lost the flow of study. I haven\u0027t ever really had one, so I used to concentrate only on the things I enjoy, and you know it was a bad place for such an attitude. It was very hard to make myself to write some Physics shity sheets or count 50 integrals to gain 1% of my Calculus year mark. It would be pretty useful even just in terms of self-discipline, but I failed. In spring I couldn\u0027t even concentrate on problem solving. If I turn back the time, I would do the things in different way from the very beginning, but...)\u003cbr /\u003e I have never told anybody of my family or non-university friends about the troubles I have. So you understand how bad I didn\u0027t want to come home and say \u0026quot;Here I am, I\u0027ve just dropped out!\u0026quot;. It was always on my mind and, you know, it feels terrible. However, being on the bottom eventually helped me to catch the flow of doing something again. \u003cbr /\u003e As you can see, I didn\u0027t want to come home and I liked Saint-Petersburg as well. I thought finding a job there would be cool, because then I could concentrate on something new and challenging. As you might guess — I applied for Yandex internships! Of course I had a very small experience in anything despite of the problem solving, but I thought I can learn fast with everyday practice at the internship, and I can write some code in the end of the day. I wouldn\u0027t expect much more than a motivation at first when I offer 300$/month(it turned out that they do). So I thought they will take me as soon as they see I am not a complete dumb and then, after a couple of months, make a decision according to my learning speed and dedication. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePre-Interview\u003c/strong\u003e\u003cbr /\u003e After I filled in a short form and attached my CV they send me a letter. The a HR had nickname in her mail account. It was something like \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003efirstName\u003c/i\u003e\u003c/span\u003e \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003enickname\u003c/i\u003e\u003c/span\u003e \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003elastName\u003c/i\u003e\u003c/span\u003e. You don\u0027t expect something like nicknames when you have official mailing with adults. I wouldn\u0027t even mention it, but the funny thing is that \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003enickname\u003c/i\u003e\u003c/span\u003e \u003d\u003d \u0026quot;Sosa\u0026quot;. For those of you who don\u0027t know Russian it sounds like some \u0026quot;Emma \u0026quot;sucky/sucko\u0026quot; Brown\u0026quot; has just mailed you about your internship to Google. It was really weird, man, but at that time I tried to keep myself damn serious. I just want to say that I would not pick such(or any) nickname in case I had to do any business talks from this account \u003cbr /\u003e She sent me a link to yandex.contest testing tasks. I was really glad to see this, since it meant a pretty standard way of work for me. I think I won\u0027t break the NDA if I say a couple of words in general about the tasks. Oh wait, there was no NDA. One of the tasks is pretty standard CP task, another one was just about big implementation routine with a little space to make a design decision that made the solution about three times shorter. The last task was quite natural in it\u0027s statement, so I googled it. I found a tool that can handle it, submitted — WA. Tried another tool — WA again. Ok, let it be. There were about 15 hotshots among of around few hundreds guys, who solved all the three problems, so I was confident that 2/3 is enough to get to the onsite interview. They said I should implement my solutions in C++ or Java. I decided to use Java for the first problem and C++ for another one just to show that I can. I had like two weeks to complete the tasks and the point is that they asked me to use Java for the implementation routine that I have already solved in C++ when it was a day or two to the deadline. Wait, what?! Why the fuck you asked to use C++ or Java, and now ask for Java only?! I had the third task undone, so I invested my time in solving it, rather than rewriting the problem I already have accepted. \u003cbr /\u003e Eventually, they invited me to the interview. Yay!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eInterview\u003c/strong\u003e\u003cbr /\u003e Before a couple of days before the interview the girl with the funny nickname brought two news for me. The first one said that she is not able to attend the interview and she will be replaced with another girl without any nickname. I didn\u0027t really care. However, later I will regret the substitute, because it seems that anybody would be better than the girl without a nickname. The second notification was far worse — it said that they don\u0027t have a vacant place for me, so even if I turn out to be Linus fucking Torvalds they won\u0027t hire me. Do I have to say how it affected my motivation? Anyway, I accepted the invite to the interview in order to get some experience and all. \u003cbr /\u003e One of my good friends \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/vadimmm\" title\u003d\"Candidate Master vadimmm\"\u003evadimmm\u003c/a\u003e helped me to get to the office and supported me during the entire period. He spent more than an hour waiting for me, so I had somebody to go to the pub with, right after all the crap I am going to tell you about has happened. The girl was not alone — some guy(I think he was a developer) was with her. We sat down and started a conversation. \u003cbr /\u003e I thought that everything will start from walking over my CV and asking about my experience. Then it would be nice to discuss the tasks I was given two weeks before and my solutions. But scenario was quite different:\u003c/p\u003e\u003cp\u003eGuy: what do you do?\u003cbr /\u003e Me: I like programming competitions, have spent a while doing it. Now I want to get some production experience and try all this stuff.\u003cbr /\u003e Guy: what do you know about CS?\u003cbr /\u003e Me: well, all these competitions are a good place for practice a lot of classic algorithms and data structures. Of course, there are always a lot of to learn, but I believe that I am quite skilled in this field comparing to an average developer. \u003cbr /\u003e Guy: (he was smiling and wondering like he is about to hack me and put me down to my real place) what books have you read, son? \u003cbr /\u003e Me: \u0026quot;Book1\u0026quot;, CLRS, \u0026quot;Book2\u0026quot;, \u0026quot;Book3\u0026quot;, some of Knuth\u0027s AoP. \u003cbr /\u003e Guy: (the bastard was smiling and about to laugh a bit. he was also looking at the girl and talking to her despite of the fact that I was answering or something) Knuth? Oh, really?! \u003cbr /\u003e Me: Yeah, when I was like in 9-10 grade, I wanted to learn DS and took CLRS along with AoP home from my teacher. The data structures turned out to be explained better in CLRS as for kid, but the first part of AoP was pretty useful in number theory, summations and some cool estimations/bounds. Of course I didn\u0027t bother to solve a lot of exercises, but anyway.\u003cbr /\u003e Guy: ok-ok, got it. (he said it in such a phony way, like my words were a complete it was kind of rocket science — to take the book and work over material that does not require much math)\u003cbr /\u003e Me: (man, I was damn angry with this CS-boss. however, I was quite calm, since I was quite confident that I will be able to solve almost every problem I will be given from him. instead of asking questions to verify my words he simply stopped talking and was looking like he doesn\u0027t believe me)\u003cbr /\u003e Girl: (yeah, the girl remembered that she should be paid for something) Why do you come here being a freshman? \u003cbr /\u003e Me: I have already said that I want some new experience. Summer is coming, so it will be like a lot of spare time and all. \u003cbr /\u003e Girl: (WA2, she\u0027s about to make another attempt) Do you go to the CS-Centre? (it\u0027s some lectures Yandex is helping to provide in SPb. dunno about their quality. I guess it\u0027s ok.) \u003cbr /\u003e Me: No, I don\u0027t. Should I? \u003cbr /\u003e Girl: Of course!(like it\u0027s the only way). There a lot of cool stuff, blah-blah...\u003cbr /\u003e Me: Thanks a lot, but in case I have a lot of time and effort I can concentrate on my University program, the teachers are quite nice, so I don\u0027t think it\u0027s necessary for our students to go to your centre. \u003cbr /\u003e Girl: you are wrong, blah-blah.\u003cbr /\u003e Me: Ok\u003cbr /\u003e // Still no a single word neither about my previous experience according to the CV nor about the tasks I was given before. \u003cbr /\u003e //You think it\u0027s time for some cool problems, or at least classic questions about data structures to verify my words above? No, it\u0027s time for Java and C++ exam!!!\u003cbr /\u003e The first part was about some classic OOP questions. Frankly, I wasn\u0027t kinda hotshot in it, or something. I failed on one easy question which was like \u003cbr /\u003e Guy: should we solve it in a way A, or in a way B? \u003cbr /\u003e Me: I don\u0027t really like any of these, but let it be B. \u003cbr /\u003e Guy: Lol, it should be C, actually. \u003cbr /\u003e There also was something like:\u003cbr /\u003e Me: (explaining the right solution)\u003cbr /\u003e Guy: how is this approach called?\u003cbr /\u003e Me: dunno, it\u0027s probably called \u0026quot;common sense\u0026quot;\u003cbr /\u003e Guy: bad-bad... (like knowing the word is better than coming up with the approach) \u003cbr /\u003e Whenever he had to tell me that I am wrong, he turned his head to the girl and was like not saying it to me directly, but discussing the mistake with her. What a man...\u003cbr /\u003e After OOP, C++ and Java exam was over, Yandex-King said \u0026quot;ok, let\u0027s go to data structures and algos\u0026quot;. Man, was I happy.\u003cbr /\u003e Guy: what do you know about deque? // not the hottest question, but at least something \u003cbr /\u003e Me: Deque is an interface, which provides blah-blah...//ofc, I do know what is deque and the good thing is that we had just finished all this stuff at Discrete Math, so I was quite confident.\u003cbr /\u003e Guy: How one can implement it? What will be the complexity? \u003cbr /\u003e Me: let\u0027s implement it with vector, blah-blah, amortised complexity proof and all the stuff\u003cbr /\u003e Guy: amortised constant time is bad for Yandex. Yandex wants the true O(1)\u003cbr /\u003e Me: Ok, let\u0027s do the stuff with linked list, but in this case we won\u0027t have O(1) random access\u003cbr /\u003e Guy: Yandex wants the true O(1) with random access. \u003cbr /\u003e Me: wuuut\u003cbr /\u003e Guy: yeah, have a think\u003cbr /\u003e Me: (I could not figure out how to provide \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eO\u003c/i\u003e(\u003ci\u003en\u003c/i\u003e)\u003c/span\u003e memory usage whenever there are \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e\u003c/span\u003e elements stored, with the true constant access/add/delete.) So I said \u0026quot;I think it\u0027s impossible\u0026quot;. I was 99% confident it was yet another cunning question from this top interviewer and the answer is \u0026quot;impossible\u0026quot;. \u003cbr /\u003e Guy: It is\u003cbr /\u003e Me: Ok, how?!\u003cbr /\u003e Guy: I won\u0027t tell you. You may google it as soon as you come home. \u003cbr /\u003e//I wasn\u0027t angry at this point. I thought that I really don\u0027t know something. \u003cbr /\u003e Girl: (yeah, she\u0027s here!) Ok, it\u0027s clear with your level of DS(her face meant that the level is low). Let\u0027s talk about algos. //Really?! You did bother me to name every standard class in Java I know(this question is the best to recognize the true talent), but asked only about one bloody DS, which is DEQUE!!\u003cbr /\u003e // The girl is still talking. Do you feel it? She\u0027s about to ask about algorithms. This one is going to be hot.\u003cbr /\u003e Girl: Do you know about F...F...fo...\u003cbr /\u003e Girl: For...For...Ford-, Ford-Fu, Fu...\u003cbr /\u003e ...\u003cbr /\u003e Me: Fulkerson? \u003cbr /\u003e Girl: Yeah, what do you know about it? \u003cbr /\u003e Me: Blah-blah...//I started to say general statements about their theorem and all the stuff \u003cbr /\u003e Girl: ok (with like 3/10 excitement rate)\u003cbr /\u003e Girl: how can it be used? \u003cbr /\u003e Me: for finding the minimal cut, for a number of assignment problems, for dealing with some kind of networks, roads, etc.\u003cbr /\u003e Girl: ok \u003cbr /\u003e //My questions about the company. \u003cbr /\u003e // Finish \u003cbr /\u003e Any questions from the phony Yandex man? — No. Any problems considering the algo? — No. Any other problems requiring just a little thinking, but not learning by heart? — No. Checking English somehow? — No, of course. \u003cbr /\u003e When they were bringing me to the exit, they both were talking about how cool is CS centre and that I definitely should apply. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEpilogue\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eDo you remember the problem about deque? After the interview I asked some of VERY cool guys in this area, and they all said that they don\u0027t know about such magic deque implementation. I was pretty sad, because even if it does exist, it\u0027s quite not reasonable to ask such stuff for a intern position. So I asked Sosa girl via mail to share material with me, because I couldn\u0027t find anything. She asked the Wise Man and he gave her a link: \u003cbr /\u003e \u003ca href\u003d\"http://en.cppreference.com/w/cpp/container/deque\"\u003ehttp://en.cppreference.com/w/cpp/container/deque\u003c/a\u003e \u003cbr /\u003e Tada! Please, don\u0027t hold your hand on your face for too long. I didn\u0027t really read it\u0027s content after seeing the complexity part. I just copied it and posted to the nickname girl. She never replied :) \u003c/p\u003e\u003cp\u003eAnyway, I am pretty thankful to this guys for being assholes. If they hire me, I probably wouldn\u0027t end up doing cool stuff at my current workplace :) \u003c/p\u003e\u003c/div\u003e","tags":["yandex","interview","fuckers"]}}