{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1524813733,"rating":11,"authorHandle":"katana_handler","modificationTimeSeconds":1524813869,"id":59135,"title":"\u003cp\u003eA Humble Request.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone,\u003c/p\u003e\u003cp\u003eThis is my first entry on Codeforces, so please excuse me if there are any mistakes. I know it i quite big but please read before down-voting. \u003c/p\u003e\u003cp\u003eThis entry is about the \u003ca href\u003d\"//codeforces.com/blog/entry/58986\"\u003eVK Cup Wild Card Round 2\u003c/a\u003e. A lot of teams participated in this Round.There was only one problem and it was very interesting. Everyone tried their best to get the maximum score. We also got 21727 points before the system testing but during the system test we got zero points, this is because the solution which the judge considered for system testing was the latest solution with nonzero score and not the best solution which the team submitted! I am not saying it was their mistake in fact it was mentioned in the contest blog but I guess not every team read it properly and so was the case with me.\u003c/p\u003e\u003cp\u003eNow i believe that it becomes unfair sometimes like in our case we submitted many other solution hoping that our score would increase but due to bugs sometimes we got zero points or sometimes a small positive score because the first case was very trivial and in the last phase of the contest we tied to submit some extra solution since the contest was going to end but we couldn\u0027t get a better score but we didn\u0027t realize that this would cost us a lot! though we had a better solution submitted only our last buggy solution was judged and our rank fell considerably.\u003c/p\u003e\u003cp\u003eThough we participated unofficially it hurt us because we actually tried really hard to get a score of 21727 but at the end when you see that your real solution got rejected and a faulty one was judged anyone would feel very bad.\u003c/p\u003e\u003cp\u003eI am not requesting to change the final standing or anything because that would be too much for a request but it would be really great to see what our best solution could score. So i request \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Штаб, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e to please consider this request and let us know the score our best solution could get!\u003c/p\u003e\u003cp\u003eI am sorry if I offended anyone, it was not my intension at all, i just wanted to put forward this request because it was something that hit hard on our hopes of getting a good rank.\u003c/p\u003e\u003cp\u003eIt would be great to know your opinion also!\u003c/p\u003e\u003c/div\u003e","tags":["vk cup 18","wildcard round 2"]}}