{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1487218221,"rating":159,"authorHandle":"simpleperson","modificationTimeSeconds":1487576482,"id":50455,"title":"\u003cp\u003eICPC Regional Considered Harmful\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI have participated 3 years in the South Central USA ICPC regional. But their problems always \u003cstrong\u003eSUCK\u003c/strong\u003e. For example, last regional they put a problem \u003cstrong\u003ewhich can\u0027t even be solved\u003c/strong\u003e; that is, I\u0027m pretty sure there is no correct algorithm that would be correct and be efficient enough. So their official solution to that problem was an incorrect greedy heuristic that is really easy to come up with a test case that makes it give a wrong answer. I got really upset because I spent a lot of time in the contest trying to solve that problem, only to realize when the contest ended that I was supposed to submit a wrong solution in order to get Accepted like other teams did. \u003cstrong\u003eIs that type of problem even allowed by the ICPC?!?!\u003c/strong\u003e I leave the link to the problem:\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://ld2016.scusa.lsu.edu/problems-regional/prb.php?prob\u003d10\"\u003ehttp://ld2016.scusa.lsu.edu/problems-regional/prb.php?prob\u003d10\u003c/a\u003e\u003c/p\u003e\u003cp\u003eOh, and sometimes they like to put trick / stupid problems like this one: (the problem statement tells you to given as input a position in the digits of pi, to find the next position where a 5 appears. But then at the output description they trick you and say to only print a 5 and don\u0027t actually solve the problem. So many teams got fooled trying to solve the original problem only to realize it was a dumb trick question. And thus wasted a lot of contest time):\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://ld2015.scusa.lsu.edu/problems-regional/prb.php?prob\u003dH\u0026amp;print\u003d1\"\u003ehttp://ld2015.scusa.lsu.edu/problems-regional/prb.php?prob\u003dH\u0026amp;print\u003d1\u003c/a\u003e\u003c/p\u003e\u003cp\u003eAnd pretty much the rest of the problems are always \u003cstrong\u003etedious implementation problems with no algorithmic insights\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eSo as you can see, their problems always SUCK. Does anyone know where can I submit a complaint? I don\u0027t think they should be allowed to make regional contests, and we should combine the region with another USA region or something. \u003c/p\u003e\u003cp\u003eWhat do you think?\u003c/p\u003e\u003c/div\u003e","tags":["icpc","usa"]}}