{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1462059253,"rating":45,"authorHandle":"I_love_Tanya_Romanova","modificationTimeSeconds":1462125489,"id":44647,"title":"\u003cp\u003eInvitation to HackerEarth MayEasy Contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003eI would like to invite you to participate in \u003ca href\u003d\"http://hackerearth.com/\"\u003eHackerEarth\u003c/a\u003e \u003ca href\u003d\"https://www.hackerearth.com/may-easy-16/\"\u003eMay Easy Round\u003c/a\u003e that will be held \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dMay%20Easy%20%2716\u0026amp;iso\u003d20160501T1600\u0026amp;ah\u003d3\u0026amp;am\u003d0\"\u003eon Sunday, 01 of May\u003c/a\u003e. The duration of the contest is 3 hours.\u003c/p\u003e\u003cp\u003eThe problems were set by \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/pkacprzak\" title\u003d\"Кандидат в мастера pkacprzak\"\u003epkacprzak\u003c/a\u003e and tested by me. The difficulty of this round will be not harder than CodeForces Div. 2 Round (maybe even easier). You\u0027ll be provided with 5 classic problems having partial scoring — you get points for every test that your solution passed, and also one approximate problem — your score for this task depends on how good your solution is comparing to current best solution \u003cem\u003e(and don\u0027t be afraid of facing an approximate problem in a contest which lasts for 3 hours only ;) )\u003c/em\u003e. This contest will be a rated HE Round.\u003c/p\u003e\u003cp\u003eYou\u0027ll be provided with statements in English, and there will also be a Russian version as well — thanks to \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/shef_2318\" title\u003d\"Международный мастер shef_2318\"\u003eshef_2318\u003c/a\u003e for working on a problemset as a translator.\u003c/p\u003e\u003cp\u003eAlso I want to thank to \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/belowthebelt\" title\u003d\"Эксперт belowthebelt\"\u003ebelowthebelt\u003c/a\u003e for helping with technical aspects of contest preparation.\u003c/p\u003e\u003cp\u003eIn any case, Good Luck \u0026amp;\u0026amp; Have Fun all of you! I hope to see you in standings :)\u003c/p\u003e\u003cp\u003e\u003cem\u003eUPD. Please notice that problem statement of \u003cstrong\u003eBridges in Karak\u003c/strong\u003e has been changed (there is an announcement about it in a contest as well — output format has been changed). We are sorry for it; in case you already attempted that problem — we strongly recommend you to check updated statement and try to fix your old solution. We\u0027ll do our best to minimize effect of this mistake in contest standings (exact decisions about rejudging old submissions and stuff like that will be made later), also contest has been extended by 15 minutes.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e","tags":["hackerearth","contest","invitation","prizes","easy"]}}