{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1496881743,"rating":41,"authorHandle":"ItsNear","modificationTimeSeconds":1496949823,"id":52462,"title":"\u003cp\u003eJavaBlitz Beta Round\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eUPDATE:\u003c/strong\u003e the contest is over, the problems are available for upsolving. If you participated, please tell us how usable and responsive the interface was, and whether everything went well.\u003c/p\u003e\u003cp\u003eHi, Everybody!\u003c/p\u003e\u003cp\u003eWe would like to invite you all to help us test a new competitive programming platform called \u003ca href\u003d\"http://javablitz.com\"\u003eJavaBlitz\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eJavaBlitz rounds are short (up to 2hr 30m) contests with ACM ICPC rules with the only difference that the penalty for an incorrect submission is 4 minutes instead of 20.\u003c/p\u003e\u003cp\u003eThe platform only supports Java as the programming language, and, similar to TopCoder, requires participants to implement a method in the given class that receives the input as arguments and returns the result. There\u0027s no reading from- and writing to files.\u003c/p\u003e\u003cp\u003eThe beta round will take place today, June 8th, at \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?year\u003d2017\u0026amp;month\u003d06\u0026amp;day\u003d08\u0026amp;hour\u003d17\u0026amp;min\u003d30\u0026amp;sec\u003d0\"\u003e20:30 Moscow Time / 17:30 UTC / 10:30 AM PDT\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe Beta Round will be 1hr 40min long and will feature three problems. No Div1 D/E level problems will be featured on this round.\u003c/p\u003e\u003cp\u003eThe platform is located here: \u003ca href\u003d\"http://javablitz.com\"\u003ehttp://javablitz.com\u003c/a\u003e, and besides the coming Beta Round has two warmup problems to play around with the arena.\u003c/p\u003e\u003cp\u003eThe probability of the system going down during the contest is very high, keep it in mind if you participate :)\u003c/p\u003e\u003c/div\u003e","tags":["javablitz"]}}