{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1490625104,"rating":32,"authorHandle":"bearf","modificationTimeSeconds":1490947653,"id":51246,"title":"\u003cp\u003eКомандный онлайн-чемпионат по программированию им. В.Б. Кононова среди студентов и школьников Республики Татарстан\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eОт Жюри.\u003c/p\u003e\u003cp\u003eС 2000 по 2016 год проводился очный \u003ca href\u003d\"http://icl.ru/turnir\"\u003eОткрытый командный турнир по программированию среди студентов и школьников Республики Татарстан\u003c/a\u003e. За это время через него прошло несколько сотен команд, а сам турнир стал известен в России. Несмотря на то, что официальные организаторы прошлых лет решили не проводить турнир, мы решили, что не стоит прерывать хорошую традицию. Поэтому в этом году по аналогичным правилам будет проведён \u003ca href\u003d\"https://tatcodecup.ru\"\u003eонлайн-чемпионат по программированию\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eМы решили почтить память Василия Борисовича Кононова, одного из организаторов первого командного турнира, проведённого компанией ICL в декабре 2000 года, и присвоить чемпионату его имя.\u003c/p\u003e\u003cp\u003eЖюри подготовило набор задач, который будет опубликован для решения в Интернете. Если вы учитесь в Республике Татарстан, собрали команду школьников или студентов (бакалавров, магистров) из трёх человек и хотите принять участие — \u003ca href\u003d\"https://goo.gl/OEx0ft\"\u003eрегистрируйтесь\u003c/a\u003e для участия в онлайн-туре. Вам будет выслан логин и пароль для входа. Ссылка для входа в интерфейс решения задач будет опубликована незадолго до проведения чемпионата.\u003c/p\u003e\u003cp\u003eКоманды не из Татарстана также могут попробовать силы в решении задач. Для этого вам нужно принять участие в этапе \u003ca href\u003d\"http://opencup.ru/index.cgi?data\u003doch/schedule\u0026amp;menu\u003dindex\u0026amp;head\u003dindex\"\u003e\u0026quot;Гран-при Татарстана\u0026quot;\u003c/a\u003e \u003ca href\u003d\"http://opencup.ru\"\u003eОткрытого кубка по программированию им. Е.В. Панкратьева\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eЧемпионат проводится при поддержке \u003ca href\u003d\"http://botaninvestments.com\"\u003eBotan Investments\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["командная олимпиада","татарстан","icl","gp of tatarstan"]}}