{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1477270929,"rating":155,"authorHandle":"Vladik","modificationTimeSeconds":1477989786,"id":47956,"title":"\u003cp\u003eОбъективен ли этот поступок?\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДоброго времени суток!\u003c/p\u003e\u003cp\u003eВчера в Гомельской области Республики Беларусь проходил отбор на ВКОШП. Задачи были взяты из проходившего в это же время интернет-отбора. И казалось бы, что можно было сделать не так, если даже задачи составлять не нужно... Но некоторые координаторы регионов умудряются это сделать и криво заливают задачи в свои собственные системы тестирования. Конкретно наш отбор проходил на сайте \u003ca href\u003d\"http://dl.gsu.by/\"\u003edl.gsu.by\u003c/a\u003e. Не знаю или у нас одних отбор прошел на таком ВЫСОКОМ уровне, но вот пару основных претензий к Гомельскому отбору:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eСайт жутко неудобный, чего только стоит система кларов (ее нету).\u003c/li\u003e   \u003cli\u003eВ двух задачах \u003cstrong\u003eC\u003c/strong\u003e и \u003cstrong\u003eF\u003c/strong\u003e были криво залиты чекеры, в результате чего сдать задачи было невозможно... (перетестирования до сих пор не произошло).\u003c/li\u003e   \u003cli\u003eБлиже к третьему часу олимпиады мы нашли способ связаться с жюри и на наше удивление получили развернутые и подробные ответы на наши вопросы \u003cstrong\u003e(нет)\u003c/strong\u003e.\u003c/li\u003e   \u003cli\u003eОшибка компиляции — отдельная тема для обсуждения. Помимо того, что посылки с данным вердиктом шли в штрафное время, так еще и участникам не давался лог компиляции этих самых посылок...\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eИ тут возникает вопрос: о чем думают подобные координаторы регионов, когда отказываются от ejudge, предоставленного жюри олимпиады... А вы что думаете по этому поводу?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e Задачи перетестировали.\u003c/p\u003e\u003c/div\u003e","tags":["вкошп","отбор","2016","dl.gsu.by"]}}