{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1433077953,"rating":167,"authorHandle":"forthright48","modificationTimeSeconds":1433086221,"id":18249,"title":"\u003cp\u003eCrowd Sourcing Editorials For Andrew Stankevich Contests \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces.\u003c/p\u003e\u003cp\u003eI want to propose a large scale cooperation for writing Editorials for all of Andrew Stankevich Contests. They are amazing contests and it\u0027s a real bummer that they don\u0027t have editorials. But so what? If all of us contribute to writing editorials for problems that we are able to solve, then it is easily possible to prepare full editorials for all of the contests.\u003c/p\u003e\u003cp\u003eIt might have been tough in any other circumstances, but I think with a strong community like Codeforces, this project is easily feasible. So here is what I am proposing:\u003c/p\u003e \u003col\u003e   \u003cli\u003eA blog post will be opened for each of the ASC contest, with title \u0026quot;Andrew Stankevich Contest XYZ Editorial\u0026quot;.\u003c/li\u003e   \u003cli\u003eIn that blog post I will write down the Editorials for the easy problems, so that \u0026quot;Big Guys\u0026quot; don\u0027t need to waste their valuable times with trivial problems.\u003c/li\u003e   \u003cli\u003eThe problems I fail to solve ( and there will be plenty of those ) will be marked \u0026quot;Missing\u0026quot;.\u003c/li\u003e   \u003cli\u003eEventually, a kind soul will post a comment with an editorial for missing problem. I will simply link that comment with the corresponding problem.\u003c/li\u003e   \u003cli\u003eEventually people might comment related problems, more resource or better explanations. I will link them too.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eOnce full editorial for contest i is complete, we will move to i+1. It might take some time to cover all of them, but slowly and eventually we will be able to build something that will come useful to so many programmers :)\u003c/p\u003e\u003cp\u003eNow, how can we make this project better? Do you have any suggestions? I am already working on ASC1. I will be publishing it withing few hours. \u003c/p\u003e\u003cp\u003eAlso, is there any way to make a blog post \u0026quot;Community Wiki\u0026quot; or something similar. So that even if I am the one who is posting the blog posts, other people ( perhaps above a certain rating ) are able to edit the posts. \u003c/p\u003e\u003ch3\u003eUPDATE\u003c/h3\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/marat.snowbear\" title\u003d\"Международный мастер marat.snowbear\"\u003emarat.snowbear\u003c/a\u003e suggested to use Codeforces groups. Seems like Codeforces Groups is going to suit this project better. A public group has been created \u003ca href\u003d\"//codeforces.com/group/qo1icaI3vI/blog\"\u003eASC Editorial Writers\u003c/a\u003e. Those who are interested, they can join the group. All the editorials will be published inside the group so that all the editorials can be found in one place. The blog posts can be edited by Managers, regardless of who created it. Non-managers can contribute by commenting. So it\u0027s a fusion of Wiki + Comment.\u003c/p\u003e\u003c/div\u003e","tags":["editorial","crowd-sourcing","andrew stankevich"]}}