{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1518634067,"rating":109,"authorHandle":"mplaza","modificationTimeSeconds":1518634067,"id":57768,"title":"\u003cp\u003e10th edition of the programming marathon Deadline24 \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eI would like to invite you to take part in the 10th jubilee edition of \u003cstrong\u003ethe international programming marathon Deadline24\u003c/strong\u003e. During the contest, the teams of three tackle algorithmic problems.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRegistration will last until February 22\u003c/strong\u003e and it is possible through the form available on the website: \u003ca href\u003d\"https://deadline24.pl/register/\"\u003ewww.deadline24.pl/register\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe qualifying round will take place on Sunday, February 25. During it the registered teams will struggle to solve tasks for 5 hours and this will be verified by server. This part of the competition is carried out remotely. In the last year a record number of competitors registered for the first phase — 1950.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/ad/60/ad607da7530020a20e8da7788c63b473536979f6.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eFor the final — which lasts for 24 hours — 30 teams with the best scores obtained during the elimination will be invited. The final will take place on 7- 8 of April in Poland. This year the best teams will win: Oculus Rift, iPad and Kindle Oasis 2.\u003c/p\u003e\u003cp\u003eDon\u0027t forget that the registration ends on February 22! Good luck in the qualifying round :) \u003c/p\u003e\u003cp\u003eIf you are interested in \u003cstrong\u003ethe previous years\u0027 tasks\u003c/strong\u003e, you can find them \u003ca href\u003d\"https://deadline24.pl/history/previous-problemsets/\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eSpecial thanks to Mike Mirzayanov for his help in promoting the competition on CF. \u003c/p\u003e\u003c/div\u003e","tags":["deadline24","marathon","algorithm","24-hour"]}}