{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1466450667,"rating":166,"authorHandle":"gKseni","modificationTimeSeconds":1466451507,"id":45560,"title":"\u003cp\u003eПрезидент России встретился с победителями финала ACM ICPC 2016\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПрезидент Российской Федерации Владимир Путин поздравил петербургских студентов, принявших участие в чемпионате по программированию. Встреча прошла в Константиновском дворце под Петербургом. По мнению главы государства, подобные специалисты должны приносить пользу стране.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/c6/ff/c6fff1ec52d24458958adac1b2a372ade2d9bb29.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e\u003csmall\u003e По правую руку от президента — команда СПбГУ, по левую — ИТМО\u003c/small\u003e\u003c/center\u003e\u003cp\u003eВо встрече участвовали команда СПбГУ (Игорь Пышкин, Станислав Ершов, Алексей Гордеев и тренер Андрей Лопатин), и ИТМО (Адам Бардашевич, Антон Ковшаров, Владимир Смыкалов и тренер Андрей Станкевич), помощник президента РФ Игорь Щёголев, помощник президента РФ Андрей Фурсенко, ректор ИТМО Владимир Васильев, ректор СПбГУ Николай Кропачев.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/92/43/9243951e89780f1eb4f44a972cc80a9cc870b073.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e\u003csmall\u003e Справа — Андрей Лопатин, тренер СПбГУ, справа от него —  ректор СПбГУ Николай Кропачев, далее — ректор ИТМО Владимир Васильев, тренер ИТМО Андрей Станкевич, помощник президента РФ Игорь Щёголев.\u003c/small\u003e\u003c/center\u003e\u003cp\u003eКак подчеркивает Владимир Путин, успехи петербургских студентов говорят о повышении уровня и качества российского образования, а программирование давно стало ключевым направлением для любой современной экономики.\u003c/p\u003e\u003cp\u003e«Я очень рассчитываю, что вы найдете применение своим талантам, знаниям и умениям, прежде всего в нашей стране», — объяснил российский президент.\u003c/p\u003e\u003cp\u003eРепортаж «Россия 24» о встрече:\u003c/p\u003e\u003cp\u003e\u003ciframe allowfullscreen\u003d\"\" frameborder\u003d\"0\" height\u003d\"315\" src\u003d\"https://www.youtube.com/embed/cMHQUNaC9FM\" width\u003d\"560\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news"]}}