{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1498090919,"rating":0,"authorHandle":"NevstruevDmitriy","modificationTimeSeconds":1498091271,"id":52807,"title":"\u003cp\u003eИгровой контест! (СТОГ_А + СТОГ_Б)\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eСегодня стартует игровой контест ЛКШ2017! (для СТОГ_А + СТОГ_Б) Чтобы принять в нём участие надо:\u003c/p\u003e\u003cp\u003e1) Зарегистрироваться в мессенджере Телеграмм (это можно сделать через веб-версию телеграмм \u003ca href\u003d\"http://web.telegram.org.ru/#/login\"\u003ehttp://web.telegram.org.ru/#/login\u003c/a\u003e)\u003c/p\u003e\u003cp\u003e2) Ввести в поиске контактов (слева сверху от списка диалогов) идентификатор Телеграмм-бота: @LKSH2017_bot и перейти к диалогу с ним.\u003c/p\u003e\u003cp\u003e3) Нажать на кнопку /start. Должно получиться что-то похожее на фото2. (фотографии есть в группе ВК)\u003c/p\u003e\u003cp\u003eЕсли отсутствуют кнопки под историей диалога, следует нажать на кнопку слева от \u0026quot;смайлики\u0026quot;.\u003c/p\u003e\u003cp\u003eТеперь Вы участвуете в игровом контесте! — Контест содержит одну интерактивную задачу, чтобы прочитать её условие, следует нажать на кнопку /task\u003c/p\u003e\u003cp\u003e— Чтобы отправить решение задачи, следует прикрепить к сообщению файл формата .срр, в случае удачи бот об этом скажет (см фото3). Каждый участник представляет не более одного решения. Если Вы загрузите другую программу, то новая полностью заменит старое решение.\u003c/p\u003e\u003cp\u003e— В конце школы будет проведён турнир \u0026quot;каждый с каждым\u0026quot; и победитель будет определён по максимальному количеству очков (1 за победу 0 за ничью и поражение). Во время школы участник имеет возможность \u0026quot;протестировать\u0026quot; свою программу на программах участников. Для этого следует нажать на кнопку \u0026quot;Потребовать сатисфакцию :\u0026lt;ИмяСоперника\u0026gt;\u0026quot;. После этого Вам будет доступна история боя (см фото4), её можно использовать для тестирования и усовершенствования Вашей программы. Чтобы не возникало недоумений, внимательно ознакомьтесь с условием задачи! Изначально в тестирующей системе одно решение — простой бот (он никогда не выигрывает) \u003c/p\u003e\u003cp\u003e— Чтобы посмотреть решение, которое Вы представляете в настоящее время, нажмите /myBot\u003c/p\u003e\u003cp\u003e— Контест \u0026quot;открыт\u0026quot; каждый день ЛКШ с 13-00 до 23-00. Писать боту можно и в другое время, но он не будет отвечать. Хотя все запросы в 13-00 обработаются корректно.\u003c/p\u003e\u003cp\u003e— Если что-то непонятно, нажмите на /help\u003c/p\u003e\u003cp\u003e— Если яснее не стало — напишите Диме или обратитесь к Вашему преподавателю, они объяснят. Так же Диме надо писать, если бот не работает или работает некорректно в нужное время.\u003c/p\u003e\u003c/div\u003e","tags":[]}}