{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1463511756,"rating":94,"authorHandle":"FatalEagle","modificationTimeSeconds":1463625574,"id":44923,"title":"\u003cp\u003eDMPG \u002716 [Contest Announcement]\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces users!\u003c/p\u003e\u003cp\u003eI invite all of you to participate in the DMPG \u002716 online mirror contests. The DMPG \u002716 is a set of 3 contests divided into three divisions, Gold (harder), Silver (medium), and Bronze (easier). Each contest is a \u003cstrong\u003e3-hour virtual contest\u003c/strong\u003e with a problemset of 6 problems which are disjoint from the other divisions, so you can choose to participate in any subset of the contests (or, if one division is too hard, you can switch to an easier division). These contests will not impact any rating on any platform, so feel free to just enter and look at the problems without any obligation to write code for them. The contests will be hosted on the DMOJ platform. I strongly recommend you all to try the Gold division!\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://dmoj.ca/contest/dmpg16d1open\"\u003eGold Contest\u003c/a\u003e | \u003ca href\u003d\"https://dmoj.ca/contest/dmpg16d2open\"\u003eSilver Contest\u003c/a\u003e | \u003ca href\u003d\"https://dmoj.ca/contest/dmpg16d3open\"\u003eBronze Contest\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/e2/d0/e2d07cc3abf9b6c766b66be495a84a5215422fb8\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThe contest window is 10 hours beginning at \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dDMPG%20%2716%20-%20Gold%20Division\u0026amp;iso\u003d2016-05-18T15:00:00\"\u003e11:00 EDT\u003c/a\u003e; you may pick any \u003cstrong\u003e3 hour interval\u003c/strong\u003e at your convenience during the larger contest window to solve the problems in. You should start within 7 hours of the window starting time if you want to use the full 3 hours to solve problems.\u003c/p\u003e\u003cp\u003eThe scoring format will be in the form of subtasks; you get partial marks for each subtask you solve correctly. Additionally, each of the 6 problems have a maximum of 100 points, so a perfect score will be 600 points. During the contest you will have full feedback. Ties in the scoreboard will be broken by the sum of highest-scoring submission times.\u003c/p\u003e\u003cp\u003eThe difficulty of the Gold contest will be similar to a CF Div 1 round, except that the easiest problem will be harder and the hardest problem will be easier. A similar situation applies for the Silver contest and a CF Div 2 round, and if CF had Div 3 rounds that would be the difficulty of the Bronze contest.\u003c/p\u003e\u003cp\u003eI was involved only in the preparation of the Gold contest. The authors of the Gold contest are me (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/FatalEagle\" title\u003d\"Grandmaster FatalEagle\"\u003eFatalEagle\u003c/a\u003e), \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/cheezecake\" title\u003d\"Specialist cheezecake\"\u003echeezecake\u003c/a\u003e, and \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/mrthefakeperson\" title\u003d\"Expert mrthefakeperson\"\u003emrthefakeperson\u003c/a\u003e. I would also like to thank \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Reyna\" title\u003d\"Grandmaster Reyna\"\u003eReyna\u003c/a\u003e for helping us test the problems for the Gold division.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD: You may now begin your virtual contest.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2: The contest is over. Thanks to everyone who participated!\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":["contest","announcement","dmoj"]}}