{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1436972462,"rating":296,"authorHandle":"kuviman","modificationTimeSeconds":1436976754,"id":19229,"title":"\u003cp\u003eRatings in groups\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003eNot so long ago summer trainings finished in Saratov State University, and to make it easier to monitor the success of our programmers we introduced a feature to add custom ratings. Now you also have this opportunity!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/b7/26/b7263931949f455b5c08cdf088f4437aebb91d63.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eCurrently rating is calculated as follows: overall rating is equal to the arithmetic mean of the ratings for each contest in which the user has participated. Contest rating depends on the ratio of problems solved by user and a number of problems solved by winner, as well as user\u0027s place in the contest. Also points for upsolving are added to the contest rating. There is a rumor that such method of calculating rating first was used in ITMO. More formally:\u003c/p\u003e \u003ccenter\u003e\u003cimg align\u003d\"middle\" class\u003d\"tex-formula\" src\u003d\"/predownloaded/a9/b4/a9b4c5789a0cbe52fb6722cf7d7d8fd355080e37.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/center\u003e\u003cp\u003ewhere\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eR\u003c/i\u003e\u003c/span\u003e — contest rating,\u003c/li\u003e   \u003cli\u003e\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e\u003c/span\u003e — maximum of 50 and number of contest participants,\u003c/li\u003e   \u003cli\u003e\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eplace\u003c/i\u003e\u003c/span\u003e — 1-indexed used\u0027s place in the contest,\u003c/li\u003e   \u003cli\u003e\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003esolved\u003c/i\u003e\u003c/span\u003e — number of solved problems by the user,\u003c/li\u003e   \u003cli\u003e\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003emaxSolved\u003c/i\u003e\u003c/span\u003e — number of solved problems by the winner,\u003c/li\u003e   \u003cli\u003e\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eupsolved\u003c/i\u003e\u003c/span\u003e — number of upsolved problems by the user,\u003c/li\u003e   \u003cli\u003e\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eproblemCount\u003c/i\u003e\u003c/span\u003e — total number of problems in the contest.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIf a user participated in a team, his place equals to the place of the team in this contest.\u003c/p\u003e\u003cp\u003eTo create a custom rating in the group you have to be its manager. There can be multiple ratings in one group with different sets of contests. There is a special button to create a rating in the group sidebar:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/e2/77/e277944f506992e3cbdd7529e9586134ab661637.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eIf you press the button rating creation form will appear:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/f4/e3/f4e3bd847937e1d06fc095558c82ff87a44b0bdf.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eUsers are added to the rating only if they have participated at least in the given percent of all contests of this rating. By default one have to participate in 50% of all the contests.\u003c/p\u003e\u003cp\u003eIf you wish you can set rating freeze date: upsolving after that date will not affect the rating.\u003c/p\u003e\u003cp\u003eAlso now you can view status in groups: it shows only submissions for the group contests.\u003c/p\u003e\u003cp\u003eGood luck with training in Codeforces groups!\u003c/p\u003e\u003c/div\u003e","tags":[]}}