{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1507122788,"rating":28,"authorHandle":"csacademy","modificationTimeSeconds":1507144913,"id":54950,"title":"\u003cp\u003eRMI 2017 Day 1 Online Mirror\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eThe \u003ca href\u003d\"http://rmi.lbi.ro/rmi_2017/index.php?id\u003dhome\"\u003eRomanian Master of Informatics\u003c/a\u003e is a yearly competition addressed to high school students and organised by the \u003ca href\u003d\"http://portal.lbi.ro/\"\u003eTudor Vianu\u003c/a\u003e highschool in Bucharest, Romania. The format of the contest is the one commonly found in olympiads.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRMI\u003c/strong\u003e provides a great opportunity for young people to demonstrate their abilities in Informatics, to exchange knowledge and to enhance cross-cultural contacts in high-school education. Coming to RMI 2017, they will have opportunities to make new friends, to visit a friendly country, and to discover the culture of Romania.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://csacademy.com/\"\u003eCS Academy\u003c/a\u003e will host the online mirrors of both competition days. The \u003ca href\u003d\"https://csacademy.com/contest/rmi-2017-day-1/\"\u003efirst contest\u003c/a\u003e starts on \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dRMI+2017+Day+1\u0026amp;iso\u003d20171005T11\u0026amp;p1\u003d1440\u0026amp;ah\u003d5\"\u003eThursday, October 05, 11:00:00 UTC\u003c/a\u003e, after the onsite competition ends. The problem statements will be available in English.\u003c/p\u003e\u003ch4\u003eContest format\u003c/h4\u003e \u003cul\u003e   \u003cli\u003eYou will have to solve \u003cstrong\u003e3\u003c/strong\u003e tasks in \u003cstrong\u003e5\u003c/strong\u003e hours.\u003c/li\u003e   \u003cli\u003eThere will be full feedback throughout the entire contest.\u003c/li\u003e   \u003cli\u003eThe tasks will have partial scoring. The maximum score for each problem will be 100 points.\u003c/li\u003e   \u003cli\u003eThere will be no tie breaker, so two users having the same total score at the end of the contest will share the same place in the standings.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIf you find any bugs please email us at \u003ca href\u003d\"mailto:contact@csacademy.com\"\u003econtact@csacademy.com\u003c/a\u003e\u003c/p\u003e\u003cp\u003eDon\u0027t forget to like us on \u003ca href\u003d\"https://www.facebook.com/csacademy\"\u003eFacebook\u003c/a\u003e, \u003ca href\u003d\"https://vk.com/realcsacademy\"\u003eVK\u003c/a\u003e and follow us on \u003ca href\u003d\"https://twitter.com/realCSAcademy\"\u003eTwitter\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["csacademy","contest","announcement"]}}