{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1516631959,"rating":76,"authorHandle":"schezo","modificationTimeSeconds":1517062924,"id":57280,"title":"\u003cp\u003eInvitation to TOKI Open Contest January 2018\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces Community, TOKI Open Contest is back again! :D\u003c/p\u003e\u003cp\u003eWe would like to invite you to participate in this TOKI Open Contest January 2018. TOKI Open Contest is Indonesian monthly online programming contest. It\u0027s been a long hiatus since we decided to make this contest international: on \u003ca href\u003d\"//codeforces.com/blog/entry/50318\"\u003eFebruary\u003c/a\u003e and \u003ca href\u003d\"//codeforces.com/blog/entry/51134\"\u003eMarch\u003c/a\u003e 2017! :\u0027)\u003c/p\u003e\u003cp\u003eEvery problem is written in both Bahasa Indonesia and English. The contest will be divided into \u003cstrong\u003etwo divisions\u003c/strong\u003e: Division 1 and Division 2. It is pretty similar to the divisions in \u003ca href\u003d\"http://atcoder.jp/\"\u003eAtcoder\u003c/a\u003e (Beginner and Regular). You are free to register in any division (it\u0027s extremely OK if you are a Div2 Codeforces user and register to our Division 1 contest)! The expected difficulties of the problems are much the same with Atcoder\u0027s contest problems.\u003c/p\u003e\u003cp\u003eTOKI Open Contest January 2018 will be held on \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dTOKI+Open+Contest+January+2018\u0026amp;iso\u003d20180127T19\u0026amp;p1\u003d108\u0026amp;ah\u003d2\"\u003eSaturday, 27 January 2018, 19.00 — 21.00 Western Indonesian Time (UTC+7)\u003c/a\u003e. This contest is written by Kwee Lung Sin (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Klungs\" title\u003d\"Кандидат в мастера Klungs\"\u003eKlungs\u003c/a\u003e) and Maximilianus Maria Kolbe (\u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/Yoshiyuki\" title\u003d\"Специалист Yoshiyuki\"\u003eYoshiyuki\u003c/a\u003e); also monitored and supervised by Agus Sentosa Hermawan (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/aguss787\" title\u003d\"Кандидат в мастера aguss787\"\u003eaguss787\u003c/a\u003e), Ammar Fathin Sabili (\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/schezo\" title\u003d\"Международный мастер schezo\"\u003eschezo\u003c/a\u003e), and Anthony Ng (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/kaifa\" title\u003d\"Кандидат в мастера kaifa\"\u003ekaifa\u003c/a\u003e).\u003c/p\u003e\u003cp\u003eSeveral details related to the contest:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eThe contest will use ACM-ICPC scoring type.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eFor each division, there will be FOUR (4) problems with various difficulties but the weight for each problem is the same. The contest duration is 2 hours.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe problems are sorted by their expected difficulty from easy to hard. Participants are recommended to read all the problems.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAny non-Accepted submission will get 8 minutes penalty but it will only be counted after the respective problem got Accepted.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe rank will be sorted according to the most number of solves (problems with Accepted verdict). If there are ties, it will be determined by least (sum of solving time + sum of penalties). The rank will be separated for Division 1 and Division 2.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe allowed programming languages are C, C++11, Pascal, Python 3, and Java 8. However, please note that we do not ensure that every language can solve all the problems on the given time limit.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe contest will be held on \u003ca href\u003d\"https://competition.ia-toki.org/contests/253\"\u003ehttps://competition.ia-toki.org/contests/253\u003c/a\u003e for division 1 and \u003ca href\u003d\"https://competition.ia-toki.org/contests/254\"\u003ehttps://competition.ia-toki.org/contests/254\u003c/a\u003e for division 2. Registration is already opened at the same place. Registering the contest requires a TLX (\u003ca href\u003d\"http://competition.ia-toki.org\"\u003ehttp://competition.ia-toki.org\u003c/a\u003e) account. You may need to register for an account if you don\u0027t have one.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eWish you all good luck and have fun! See you at the leaderboard! :)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD 1\u003c/strong\u003e: The contest will be held in less than 20 hours, make sure you are already registered! :D\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD 2\u003c/strong\u003e : The contest is over, thanks for participating the TOKI Open Contest January 2018! :D\u003c/p\u003e\u003cp\u003eThis contest has 31 contestants in Division 1 and 41 contestants in Division 2 with at least one submission.\u003c/p\u003e\u003cp\u003eThe following are the winner of the TOKI Open Contest January 2018:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDivision 1\u003c/strong\u003e:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ayaze\" title\u003d\"Гроссмейстер ayaze\"\u003eayaze\u003c/a\u003e solved 4 problems with 164 minutes total penalty.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/jonathanirvings\" title\u003d\"Гроссмейстер jonathanirvings\"\u003ejonathanirvings\u003c/a\u003e solved 4 problems with 207 minutes total penalty.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/wiwit\" title\u003d\"Гроссмейстер wiwit\"\u003ewiwit\u003c/a\u003e solved 4 problems with 254 minutes total penalty.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003e\u003cstrong\u003eDivision 2\u003c/strong\u003e:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/reiva5\" title\u003d\"Эксперт reiva5\"\u003ereiva5\u003c/a\u003e solved 4 problems with 164 minutes total penalty.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/farizazmip\" title\u003d\"Эксперт farizazmip\"\u003efarizazmip\u003c/a\u003e solved 4 problems with 203 minutes total penalty.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/ipul23\" title\u003d\"Специалист ipul23\"\u003eipul23\u003c/a\u003e solved 4 problems with 278 minutes total penalty.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eCongratulation to winners! :D\u003c/p\u003e\u003cp\u003eThe problems are available at \u003ca href\u003d\"https://training.ia-toki.org/problemsets/106/problems\"\u003ehttps://training.ia-toki.org/problemsets/106/problems\u003c/a\u003e for upsolving. See you at the next TOKI Open Contest! :D\u003c/p\u003e\u003c/div\u003e","tags":["toki","toki-open-contest","indonesia"]}}