{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1422373337,"rating":4,"authorHandle":"yermak0v","modificationTimeSeconds":1422435703,"id":16057,"title":"\u003cp\u003eОдна задачка, или как сойти с ума более изящно\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, все.\u003cbr /\u003eНа днях я придумал одну [очень] интересную задачу.\u003cbr /\u003eСобственно задача:\u003cbr /\u003eУ нас есть ориентированный граф \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e\u003c/span\u003e вершин и \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003em\u003c/i\u003e\u003c/span\u003e ребер. Вы находитесь в вершине \u003cspan class\u003d\"tex-span\"\u003e1\u003c/span\u003e. Также известно, что, будучи в вершине \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ev\u003c/i\u003e\u003c/span\u003e вы пойдете в вершину \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eu\u003c/i\u003e\u003c/span\u003e с определенной вероятностью. Также с некоторой вероятностью вы останетесь в этой вершине и не пойдете больше никуда. Очевидно, что сумма вероятностей прохождения по какому-то ребру и того, что вы останетесь на месте, — равна \u003cspan class\u003d\"tex-span\"\u003e1\u003c/span\u003e. Нужно посчитать вероятность с которой вы попадете в вершину \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eto\u003c/i\u003e\u003c/span\u003e, начав свой путь с вершины \u003cspan class\u003d\"tex-span\"\u003e1\u003c/span\u003e.\u003cbr /\u003eМое решение, а точнее сказать размышления о решении под катом.\u003cbr /\u003e\u003cb\u003eUPD\u003c/b\u003e решение было найдено. Пару слов в конце.\u003cbr /\u003e Мои раздумия (сразу предупреждаю: буду описывать ход своих мыслей — поэтому может быть немного лишнего):\u003cbr /\u003e1. возьмем такой пример: у нас есть путь \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ev\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e1\u003c/sub\u003e \u003d 1\u003c/span\u003e, \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ev\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e2\u003c/sub\u003e\u003c/span\u003e,..., \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ev\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ek\u003c/i\u003e\u003c/sub\u003e \u003d \u003ci\u003eto\u003c/i\u003e\u003c/span\u003e. Имея хоть немного знаний в теории вероятностей, можно увидеть, что вероятность прохождения именно по этому пути равна произведению вероятностей каждого ребра. Это вроде и очевидно, но вдруг кто не знает?..\u003cbr /\u003e2. сразу хочется запустить какой-то поиск по графу, и именно эта идея пока играет ключевую роль.\u003cbr /\u003e2.1. поиск в ширину не подходит, по причине того, что в вершину \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eu\u003c/i\u003e\u003c/span\u003e может приходить несколько путей разной длины, но мы в нее зайдем только раз, и вероятность которую мы получим через второй путь мы недосчитаем во всех вершинах, которые доступны из \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eu\u003c/i\u003e\u003c/span\u003e. Поэтому мы его сразу бракуем.\u003cbr /\u003e2.2. значит у нас остается поиск в глубину. Правда с ним тоже не все гладко: за сколько будет работать такой алгоритм, я пока понять не смог...\u003cbr /\u003e3. с горем пополам таки пишем эту идею. \u003cs\u003eПрофит.\u003c/s\u003e Но радость длится недолго.\u003cbr /\u003e4. вспоминаем, что в графах бывают циклы, \u003cs\u003eплачем,\u003c/s\u003e:\u003cbr /\u003eс первого взгляда кажется, что из-за циклов, ответ для вершин, по пути к которым есть циклы, будет бесконечно большим, но это не так: цикл, как известно, является замкнутым путем, и вероятность прохождения по нему также можно посчитать.\u003cbr /\u003e5. замечаем, что в случае с вероятностями, все числа в пределах [0,1], а значит с каждым прохождением по циклу к вероятности прихода в вершину добавляются члены геометричесской прогрессии. Ее знаменателем будет вероятность прохождения по циклу, а первым членом посчитанная ранее вероятность прихода в эту вершину. Как известно, по этих данных можно найти предел этой суммы, и это очень просто. Но радоваться все еще очень рано... Даже в таком случае не очень-то ясно как именно считать теперь это все. В случае с одним циклом все выворачивается само собой, но когда циклов побольше — то даже интуитивно не понятно как считать эту гребаную веротность...\u003cbr /\u003eТак вот, я хотел бы попросить у вас помощи, или хотя бы хоть какого-то объективного доказательства, что решить эту задачу нереально.\u003cbr /\u003e\u003cb\u003eP.S.\u003c/b\u003e если кто-то подскажет программу, в которой можно не прикладая много усилий рисовать графы — то я добавлю сюда немного картинок.\u003cbr /\u003e\u003cb\u003eUPD.\u003c/b\u003e к счастью, или к сожалению, сойти с ума не вышло. Решение помогли найти, и оно оказалось намного проще, чем я думал. Метод решения описан \u003ca href\u003d\"https://ru.wikipedia.org/wiki/%D0%A6%D0%B5%D0%BF%D1%8C_%D0%9C%D0%B0%D1%80%D0%BA%D0%BE%D0%B2%D0%B0\"\u003eтут\u003c/a\u003e. \u003ca href\u003d\"http://www.everfall.com/paste/id.php?etpb56iqfbo7\"\u003eКод решения\u003c/a\u003e от \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/PavelSavchenkov\" title\u003d\"Международный мастер PavelSavchenkov\"\u003ePavelSavchenkov\u003c/a\u003e. От себя добавлю очень похожа на задачу о нахождении количества путей заданой длины. Даже могу сказать, что задачи мало отличаются друг от друга.\u003c/p\u003e\u003c/div\u003e","tags":["теория вероятностей","теория графов","графы","хардкор","квантовая физика","бесконечность"]}}