{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1471472602,"rating":8,"authorHandle":"Heisenberg302","modificationTimeSeconds":1471472602,"id":46616,"title":"\u003cp\u003eExperience Sharing\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eAs a person who likes solving algorithm questions a lot I want to ask some questions to the people who have not been that great in solving questions but who are not pretty comfortable with that.  In general people start learning algorithms in high school or even earlier and they work on problems in groups so it is very fast for them to learn new things. Unfortunately I have started learning algorithms and participating in some contests pretty recently, I am in college now. I did\u0027t even know what \u0027algorithm\u0027 meant back in days in high school, anyways without beating around the bush lets get to the point.  I want to know what is a good way of learning fast, I know it might vary from person to person but I am asking personal experiences here rather than focusing on getting a general answer, which is not likely. So far I have been taking some contests and solving A B C in general sometimes D but it is hard to solve E for me in contests. It is obvious that every red user was at this point someday. How did you guys improve yourselves ? Did you guys try to solve questions on your owns or looked at someone elses code? Also should I learn how to implement some algorithms like heavy llght etc. when there is a question about it in a contest or should I leave some other time for that ? I guess you guys understood what I am asking.  Another question that I want to ask is a little bit different , I know that there are a lot of people from good companies. I heard that it is very stressful to work in good companies as there are so many good people and deadlines are so strict and they don\u0027t give you enough time. How true is this ? Thanks for reading... \u003c/p\u003e\u003c/div\u003e","tags":[]}}