{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1465735169,"rating":352,"authorHandle":"yeputons","modificationTimeSeconds":1465735215,"id":45384,"title":"\u003cp\u003eOnline judge with IOI problem went public\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone.\u003c/p\u003e\u003cp\u003eTwo years ago there was a post titled \u0026quot;Submitting IOI problems\u0026quot; and \u003ca href\u003d\"/blog/entry/10967#comment-161620\"\u003emy comment\u003c/a\u003e there. I offered everyone to contact me via PM on Codeforces to get the access and be able to solve problems from past IOIs (starting with IOI 2003). What was important here is that \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/PavelKunyavskiy\" title\u003d\"International Grandmaster PavelKunyavskiy\"\u003ePavelKunyavskiy\u003c/a\u003e and me took effort and made the system as similar to what was used on particular IOI as we could, including:\u003c/p\u003e \u003col\u003e   \u003cli\u003eOriginal tests from archives\u003c/li\u003e   \u003cli\u003eTests grouping and correct subtasks scoring where applicable — you won\u0027t get 54 points if there are subtasks for 40 and 60 points — just like on IOI.\u003c/li\u003e   \u003cli\u003eInteractive problems with interactive I/O (say, \u0026quot;Aliens\u0026quot; from IOI 2007 or \u0026quot;Maintain\u0026quot; from IOI 2003)\u003c/li\u003e   \u003cli\u003ePartial scoring where you can get only a fraction of points per test, like \u0026quot;Reverse\u0026quot; from IOI 2003 or \u0026quot;Hotter Colder\u0026quot; from IOI 2010.\u003c/li\u003e   \u003cli\u003e\u0026quot;Encode-decode\u0026quot; problems, where your solution is executed several times in separate processes, like \u0026quot;Parrots\u0026quot; from IOI 2011.\u003c/li\u003e   \u003cli\u003eOpen test problems where you submit answers only instead of solution, like \u0026quot;Forbidden subgraph\u0026quot; from IOI 2006 or \u0026quot;Maze\u0026quot; from IOI 2010.\u003c/li\u003e   \u003cli\u003eGraders like on IOI 2010 and further. Unfortunately, the \u0026quot;Black box\u0026quot; problem from IOI 2006 was also implemented as a problem with graders instead of running a real \u0026quot;black box\u0026quot; on our server which you can access remotely.\u003c/li\u003e   \u003cli\u003e\u0026quot;Odometer\u0026quot; problem from IOI 2012 where you had to submit a program on a specially invented language.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eSo far it was a closed judge available upon request only. As far as I remember, I\u0027ve granted access to everyone who\u0027ve asked — 150+ persons. Time flows and the judge eventually migrated to \u003ca href\u003d\"http://contest.yandex.ru/ioi\"\u003eYandex.Contest\u003c/a\u003e (the system used for \u003ca href\u003d\"http://algorithm.contest.yandex.ru/\"\u003eYandex.Algorithm\u003c/a\u003e) with help of \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/lperovskaya\" title\u003d\"Expert lperovskaya\"\u003elperovskaya\u003c/a\u003e. It still supports all of the above, but the registration is open for everyone and IOI 2015 is available there. Feel free to join!\u003c/p\u003e\u003cp\u003eUnfortunately, it\u0027s still a beta version and there are still some issues: no problem statements are visible in the interface, some labels may be in Russian only and graders for Pascal and Java may be non-working in some problems (C++ should work everywhere, though). Note that we use slightly different conventions for graders from what was on IOI (for the sake of consistency among all IOIs). You can download an archive with example solutions by clicking on the \u0026quot;Download\u0026quot; button right to the \u0026quot;Jury messages\u0026quot; link. If the button is not here, there is no archive with example solutions yet, but the format of graders should be very similar among all problems and we didn\u0027t change signatures of functions from IOI, so it should be fairly easy to \u0026quot;restore\u0026quot; the format.\u003c/p\u003e\u003cp\u003eI hope that will help all of you who are preparing for upcoming IOIs! By the way, if you have not advanced to IOI this year, I would highly recommend you to avoid reading several IOIs so you will have good problems preparing for IOI next year. It\u0027s hard to find good IOI-like problems.\u003c/p\u003e\u003c/div\u003e","tags":["ioi","judge","online judge"]}}