{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1521467158,"rating":72,"authorHandle":"innopolis","modificationTimeSeconds":1521475758,"id":58457,"title":"\u003cp\u003eУниверситет Иннополис поздравляет Codeforces! И приглашает в бакалавриат и магистратуру!\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cb\u003eПривет, Codeforces!\u003c/b\u003e\u003c/p\u003e \u003cp\u003e\u003ci\u003eУниверситет Иннополис рад поддержать Codeforces и спортивное программирование в лице платформы. Наш университет активно участвует в соревнованиях ACM-ICPC, проводит локальные сборы и олимпиады по программированию. Мы рады поздравить всех участников сообщества с 8-летием площадки! Живите долго и процветайте!\u003c/i\u003e\u003c/p\u003e \u003cp\u003e\u003ci\u003eПользуясь случаем, хотим напомнить о себе и рассказать об успехах за последние три года. Бонусом вы узнаете, как бесплатно учиться в Университете Иннополис и новых программах магистратуры. Поехали!\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/7d/a8/7da8850b7575b6c3a34bd1eaf430900e7be68e1b.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch2\u003e\u003cbr /\u003e Welcome to the youngest city in Russia!\u003c/h2\u003e\u003cp\u003eИннополис – самый молодой город в России, расположенный в 40 км от Казани. Вот уже 5 лет здесь творится настоящая история в российском ИТ-мире — город быстро развивается, привлекая профессионалов в сфере информационных и высоких технологий. Сейчас в городе работают уже 3500 первоклассных ИТ-специалистов, реализуя смелые инновационные проекты. \u003c/p\u003e\u003ch3\u003eStudy IT and Robotics in Innopolis University!\u003c/h3\u003e\u003cp\u003eУниверситет остается центром инновационной работы – исследований, изобретений и подготовки специалистов для ИТ-индустрии. На базе Университета команды ученых совместно со студентами создают уникальные вещи – сервис беспроводной зарядки электротранспорта, сверхбыстрый метод моделирования белковых взаимодействий, благодаря которому, например, можно ускорить разработку вакцин и лекарств – это неоценимые возможности для лечения тяжелых заболеваний. Из последних достижений, которыми мы гордимся – беспилотная система управления КАМАЗами. Вскоре такие огромные машины будут ездить без водителей!\u003c/p\u003e\u003cp\u003eСейчас мы активно отбираем абитуриентов на 2018-2019 учебный год. Подать заявку: \u003ca href\u003d\"https://apply.innopolis.ru/get-in/?utm_source\u003dcodeforces\u0026amp;utm_medium\u003dpost\u0026amp;utm_term\u003dcodeforc\u0026amp;utm_content\u003dmaster17-18\u0026amp;utm_campaign\u003dwave_4\"\u003ehttps://apply.innopolis.ru\u003c/a\u003e\u003c/p\u003e\u003ch3\u003eChoose your pass with IU!\u003c/h3\u003e\u003cp\u003eЕсли ты только заканчиваешь школу и выбираешь ИТ- вуз, то советуем присмотреться к нашей программе бакалавриата \u0026quot;\u003ca href\u003d\"https://apply.innopolis.ru/bachelor/computer-science/?utm_source\u003dcodeforces\u0026amp;utm_medium\u003dpost\u0026amp;utm_term\u003dcodeforc\u0026amp;utm_content\u003dmaster17-18\u0026amp;utm_campaign\u003dwave_4\"\u003eИнформатика и вычислительная техника\u003c/a\u003e\u0026quot;. Ты будешь изучать самые современные направления в ИТ – робототехнику, большие данные и выбрать другие интересные тебе предметы из 84 курсов Университета!\u003c/p\u003e\u003ch3\u003eBoost your career in IT!\u003c/h3\u003e\u003cp\u003eЕсли ты уже состоявшийся спец в ИТ, но чувствуешь, что хочется чего-то нового, большего и крутого, то тебе подойдет одна из программ нашей магистратуры:\u003c/p\u003e \u003col\u003e \u003cli\u003e\u003ca href\u003d\"https://apply.innopolis.ru/master/software-engineering/?utm_source\u003dcodeforces\u0026amp;utm_medium\u003dpost\u0026amp;utm_term\u003dcodeforc\u0026amp;utm_content\u003dmaster17-18\u0026amp;utm_campaign\u003dwave_4\"\u003eУправление разработкой ПО\u003c/a\u003e;\u003c/li\u003e \u003cli\u003e\u003ca href\u003d\"https://apply.innopolis.ru/master/the-development-of-secure-systems-and-networks/?utm_source\u003dcodeforces\u0026amp;utm_medium\u003dpost\u0026amp;utm_term\u003dcodeforc\u0026amp;utm_content\u003dmaster17-18\u0026amp;utm_campaign\u003dwave_4\"\u003eРазработка безопасных систем и сетей\u003c/a\u003e;\u003c/li\u003e \u003cli\u003e\u003ca href\u003d\"https://apply.innopolis.ru/master/management-of-big-data/?utm_source\u003dcodeforces\u0026amp;utm_medium\u003dpost\u0026amp;utm_term\u003dcodeforc\u0026amp;utm_content\u003dmaster17-18\u0026amp;utm_campaign\u003dwave_4\"\u003eУправление большими данными\u003c/a\u003e;\u003c/li\u003e \u003cli\u003e\u003ca href\u003d\"https://apply.innopolis.ru/master/robotics/?utm_source\u003dcodeforces\u0026amp;utm_medium\u003dpost\u0026amp;utm_term\u003dcodeforc\u0026amp;utm_content\u003dmaster17-18\u0026amp;utm_campaign\u003dwave_4\"\u003eРобототехника\u003c/a\u003e.\u003c/li\u003e \u003c/ol\u003e\u003ch3\u003eReady to join IU team?\u003c/h3\u003e\u003cp\u003eУчиться в Университете Иннополис можно (и нужно!) совершенно бесплатно за счет образовательного гранта. \u003cimg height\u003d\"50%\" src\u003d\"https://apply.innopolis.ru/images/how_to_apply.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" width\u003d\"50%\" /\u003e\u003c/p\u003e\u003cp\u003eПри успешном прохождении отбора \u003cstrong\u003eабитуриент получает 100% грант на обучение и ежемесячную стипендию – от 12 до 42 тысяч рублей\u003c/strong\u003e.\u003c/p\u003e\u003ch3\u003eIt’s cool to study at IU!\u003c/h3\u003e \u003cul\u003e \u003cli\u003e\u003cstrong\u003eИнтенсивное обучение на английском языке\u003c/strong\u003e. Помогает быстро прокачать язык и свободно читать иностранные источники, чтобы быть в курсе самых последних трендов в мире ИТ.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eЛучшие российские ученые и исследователи, а также профессора из ТОП-100 мировых университетов\u003c/strong\u003e. P.S. вы сможете побывать на лекциях профессора Анджело Мессина — отставного генерала Итальянской армии, который служил в составе групп войск НАТО\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eСтажировки – часть образовательной программы\u003c/strong\u003e. Студенты работают над реальными проектами компаний-партнеров, таких как Mail.ru Group, АкБарс групп, Касперский и многие другие.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eТрудоустройство в топовых IT компаниях\u003c/strong\u003e: 169 выпускников 2017 года получили 284 приглашения на работу от компаний-партнеров: Сбербанк-технологии, МТС, Яндекс, Cognitive Technologies, Postgres Pro, Visiology, СКБ контур, ICL, Открытая мобильная платформа и др.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eМеждународный обмен\u003c/strong\u003e расширяет кругозор, позволяет завести полезные знакомства или найти будущих инвесторов.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eКрутые мероприятия и приглашенные спикеры\u003c/strong\u003e. Успешные бизнесмены, программисты, менеджеры и просто необычные люди охотно делятся своим опытом с нашими студентами. Так, в 2016 году хакер Ares, знакомый с Эдвардом Сноуденом, давал мастер-класс по взлому сети.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eИз кампуса до университета за 2 минуты по теплому переходу\u003c/strong\u003e. Интеллектуальная жизнь студентов невероятно насыщена. Поэтому всё в городе организовано так, чтобы нашим будущим и настоящим спецам было максимально комфортно. Все студенты живут в современном кампусе, а необходимая инфраструктура – новый медицинский центр, магазины, атмосферные рестораны — в пешей доступности.\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003eSee you\u003c/h3\u003e\u003cp\u003eА ещё в Иннополисе просто очень красиво, безопасно и позитивно — ведь когда работаешь с людьми, близкими по духу и ценностям, когда делаешь сложную и интересную работу, когда вносишь вклад в инновационное развитие своей страны – разве это не окрыляет?\u003c/p\u003e\u003cp\u003eКак видите, будущее России создается здесь и сейчас. И вы можете \u003ca href\u003d\"https://apply.innopolis.ru/get-in/?utm_source\u003dcodeforces\u0026amp;utm_medium\u003dpost\u0026amp;utm_term\u003dcodeforc\u0026amp;utm_content\u003dmaster17-18\u0026amp;utm_campaign\u003dwave_4\"\u003eприсоединиться к нам\u003c/a\u003e и стать его частью!\u003c/p\u003e\u003c/div\u003e","tags":["иннополис","codeforces"]}}