{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1427806852,"rating":23,"authorHandle":"innopolis","modificationTimeSeconds":1427908485,"id":17220,"title":"\u003cp\u003eУниверситет Иннополис проводит конкурс-отбор талантливых студентов IT-специальностей\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003e\u003cem\u003eМы рады возможности поздравить вас с пятилетием! Codeforces — замечательная соревновательная и учебная площадка для всех тех, кто интересуется алгоритмами и структурами данных. Нам приятно поддержать Codeforces. Желаем процветать, радовать нас раундами и с нетерпением ждем интересных нововведений. Ура!\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eПользуясь, обещанной возможностью рассказать о себе в посте, мы обращаемся к вам.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eНедалеко от Казани появился новый российский город — \u003ca href\u003d\"http://innopolis.ru/\"\u003eИннополис\u003c/a\u003e. Это проект международного уровня с ключевой специализацией на высокие технологии. Здесь идет создание экосистемы для привлечения лучших специалистов из области высоких технологий для рождения и реализации смелых инновационных идей, которые в дальнейшем станут основой инновационного развития России. Перспективная численность города — 150 000 человек. \u003c/p\u003e\u003cp\u003eИнтеллектуальным ядром города стал IT-университет, который специализируется на подготовке высококвалифицированных кадров в области современных информационных технологий. Международный статус университета позволяет привлекать преподавателей из TOP-100 университетов мира для обучения студентов, а программы обмена дают возможность получать знания в ведущих IT-университетах мира: \u003c/p\u003e \u003cul\u003e   \u003cli\u003eCarnegie Mellon University (№3, QS World University Rankings by Subject 2014 — Computer Science \u0026amp; Information Systems)\u003c/li\u003e   \u003cli\u003eETH Zurich\u003c/li\u003e   \u003cli\u003eНациональный университет Сингапура (National University of Singapore)\u003c/li\u003e   \u003cli\u003eУниверситет Амстердама (University of Amsterdam, Нидерланды)\u003c/li\u003e   \u003cli\u003eKAIST (Korea Advanced Institute of Science and Technology, Республика Корея)\u003c/li\u003e   \u003cli\u003eМиланский политехнический университет (Polytechnic University of Milan, Италия)\u003c/li\u003e   \u003cli\u003eИнститут EURECOM (Франция)\u003c/li\u003e \u003c/ul\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/0b/69/0b69495a76fb89e25357d75009098e11bb608a7e.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eВ этом году \u003ca href\u003d\"http://university.innopolis.ru/?utm_source\u003dcodeforces\u0026amp;utm_medium\u003dpost\u0026amp;utm_campaign\u003dcf_cup\"\u003eУниверситет Иннополис\u003c/a\u003e проводит отбор талантливых студентов IT-специальностей на учебные программы бакалавриата (3-4 курс) и магистратуры. Всё обучение проходит на английском языке и по окончании Университет гарантирует выпускникам трудоустройство в компаниях-партнерах. При успешном прохождении отбора студент получает грант, который покрывает до 100% стоимости обучения. Студенты Университета живут на территории современного кампуса и получают стипендию от 12 до 36 тысяч рублей в месяц. Вот наши учебные программы, которые дают хорошее представление о том, что стоит ждать \u003c/p\u003e\u003ch3\u003eУчебная программа бакалавриата (3-4 курс)\u003c/h3\u003e\u003cp\u003eУчебная программа бакалавриата длится 2 года и предназначена для студентов не младше 2 курса или дипломированных специалистов. В первый год обучения она состоит из фундаментальных IT-дисциплин: \u003c/p\u003e \u003col\u003e   \u003cli\u003eAlgorithms and Data Structures — ADS\u003c/li\u003e   \u003cli\u003eTheory of computation — TOC\u003c/li\u003e   \u003cli\u003eObject-oriented Programing\u003c/li\u003e   \u003cli\u003eSoftware Architecture\u003c/li\u003e   \u003cli\u003eOperating Systems and Networks\u003c/li\u003e   \u003cli\u003eDiscrete Math/Logic\u003c/li\u003e   \u003cli\u003eData Modeling and Databases\u003c/li\u003e   \u003cli\u003ePhilosophy\u003c/li\u003e   \u003cli\u003eEnglish Language\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eНа второй год можно по желанию выбрать курсы по специализациям: \u003c/p\u003e\u003ch4\u003e1. Software Engineering\u003c/h4\u003e\u003cp\u003eНа этой специальности студенты изучают построение компиляторов (Compiler Construction), проектирование программного обеспечения (Software Design), его документирование и разработку. \u003c/p\u003e\u003ch4\u003e2. Artificial Intelligence\u003c/h4\u003e\u003cp\u003eКурс по искусственному интеллекту включает в себя такие дисциплины, как: \u003c/p\u003e \u003cul\u003e   \u003cli\u003eMachine Learning\u003c/li\u003e   \u003cli\u003eAffective Computing\u003c/li\u003e   \u003cli\u003eComputer Vision\u003c/li\u003e   \u003cli\u003eArtificial Cognitive Systems\u003c/li\u003e   \u003cli\u003eProcedural Content Generation For Games\u003c/li\u003e   \u003cli\u003eComputational intelligence\u003c/li\u003e \u003c/ul\u003e\u003ch4\u003e3. Big Data\u003c/h4\u003e\u003cp\u003eТрендовое направление по анализу больших данных представлено следующими программами: \u003c/p\u003e \u003cul\u003e   \u003cli\u003eSocial Network Analysis\u003c/li\u003e   \u003cli\u003eInformation retrieval\u003c/li\u003e   \u003cli\u003eMining Large-scale Data\u003c/li\u003e   \u003cli\u003eStatistical Analysis of Big Data\u003c/li\u003e   \u003cli\u003eAdvanced Statistics and Time Series Analysis with IT Applications\u003c/li\u003e   \u003cli\u003eStatistical Decision Theory\u003c/li\u003e \u003c/ul\u003e\u003ch4\u003e4. Robotics\u003c/h4\u003e\u003cp\u003eПопулярный курс начинается с введения в робототехнику, затем студенты учатся создавать и программировать своих роботов. \u003c/p\u003e\u003ch3\u003eУчебная программа магистратуры\u003c/h3\u003e\u003cp\u003eМагистратура Университета Иннополис – это программа в сфере информационных технологий по направлениям Software Engineering, Cyber Security, Data Sciences, Robotics для молодых специалистов и инженеров-разработчиков, которые созданы совместно с ведущими университетами мира – партнерами Университета. Подготовка по учебным программам ведется на центральной площадке Университета в городе Иннополис и на площадках университетов-партнеров в США, Азии и Европе. \u003c/p\u003e\u003cp\u003eУчебные программы магистратуры включают более 40% практики, чаще всего в форме командных проектов, которые встраиваются в каждый учебный курс. Заказчиком финального проекта является внешняя компания. Команда студентов разрабатывает программное решение с нуля, проходя все стадии, начиная от сбора и обработки требований, заканчивая финальным тестированием и сдачей заказчику, включая построение архитектуры и написание тестов. Таким образом, студенты сразу применяют теоретические знания на практике.\u003c/p\u003e\u003ch3\u003eКак стать студентом Университета Иннополис\u003c/h3\u003e\u003cp\u003eУниверситет Иннополис проводит серию IT-уикэндов Innopolis Cup — конкурс-отборов студентов IT-специальностей. Участники конкурса проведут 2 дня в Иннополисе — городе будущего, который находится в 30 км от Казани. За это время они пройдут собеседование с представителями лучших IT-компаний России, а ведущие преподаватели университета проведут с ними интервью на английском языке. Участники также поучаствуют в групповом тренинге на выявление ключевых IT-компетенций и сыграют в командную игру. \u003c/p\u003e\u003cp\u003eПо итогам уикэнда среди победителей мы разыграем смартфон YotaPhone 2 — первый в мире смартфон с двумя экранами!\u003c/p\u003e\u003ch3\u003eУсловия участия\u003c/h3\u003e \u003cul\u003e   \u003cli\u003eВозраст от 18 до 27 лет;\u003c/li\u003e   \u003cli\u003eЗнание языков программирования;\u003c/li\u003e   \u003cli\u003eАнглийский язык на уровне Intermediate и выше.\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003eБесплатно\u003c/h3\u003e \u003cul\u003e   \u003cli\u003eТрансфер из Казани до места проведения конкурса Innopolis Cup;\u003c/li\u003e   \u003cli\u003e3-х разовое питание и проживание в комфортабельном кампусе на территории города Иннополис.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eДля участия в Innopolis Cup регистрируйтесь на сайте \u003ca href\u003d\"http://cup.innopolis.ru/?utm_source\u003dcodeforces\u0026amp;utm_medium\u003dpost\u0026amp;utm_campaign\u003dcf_cup\"\u003ecup.innopolis.ru\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e \u003cbr /\u003e \u003c/p\u003e\u003cp style\u003d\"text-align: center;\"\u003e \u003ca href\u003d\"http://cup.innopolis.ru/?utm_source\u003dcodeforces\u0026amp;utm_medium\u003dpost\u0026amp;utm_campaign\u003dcf_cup\" style\u003d\"background-color: rgb(103,174,115);padding: 0.35em;font-size: 30.0px;color: white;\"\u003eЗарегистрироваться »\u003c/a\u003e \u003c/p\u003e \u003cbr /\u003e \u003cbr /\u003e\u003c/div\u003e","tags":["иннополис","с днем рождения"]}}