{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1499979531,"rating":274,"authorHandle":"ltaravilse","modificationTimeSeconds":1499979531,"id":53288,"title":"\u003cp\u003eDiscrimination on the programming contest community\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI\u0027ve been thinking of this lately, and I realized that we can\u0027t allow this to keep happening. There is a serious discrimination problem in the programming contest community and we can\u0027t act as if it doesn\u0027t happen.\u003c/p\u003e\u003cp\u003eThe first problem I saw was the IOI in Iran, a country that discriminates people according to their religion. How many of you know that Jewish people can\u0027t enter into Iran? What does it mean? If you are Jewish, just for your religious beliefs, you can\u0027t go to the IOI.\u003c/p\u003e\u003cp\u003eThat was the first thing I noticed that I think is a serious problem, but then I saw something else, that I felt that I had to share with all the community, and ask everyone in the competitive programming community to please share with everyone and try, all together, to see if we can make the people in charge of this to make a decision that changes this horrible discriminative situation.\u003c/p\u003e\u003cp\u003eI was in Cuba in the last three weeks. I was in charge of the Caribbean Training Camp for competitive programming. I\u0027ve been in several events like this in a lot of places in Latin America and I can say for sure that there\u0027s no other place in Latin America were people make as much effort and dedication as they do in Cuba. They all want to improve, to be everyday better than the day before, and they do a very big effort to make their competitive programming community get stronger. \u003c/p\u003e\u003cp\u003eThere are 24 universities in Cuba that have degrees related to informatics and computer sciences, all of them send teams to the ACM ICPC. In my three weeks in Cuba they made me feel like I was at home, they did for me a lot of things that it\u0027s very hard to do them for their own because of the situation they have in Cuba, specially the economic situation. And no matter what, they always give more than what they have, not only for me, but for everyone who tries to help them.\u003c/p\u003e\u003cp\u003eI made a lot of very good friends there, and one day I asked one of them how did he do on the last Google Code Jam, and his answer was the worst possible answer I could expect: Cuban people are not allowed to compete on Google Code Jam. They are also not allowed to compete in a lot of other programming contests, and there are many contests where they can compete but not receive prizes if they win.\u003c/p\u003e\u003cp\u003eI don\u0027t care if Donald Trump, Barack Obama or George Bush are angry with Fidel and Raúl Castro, they are just the Cuban politicians, and the Cuban people don\u0027t have to pay for their president\u0027s mistakes. I also know that politicians, specially in the US, don\u0027t care about people outside their country, they make their people believe that they are the heroes and all the other people in the world are villains (specially if they have some political rivalry or if they have oil and need to be invaded like what happened in Afghanistan or Irak) and people, sadly, believe what they say, but why the big companies, that host this kind of events, like Google does, have to act according to their politicians interests?\u003c/p\u003e\u003cp\u003eI feel ashamed that this very nice community that I feel part of, is allowing this kind of things to happen, and I can\u0027t stand it. So I ask all of you, competitive programmers, to please, help me ask every organizer of a programming contest to stop harassing the Cuban people, and tell everybody about what they are doing.\u003c/p\u003e\u003cp\u003eIf you ignore this situation, you are helping this happen.\u003c/p\u003e\u003c/div\u003e","tags":[]}}