{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1505363826,"rating":45,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1505397359,"id":54518,"title":"\u003cp\u003eТехнокубок 2018 — олимпиада по программированию для школьников\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/technocup-2016-banner.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eMail.Ru Group совместно с МФТИ, МГТУ им. Н. Э. Баумана и Codeforces в третий раз запускает Технокубок — совместную олимпиаду по программированию для школьников. В этом учебном году олимпиада вошла в перечень олимпиад школьников, повысив свой уровень до второго — круг учебных заведений, дающих льготы победителям и призерам, значительно расширился. Лучшие участники получат ценные призы от компании Apple.\u003c/p\u003e\u003cp\u003eСразиться за звание самого талантливого молодого программиста приглашаются учащиеся средних образовательных учреждений 8 — 11 классов.\u003c/p\u003e\u003cp\u003eПобедители и призеры олимпиады будут определены по результатам очного этапа, который будет проведен в Москве весной 2018 года на базе площадок МГТУ им. Н.Э.Баумана и МФТИ. \u003cbr /\u003e\u003c/p\u003e\u003ch2\u003eЭтапы соревнования\u003c/h2\u003e\u003ch4\u003eОзнакомительные раунды\u003c/h4\u003e \u003cul\u003e   \u003cli\u003e14 сентября 15:00 — 17 сентября 15:00\u003c/li\u003e   \u003cli\u003e12 октября 10:00 — 15 октября 10:00\u003c/li\u003e   \u003cli\u003e9 ноября 18:00 — 12 ноября 18:00\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eУ участников олимпиады будет возможность ознакомиться с платформой Codeforces. Для участия в онлайн — этапе, решение задач ознакомительного раунда не обязательно.\u003c/p\u003e\u003ch4\u003eОтборочные (онлайн) этапы\u003c/h4\u003e \u003cul\u003e   \u003cli\u003eпервый отборочный раунд: 17 сентября 16:05 — 18:05\u003c/li\u003e   \u003cli\u003eвторой отборочный раунд: 15 октября 11:05 — 13:05\u003c/li\u003e   \u003cli\u003eтретий отборочный раунд: 12 ноября 19:05 — 21:05\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eПользователи могут участвовать как и в первом, так и во втором онлайн-раунде. Лучшие участники каждого из онлайн-раундов будут приглашены к участию в заключительном этапе, но не более 45% от общего числа участников раунда. Приглашенные в заключительный этап должны подтвердить желание и возможность участия в нем. В случае отсутствия подтверждения, жюри может пригласить следующего участника по результатам соответствующего онлайн-раунда.\u003c/p\u003e\u003cp\u003eКоличество отборочных раундов может быть увеличено.\u003c/p\u003e\u003ch4\u003eЗаключительный (очный) этап в МГТУ им. Н. Э. Баумана и МФТИ, февраль-март 2018 года\u003c/h4\u003e\u003cp\u003eЗаключительный этап будет проходить очно на площадках вузов. Участники, прошедшие онлайн-этап, побывают в лучших технических вузах страны и смогут получить ответы на вопросы по поводу поступления. Награждение пройдет в в офисе Mail.Ru Group. Победители и призеры олимпиады познакомятся со специалистами крупнейшей IT-компании в России, а также узнают про возможности карьерного роста в IT-сфере для абитуриентов МФТИ и МГТУ им. Н. Э. Баумана. Проживание и проезд осуществляется за счет участников. При наличии возможности по решению Оргкомитета возможна частичная оплата расходов на проживание. Для остальных мы подберем рекомендации по проживанию за невысокую цену близ площадок вузов.\u003c/p\u003e\u003ch2\u003eПризы\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eЛьготы:\u003c/strong\u003e \u003cbr /\u003e Олимпиада школьников «Технокубок» включена в Перечень олимпиад школьников, дающих льготы при поступлении в высшие учебные заведения РФ.\u003c/p\u003e\u003cp\u003eВсего будут награждены не более трети участников заключительного этапа.\u003c/p\u003e\u003cp\u003eЦенные призы:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e1 место iPad air 2 + Технокубок\u003c/li\u003e   \u003cli\u003e2 место iPod nano\u003c/li\u003e   \u003cli\u003e3 место iPod shuffle\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eРегистрация уже началась\u003c/strong\u003e и проходит на сайте \u003ca href\u003d\"https://technocup.mail.ru\"\u003ehttps://technocup.mail.ru\u003c/a\u003e. Официальная группа Вконтакте: \u003ca href\u003d\"http://vk.com/techno_cup\"\u003ehttp://vk.com/techno_cup\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eСразитесь за звание самого талантливого молодого программиста и за право стать первым обладателем Технокубка!\u003c/p\u003e\u003cp\u003eОлимпиада проходит по правилам раундов Codeforces.\u003c/p\u003e\u003cp\u003e\u003csmall\u003e Чемпионат Технокубок входит в число инициатив Mail.Ru Group, направленных на развитие российской IT-отрасли и объединённых ресурсом It.Mail.Ru. Платформа It.Mail.Ru создана для тех, кто увлекается IT и стремится профессионально развиваться в этой сфере. Проект объединяет чемпионаты Russian AI Cup, Russian Code Cup и Russian Developers Cup, образовательные проекты Технопарк в МГТУ им. Баумана, Техносфера в МГУ им. М.В. Ломоносова и Технотрек в МФТИ. Кроме того, на It.Mail.Ru можно с помощью тестов проверить свои знания по популярным языкам программирования, узнать важные новости из мира IT, посетить или посмотреть трансляции с профильных мероприятий и лекции на IT-тематику. \u003c/small\u003e\u003c/p\u003e\u003ch2\u003eОрганизаторы олимпиады\u003c/h2\u003e\u003cp\u003e\u003ca href\u003d\"https://mipt.ru/\" title\u003d\"Московский физико-технический институт\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/mipt-logo.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003cbr /\u003e \u003csmall\u003eМосковский физико-технический институт\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://www.bmstu.ru/\" title\u003d\"Московский Государственный Технический Университет им. Н. Э. Баумана\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/bmstu-logo.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003cbr /\u003e \u003csmall\u003eМосковский Государственный Технический Университет им. Н. Э. Баумана\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://it.mail.ru/\" title\u003d\"IT.Mail.Ru\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/itmailru-logo.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003cbr /\u003e \u003csmall\u003eIT.Mail.Ru\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/\" title\u003d\"Codeforces\"\u003e\u003cimg src\u003d\"/predownloaded/26/ea/26ea5e302c92ac6af3552f05b98f0117b6cd4317.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003cbr /\u003e \u003csmall\u003eCodeforces\u003c/small\u003e\u003c/p\u003e\u003cp\u003eПобедители и призеры олимпиады будут определены по результатам очного этапа, который будет проведен в Москве.\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["мэйлру","mail.ru","мфти","бауманка","мгту им баумана","мгту","технокубок","для школьников"]}}