{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1467968989,"rating":53,"authorHandle":"Namnamseo","modificationTimeSeconds":1467968989,"id":45943,"title":"\u003cp\u003eLibraries \u0026amp; tools for preparing data?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eEveryday, problems (for competitive programming) are made — and so are the datas.\u003c/p\u003e\u003cp\u003eI\u0027ve seen tons of problems involvig a graph, directed or undirected, cyclic or acyclic, weighted or unweighted, dense or sparse, random or having some special requirements (i.e. perfect, cactus, scorpion, etc.). And preparing testcases for such problems inevitably involve building such graph. Also, there are so many problems involving trees, strings, arrays, and points on 2D or 3D space.\u003c/p\u003e\u003cp\u003eI learned a few tricks for making such datas, including making a connected graph by first building its spanning tree, putting a few special trees(all points lying on a line, \u0027sea urchin\u0027 trees, sqrt(N) vertices having sqrt(N) neighbors) to cut out some suboptimal solutions, and such. \u003cem\u003e(Put it the other way, take a look at APIO 2013, the third task.)\u003c/em\u003e\u003c/p\u003e\u003cp\u003eBut somehow, it feels tedious to code the same things every time(yes, I\u0027m being lazy here), and I believe there are many ideas we can share to make the testcases better (and harder). I googled a little bit, but it seems there aren\u0027t one that\u0027s well-maintained.\u003c/p\u003e\u003cp\u003eI think it\u0027d be good to have one that:\u003c/p\u003e \u003cul\u003e   \u003cli\u003ecan be run directly as a tool, or can be used as a library;\u003c/li\u003e   \u003cli\u003eprovides templates for common structures and constraints;\u003c/li\u003e   \u003cli\u003eits outputs should be easily formattable;\u003c/li\u003e   \u003cli\u003ecustom constraints can be easily added;\u003c/li\u003e   \u003cli\u003eis open-source and well-maintained\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIs there any?\u003c/p\u003e\u003c/div\u003e","tags":["preparing problems","library"]}}