{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1503912378,"rating":90,"authorHandle":"gKseni","modificationTimeSeconds":1504884644,"id":54114,"title":"\u003cp\u003eBarcelona Bootcamp — Teams and Sponsorship update\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/a6/1b/a61be4b7ba01cf0feb68d6e5e00eb9d467fe8519.png\" style\u003d\"float: right;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eFor the last 6 years the world titles have been won only by St Petersburg teams – ITMO and St. Petersburg State University – both universities will bring their top teams to \u003ca href\u003d\"http://in.harbour.space/icpc/acm-icpc-hello-barcelona-bootcamp-autumn-2017/?utm_source\u003dCodeforces\"\u003e2nd Hello Barcelona Programming Bootcamp in collaboration with Moscow Workshops ACM ICPC\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe event runs from Sept 27 to Oct 5 – but how to get the most out of the camp? \u0026quot;I think there is no universal solution for \u0026quot;get the most out of a camp\u0026quot; – everyone should find their own path, but the general guideline will be: communicate with other participants as much as you can, make sure you do upsolving (at least some), keep track of how much you sleep,\u0026quot; said \u003ca href\u003d\"https://goo.gl/srpKTu\"\u003eGleb Evstropov\u003c/a\u003e, coach and coordinator of the programming committee.\u003c/p\u003e\u003cp\u003eSleeping could be somewhat challenging with all the famous Russian teams coming, which includes ITMO, St. Petersburg State University, MIPT, Ural Federal University, Tomsk, Novosibirsk, Saratov, Samara and Perm, as well as the rest of the world’s top universities such as USA’s highest placing team, Central Florida, along with Canada’s Waterloo, high-scoring Asian teams from Hangzhou Dianzi and Singapore, and Tokyo University, as well as Stockholm’s KTH among dozens of others – so far teams from 30 countries have signed up. \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/65/35/65359a6188d1a37fb5b228274d8fdcd973912fe8.png\" style\u003d\"margin-top: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e  \u003c/center\u003e\u003cp\u003eThe event’s Gold sponsor is \u003ca href\u003d\"http://www.sberbank.com/\"\u003eSberbank\u003c/a\u003e, the biggest commercial and investment bank of Eastern Europe and Russia, with over 170 years of history. Thanks to their support we expect that the top participants will be awarded valuable prizes, alongside high-profile internships and job opportunities. \u003cbr /\u003e\u003cbr /\u003e Not only are the participants top of the line – so are the coaches. \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/4d/35/4d353ba00428156ffa0a8bf36308090ad907b2b6.jpg\" style\u003d\"margin-top: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e  \u003c/center\u003e\u003cp\u003eCoach \u003ca href\u003d\"https://goo.gl/QV9GDu\"\u003eMikhail Tikhomirov\u003c/a\u003e – who will also be a coordinator of the programming committee for our camp, has coached MIPT to 4th and 5th spots in world finals and has worked on bootcamps for the last three years. \u0026quot;As a rule, we offer different programmes depending on attendees\u0027 experience, with focus on particular topics we consider useful, or on high-level competition preparation drill,\u0026quot; he described the days during the boot camp. \u0026quot;Regardless of the schedule, we put a lot of effort in providing detailed explanations of every topic and problem encountered. To our participants we recommend to put newly acquired theoretical knowledge to practice on yet uncracked problems, but also find some time to relax and just have fun!” You are coming to Barcelona. So the last part is sorted.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/cd/9e/cd9e3aee866e24a5fc6a24e27cc62a6295b50d2e.png\" style\u003d\"margin-top: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e  \u003c/center\u003e\u003cp\u003eOur silver sponsor, \u003ca href\u003d\"https://indeed.recruit-jinji.jp/en/project_profile/\"\u003eindeed Tokyo (Jointly established by Indeed, Inc. and Recruit Holdings)\u003c/a\u003e, is the #1 job site worldwide, with over 200 million unique visitors per month. Since 2004, they have given job seekers free access to millions of jobs from thousands of company websites and job boards on a global scale. As the leading pay-for-performance recruitment advertising network, indeed Tokyo (Jointly established by Indeed, Inc. and Recruit Holdings) drives millions of targeted applicants to jobs in every field and is the most cost-effective source of candidates for thousands of companies. We are honored to have them be a part of this international event!\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/ab/c4/abc4d3fcb843a569caf57d7a9b9766a3cf21fdef.png\" style\u003d\"margin-top: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e  \u003c/center\u003e\u003cp\u003eFinally we are excited about our newest promotional partner, \u003ca href\u003d\"http://bit.ly/2iuJMkQ\"\u003eHeroX\u003c/a\u003e! They exist at the intersection of crowdsourcing, competition and social networking. The HeroX crowdsourcing platform is passionate and phenomenal at bringing together the global communities of problem solvers to deliver breakthrough solutions to social, economic, and strategic challenges. We are looking forward to sharing a platform with them in the coding community!\u003c/p\u003e\u003cp\u003eWe can’t wait to see all of you here to learn, practice and compete on the international stage, smoothing your road towards the April World Finals in Beijing.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e \u003c/p\u003e\u003ccenter\u003e \u003ca href\u003d\"https://goo.gl/Phei5d\" style\u003d\"font-size: 24.0px;\"\u003eRegister for the Barcelona 2nd Hello Barcelona ACM-ICPC Bootcamp\u003c/a\u003e \u003c/center\u003e \u003cbr /\u003e\u003cp\u003ePs. Registrations close on September 1.\u003c/p\u003e\u003c/div\u003e","tags":["harbourspace","barcelona","sberbank","indeed","herox","bootcamp"]}}