{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1511811428,"rating":33,"authorHandle":"DPR-pavlin","modificationTimeSeconds":1511814168,"id":56039,"title":"\u003cp\u003eОлимпиадные Школы МФТИ: отделение информатики\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем добрый день!\u003c/p\u003e\u003cp\u003eМеня зовут Филипп Рухович, и я являюсь методистом отделения информатики \u003ca href\u003d\"https://it-edu.mipt.ru/ru/school_olymp\"\u003eОлимпиадных школ МФТИ\u003c/a\u003e, проводимых \u003ca href\u003d\"https://it-edu.mipt.ru\"\u003eЦентром Развития ИТ-образования МФТИ\u003c/a\u003e. Проект Школ существует на Физтехе с 2013 года, и основной его целью является подготовка детей к олимпиадам. В этом году Зимняя Олимпиадная школа пройдёт на базе кампуса МФТИ с 4 по 14 января, и с 2 по 7 января в Казани, \u003ca href\u003d\"https://it-edu.mipt.ru/ru/school-olymp/winter-18-mipt-kfu\"\u003eна базе КФУ\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eВ школе существует множество направлений, одно из них — информатика, программой которого я занимаюсь. В этом посте мне бы хотелось рассказать пользователям codeforces.com о своем курсе. \u003c/p\u003e\u003cp\u003eНа направлении информатики существуют четыре группы разных уровней: \u003c/p\u003e\u003cp\u003e1) \u003cstrong\u003eГруппа С (\u0026quot;Си\u0026quot;)\u003c/strong\u003e направления \u0026quot;Математика + Информатика\u0026quot;. Эта группа подойдет для новичков, которые еще не умеют программировать. Входных знаний не предполагается, необходимо пройти тестирование по математике.\u003c/p\u003e\u003cp\u003e2) \u003cstrong\u003eГруппа “Алго”\u003c/strong\u003e направления \u0026quot;Математика + Информатика\u0026quot;. В этой группе проходить обучение стоит тем, кто владеет базовыми операторами, циклами и функциями языка С/C++ и/или любого другого распространенного языка программирования (Pascal/Delphi, Java, Python), но еще не имеет опыта решения задач по спортивному программированию. Здесь вы изучите основы динамического программирования, основы модульной арифметики и теории чисел, основы вычислительной геометрии, основы теории графов, а также базовые алгоритмы, применяемые в олимпиадах. Для прохождения в группу “Алго” необходимо сдать тестирование по математике и информатике. \u003c/p\u003e\u003cp\u003e3) \u003cstrong\u003eГруппа \u0026quot;Информатика Профи\u0026quot;\u003c/strong\u003e одноименного направления. Группа подойдет ребятам, которые владеют базовыми алгоритмами и уже имеют успешный опыт участия в олимпиадах. На занятиях изучаются продвинутые алгоритмы, динамическое программирование на подотрезках и по профилю, поиск минимального остовного дерева, деревья отрезков, базовые алгоритмы на строках (z-функция, префикс-функция, хэширование подстрок, бор). Для поступления в эту группу нужно проходить тестирование по информатике и математике.\u003c/p\u003e\u003cp\u003e4) \u003cstrong\u003eГруппа \u0026quot;Информатика Hard\u0026quot;\u003c/strong\u003e направления \u0026quot;Информатика Профи\u0026quot; будет интересна тем, кто добился внушительных успехов в спортивном программировании (например, призер или победитель Всероссийской олимпиады, Открытой олимпиады школьников и т.д.). На занятиях упор будет делаться на практику решения большого количества задач как школьного, так и студенческого уровня. Для попадания в группу нужно пройти тестирование по информатике и математике. \u003c/p\u003e\u003cp\u003eТаковы особенности каждого направления в отдельности; а теперь рассмотрим, что же у них общего:\u003c/p\u003e\u003cp\u003eа) Задания. Вне зависимости от группы, которую вы выберете, вы будете решать большое количество задач;\u003c/p\u003e\u003cp\u003eб) \u0026quot;Дорешка\u0026quot;. Задания можно решать не только во время непосредственно практических занятий, но и в любое время (кроме ночи, разумеется :) ). При этом вы можете дорешивать не только в общежитии, но и там, где проводились занятия. Более того, в это время в аудитории находится преподаватель (а чаще всего, и не один); ему можно задавать любые вопросы как по пройденному материалу, так и по другим темам; в частности, можно попросить разъяснить/повторить непонятные моменты в лекциях или помочь сдвинуться с мертвой точки при попытке решить задачу.\u003c/p\u003e\u003cp\u003eв) Гибкость программы. Программа обучения составляется на основании результатов вступительного тестирования: мы оцениваем знания будущих учеников Школы и вносим соответствующие коррективы в план занятий.\u003c/p\u003e\u003cp\u003eг) Олимпиада. На Школе традиционно проводится олимпиада по информатике. С 2017 года правила олимпиады приближены к правилам Всероссийской олимпиады школьников, что дает возможность потренироваться. \u003c/p\u003e\u003cp\u003eд) Требовательные, но при этом отзывчивые преподаватели (это верно для всех отделений Школы :) ). \u003c/p\u003e\u003cp\u003eе) Развлечения. На Школе есть как спортивные, так и вечерние мероприятия (вечера настольных игр, \u0026quot;Что? Где? Когда?\u0026quot; и многое другое), и конечно, научно-популярные лекции. \u003c/p\u003e\u003cp\u003eЧтобы попасть на отделение информатики Зимней Олимпиадной школы, нужно до 10 декабря пройти тестирование по информатике (кроме группы С) и математике. Подробную информацию о том, как это сделать, можно найти на \u003ca href\u003d\"https://it-edu.mipt.ru/ru/school-olymp/winter-18\"\u003eсайте\u003c/a\u003e. Ниже я расскажу о тестировании. \u003c/p\u003e\u003cp\u003eТестирование представляет собой контест из 13 задач; каждую из этих задач нужно сдать в тестирующую систему. Решение признается верным, если и только если оно прошло все тесты; в этом случае, решение получает вердикт ОК. Сложность задач варьируется: самые легкие задачи предназначены для начинающих, поступающих в группу Алго; самые сложные задачи предназначены уже для поступающих в группу \u0026quot;Информатика Hard\u0026quot;. Задачи можно решать в течение нескольких дней — дедлайном является время окончания тестирования. Однако как показывает практика, для поступления на желаемую (практически любую) параллель не обязательно решать все задачи. Тем не менее, рекомендуем решить как можно больше задач — это покажет ваш уровень знаний и целеустремленность. Задачи в контесте примерно упорядочены по сложности; тем не менее, может так оказаться, что следующая задача лично для вас окажется легче предыдущей. Поэтому обязательно читайте и пробуйте решать все задачи (к тому же на реальной олимпиаде, в условиях нехватки времени, очень большую службу может сослужить чтение всех задач и планирование своих действий).\u003c/p\u003e\u003cp\u003eУвидимся на школе!\u003c/p\u003e\u003c/div\u003e","tags":[]}}