{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1417475911,"rating":85,"authorHandle":"Psyho","modificationTimeSeconds":1417476478,"id":14958,"title":"\u003cp\u003eMarathon24 — Smallish write-up for CTF\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHey,\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/LeBron\" title\u003d\"Гроссмейстер LeBron\"\u003eLeBron\u003c/a\u003e asked me few questions about the \u003ca href\u003d\"http://marathon24.com\"\u003eMarathon24\u003c/a\u003e contest that finished during the last weekend, and since I thought that my answer could be slightly useful for more people I decided to do a blog post here, which I haven\u0027t done before, and I still find it strange that there\u0027s no forum :)\u003c/p\u003e\u003cp\u003eFor those who don\u0027t know who I am — I\u0027m \u003ca href\u003d\"http://psyho.gg\"\u003ePsyho\u003c/a\u003e and, apparently, some guy took my handle ;)\u003c/p\u003e\u003cp\u003eMy work throughout the contest was something like this:\u003c/p\u003e \u003cul\u003e   \u003cli\u003ewe saw that CTF had a \u0026quot;x2\u0026quot; multiplier, so this was a clear choice for the task for me; especially since it was longer, and the goal was that I\u0027ll solve a task that will have a complex visualization.\u003c/li\u003e   \u003cli\u003eshort solution for quick points: random walk for monsters (easiest to write, and should get much more points than random shooting)\u003c/li\u003e   \u003cli\u003emove monsters towards enemy snipers\u003c/li\u003e   \u003cli\u003eadd random walk for sniper for monster respawn (at this point, I believe I won most of the games I believe)\u003c/li\u003e   \u003cli\u003eadd visualization (where I discovered that I incorrectly parsed the given data, since some units were walking on walls).\u003c/li\u003e   \u003cli\u003eadd BFS for monsters, so that they can avoid obstacles\u003c/li\u003e   \u003cli\u003eadded some simple monster shooting for bonus points, but it turned out to be worthless\u003c/li\u003e   \u003cli\u003ethen I slowly started losing out to other people, so I took a longer break to think about the final strategy\u003c/li\u003e   \u003cli\u003eI scrapped all of my logic (it was still under 100 lines), and I implemented a bit more complex sniper logic (monster logic was left intact for the whole contest) — basically the idea was to steal the closest flag, and move towards the cell that maximized some simple scoring function (avoiding getting dead was a priority, getting closer to flag was secondary). After stealing all 5 flags return them to base and repeat (this didn\u0027t happen too often, I guess a bit less than once on average, but sometimes it happened 3-4 times with a bit of luck).\u003c/li\u003e   \u003cli\u003eadd more stuff to visualizer which was complete at that time\u003c/li\u003e   \u003cli\u003elastly I was in the loop: look at visualizer, find an obvious mistake, correct it\u003c/li\u003e   \u003cli\u003eadd a very simple manual interface, where I could click on a tile, and it changed the current target cell. Useful for forcing sniper to return flags earlier, adding a way-point or changing a target flag. Although to be honest, I have used it very sparingly.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIn the end, I spent probably around 3h on coding the logic, which is an usually short time for such contest. The reason is that I was still horribly jetlagged after TCO and that I had no motivation when looking at the scoreboard :) I knew that my solution suddenly won\u0027t stop losing, since this strategy was rather independent of what other players are doing. \u003c/p\u003e\u003cp\u003eFew very good ideas that I haven\u0027t implemented:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eIf you\u0027re surrounded by your monsters you\u0027re invincible without enemy snipers. If you hide in the corner with 5 flags, and surround yourself with monsters (leaving 2 empty cells, so you can move back and forth to spawn new monsters). The only catch is that you have to actually carefully select the flags of active players (which I forgot to do). This was my #1 on TODO list. If you stole the flags from \u0026quot;best\u0026quot; players, and no one else did that, that was by far a winning strategy by a rather wide margin (at least for CTF2).\u003c/li\u003e   \u003cli\u003eMonsters should ideally approach enemies from the back — even avoiding line of sight as tie-breaker for moving, should improve things greatly.\u003c/li\u003e   \u003cli\u003eYou could move around with monsters as \u0026quot;blockers\u0026quot;. Unfortunately, this is a very hard thing to implement and it\u0027s not clear if this would improve overall results, since you would need few monsters to help you, so there are fewer monsters left for attacking snipers.\u003c/li\u003e   \u003cli\u003eI didn\u0027t visualize the \u0026quot;sensing\u0026quot; of monsters which could be useful. Unfortunately, the strategy of avoiding big number of monsters, was usually defeated by a sniper that randomly spawned near you.\u003c/li\u003e   \u003cli\u003eI didn\u0027t calculate when near monster should spawn. This could\u0027ve slightly improved my survivability.\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"http://pastebin.com/pLMyBsVm\"\u003eMy code\u003c/a\u003e (with my libraries and visualization removed, since it\u0027s a work of our whole team and sharing it, would be inappropriate).\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cem\u003eP.S. I guess you are not very often guest at CodeForces, and not reading all the blogs, so you might have missed this message — \u003ca href\u003d\"//codeforces.com/blog/entry/14753#comment-197383\"\u003ehttp://codeforces.com/blog/entry/14753#comment-197383\u003c/a\u003e :)\u003c/em\u003e\u003c/p\u003e\u003cp\u003eI hope I\u0027ll do it someday. I had bigger plans for the whole blog (I wanted to create a series of posts for newcomers for competitive programming and also some tips\u0026amp;tricks for practicing), but unfortunately life and laziness got into my way. I can\u0027t promise, but it\u0027s on my several-pages long TODO list :)\u003c/p\u003e\u003cp\u003eFeel free to ask questions.\u003c/p\u003e\u003c/div\u003e","tags":["marathon24","winter"]}}