{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1513859366,"rating":195,"authorHandle":"fcspartakm","modificationTimeSeconds":1513898114,"id":56527,"title":"\u003cp\u003eCodeforces: Copying of Contests and Gyms\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello!\u003c/p\u003e\u003cp\u003eIn this post I will talk about recent innovation in Codeforces.\u003c/p\u003e\u003cp\u003eIt is noticed that many coaches used the opportunity to change the start of the training/rename it for personal purposes (to host group trainings). This leads to confusion and inconvenience for other members of the community.\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/03/bf/03bfe17abe456afe14ac93cd643586fd35301a51.png\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;width: 190.0px;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eTo keep everything in order, we changed the rules for editing gym contests. Now a coach can change the name/start time/description of a gym if it is not public or the last update was made not later than a week ago. A week after editing a gym, it becomes the history of Codeforces and coaches lose an opportunity to make edits in it.\u003c/p\u003e\u003cp\u003eYou cat ask \u0026quot;how do you give a training in a group, specifying the start time?\u0026quot; Now there is such a way!\u003c/p\u003e\u003cp\u003eTo allow more convenient re-use of past trainings, as well as regular contests, it was possible to copy past training and regular competitions into a mashup. This can be done by clicking on the corresponding button in the right sidebar or directly in the form of mashup creation.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/a7/d9/a7d9da490c8c3ec97b8dfd344e1c0f12e0e3642c.png\" style\u003d\"width: 580.0px;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eIn the copied mashup all the submissions of participants of parent contest, the statements of the problems and other information are inherited. Thus, it is a convenient way to start a training in a group at a specific time (now participants will participate in an ordinary way, and not make a synchronous virtual start), giving it its own name.\u003c/p\u003e\u003cp\u003eWish you successful trainings!\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","gyms","mashups"]}}