{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1435004479,"rating":0,"authorHandle":"vacuous","modificationTimeSeconds":1435004543,"id":18802,"title":"\u003cp\u003eCode gives WA. Is it due to precision error or mistake in some logic?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi I have been trying this question by another method. \u003ca href\u003d\"//codeforces.com/contest/552/problem/D\"\u003ehttp://codeforces.com/contest/552/problem/D\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIn this question, there are points in a 200X200 area and the total number of triangles(with non-zero areas) are to be calculated. Number of points is \u0026lt; 2000.\u003c/p\u003e\u003cp\u003eSo instead of taking advantage of the 200X200 area, I was trying to take advantage of n\u0026lt;2000. \u003c/p\u003e\u003cp\u003eLogic -\u0026gt; All sets of 3 points form a triangle except when they are collinear. For lines to be collinear their slope and y-intercept needs to be same.\u003c/p\u003e \u003cpre\u003ey\u003dm*x + c\u003c/pre\u003e\u003cp\u003eSince n\u0026lt;\u003d2000, we can calculated m \u0026amp; c for every pair, store them, sort them and then compare.\u003c/p\u003e\u003cp\u003eI am getting WA for this logic. The test case is big and hence not entirely visible. I tried debugging the code but unable to find the bug. \u003c/p\u003e\u003cp\u003eOne probable cause of WA , what I think , maybe the loss of precision. I am storing the slope in a double variable and comparing it afterwards. It maybe any rational number and it is rounded off differently in different cases. And while comparing they may be treated as different. Not sure, but this may be the source of the WA.\u003c/p\u003e\u003cp\u003eI have tried my best to keep the code simple to understand and have commented in between as well. \u003c/p\u003e\u003cp\u003eideone link -\u0026gt; \u003ca href\u003d\"http://ideone.com/FoQyfl\"\u003ehttp://ideone.com/FoQyfl\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/contest/552/submission/11714049\"\u003ehttp://codeforces.com/contest/552/submission/11714049\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["c++","maths","wa","precision"]}}