{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1514647791,"rating":110,"authorHandle":"vlecomte","modificationTimeSeconds":1514647927,"id":56773,"title":"\u003cp\u003eWriting a book on geometry, need some feedback\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello!\u003c/p\u003e\u003cp\u003eI\u0027m writing a book on geometry with a competitive programming approach. I\u0027ve just started, so I haven\u0027t written much at all yet but I\u0027d like to have some early feedback.\u003c/p\u003e\u003cp\u003eMy goal is to be easy to understand and practical (quite code-oriented), but also to explain important concepts in depth and try to build intuitions / interesting interpretations, because I think I can bring some things on that front. In what I\u0027ve written I feel like the \u0026quot;in depth\u0026quot; part is okay but I\u0027m afraid the \u0026quot;easy to understand\u0026quot; part is a bit lacking.\u003c/p\u003e\u003cp\u003eSo far I\u0027ve covered complex numbers, point representation, dot product, cross products and their applications, as the first part of a \u0026quot;Basics\u0026quot; chapter. There will eventually be other chapters, covering things like sweep algorithms, algorithms on convex polygons/hulls, and especially 3D geometry, which I like a lot.\u003c/p\u003e\u003cp\u003eI\u0027d like to have feedback mostly on writing style and on ways in which I can make the explanations more accessible (e.g. adding examples, figures, rephrasing, etc.), but any comment or suggested improvement is welcome. I know I\u0027ve not written much but there are some concepts in there which I found tricky to explain, so there should be plenty to criticize. :)\u003c/p\u003e\u003cp\u003eHere\u0027s the link (I\u0027ll update it as I fix things and add sections): \u003ca href\u003d\"https://vlecomte.github.io/cp-geo.pdf\"\u003ehttps://vlecomte.github.io/cp-geo.pdf\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}