{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1526827314,"rating":-1,"authorHandle":"alshahreyaj","modificationTimeSeconds":1526827713,"id":59591,"title":"\u003cp\u003eProblem 922C — Cave Painting Explanation \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eA lot of people solve this problem. I see a lot of them didn\u0027t understand why this solution works. I also start finding to understand the solution. I read editorial, but i didn\u0027t understand. May be i\u0027m not capable of it. But I tried to explain it in my way. Hope it will help a few beginner like me. Here is my explanation.\u003c/p\u003e\u003cp\u003eAs, the problem said that if it is possible to get different reminder from 1 to k for a value n then print \u0026quot;Yes\u0026quot;. As, the reminders have to be different, so we will get k different reminder. So, the reminders must have to be 0 to k-1. And their form are given below:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eReminder for k\u003dk-1\u003c/strong\u003e (Other not possible. Because if the reminder is k-2 for k there couldn\u0027t be possible to have more k-1 reminder. So it must have to be k-1).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eReminder for k-1\u003dk-2.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eReminder for k-2\u003dk-3.\u003c/strong\u003e .\u003c/p\u003e\u003cp\u003e.\u003c/p\u003e\u003cp\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eReminder for 2\u003d1.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eReminder for 1\u003d0.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eNow look, if we add now 1 with n, n will be divisible by all of the number from 1 to k. Because the reminders are only one less from the number, so if we add one with n, reminder for all will be zero. So, (n+1) must have to be a number which is divisible by all number from 1 to k. And, that\u0027s the LCM of 1 to k. Now, if we calculate, for k\u003d42 the LCM of 1 to 42 is bigger than 10^18. So, there is no value of n possible n\u0026lt;\u003d10^18 where k\u0026gt;42. Now, it\u0027s easy to calculate. \u003c/p\u003e\u003cp\u003eSo, that\u0027s the explanation. Hopefully it will help who didn\u0027t understand the solution. \u003c/p\u003e\u003cp\u003emy solution: \u003ca href\u003d\"//codeforces.com/contest/922/submission/38462069\"\u003eHere\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["#number theory","lcm","cave painting","922c"]}}