{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1427425414,"rating":126,"authorHandle":"aropan","modificationTimeSeconds":1431090628,"id":17142,"title":"\u003cp\u003eBSUIR Open Programming Championship 2015\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv style\u003d\"float: right;margin: 10.0px;margin-top: 30.0px;\"\u003e \u003cimg alt\u003d\"bo2015\" src\u003d\"/predownloaded/b2/5f/b25f0d431060f6bdeaed5bfb11f990e0c57231c5\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e\u003cp\u003eThe V BSUIR Open Programming Championship will be held from 7 till 24 April, 2015 (Minsk, Belarus). Undergraduates and postgraduates of BSUIR, students of other educational institutions, students from other universities and CIS countries are invited to participate in the Championship.\u003c/p\u003e\u003cp\u003eThe competition will take place in three rounds:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003efirst qualifying round (distance) — April 7̶-̶9̶ 10-13;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003esecond qualifying round (onsite semi-final) — April 14-16;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eChampionship final — April 22-24.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eTeams from the universities of near and far abroad are invited immediately to the final of the competition (no more than 2 from the same university). To participate in the Championship teams need to be registered prior to 17.04.2015 incl. Qualifying rounds (quarter-finals and semi-finals) are required only for the teams from BSUIR and high school teams. Other registered teams can also take part in the qualifying rounds.\u003c/p\u003e\u003cp\u003eOpen BSUIR Programming Championship is held by the ACM rules. During the Championship, the teams will be given 5 hours to solve 8 to 12 programming problems. The problems are written in English. More information about the championship, as well as the \u003ca href\u003d\"http://acm.bsuir.by/wps/wcm/connect/olymp/site/content/champ2014/final/statements\"\u003eproblems\u003c/a\u003e and \u003ca href\u003d\"http://acm.bsuir.by/wps/wcm/connect/olymp/site/content/champ2014/final/results\"\u003eresults\u003c/a\u003e of previous years, you may find at \u003ca href\u003d\"http://acm.bsuir.by/wps/wcm/connect/olymp/site/content/champ2015/\"\u003eacm.bsuir.by\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD. April 5.\u003c/strong\u003e Moved the date of first qualifying round.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD. May 8.\u003c/strong\u003e Practice and virtual participation of all the stages of the championship is available on \u003ca href\u003d\"https://contest.yandex.ru/bsuir2015/?lang\u003den\"\u003eYandex.Contest\u003c/a\u003e. Statements are also available on the championship \u003ca href\u003d\"http://acm.bsuir.by/wps/wcm/connect/olymp/site/content/champ2015/\"\u003ewebsite\u003c/a\u003e. Analysis is coming.\u003c/p\u003e\u003c/div\u003e","tags":["championship","bsuir","2015"]}}