{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1477770210,"rating":221,"authorHandle":"Miyukine","modificationTimeSeconds":1477770358,"id":48082,"title":"\u003cp\u003eMy first ACM experience\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHey! \u003c/p\u003e\u003cp\u003ePolish Collegiate Team Programming Contest (AMPPZ 2016) took place today, organized by University of Wroclaw. This is my first ACM experience, and I want to share with you my impressions.\u003c/p\u003e\u003cp\u003eTo begin with, I\u0027m still a high schooler (2nd grade). However, thanks to generosity of UWroclaw organizers team and some charity institutions, a few best high school teams were able to participate. \u003c/p\u003e\u003cp\u003eNow let\u0027s talk about the contest. My teammates were Paweł Burzyński(\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/pawelek1\" title\u003d\"Кандидат в мастера pawelek1\"\u003epawelek1\u003c/a\u003e) and Kacper Kluk (\u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/wonrzrzeczny\" title\u003d\"Эксперт wonrzrzeczny\"\u003ewonrzrzeczny\u003c/a\u003e). None of us is a really fast coder, so we just decided to focus more on accuracy than speed. As we\u0027ll see later, this was kind of a good idea.\u003c/p\u003e\u003cp\u003eThe contest started with no delays. I was not expected to be the coding monkey, but somehow it happened that three first and easiest tasks were accepted by me. These were not really challenging, so let\u0027s just ignore this fact. Some time later, Kacper scored the \u0026quot;ifologic\u0026quot; problem C. Then, the difficulty has risen.\u003c/p\u003e\u003cp\u003eMeanwhile, teams of UWarsaw1 and 2 were skyrocketing, grabbing quite outstanding scores of 7 problems per 90 minutes and 9 problems after the first half of the contest. After 2,5 hours there were 2 problems with no solves. The problemset was rather on the technical side and at this stage it was only a matter of time who will manage to implement more tasks correctly. As for our team, Paweł scored an interesting F and Kacper was implementing G. B was still unsolved, but we were giving it a try, because it looked like a problem which requires just careful cases handling for which probably most top teams had no time.\u003c/p\u003e\u003cp\u003eThere were still two number theory problems left, two graphs, two implementations G and (super awful) B and a something-with-convex-hull-problem E. At that point we had an accuracy of 0 incorrect tries, which gave us a good position even though our solving times was average. Paweł got into E and Kacper finished G, and at 3:15 we had 7 (+20 penalty). \u003c/p\u003e\u003cp\u003eAfter this, we got quite stuck on harder problems. Because we couldn\u0027t solve anything harder, I was chosen to code some clever backtracking for B. A similar problem was already on AMPPZ 2014, named pillars (\u003ca\u003ehttp://main.edu.pl/en/archive/amppz/2014/fil)\u003c/a\u003e. While I was adding new and new ideas to the solution, other guys were thinking on EIHL. 30 minutes left, and Paweł sat to code his I solution. Unsurprisingly, it had some bugs. There was little time left, so we had to speed up. We were working together, but I barely knew what the solution should do. We debugged the samples and... WA. 10 minutes before the end, we still had WA and Paweł had basically no ideas what could be wrong. I still don\u0027t know how I came up blindly with the right idea, but three mintues later we were happy with the AC. 8 problems with 2 incorrect tries during the whole competition -\u0026gt; that was rather well. At that point we knew we were going to be top10, and we were really satisfied. \u003c/p\u003e\u003cp\u003eAfter the contest, we had some time to discuss the problems with friends and meet some famous people. We\u0027ve even managed to have a picture taken with \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Легендарный гроссмейстер Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e! :)\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/79/b5/79b57f4db3be49fecdac7034f08448cbd211d057.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThen, the solutions presentation and final ceremony took place. The organizers prepared amazing piece of work which simulated the ranking in a really cool way. The final results :\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eUWarsaw1 (\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/mnbvmar\" title\u003d\"Легендарный гроссмейстер mnbvmar\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003em\u003c/span\u003enbvmar\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/marcin_smu\" title\u003d\"Международный гроссмейстер marcin_smu\"\u003emarcin_smu\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/swistakk\" title\u003d\"Международный гроссмейстер swistakk\"\u003eswistakk\u003c/a\u003e) 11.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eUWarsaw2 (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Stonefeang\" title\u003d\"Международный гроссмейстер Stonefeang\"\u003eStonefeang\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Errichto\" title\u003d\"Международный гроссмейстер Errichto\"\u003eErrichto\u003c/a\u003e, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/mareksom\" title\u003d\"Мастер mareksom\"\u003emareksom\u003c/a\u003e) 10.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e*Google (\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Легендарный гроссмейстер Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e, Franken, Kwasnicki) 10.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eUWroclaw2 (Lowicki, Syposz, Michalak) 9.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eUWarsaw3 (\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/znirzej\" title\u003d\"Мастер znirzej\"\u003eznirzej\u003c/a\u003e, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/tabasz\" title\u003d\"Международный мастер tabasz\"\u003etabasz\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/kezsulap\" title\u003d\"Кандидат в мастера kezsulap\"\u003ekezsulap\u003c/a\u003e) 8.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e*III High School Gdynia (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Miyukine\" title\u003d\"Кандидат в мастера Miyukine\"\u003eMiyukine\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/pawelek1\" title\u003d\"Кандидат в мастера pawelek1\"\u003epawelek1\u003c/a\u003e, \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/wonrzrzeczny\" title\u003d\"Эксперт wonrzrzeczny\"\u003ewonrzrzeczny\u003c/a\u003e) 8.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e \u003cul\u003e   \u003cli\u003emeans unofficial participation. I\u0027ll post the official data (statements, results) as soon as they\u0027re published. Right now, you can enjoy live ranking from the first 4 hours of contest at : \u003ca href\u003d\"http://solve.edu.pl/~amppz/chartcode2016/ranking.html\"\u003ehttp://solve.edu.pl/~amppz/chartcode2016/ranking.html\u003c/a\u003e.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eOur results were really satisfactory. And what about you? How was your first ever ACM contest? I\u0027m not talking about such programming legends as [Bredor] and his \u003ca href\u003d\"//codeforces.com/blog/entry/45106\"\u003ehttp://codeforces.com/blog/entry/45106\u003c/a\u003e ACM story, just average people. I\u0027m writing this mostly for myself to remember this event, but I will appreciate any answers :)\u003c/p\u003e\u003cp\u003eOne more thing. I want to thank the organizers for an interesting problemset and a reaaaally cool event. Thank you, and thank all people who contributed to it. Looking forward to seeing you in @amppz2017!\u003c/p\u003e\u003c/div\u003e","tags":[]}}