{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1463087126,"rating":140,"authorHandle":"savinova","modificationTimeSeconds":1463142556,"id":44852,"title":"\u003cp\u003eОтчет о деятельности фонда Botan Investments\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/a1/ba/a1ba8687e7ec7d3c4ce85f72b603b848c05b66bb.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eНапомню, что функционируют два типа грантов, учрежденных президентом фонда Виктором Шабуровым, направленных на поддержку развития спортивного программирования в региональных вузах: \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003e50K рублей и поездка в Сочи для “гроссмейстеров” с Codeforces\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e10К рублей в месяц для преподавателей, организующих тренировки по спортивному программированию.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eВ этом посте я бы хотела рассказать вам о результатах работы фонда \u003cstrong\u003eBotan Investments\u003c/strong\u003e за последние полгода. Также обращаю ваше внимание, что недавно сменился координатор образовательных программ фонда, и теперь эту деятельность выполняю я (меня зовут Софья Савинова, мои контактные данные внизу поста).\u003c/p\u003e\u003cp\u003eПозавчера побороться за приз в 50К рублей в Сочи приезжал Эдвард \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Edvard\" title\u003d\"International master Edvard\"\u003eEdvard\u003c/a\u003e Давтян. К сожалению, ему не удалось получить грант, но мы надеемся, что поездка в наш замечательный город и знакомство с представителями фонда оставит у него самые приятные впечатления и станет стимулом к дальнейшему развитию. \u003cbr /\u003e Мы приглашаем всех желающих, подходящих под требования программы (а с ними можно подробно ознакомиться на \u003ca href\u003d\"http://botaninvestment.com/codeforces/\"\u003eсайте Botan Investments\u003c/a\u003e) последовать его примеру и побороться за приз. Сочи вас ждет! \u003cbr /\u003e \u003cbr /\u003e \u003c/p\u003e\u003cdiv style\u003d\"width: 100.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/ee/98/ee98cd51b81d3cb28a9353094db853b87a22015a.jpg\" style\u003d\"width: 47.2%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg src\u003d\"/predownloaded/94/4a/944aa76b1544c7233e0c72dd02af73248fb9a2ca.jpg\" style\u003d\"width: 49.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e\u003cp\u003eВторая образовательная программа фонда \u003cstrong\u003eBotan Investments\u003c/strong\u003e – 10К рублей преподавателям – действует с ноября. За это время в программе приняли участие представители пятнадцати российских вузов. \u003cbr /\u003e Наша работа с преподавателями продолжается, и в будущем планируется увеличить число задействованных вузов. Мы бы очень хотели узнать ваши мнения и предложения по улучшению качества нашей деятельности. Нам важно понять, как мы можем поддержать развитие спортивного программирования в российских вузах, с какими проблемами сталкиваются преподаватели и как мы можем помочь их решить.\u003c/p\u003e\u003cp\u003eТакже в апреле фонд выступил одним из спонсоров Московских сборов на базе МФТИ. \u003c/p\u003e\u003cp\u003eЖелаем российским командам удачи на финале в Таиланде!\u003c/p\u003e\u003cp\u003eСофья Савинова,\u003cbr /\u003e Координатор образовательных программ \u003cstrong\u003eBotan Investments\u003c/strong\u003e \u003cbr /\u003e Email: \u003ca href\u003d\"mailto:edu@botaninvestments.com\"\u003eedu@botaninvestments.com\u003c/a\u003e \u003cbr /\u003e Телефон: +79996525628\u003c/p\u003e\u003cp\u003eP.S. В ближайшее время мы свяжемся со всеми преподавателями для обсуждения вопросов компенсаций, исправления недочетов программы и корректировки планов на следующий учебный год.\u003c/p\u003e\u003c/div\u003e","tags":["шабуров","botan investments","образование"]}}