{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1402053784,"rating":51,"authorHandle":"RodionGork","modificationTimeSeconds":1402053798,"id":12580,"title":"\u003cp\u003eВопрос к авторам раундов (о подготовке оных)\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eИтак в ходе дискуссий у некоторых коллег (и у меня) появилось желание порасспросить авторов раундов о том, как происходит подготовка раунда.\u003c/p\u003e\u003cp\u003eОфициальная документация на CF даёт на этот вопрос скудный комментарий \u0026quot;Обратитесь к Геральду\u0026quot;. По-видимому понятно что с этого процесс начинается — или, более детально, как подсказал \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/dalex\" title\u003d\"Candidate Master dalex\"\u003edalex\u003c/a\u003e стоит подготовить задачи (в Полигоне или прям совсем \u0026quot;на словах\u0026quot;?) и показать их Геральду чтобы выяснить годятся ли они...\u003c/p\u003e\u003cp\u003eА остальное? Итак, попробую сформулировать несколько вопросов:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eСколько времени у вас уходит на то чтобы подготовить, выбрать, вспомнить или подыскать сами идеи задач — происходит ли это в течение дня-двух, или они постепенно рождаются недельку-месяц а потом вы начинаете думать \u0026quot;не применить ли их в контесте?\u0026quot;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eКак вы оцениваете — какой опыт решения задач СП (в штуках? годах) требуется чтобы уверенно изобретать задачи самому — или же это не коррелирует и есть люди которые только придумывают, но не решают (хаха)?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eСколько сил (в человеко-часах) у вас лично отнимает подготовка раунда?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eКак вы общаетесь с администрацией CF — сообщениями на сайте, почтой, скайпом или ещё что? Насколько этот процесс быстрый или медленный особенно если разные временные зоны?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eСколько итераций у вас могут пройти задачи прежде чем вы по их идеям достигнете согласия с администрацией и приступите непосредственно к подготовке раунда? Или задачи всегда \u0026quot;нравятся\u0026quot; с первой попытки?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eК кому можно обратиться за помощью если задач не хватает или их качество нехорошо — или тут что-то администрация предлагает подсказывает?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eКак выбираются тестеры для задач, как они участвуют в подготовке — например, советуют ли снять задачу, изменить количество баллов по ней и т.п.?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eТребуется ли непосредственное участие автора во время проведения контеста? Поддерживается ли с ним постоянная связь скайпом и т.п.?\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eЕсли кто-то ещё вопросы подскажет, будет здорово.\u003c/p\u003e\u003cp\u003eА если кто-то из авторов решится таки написать пост, хотя бы небольшой — этакое сочинение \u0026quot;как я готовил раунд\u0026quot; — наверное его прочтут с большим интересом!\u003c/p\u003e\u003c/div\u003e","tags":["вопрос","контесты"]}}