{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1497716249,"rating":11,"authorHandle":"Kaga2s","modificationTimeSeconds":1497716425,"id":52699,"title":"\u003cp\u003eThe COJ Progressive Contest #11: Call for Participation!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eDear all,\u003c/p\u003e\u003cp\u003eThe COJ is celebrating 7 years of coding! and we are glad to invite you to take part in the last day of the 11th edition of \u0026quot;The COJ Progressive Contest\u0026quot; (\u003ca href\u003d\"http://coj.uci.cu/contest/contestview.xhtml?cid\u003d1571\"\u003ehttp://coj.uci.cu/contest/contestview.xhtml?cid\u003d1571\u003c/a\u003e. The problems for all levels are from 2016 ICPC-BOLIVIA in Bolivia, and 2017 UTP-COLOMBIA Open programming contests of Universidad Tecnológica de Pereira (UTP) in Colombia, hosted by the Red de Programación Competitiva (RPC), which took place on 2016 and 2017.\u003c/p\u003e\u003cp\u003eThe contest duration is almost two weeks (from \u003ca href\u003d\"http://timeanddate.com/worldclock/fixedtime.html?day\u003d5\u0026amp;month\u003d6\u0026amp;year\u003d2017\u0026amp;hour\u003d9\u0026amp;min\u003d0\u0026amp;sec\u003d0\u0026amp;p1\u003d99\"\u003e2017-06-05 09:00:00\u003c/a\u003e to \u003ca href\u003d\"http://timeanddate.com/worldclock/fixedtime.html?day\u003d18\u0026amp;month\u003d6\u0026amp;year\u003d2017\u0026amp;hour\u003d16\u0026amp;min\u003d0\u0026amp;sec\u003d0\u0026amp;p1\u003d99\"\u003e2017-06-18 16:00:00\u003c/a\u003e). The tasks are in English. The allowed programming languages are C, C++, C++11, C#, Java, Ruby, Pascal and Python. The contest will be held on the rules for progressive competitions in the COJ. If you have any question, please feel free to ask on \u003ca href\u003d\"mailto:coj@uci.cu\"\u003ecoj@uci.cu\u003c/a\u003e\u003c/p\u003e\u003cp\u003eTo participate you need to have an account in the Caribbean Online Judge (**COJ** — \u003ca href\u003d\"http://coj.uci.cu/user/createnewaccount.xhtml\"\u003ehttp://coj.uci.cu/user/createnewaccount.xhtml\u003c/a\u003e). You don\u0027t need to register in the contest: the registration in the contest is effective with the first submission.\u003c/p\u003e\u003cp\u003eThe challenge is as follows:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eThe problems are divided by difficulty levels, and in the beginning you only have access to the first level of problems.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIn order to gain access to the next level of problems, you must solve a specific number of problems from the current level (defined by the Contest-Setter).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eNot all levels require the same amount of problems and, of course, we design each level to be more challenging than the previous one.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eAbout the ranking of the contest:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eThere will be not penalty time for rejected submissions.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThere will be not (less or more) points by solve any problem after or before another user. Points are assigned when you solve a problem.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eEach problem has a fixed number of points, so no matter the number of users who solved it will always worth the same.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe scored points are in this form: \u003cstrong\u003eTPOINTS\u003c/strong\u003e / (**TLEVELS** — \u003cstrong\u003ePLEVEL\u003c/strong\u003e + 1) where \u003cstrong\u003eTPOINTS\u003c/strong\u003e is the Total Points defined for all the problems in the contest, \u003cstrong\u003eTLEVELS\u003c/strong\u003e is the Total Levels defined for the contest and \u003cstrong\u003ePLEVEL\u003c/strong\u003e is the level of the given problem. Note that problems in the first level gives you \u003cstrong\u003eTPOINTS\u003c/strong\u003e / \u003cstrong\u003eTLEVELS\u003c/strong\u003e points, and problems on the last level gives you \u003cstrong\u003eTPOINTS\u003c/strong\u003e points (full points). The higher the level, the more points are scored.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIf two users have the same points in the ranking, the user who has solved its problems before, must be in a higher rank.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eFor this 11th edition of \u0026quot;The COJ Progressive Contest\u0026quot; we have \u003cstrong\u003e6\u003c/strong\u003e levels of problems, and you need to solve \u003cstrong\u003e4\u003c/strong\u003e problems from each one to pass to the next level. On the other hand, you can solve \u003cstrong\u003e25\u003c/strong\u003e problems in the entire contest to see (unblock by special rule) all the problems in all the levels. The value for \u003cstrong\u003eTPOINTS\u003c/strong\u003e is \u003cstrong\u003e60\u003c/strong\u003e points (in this edition).\u003c/p\u003e\u003cp\u003eProblems by levels:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eLevel 1: 7 problems.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eLevel 2: 6 problems.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eLevel 3: 5 problems.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eLevel 4: 5 problems.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eLevel 5: 4 problems.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eLevel 6: 3 problems.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eCan you get to the last level? Can you solve all the problems? This is the real challenge for you!\u003c/p\u003e\u003cp\u003eWe hope that you enjoy it very much. Thank you and have fun!\u003c/p\u003e\u003cp\u003eKind regards, \u003ca href\u003d\"http://coj.uci.cu/general/about.xhtml#about.18\"\u003eCOJ Development Team (CDEVT)\u003c/a\u003e \u0026amp; \u003ca href\u003d\"http://www.utp.edu.co/\"\u003eUniversidad Tecnológica de Pereira (UTP)\u003c/a\u003e \u0026amp; \u003ca href\u003d\"https://www.facebook.com/icpcbolivia/\"\u003eICPC Bolivia\u003c/a\u003e \u0026amp; \u003ca href\u003d\"http://www.redprogramacioncompetitiva.com/\"\u003eRed de Programación Competitiva (RPC)\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}