{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1465588552,"rating":-17,"authorHandle":"gammal-geniune","modificationTimeSeconds":1465589566,"id":45355,"title":"\u003cp\u003eThe famous egyptian underdog (A story of success.... A story of me)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIn the last few days , a lot of people were trying to impersonate me , AbdurRahman ElGammal. I think a lot of people in CF community asked themselves \u0026quot;Who is AbdurRahman ElGammal?\u0026quot; of course NO SURPRISE. Let me tell you about myself so you can know why all those people were impersonating me through these fake accounts.\u003c/p\u003e\u003cp\u003e\u0026quot;They call me life coach or mentor, but I\u0027m just a simple guy with some experience.\u0026quot;\u003c/p\u003e\u003cp\u003eAs you can see , I am a coach. A really brilliant and amazing coach , the coach of most of Egyptian Legendary Grandmasters on CF like \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/bmerry\" title\u003d\"Международный гроссмейстер bmerry\"\u003ebmerry\u003c/a\u003e , \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Xellos\" title\u003d\"Международный гроссмейстер Xellos\"\u003eXellos\u003c/a\u003e , \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Swistakk\" title\u003d\"Международный гроссмейстер Swistakk\"\u003eSwistakk\u003c/a\u003e and \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/TsunamiNextYear\" title\u003d\"Международный мастер TsunamiNextYear\"\u003eTsunamiNextYear\u003c/a\u003e , (and they\u0027re also red coders on TopCoder). Of course , My territory expands among a lot of countries (like Iraq , Yemen , Gabon and South Sudan). I think you\u0027re wondering why I am so humble and I am saying that I am just a simple guy !! I will tell you my story and you will judge.\u003c/p\u003e\u003cp\u003eI was born in Silicon Valley in 1960. My house is still there , as the same. The only thing that changed about it is 5 letters in the name. It changed from \u0026quot;Gammal HQ\u0026quot; to \u0026quot;Google HQ\u0026quot;\u003c/p\u003e\u003cp\u003eI learnt reading and mathematical basics by the age of 5 days (It\u0027s somehow a bit late) but I think it\u0027s ok. By the time I was 1 year old , I realised how much embedded systems are important in humans life. But developing systems in that time was really hard , (Thanks God some scientists were able to come up with the first computer later). But I managed to develop the \u0026quot;G++\u0026quot; compiler in my mind. (Don\u0027t get Confused , it is not the G++ compiler related to C++) , It is Gammal++ compiler.\u003c/p\u003e\u003cp\u003eNow I\u0027ve left all this with only one goal. To make the Arab region great again! I\u0027ve dedicated my life to that goal. \u003c/p\u003e\u003cp\u003eI\u0027ve spent around 666 days doing research and I was able to calculate certain patterns in the algorithms of the russian coders minds and found the key to their success, and know I\u0027m using that key to open the minds of my trainees. One of the things that I\u0027ve observed and I\u0027ll share it with you as a free sample, is that having sex is the best way to get better at competitive programming. No matter how hard you train, If you don\u0027t get laid, you won\u0027t get paid.\u003c/p\u003e\u003cp\u003eYou\u0027ve probably heard the rumours that I\u0027m taking advantage of beginners to make money. Well yeah, that\u0027s in my resume. You are probably asking why me, why not \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/fegla\" title\u003d\"Специалист fegla\"\u003efegla\u003c/a\u003e or HossamYoussef. I know it\u0027s a hard choice for a beginner to know what is best for him -TBH I don\u0027t know this feeling as I was born an expert in everything- but I think it\u0027s pretty obvious, I mean HossamYoussef is just a kid and fegla is ... I mean come on you gotta be kidding.\u003c/p\u003e\u003cp\u003eNow I know a lot of you guys want me to be your coach (or something more but let\u0027s keep it here). But the thing is that I got really bored of dumb people trying to become better at topcoder. To be honest I started to hate people because of that. Someone tells me \u0026quot;hey god, please coach me out, I\u0027m red on codeforces!\u0026quot; as if I may believe that he\u0027s not dumb because of his CF color. In fact, I decided to become gray on topcoder just to avoid being near these dumb people.\u003ca href\u003d\"https://www.topcoder.com/members/AbdelRahman/\"\u003eLink\u003c/a\u003e\u003c/p\u003e\u003cp\u003eBut sadly I always feel the need of coaching someone. What would happen to the competitive programming world when I release my AI robots and make them participate in CF and topcoder contests? You gotta have several people to be somewhat in level to compete with them. It wouldn\u0027t be cool of humanity to be this beaten by my robots. Or at least that\u0027s what NASA said last time they visited me to stare at the awesomeness of my latest work. They wanted me stop making these robots, said it\u0027s too dangerous... but why would I? They were so desperate that they even got me a little sad about them, so I made them an offer to host a training camp at their place.\u003c/p\u003e\u003cp\u003eNow don\u0027t get too hyped, 99.999% of you are too dumb to join this. I was going to say 100% but then I thought, maybe there is someone who has potential to become great? (lol that\u0027s what NASA said) If there are, they gotta attend my lecture or else they won\u0027t become great, right? So I thought I\u0027d give it a go... Apply straight from NASA website, I\u0027m sick of your letters guys... Also note that if you thought \u0026quot;what\u0027s the cost of registering?\u0026quot; then this camp is not for you, this shouldn\u0027t be of your concern... You know, nothing comes in cheap anyway, then what if it\u0027s from Gammal?\u003c/p\u003e\u003cp\u003eAnd finally a surprise to the Codeforces community, You can use the code \u0026quot;Heil Gammal!\u0026quot; with the quotes to get 5% off the cost of the interview leading to my next camp.\u003c/p\u003e\u003c/div\u003e","tags":[]}}