{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1482761427,"rating":124,"authorHandle":"snarknews","modificationTimeSeconds":1483189532,"id":49331,"title":"\u003cp\u003eSnarkNews New Year Contests — 2017\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eTraditionally, SnarkNews runs two \u003ca href\u003d\"https://contest.yandex.com/newyear2017\"\u003eNew Year Contests\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe New Year Blitz Contest (Multiple Language Round) will start at \u003cstrong\u003e16:00 31.12.2016\u003c/strong\u003e and ends at \u003cstrong\u003e08:00 01.01.2017\u003c/strong\u003e Moscow Time. Contest consists of 13 problems. Some of those problems are based on problems, used at official or training contests in 2016. Contest rules are based on the ACM system with two important modifications.\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003ePenalty time is calculated as \u003cstrong\u003edistance\u003c/strong\u003e between time of first successful submit for the contestant on this problem and \u003cstrong\u003e0:00:00 01.01.2017\u003c/strong\u003e, i.e. successful submissions at \u003cstrong\u003e23:50:00 31.12.2016\u003c/strong\u003e and at \u003cstrong\u003e0:10:00 01.01.2017\u003c/strong\u003e will both have penalty time 10 minutes (600 seconds).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003cem\u003eMultiple Language Round\u003c/em\u003e rule: If for the first successful submit for the contestant on the some problem was used the programming language, which was never used by this contestant in his previous first successful submits on other problems, contestant receives \u003cstrong\u003elanguage bonus\u003c/strong\u003e: his summary penalty time is decreased by \u003cstrong\u003e100 minutes\u003c/strong\u003e (6000 seconds). Note that different implementations of the same language are counting as same language, i.e. Java 6 and Java 7 are both counted as \u003cem\u003eJava\u003c/em\u003e, C++ 32 bit and C++11 64 bit both as \u003cem\u003eC++\u003c/em\u003e. Additionally, C and C++ are counted as \u003cem\u003esame\u003c/em\u003e programming language.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eContest will be running on Yandex.Contest system. \u003ca href\u003d\"https://contest.yandex.com/newyear2017/contest/3642/enter/\"\u003eLink for registration and participation\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e13\u0027th Prime New Year Contest will start at \u003cstrong\u003e0:00 30.12.2016\u003c/strong\u003e and finish at \u003cstrong\u003e23:59 10.01.2017\u003c/strong\u003e Moscow time. Traditionally, Prime New Year Contest consists of problems, which were presented at team programming contests in 2016 and \u003cstrong\u003enever\u003c/strong\u003e solved on the contest. For the Prime New Year contest plain ACM rules are used.\u003c/p\u003e\u003cp\u003eIdea of Prime Contest was first implemented by Andrey Lopatin and Nick Dourov at Summer Petrozavodsk training camp at 2003; in Russian word \u0026quot;Prostoj\u0026quot; used in meanings \u0026quot;prime\u0026quot; and \u0026quot;easy\u0026quot;, so, contest was called \u0026quot;Prostoj contest\u0026quot; but was composed of extremelly hard problems, numbered with prime numbers (2,3,5 etc). Since then such a numeration is traditionally used for contests, consisting of very hard problems only.\u003c/p\u003e\u003cp\u003eContest will be running on Yandex.Contest system. \u003ca href\u003d\"https://contest.yandex.com/newyear2017/contest/3641/enter/\"\u003eLink for registration and participation\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eBoth contests have English statements. Registration is open till the end of the contest.\u003c/p\u003e\u003c/div\u003e","tags":["snarknews"]}}