{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1401512049,"rating":24,"authorHandle":"RodionGork","modificationTimeSeconds":1401512049,"id":12489,"title":"\u003cp\u003eМагистратура CS или SE в СПб Академическом Университете?\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eНеторопливо подумываю пойти в магистратуру.\u003c/p\u003e\u003cp\u003eЕсть такое учебное заведение — \u003ca href\u003d\"http://spbau.ru/\"\u003eАкадемический Университет\u003c/a\u003e — помню здесь были либо студенты, либо сотрудники оттуда — в связи с чем надеюсь на подсказки которых не могу найти на сайте.\u003c/p\u003e\u003cp\u003eИнтересует магистратура CS или возможно SE — вот их \u003ca href\u003d\"http://mit.spbau.ru/\"\u003eкраткие анонсы\u003c/a\u003e.\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eЕсть ли очная или очно-заочная форма? Дело в том что работу бросать ради учёбы пока тоже сложно... Насколько сложно совмещать обучение с работой, если у кого есть опыт?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eБудет ли легче учиться на SE чем на CS при наличии небольшого (лет 5) \u0026quot;industrial experience\u0026quot; в разработке ПО.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПо SE: \u003cem\u003eна 5 курсе работа заключается в выполнении выбранного студентом проекта\u003c/em\u003e — насколько возможно протолкнуть что-нить из собственных проектов, на что уже были потрачены силы и время год-два назад, чтобы сэкономить их теперь? Или всё определяется непреклонной волей преподавателя?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eЕщё по SE: \u003cem\u003eНа шестом курсе из студентов формируются коллективы из 3-4 человек, работающие под руководством преподавателя\u003c/em\u003e — правильно понимаю что альтернативы развивать в одно жало проект с 5 курса при этом не предоставляется?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПо CS: Насколько самонадеяно пытаться поступать на это направление если бакалавра получал в несколько другой области (автоматизация, промышленные контроллеры, электропривод) — или окажется что подготовка по математике и дискретной математике недостаточна и повесть будет печальной и мучительной?\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eСпасибо за подсказки/советы если таковые последуют!\u003c/p\u003e\u003c/div\u003e","tags":["учёба","магистратура","образование"]}}