{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1519900490,"rating":86,"authorHandle":"geniucos","modificationTimeSeconds":1520949374,"id":58101,"title":"\u003cp\u003eInfO(1) Cup 2018\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003eI\u0027m happy to invite you to take part in the \u003ca href\u003d\"http://info1cup.com/\"\u003esecond edition of InfO(1) Cup\u003c/a\u003e, an online contest meant to be similar to international olympiads such as IOI, CEOI, BOI, APIO, etc. If you remember last year\u0027s entry about the contest, you should notice that we\u0027ve been talking about making it an onsite event, but we decided it\u0027s both easier (especially financially) and helpful to more people (as we can have more online participants) to have it online.\u003c/p\u003e\u003cp\u003eThe contest consists of 2 rounds: the national round and the international round. Participation in both rounds is invitation based (you can see the \u0026quot;official\u0026quot; participants \u003ca href\u003d\"http://info1cup.com/participants\"\u003ehere\u003c/a\u003e). We\u0027ve tried to reach out to the official organizers of Informatics Olympiad in several countries to make the competition as fierce as possible by having future IOI-participans, as well as to help those students in their training for upcoming international olympiads.\u003c/p\u003e\u003cp\u003eBoth rounds will have online mirrors (which are the purpose of this entry), that you\u0027re all invited to take part in. Both online mirrors will be taken in the usaco format. The first round is similar in difficulty to a div2 contest, 5 problems in 4 hours, whereas the international round (the one meant to be similar to IOI, CEOI, etc) will last for 5 hours and participants will have 4 problems to solve. If you are a strong participant, then we advise you to take part in the international round and if not, both rounds should be a good training.\u003c/p\u003e\u003cp\u003eThe registration button for the online mirrors will become available at the beginning of the online mirrors (keep in mind that you can choose whatever 4 or 5-hour slot you want, you\u0027ll have several days to choose from for round 2, and only one for round 1). I will update the blog with the link to the registration button as soon as possible. \u003cs\u003eYou can take the first online mirror during this \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dNational+Round+Online+Mirror\u0026amp;iso\u003d20180303T14\u0026amp;p1\u003d5121\u0026amp;ah\u003d20\"\u003etime interval\u003c/a\u003e\u003c/s\u003e (we will keep the online mirror of round 1 after the one of round 2, and will reupdate the blog with the exact time), and the second one will start at \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dInternational+Round+Online+Mirror\u0026amp;iso\u003d20180304T17\u0026amp;p1\u003d5121\"\u003ethis time\u003c/a\u003e and last for 72 hours. As in the case of all contests with this format, we kindly ask the participants not to discuss the problems until the end of both the official round and its online mirror (may it be the national or international round).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cfont size\u003d\"4\"\u003eThe online mirror of the international round is now over. You may now discuss the problems. Please give us any sort of relevant feedback in order to improve the next editions.\u003c/font\u003e\u003c/strong\u003e\u003cfont\u003e \u003c/font\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cfont size\u003d\"4\"\u003eThe online mirror of the national round (round 1) has now started. You may now choose any 4-hour frame to take it. It will end in 2 days and a half or so (better check the link). Remember that this one should be similar to a div2 in terms of difficulty, although the format is pretty different.\u003c/font\u003e\u003c/strong\u003e\u003cfont\u003e \u003c/font\u003e\u003c/p\u003e\u003cp\u003eYou can check last edition\u0027s problems and rankings \u003ca href\u003d\"http://info1cup.com/archive/2017/index.html\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAnd last but not least, I want to present the scientific committee (in random order): I (Costin Oncescu), \u003ca href\u003d\"//codeforces.com/profile/atatomir\"\u003eAlex Tatomir\u003c/a\u003e (one of last year\u0027s winners of InfO(1) Cup), \u003ca href\u003d\"//codeforces.com/profile/AlexandruVlad\"\u003eAlexandru Niculae\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/profile/Tudor\"\u003eCostin Tudor\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/profile/Theodor1000\"\u003eCristea Theodor\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["oi","usaco style","invitation","new competition","info1 cup"]}}