{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1506498191,"rating":86,"authorHandle":"ErdemKirez","modificationTimeSeconds":1506498191,"id":54797,"title":"\u003cp\u003eA Few Questions About ACM-ICPC Rules\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi,\u003c/p\u003e\u003cp\u003e2 days ago I send an e-mail to ACM-ICPC people(I don\u0027t know which word is suitable here maybe authoritative or director) but they didn\u0027t reply my e-mail yet. So I wanted to know can anyone answer those questions. It\u0027s the last registration date of SEERC so I\u0027m in a little bit rush. Thank you to all of you. I\u0027m pasting my e-mail here.\u003c/p\u003e\u003cp\u003e~~~~~~~~~~~~~~~~~~~\u003c/p\u003e\u003cp\u003eHi,\u003c/p\u003e\u003cp\u003eI’m not sure about who do I have to communicate with, so I’m sending it to several e-mails, I’m sorry about it. \u003c/p\u003e\u003cp\u003eWe were contestant for World Finals 2017 from TOBB University of Echonomics and Technology but 2 of my teammates couldn’t get visas so I participated alone in finals. In awarding ceremony Dr. Bill Poucher said they will give our team a free pass for WF2018 because we couldn’t participate as a whole team. So in this case I have a few questions and they’re very important for us and we’ll very glad if you can answer them.\u003c/p\u003e\u003cp\u003eIf a whole team couldn’t get a visa, their “maximum number of attend to WF” increased to 3 because this year they didn’t participate. But in our team I participated my teammates didn’t. So do we have one more attend or two left?\u003c/p\u003e\u003cp\u003eIf we change one participant from our team, can we still participate at WF without regionals?\u003c/p\u003e\u003cp\u003eAlso I have a friend whose name is Murat Ekici. He started university this year and he went to Bogazici University in Turkey. We had really wanting to participate together at WF for like a 3 year. But we ended up in different universities and we wanted to make sure there isn’t any possible way. However when we were checking rules of ACM-ICPC we found that a person could attend to ACM-ICPC from different university if he/she is a intern at that university. So Murat involved in a Algorithmic Game Theory Lab in my university. So we wanted to make sure that it doesn’t coincide with rules of ACM-ICPC. Can we participate with him at regionals as team of TOBB University of Echonomics and Technology?\u003c/p\u003e\u003cp\u003eWe are waiting for your reply and we will be grateful for it. Sorry for disturbing you with such a long e-mail.\u003c/p\u003e\u003cp\u003eThanks, Mustafa Erdem Kirez\u003c/p\u003e\u003c/div\u003e","tags":["#acmicpc2018","acm icpc regionals","seerc"]}}