{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1486761006,"rating":-28,"authorHandle":"wag","modificationTimeSeconds":1486803602,"id":50356,"title":"\u003cp\u003eSTAND-UP Евгения Недашковского S01E02\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eПредыдущие выпуски\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cul\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/50304\"\u003eВступление\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/50308\"\u003eS01E01\u003c/a\u003e\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eС добрым утром, Codeforces!\u003c/p\u003e\u003cp\u003eНа вашей волне русский король английского юмора Евгений Недашковский. Как говорил Альберт Эйнштейн, пусть всегда рулит западное побережье. Сегодня на утро я запланировал плотно позавтракать и взорвать \u003cem\u003ecodeforces\u003c/em\u003e очередным выпуском своего стэндапа. Как вы уже поняли, я не голоден.\u003c/p\u003e\u003cp\u003eЯ очень рад, что вы активно комментировали предыдущие выпуски. Для меня очень важно получать обратную связь от публики. Всем спасибо за тёплые слова о моём скромном проекте. Многие думали, что я быстро прекращу, но нет, я не брошу, Аннушка уже разлила масло, судьба уже расписана. Как видите, я очень умный, философский и начитанный.\u003c/p\u003e\u003cp\u003eА теперь наберите побольше воздуха в грудь, ведь я начинаю \u003cstrong\u003eюморить\u003c/strong\u003e. \u003c/p\u003e\u003cp\u003eАнекдот\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eСидят как-то турист, Пётр Митреевич и моежинольвиииив. \nУ них спрашивают: \u0026quot;Почему у вас такой ник?\u0026quot;\nТурист: ну у меня на лыжах было написано турист\nПётр Митреевич: а меня просто зовут Пётр Митреевич\nмоежинольвииив: а я ударился головой об клавиатуру\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eВот ещё:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eШтирлицу поручили охранять порядок во время приезда гостей в Берлин. \nВдруг он видит: кто-то пытается побить туриста, но никак не может. Всё бегает за ним, тужится, пыжится, весь покраснел, даже чуть-чуть почернел, но не догнал.\n\u0026quot;Митреевич\u0026quot; – догадался Штирлиц\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eТеперь история из жизни. Однажды у меня спросили: \u0026quot;Евгений, почему вы написали фамилию Митреевич именно так?\u0026quot; Я ответил: \u0026quot;Это начал не я. Так написал какой-то школьник пару лет назад в своём блоге. Наверное, он просто описался. Прямо в штаны\u0026quot;. Это была сложная шутка, но, надеюсь, поняли. Вот вам и ссылка на \u003ca href\u003d\"//codeforces.com/blog/entry/18617\"\u003eблог\u003c/a\u003e, чтобы потом не говорили, что Евгений Недашковский обманывает людей. \u003c/p\u003e\u003cp\u003eКолобок повесился. Буратино утопился. Русалка села на шпагат.\u003c/p\u003e\u003cp\u003eНапоследок хотелось бы процитировать одного художника:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eЯ ЧЁ ХОЧУ СКАЗАТЬ, Я ХОЧУ СКАЗАТЬ ОДНУ ВЕЩЬ ОЧЕНЬ ВАЖНУЮ. СЕЙЧАС НАЧИНАЕТСЯ В ЛЮДЯХ ЧТО ИДЁТ. МНОГИЕ ЛЮДИ ЩАС БЕРУТ ВМЕСТО ТОГО, ЧТОБЫ РЕЗАТЬ НАПРИМЕР МОРКОВЬ, КАРТОФЕЛЬ ИЛИ ЩАС ПРОДАЁТСЯ БАКЛАЖАНЫ, НОЖАМИ ОНИ СКУПАЮТ НАЧИНАЮТ СКУПАТЬ МИКСЕРЫ ИДЁТ ЭТО ПОТОМУ ЧТО НА ЕЩЁ МНОГО УВЛЕЧЕНИЙ ИДЁТ НА СЧЁТ МИКСЕРОВ. МИКСЕРЫ ПОЯВЛЯЮТСЯ СЕЙЧАС, И МОЛОДЫЕ СОРВАНЦЫ, КОТОРЫЕ ЛЁГКИМИ СТАЙКАМИ ТУТ БЕГАЮТ ПО ДВОРАМ, И ТАМ БЕГАЮТ СОРВАНЦЫ И ТАМ. ОНИ ТОЖЕ ХОТЯТ МИКСЕР ЭТОТ ПРИОБРЕСТИ, ЧТОБЫ ПЕРЕМЕШАТЬ ВСЁ КАК ГОВОРИТСЯ, ПОТОМУ ЧТО НЕТ, УЖЕ УХОДИТ ЭТА ТРАДИЦИЯ, ТОНКАЯ ТРАДИЦИЯ, КОГДА ТЫ БЕРЁШЬ СПОКОЙНО МОРКОВЬ, КАРТОФЕЛЬ БЕРЁШЬ, БЕРЁШЬ И БАКЛАЖАНЫ БЕРЁШЬ ИЛИ БЕРЁШЬ НАПРИМЕР ЕЩЕ ЭТО ОТ МОРКОВКИ БЕРЁТСЯ ЗЕЛЁНЫЕ ТАМ БЕРЁТ И СОБИРАЮТСЯ ЭТИ И СТАРЫЕ ЛЮДИ СОБИРАЮТСЯ ГДЕ-ТО НА КУХНЕ И ЕСЛИ УГОДНО ВАМ В КУХОННОМ И ЕСЛИ УГОДНО ВАМ В КУХОННОМ ПРИТВОРЕ СОБИРАЮТСЯ ЛЮДИ И СПОКОЙНО ДЕЛАЮТ ВСЁ.\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eВот и всё на сегодня, дорогие друзья. Этот выпуск получился чуть короче, но более насыщен шутками, да и сами они получились, как мне кажется, чуть смешнее, чем в предыдущих выпусках. \u003c/p\u003e\u003cp\u003eЭто был STAND-UP Евгения Недашковского и его ведущий Евгений Недашковский. Стаьте \u003cstrong\u003eПЛЮСИКИ\u003c/strong\u003e, подписывайтесь и обязательно пишите комментарии, чтобы тоже набирать \u003cstrong\u003eПЛЮСИКИ\u003c/strong\u003e (например, под первым эпизодом все комментарии сильно \u003cstrong\u003eЗАПЛЮСИКОВАНЫ\u003c/strong\u003e). Кроме того, если вам нравится мой проект, пожалуйста, оставляйте ссылки на него в соцсетях и просто других блогах.\u003c/p\u003e\u003cp\u003eВсем пока!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eP.S.\u003c/strong\u003e Третий выпуск выходит во вторник в 19:35. Ждите... \u003c/p\u003e\u003c/div\u003e","tags":["юмор","шутки","standup","tourist","митреевич","плюсики","недашковский","философия"]}}