{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1493394950,"rating":170,"authorHandle":"Zlobober","modificationTimeSeconds":1493565019,"id":51765,"title":"\u003cp\u003eYandex.Algorithm 2017 Qualification Round\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi,\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://clck.ru/Atnsc\"\u003eMidnight tonight (UTC +3)\u003c/a\u003e starts the Yandex.Algorithm 2017 Qualification Round. Round lasts for two days in a virtual mode. The contest itself is 100 minutes long. You may start your participation in any moment of time between 21:00 UTC of Friday and 20:59 UTC of Sunday, inclusive.\u003c/p\u003e\u003cp\u003eIn order to participate in a competition, you have to complete your registration. It will remain open for everybody until the end of the qualification round.\u003c/p\u003e\u003cp\u003eThose who already successfully submitted at least one problem in a warm-up round are already qualified to the elimination round of the competition. For everybody else in order to be qualified it is necessary to successfully submit at least one problem in a qualification round.\u003c/p\u003e\u003cp\u003eThe link to the contest will appear on the \u003ca href\u003d\"https://contest.yandex.com/algorithm2017/\"\u003esite\u003c/a\u003e of a competition shortly before the round start time.\u003c/p\u003e \u003ccenter\u003e\u003ch3\u003e\u003ca href\u003d\"https://contest.yandex.com/algorithm2017/contest/4502/enter/\"\u003eEnter the contest!\u003c/a\u003e\u003c/h3\u003e\u003c/center\u003e\u003cp\u003eLet us remind you that discussion of problem statements and solutions is prohibited until 22:40 UTC of Sunday (the latest possible contest end time for a participant). After that you may discuss problems and solutions in comments of this post or the editorial that will appear after the end of competition.\u003c/p\u003e\u003cp\u003eGood luck!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e: There is about 6 hours left to register and participate. Don\u0027t miss!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/79/35/793520817ba433d0c701d53955dca0709bb2c91b.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["yandex.algorithm 2017","qualification"]}}