{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1411475883,"rating":121,"authorHandle":"monsoon","modificationTimeSeconds":1411587370,"id":13929,"title":"\u003cp\u003eSecond edition of Marathon24 team programming contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/30/4a/304a7704f3d76266cb3517f71f5353e2bb4b133e.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eOnce again we invite you to participate in the 24-hour team programming contest \u003cstrong\u003eAsseco Programming Marathon24 Gdynia 2014. Powered by CodiLime\u003c/strong\u003e. The first edition in 2013 was quite a success: 243 teams of three from over 20 different countries were registered for the contest and 30 teams from 8 countries were qualified for \u003ca href\u003d\"http://marathon24.com/gallery/2013/#video\"\u003ethe finals in Gdynia\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eIn the contest teams of three can participate. There is no limit concerning the age or education of contestants. Also there is no limit in equipment, programming languages or materials you can use during the contest.\u003c/p\u003e\u003cp\u003eThe contest consists of two stages. You can check out \u003ca href\u003d\"http://marathon24.com/archive/2013/#qualifications\"\u003eproblems from the first edition\u003c/a\u003e to familiarize yourself with the format. This year\u0027s tasks will also be prepared (among others) by Tomasz Idziaszek \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/monsoon\" title\u003d\"Expert monsoon\"\u003emonsoon\u003c/a\u003e and Wojtek Nadara \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Swistakk\" title\u003d\"Master Swistakk\"\u003eSwistakk\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe first stage are qualifications, which will start on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dMarathon24+Qualifications\u0026amp;iso\u003d20141011T09\u0026amp;p1\u003d262\u0026amp;ah\u003d5\"\u003e11th October 2014 at 9:00 CEST\u003c/a\u003e and will last for 5 hours. There will be 5 algorithmic problems, to which 10 test cases will be provided. You only submit outputs to the tests and you get immediate feedback on your score.\u003c/p\u003e\u003cp\u003eNo more than 30 teams with the highest scores will qualify for finals. They will take place in Pomeranian Science and Technology Park in the city of Gdynia in Poland. Finals will begin on 29th November 2014 and will last for 24 hours. There will be 3 problems, which will require you to write a program communicating with the contest server through the TCP/IP protocol.\u003c/p\u003e\u003cp\u003eFor three teams with the highest scores in finals there are prizes amounting to over 30 000 PLN in cash. For more information visit our site: \u003ca href\u003d\"http://marathon24.com\"\u003emarathon24.com\u003c/a\u003e. The registration closes on 9th October 2014.\u003c/p\u003e\u003cp\u003eUpdate: \u003cstrong\u003eAlso be sure to take part in Codeforces Round #270, for the top 25 participants of this round will get Marathon24 T-shirts!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eGood luck and have fun!\u003c/p\u003e\u003c/div\u003e","tags":["marathon24"]}}