{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1488976650,"rating":0,"authorHandle":"AN_out_of_date","modificationTimeSeconds":1489128846,"id":50863,"title":"\u003cp\u003eRules...!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIn the name of Allah the most compassionate the most merciful.\u003c/p\u003e\u003cp\u003eHi every one!\u003c/p\u003e\u003cp\u003eAs I pointed, the main goal is to improve our skills. Removing people of group didn\u0027t relate to their ratings. Logically, the more active you are, the more chance you have to stay. Actually, we may need to have problem writers not only good problem setters or good problem solvers.\u003c/p\u003e \u003col\u003e   \u003cli\u003eEach problem should have a title in this form: \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eN\u003c/i\u003e.\u003ci\u003ename\u003c/i\u003e \u003ci\u003eLevel\u003c/i\u003e \u003ci\u003eothers\u003c/i\u003e\u003c/span\u003e N is the problem number and Level can be simple, medium, hard or very hard. Please note that we won\u0027t need simple problems otherwise they are beautiful enough to be noticed.\u003c/li\u003e   \u003cli\u003eThe statement of the problem must be as simple as possible and the solution should be below the statement as an \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003espoiler\u003c/i\u003e\u003c/span\u003e.\u003c/li\u003e   \u003cli\u003eI myself think about different ideas about the problems(even I don\u0027t know whether the idea result a good problem or not) and I encourage you to do, too.\u003c/li\u003e   \u003cli\u003eComments can have anythings about the problem, improve that or about the better solutions. \u003cstrong\u003eSpammers\u003c/strong\u003e will be kicked.\u003c/li\u003e   \u003cli\u003eIf \u003cstrong\u003eanyone\u003c/strong\u003e won\u0027t be active whole a week, he/she will be kicked unless in special conditions.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eBecause the group is young yet, there is no new problem. But you can see my problems in codeforces a few week later or my problems in other sites that I may post it here.\u003c/p\u003e\u003cp\u003eI\u0027ll appreciate if there is any suggestion.\u003c/p\u003e\u003cp\u003eGoodbye.\u003c/p\u003e\u003c/div\u003e","tags":["problemsetting"]}}