{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1490349986,"rating":52,"authorHandle":"MiptLited","modificationTimeSeconds":1490356141,"id":51185,"title":"\u003cp\u003eHonor Cup 2017 от Huawei\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет! Приглашаем студентов и аспирантов принять участие в решении задач от компании \u003cstrong\u003e\u003ca href\u003d\"http://codecraft.huawei.com/ehome\"\u003eHuawei\u003c/a\u003e\u003c/strong\u003e, в соперничестве с китайскими, индийскими и российскими студентами на английском языке! \u003cbr /\u003e\u003cstrong\u003eКак регистрироваться:\u003c/strong\u003e \u003c/p\u003e\u003cp\u003eДля регистрации на этом \u003ca href\u003d\"http://codecraft.huawei.com/ehome\"\u003eсайте\u003c/a\u003e мы рекомендуем использовать десктоп и Chrome. \u003cstrong\u003eПри регистрации важно указать регион \u0026quot;Россия\u0026quot;.\u003c/strong\u003e Если Вы из другой страны, которая не указана на сайте, то все равно нужно выбрать Россию, указав в комментариях страну и название университета.\u003c/p\u003e В команде может быть от 1 до 3 человек, каждый из которых должен пройти регистрацию, а затем сообщить свои данные капитану команды, чтобы он добавил членов команды в свой профайл. Команды могут быть смешанными, не обязательно из одного университета, но стабильными на протяжении всего соревнования. \u003cp\u003eНа вкладке Propositions после регистрации можно загрузить задачу, ознакомиться с ее описанием, загружать свои решения на С++/Java \u003cstrong\u003eдо 5 апреля.\u003c/strong\u003e Решение будет тестироваться автоматически на серверах Huawei. Результаты можно будет увидеть на вкладке Live Broadcast регион Russia.\u003c/p\u003e \u003cp\u003eПериодически могут проводиться профилактические мероприятия на сайте соревнований. Если возникают сложности, которые не решаются на следующий день, то о технических проблемах можно писать по адресу: \u003ca href\u003d\"mailto:andrey.golomazov@huawei.com\"\u003eandrey.golomazov@huawei.com\u003c/a\u003e \u003c/p\u003e \u003cp\u003eПосле 5-го апреля будут отобраны лучшие команды, которые попадут в четвертьфинал. \u003cstrong\u003eПосле 5-го апреля принимать участие во всех последующих раундах могут только те, кто успел зарегистрироваться и отправить свое решение до 5 апреля.\u003c/strong\u003e Для участников, не попавших в четвертьфинал напрямую, 7-8 апреля будет проведен дополнительный региональный раунд, по итогам которого будут отобраны дополнительные участники четвертьфиналов.\u003c/p\u003e \u003cp align\u003d\"center\"\u003e\u003cimg src\u003d\"/predownloaded/25/4d/254d5c19e04caed5d7904a871e361d1188f1e33c.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e \u003cp\u003eВо время проведения \u003ca href\u003d\"http://it-edu.mipt.ru/en/spring_training_2017\"\u003eМосковского АСМ воркшопа\u003c/a\u003e в физтехе с 9 по 17 апреля, будет выделено время в программе мероприятия для того, чтобы его участники, которые до 5 апреля зарегистрировались и отправили решения до 5 апреля на \u003ca href\u003d\"http://codecraft.huawei.com/ehome\"\u003ehttp://codecraft.huawei.com/ehome\u003c/a\u003e, смогли принять участие в онлайн ¼ финала, находясь на площадке мероприятия в физтехе.\u003c/p\u003e \u003cp\u003eДля всех студентов, принявших участие в ¼ финала от российского региона, включая участников АСМ воркшопа, мы проведем день открытых дверей в московском исследовательском центре Huawei, а так же проведем промежуточную оценку результатов ¼ и наградим лучших.\u003c/p\u003e \u003cp\u003eДата дня открытых дверей в московском исследовательском центре Huawei — 14 Апреля, дата награждения — 16 апреля. Обе даты будут указаны в \u003ca href\u003d\"http://it-edu.mipt.ru/en/spring_training_2017\"\u003eпрограмме\u003c/a\u003e.\u003c/p\u003e \u003cp\u003eВ качестве промежуточных призов мы предложим стажировку от 100000руб в месяц с дополнительной оплатой транспортных расходов и проживания, с полной занятостью во время каникул, также возможно обсуждение вариантов частичной занятости паралелльно с учебой* \u003ca href\u003d\"https://it-edu.mipt.ru/sites/default/files/huawei_rd_russia_2017-03-15.pdf\"\u003eпо направлениям\u003c/a\u003e. В некоторых случаях возможны командировки в КНР. Проживание иногородних студентов будет организовано в общежитиях МФТИ или ИТМО. \u003c/p\u003e \u003cp\u003eСтажировки будут разыграны между теми, кто при регистрации на codecraft в своем никнейме и в названии команды добавил \u003cstrong\u003eпостфикс\u003c/strong\u003e: \u003ca href\u003d\"mailto:nickname_ACM@MIPT\"\u003enickname_ACM@MIPT\u003c/a\u003e или \u003ca href\u003d\"mailto:nickname_ACM@ITMO\"\u003enickname_ACM@ITMO\u003c/a\u003e. Позднее по постфиксу Вашего никнейма мы поймем, в каком городе Вы хотели бы пройти стажировку.\u003c/p\u003e \u003cp\u003eПосле окончательного подведения итогов четвертьфинала Huawei codecraft 23 Апреля, 2 топ команды, зарегистрированные в Российском регионе, будут приглашены на очный финал в Китай 12-14 мая и поборются за главный приз — 200000￥(около 1600000 в рублях). Все остальные призы анонсированы на \u003ca href\u003d\"http://codecraft.huawei.com/ehome\"\u003eсайте мероприятия\u003c/a\u003e. Регистрация и загрузка решений завершаются 5 апреля!\u003c/p\u003e\u003cp\u003e*для победивших «визовых» иностранцев будет найдено другое решение.\u003c/p\u003e\u003c/div\u003e","tags":[]}}