{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1508848353,"rating":-16,"authorHandle":"ashyk_yigit","modificationTimeSeconds":1508861198,"id":55376,"title":"\u003cp\u003eTask of sqrt decomposition \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi CF! I find problem sqrt decomposition. Sorry my english isn\u0027t well. \u003c/p\u003e\u003cp\u003eRoma and Vitala came up with the following game: add and subtract from the number of power two, and after each operation count the number of units in the binary number of this number. Who is faster and more correct, he won.\u003c/p\u003e\u003cp\u003eYou have to help them: write a program with which they could check their calculations. The rules of the game are:\u003c/p\u003e\u003cp\u003eAt the beginning of the game, the number P is zero. For the entire game, N operations are performed. Each operation is the addition to the number P or subtraction from the number P of the number 2S. After performing each operation, it is necessary to output the number of units in the binary representation of P. It is guaranteed that at any time the number P can not be negative.\u003c/p\u003e \u003cbr /\u003e \u003cp\u003eInput\u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003cp\u003e The first line of the input file INPUT.TXT contains an integer N (1 ≤ N ≤ 10\u003csup\u003e5\u003c/sup\u003e) — the number of operations. The following N lines specify operations where each operation is specified by one of two lines: \u0026quot;add S\u0026quot; or \u0026quot;sub S\u0026quot;, where S (0 ≤ S ≤ 10\u003csup\u003e5\u003c/sup\u003e) is an integer.\u003c/p\u003e\u003cp\u003eThe \u0026quot;add S\u0026quot; operation means that 2 \u003csup\u003eS\u003c/sup\u003e must be added to the P number.\u003c/p\u003e\u003cp\u003eThe operation \u0026quot;sub S\u0026quot; means that the number P should subtract 2 \u003csup\u003eS\u003c/sup\u003e. \u003c/p\u003e \u003cbr /\u003e \u003cp\u003eOutput\u003c/p\u003e \u003cp\u003eFor each of the N requests to the output file OUTPUT.TXT on a separate line, output the number of units in the binary record of the number P after performing this operation.\u003c/p\u003e \u003cp\u003etest\u003c/p\u003e \u003cp\u003e 4 add 2 add 8 sub 3 sub 0  output: 1 2 6 7 \u003c/p\u003e\u003c/div\u003e","tags":[]}}