{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1480437686,"rating":98,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1480439085,"id":48708,"title":"\u003cp\u003eCodeforces как архив задач\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДобрый день.\u003c/p\u003e\u003cp\u003eСначала я хотел написать комментарий. Его стал писать принимая пересдачу у студентов, увлекся и текст вырос до размера поста.\u003c/p\u003e\u003cp\u003eКонтест такой: Михаил \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik\" title\u003d\"Мастер MikhailRubinchik\"\u003eMikhailRubinchik\u003c/a\u003e Рубинчик как-то написал \u003ca href\u003d\"https://vk.com/wall-115220257_29\"\u003eпост про архивы\u003c/a\u003e, где он поставил под сомнение целесообразность использования архива задач Codeforces как архива задач в отличии от Тимуса. Еще в комментариях \u003ca href\u003d\"//codeforces.com/blog/entry/48697\"\u003eвот к этому посту\u003c/a\u003e была тема поднята. Сам я трепетно отношусь к Тимусу, мой старт в олимпиадах был во многом связан с решением задач оттуда (правда больше контестов, чем архива), но такая позиция мне не очевидна.\u003c/p\u003e\u003cp\u003eВероятно, Михаил недостаточно внимательно посмотрел на возможности Codeforces. Возможно, что ему удобно рекомендовать Тимус для своих студентов, так как многие задачи оттуда он помнит, лично знает авторов, у него уже десяток студентов, нарешавших там около 1000, может имеет какой-нибудь админский доступ туда или хотя бы прямой выход на админов. Если так, то я его в этом отлично понимаю, сам по этой причине часто рекомендую к прорешке хорошо знакомые мне ресурсы.\u003c/p\u003e\u003cp\u003eВ списке ниже я попробую раскрыть тему, какие усилия приложила команда Codeforces, авторы задач и сообщество, чтобы ценность Codeforces как архива была значительная, буду сравнивать с Тимусом (не я поднял эту тему!). Если я отстал от того, что умеет Тимус, пожалуйста, поправляйте меня.\u003c/p\u003e \u003cul\u003e   \u003cli\u003eНа Codeforces задачи покрыты тегами. Часто бывает, что прорабатываешь какую-то тему и хочется решать тематические подборки задачи. На Тимусе я вижу какое-то непонятное упоминание \u003ccode\u003eМетки: нет  (скрыть метки для нерешенных задач)\u003c/code\u003e. Что это для меня загадка. UPD: я нашел что это, но видимо метками покрыта лишь часть задач.\u003c/li\u003e   \u003cli\u003eНа Codeforces все задачи специально разработаны для раундов, а вот на Тимусе есть задачи с хороших командных контестов, которые потом неплохо бы потом прорешать командой.\u003c/li\u003e   \u003cli\u003eНа Codeforces значительно шире круг авторов, на Тимусе очень много задач уральских авторов. Это накладывает отпечаток на тематику и типаж задач.\u003c/li\u003e   \u003cli\u003eНа Codeforces наверняка в среднем лучше тесты просто благодаря наличию взломов. Я каждый контест убеждаюсь, что как бы ни старался автор обязательно найдутся какие-то взломы, которые улучшают набор тестов.\u003c/li\u003e   \u003cli\u003eНа Codeforces практически к каждой задаче можно найти разбор и почитать её обсуждение в комментариях. На Тимусе есть форум, но я случайно потыкал в задачи — кажется, дельных обсуждений там меньше и читать его сложно.\u003c/li\u003e   \u003cli\u003eНа Codeforces полезно после решения задачи посмотреть решения крутых участников и чему-то научиться (подсмотреть трюк в реализации, другую идею). На Тимусе такой возможности нет.\u003c/li\u003e   \u003cli\u003eНа Codeforces каждая задача принадлежит недлинному контесту и при желании сначала можно решить виртуальное соревнование, которое её содержит, а потом только перейти к дорешиванию. Что полезно: не важно решали вы эту задачу в архиве, мэшапе, виртуальном контесте или настоящем — она будет помечена у вас как решенная.\u003c/li\u003e   \u003cli\u003eCodeforces значительно лучше подходит для совместной работы. Наличие \u003ca href\u003d\"//codeforces.com/blog/entry/21912?locale\u003dru\"\u003eсписков пользователей\u003c/a\u003e позволяет быстро и просто для группы тренирующихся находить ранее нерешенные задачи. Если вы решали какой-то контест командой, то задача у вас будет отмечена как решенная.\u003c/li\u003e   \u003cli\u003eНаличие большого количества задач — это конечно плюс. Довольно странно ставить в заслугу \u0026quot;Зато на Тимусе задач меньше!\u0026quot;. Если слишком разбегаются глаза, то можно решать только задачи из старых контестов (с номерами до 200, например). С другой стороны, если вы выбираете задачи какой-то определенной сложности или тематики, то выбор остается не слишком узкий.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eЕсть еще несколько моментов совсем уж на грани просто моего ИМХО — условия из простыней текста в некоторых задачах, условия только на английском, много задач с одним тестом и без пояснений.\u003c/p\u003e\u003cp\u003eВ общем, тезис из поста Михаила мне не кажется каким-то значительным, а вот многие пункты перечисленные выше как минимум могут быть полезны.\u003c/p\u003e\u003cp\u003eС радостью послушаю мнение любителей архивов, где я ошибаюсь или что можно улучшить в этом направлении на Codeforces (сам я, конечно, вижу ряд пунктов).\u003c/p\u003e\u003c/div\u003e","tags":["архивы задач","мнение"]}}