{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1406947110,"rating":5,"authorHandle":"hagu","modificationTimeSeconds":1406947110,"id":13276,"title":"\u003cp\u003eLightOJ 1268 — Unlucky Strings \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI tried this problem using KMP and Matrix exponentiation, but got an WA and i\u0027m unable to find the cases on which my solution fails.\u003c/p\u003e\u003cp\u003eThis is the problem Link :- \u003ca href\u003d\"http://lightoj.com/volume_showproblem.php?problem\u003d1268\"\u003ehttp://lightoj.com/volume_showproblem.php?problem\u003d1268\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIn short this problem asks you to find out how many strings you can generate of length N that doesn\u0027t contain a given string(suppose the string be called \u0026quot;pat\u0026quot;) as substring. The allowed characters are also given to you in the form of another string. 1 \u0026lt;\u003d N \u0026lt;\u003d 10^9 and 1 \u0026lt;\u003d length(pat) \u0026lt;\u003d 50.\u003c/p\u003e\u003cp\u003eMy approach to the problem is to generate a matrix \u003ccode\u003eans[length(pat)-1][length(pat)-1]\u003c/code\u003e in which each entry (i,j) corresponds to number of strings of length N generated if before the start of the string the \u003ccode\u003epie value\u003c/code\u003e (pie value as in KMP algo which denotes the longest prefix which is also a suffix) was \u0026quot;i\u0026quot; and after the end of the string the pie value is \u0026quot;j\u0026quot;. So by counting the entries in the table ans[0][k] where 0 \u0026lt;\u003d k \u0026lt; length(pat) we can get the final answer.\u003c/p\u003e\u003cp\u003eNow to get the matrix ans we can use matrix exponentiation. we can determine value for each entry (i,j) if N \u003d 1 using KMP and then apply matrix exponentiation to generate final matrix for given N.\u003c/p\u003e\u003cp\u003eThis is my solution and it\u0027s giving WA \u003ca href\u003d\"http://ideone.com/3PTR9S\"\u003ehttp://ideone.com/3PTR9S\u003c/a\u003e\u003c/p\u003e\u003cp\u003ePlease tell if i\u0027m missing something or if there\u0027s a bug in my code . Thanks.\u003c/p\u003e\u003cp\u003eNote :- This problem requires you to compute the answer modulo 2^32.\u003c/p\u003e\u003c/div\u003e","tags":["kmp","matrix exponentiation","lightoj"]}}