{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1506867187,"rating":1,"authorHandle":"SecretSuperstar","modificationTimeSeconds":1506867313,"id":54878,"title":"\u003cp\u003eMystery with segment trees and problem 867 E\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello CF community,\u003c/p\u003e\u003cp\u003eIn this blog, I look to ask up two things which are somewhat related to my approach for yesterday\u0027s Div2 E problem Buy Low Sell High. But before asking about that I need to ask something about segment trees.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cem\u003eMy approach for yesterday\u0027s problem -\u003c/em\u003e\u003c/strong\u003e First I took all the stock values in a pair array with second index storing actual index. I sorted the array so as to get the least to highest prices keeping lowest index in mind first.\u003c/p\u003e\u003cp\u003eI built a segment tree (max query) then.\u003c/p\u003e\u003cp\u003eThe basic idea was to now iterate over the pair array whose first index gives me the stock value (say \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eval\u003c/i\u003e\u003c/span\u003e) and second index gives actual position (\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003epos\u003c/i\u003e\u003c/span\u003e) of that stock in the real array. The next thing to do is find the maximum value of stock in array (using segment tree) from \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003epos\u003c/i\u003e + 1\u003c/span\u003e to \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e\u003c/span\u003e , say \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003emax\u003c/i\u003e\u003c/span\u003e. Since there is a possibility that there can be multiple position with value \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003emax\u003c/i\u003e\u003c/span\u003e in the array, I took up the closest one to \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003epos\u003c/i\u003e\u003c/span\u003e. For this, I simply stored all the values of position a particular number in a set and just found the upper bound of \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003epos\u003c/i\u003e\u003c/span\u003e. If that max value is greater than stock value, cool.. update it, add the difference to answer and keep moving, otherwise just simply continue.\u003c/p\u003e\u003cp\u003eThe first submission I made got a runtime error and I wasn\u0027t able to understand why it happened. After the contest while trying to upsolve or possibly find out the error, what I just did was change all \u003cspan class\u003d\"tex-span\"\u003e2\u003ci\u003enode\u003c/i\u003e + 1\u003c/span\u003e to \u003cspan class\u003d\"tex-span\"\u003e2\u003ci\u003enode\u003c/i\u003e\u003c/span\u003e and \u003cspan class\u003d\"tex-span\"\u003e2\u003ci\u003enode\u003c/i\u003e + 2\u003c/span\u003e to \u003cspan class\u003d\"tex-span\"\u003e2\u003ci\u003enode\u003c/i\u003e + 1\u003c/span\u003e in my segment tree implementation. Surprisingly the problem now got solved.\u003c/p\u003e\u003cp\u003eSo my two questions for this problem and particularly my situation are that why the problem got solved with that little change or in-fact why I got that problem when everything was basically fine and same in my update and query function. Was it something related to memory issues?\u003c/p\u003e\u003cp\u003eSecond obviously is why my algorithm is wrong as I am still getting wrong answer?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eProblem Link -\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/problemset/problem/867/E\"\u003ehttp://codeforces.com/problemset/problem/867/E\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMy runtime error submission -\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/contest/867/submission/30885275\"\u003ehttp://codeforces.com/contest/867/submission/30885275\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNo runtime error but WA submission -\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/contest/867/submission/30910560\"\u003ehttp://codeforces.com/contest/867/submission/30910560\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}