{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1498817652,"rating":2,"authorHandle":"Ahmad_Elsagheer","modificationTimeSeconds":1499901263,"id":52998,"title":"\u003cp\u003eAnalysis of Ranking Contests\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eRanking contests is critically important to evaluate the individual performance of participants which is helpful in team selection.\u003c/p\u003e\u003cp\u003eThis year, we will be running 5 ranking contests that cover most of the topics and problems categories that appear in the national and regional contests.\u003c/p\u003e\u003cp\u003eEvery participant will get a rating. The overall rating is the arithmetic mean of all contest ratings. Contest rating depends on both the number of problems solved and the contest rank. Formally:\u003c/p\u003e\u003cp\u003e\u003cimg align\u003d\"middle\" class\u003d\"tex-formula\" src\u003d\"/predownloaded/b4/92/b492209a9e283399e944451b620ab1bfb6dd8e53.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e where:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003esolved\u003c/i\u003e\u003c/span\u003e is the number of problems solved by the contestant.\u003c/li\u003e   \u003cli\u003e\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003emaxSolved\u003c/i\u003e\u003c/span\u003e is the number of problems solved by the first rank.\u003c/li\u003e   \u003cli\u003e\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e\u003c/span\u003e is the maximum of \u003cspan class\u003d\"tex-span\"\u003e50\u003c/span\u003e and the number of contestants in the contest.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eObviously, the first rank get a score of 200 points. You can find your rating \u003ca href\u003d\"//codeforces.com/group/F98TMlk1TZ/customrating/596\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eFor a team to perform well in a contest, they must take care of the following points:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eIndividual performance and experience.\u003c/li\u003e   \u003cli\u003eContest strategy.\u003c/li\u003e   \u003cli\u003eTeam chemistry.\u003c/li\u003e \u003c/ul\u003e\u003ch4\u003eIndividual performance and experience\u003c/h4\u003e\u003cp\u003eThis is the building block for the team. Experienced contestants always make a good team. And this is the main point that you get after analyzing the ranking contests. With ranking contests, you can evaluate:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eSpeed: which indicates\u003c/p\u003e   \u003col\u003e     \u003cli\u003eexperience: dividing the problem to subtasks with a previous experience with these subtasks.\u003c/li\u003e     \u003cli\u003eproblem-solving skills: coming up with creative solutions for unseen problems.\u003c/li\u003e     \u003cli\u003ecoding skills: writing fast efficient bug-free code.\u003c/li\u003e   \u003c/ol\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eCode Cleanness: which is an important point for a team, as you might need to quickly understand and debug your teammate\u0027s code.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eOptimality: contestants who always try to write the optimal solution (not any solution that will pass) are more probable to solve harder problems, because at every practice problem, they get the maximum benefit from it.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eContest Mentality: how contestants perform in a contest environment. For example, how they behave when they get a WA for a problem, can they move on to another problem? do they make too many submissions?). This point is better evaluated with trial team contests.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eExperience: with the ability to solve problems on a specific topic. When all contests end, this blog will be updated with tags for problems and estimated difficulty.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003ch4\u003eContest Strategy\u003c/h4\u003e\u003cp\u003eHow the team attack the problem set and manage their time efficiently is essential to solve the maximum number of reachable problems during contest time. Generally, the strategy for an individual contest is different from that of a team contest. Once a team is formed, they start to develop a strategy for team contests. We will talk about this point later.\u003c/p\u003e\u003ch4\u003eTeam Chemistry\u003c/h4\u003e\u003cp\u003eThough individual performance is a clear logical parameter in team selection, one must keep in mind that not all people can get along with each other. That is because:\u003c/p\u003e \u003cul\u003e   \u003cli\u003ePeople have different mindsets. You are going to discuss problems with your teammates, so you should be able to understand each others\u0027 ideas.\u003c/li\u003e   \u003cli\u003ePeople don\u0027t feel comfortable with everyone. You don\u0027t have to force yourself accept everyone, so pick teammates who you can enjoy a five-hour contest with them.\u003c/li\u003e \u003c/ul\u003e\u003ch2\u003eHow to make a team?\u003c/h2\u003e \u003cul\u003e   \u003cli\u003eWhen the ranking contests finish, analyze them based on the points mentioned above.\u003c/li\u003e   \u003cli\u003eKeep in mind that some points can developed later such as experience with topics, contest strategy and others (depending on how patient is you to help your teammates improve their weaknesses).\u003c/li\u003e   \u003cli\u003eDon\u0027t make the team blindly and pick your friends.\u003c/li\u003e   \u003cli\u003eMake individual performance your first and main parameter for selection.\u003c/li\u003e   \u003cli\u003eDo many trial team contests to make sure that you can get along with the teammates you selected. You may want to try different team combinations.\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":[]}}