{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1483605633,"rating":5,"authorHandle":"V_2","modificationTimeSeconds":1483611117,"id":49581,"title":"\u003cp\u003e[Solved]Need help in coloring a planar graph [Toph -Chor Tintin Tikri]\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eProblem Link: \u003ca href\u003d\"https://toph.co/p/chor-tintin-tikri\"\u003eChor Tintin Tikri\u003c/a\u003e \u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eStatement\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eA new land, what we call “chor”, has emerged. Local people have already given it a name “Chor Tintin Tikri” and taken hold of some part of the land. You are among one of the powerful people so you got a big portion of land for yourself. Now you decided to divide the land into parts and let the local farmers cultivate it.\u003c/p\u003e\u003cp\u003eYou are a big fan of Pizza Ghat, and pizza is your favorite food. You even dream about pizza. So you have made a decision to divide your newly acquired land in triangular shapes. You have already told your people to start dividing the land. They have started to make each part in triangular shape and put a pole on three corners of each part. But to do this they require a lot of time.\u003c/p\u003e\u003cp\u003eAfter hearing your decision, the farmers have demanded that their land should have different color of poles on each corner. Now after you told the workers who are dividing the land to color each pole, they quit and left you with some part properly divided and others not so much.\u003c/p\u003e\u003cp\u003eIn the meantime, cultivating season has started and you will face a huge loss if you don’t give distribute the land among the farmers for cultivation. So you decided to color the every pole which is already set according to the farmers demand. (You will also color those poles which doesn’t make a triangle yet, so you may cheat them later by not coloring the next poles which will be set. As after those are set, the coloring scheme may be invalid. Any how, you don’t need to think about this too hard!!)\u003c/p\u003e\u003cp\u003eAs you want to save money you have decided to buy minimum types of color by which you can color all the poles which are already set according to the farmers demand. Your job now is to determine this minimum value.\u003c/p\u003e\u003cp\u003econstraints : 1\u0026lt;\u003dnode\u0026lt;\u003d1000 1\u0026lt;\u003dedge\u0026lt;\u003d5000 Note: Actually the problem contain wrong statement .Here 0\u0026lt;\u003dEdge\u0026lt;\u003d5000 .\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eMy approach\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eMy approach: removed after AC\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eNote: Actually the problem contain wrong statement .Here 0\u0026lt;\u003dEdge\u0026lt;\u003d5000 .\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eInput: \n4 6\n1 2\n1 3\n1 4\n2 3\n2 4\n3 4\n           __1__\n         _/  |  \\_\n       _/    |    \\_\n     _/   ___3__    \\_\n   _/   _/      \\_    \\\n  2 ___/___________\\___4\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eIn this graph , every vertices is a part of some triangles. And Adjacent of nodes(1,2 4) make a cycle of odd length and thus the output will be 4. \u003c/p\u003e\u003cp\u003eAnd got many wrong answer using this approach. Can anyone suggest any hint please or solution ? Thanks in Advance.\u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eMy implementation\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cpre\u003e\u003ccode\u003eremoved after AC\n\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e","tags":["planar","iutfest16","colorings"]}}