{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1418904753,"rating":26,"authorHandle":"Rubanenko","modificationTimeSeconds":1419073204,"id":15257,"title":"\u003cp\u003eDecember Clash \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHey guys! \u003ca href\u003d\"http://hackerearth.com/december-clash/\"\u003eDecember Clash\u003c/a\u003e at \u003ca href\u003d\"http://hackerearth.com\"\u003eHackerEarth\u003c/a\u003e is taking place this \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dDecember%20Clash\u0026amp;iso\u003d2014-12-20T00:30:00\u0026amp;p1\u003d64\u0026amp;ah\u003d12\"\u003eSaturday\u003c/a\u003e. The contest lasts for twelve(!) hours, so almost everyone can find a time slot to participate. \u003c/p\u003e\u003cp\u003eThere are five tasks, four of them are standard algorithmic problems with partial solutions allowed, while the last one is an approximation problem which will allow to determine the best participant. \u003c/p\u003e\u003cp\u003eI think that this format of competition is interesting for everybody because newcomers can do better than stronger competitors with a help of \u0026quot;12-hours dedication\u0026quot; strategy, while the strongest guys will enjoy fighting each other on the approximation problem. \u003c/p\u003e\u003cp\u003eThe complete problemset is prepared by \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/laoriu\" title\u003d\"Candidate Master laoriu\"\u003elaoriu\u003c/a\u003e. It was very exciting to work over the contest with him. You may know this guy from preparing the \u003ca href\u003d\"/contest/486\" title\u003d\"Codeforces Round 277 (Div. 2)\"\u003eCodeforces Round #277 (Div. 2)\u003c/a\u003e. I did the testing part for this contest and would like to say that I wouldn\u0027t be able to solve all the problems without \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/laoriu\" title\u003d\"Candidate Master laoriu\"\u003elaoriu\u003c/a\u003e\u0027s help. So I find the problemset pretty challenging and strongly recommend you to participate! I believe that both math_lovers and implementation_lovers will find something interesting for them.\u003c/p\u003e\u003cp\u003eHope to see you at the scoreboard ;)\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Rubanenko\" title\u003d\"Candidate Master Rubanenko\"\u003eRubanenko\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eReminder!!!\u003c/strong\u003e \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eAs usually, top three contestants will receive HackerEarth T-shirts!\u003c/p\u003e\u003c/div\u003e","tags":["hackerearth","december","clash","hard","laoriu"]}}