{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1509044675,"rating":0,"authorHandle":"acmASCIS","modificationTimeSeconds":1509044675,"id":55422,"title":"\u003cp\u003eWeek02 — Problems Editorial\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003e- Four prisoners problem:\u003c/h1\u003e\u003cp\u003eLet’s assume that the second and the third prisoners wear the same color.\u003c/p\u003e\u003cp\u003eSince there’s only 2 white hats and 2 black ones, then the first prisoner would be certain about his hat color.\u003c/p\u003e\u003cp\u003eBut the first prisoner didn’t speak, which means that the second and the third prisoners wear different colors.\u003c/p\u003e\u003cp\u003eAnd since the second prisoner can see the third, he can be certain that his color is different than him, and shout his color.\u003c/p\u003e\u003cp\u003eSo the answer is the second prisoner.\u003c/p\u003e\u003ch1\u003e- Train station:\u003c/h1\u003e\u003cp\u003eIt’s easy to come up with a greedy solution:\u003c/p\u003e\u003cp\u003eFor every arriving train if there is an empty platform, the train stays there until its departure time.\u003c/p\u003e\u003cp\u003eOtherwise, we open a new platform.\u003c/p\u003e\u003cp\u003eThe first train arrives at 2:00 and leaves at 2:25, there’s no empty platforms so we switch on the first platform.\u003c/p\u003e\u003cp\u003eThe second train arrives at 2:10 and leaves at 2:50, the first platform is still reserved for the first train so we switch on a new platform.\u003c/p\u003e\u003cp\u003eWe repeat the previous process for every arriving train.\u003c/p\u003e\u003ch1\u003e- Amazing city number:\u003c/h1\u003e\u003cp\u003eWe call number X is amazing if X \u003d 2^A * 3^B, which means it’s a product of A twos and B threes.\u003c/p\u003e\u003cp\u003eTo check if a number N is amazing we can apply this function:\u003c/p\u003e\u003cp\u003eF(N) \u003d \u003c/p\u003e\u003cp\u003e-- If N is divisible by 2, we check F(N/2).\u003c/p\u003e\u003cp\u003e-- If N is divisible by 3, we check F(N/3).\u003c/p\u003e\u003cp\u003e-- If N is not divisible by 2 nor 3, then N is not amazing.\u003c/p\u003e\u003cp\u003e-- If N \u003d 1, then N is amazing (as 1 \u003d 2^0 * 3^0).\u003c/p\u003e\u003ch1\u003e- Will you be the first (backtracking problem):\u003c/h1\u003e\u003cp\u003eLet’s say that we’re standing on a number, we repeat these two operation until we reach the last number:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eAdd the next number, and stand on it\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eSubtract the next number, and stand on it\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eWhen we reach the last number we check if the result is equal to the given number N.\u003c/p\u003e\u003c/div\u003e","tags":[]}}