{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1524107975,"rating":45,"authorHandle":"ICPCNews1","modificationTimeSeconds":1524107975,"id":58998,"title":"\u003cp\u003eMy story to the ICPC and what I found amazing through it\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eMy name is Fadi Ashy I’m a Game Programmer and a senior software engineering student at Al-Baath University from Syria. ACM was a big part of my life through college. I was a contestant for three years reaching my country’s final “SCPC” three times and for the fourth year, I went to be an organizer for our local and country’s Contest. Codeforces was a huge player in my journey solving around 300+ problems in different areas of the sea of Computer Programming.\u003c/p\u003e\u003cp\u003eMy story to the ICPC started when I logged in my e-mail one day and came across a contest hosted by the ICPC in my newsletter for a chance to win a trip to the ICPC Finals in Beijing by sharing a small video about yourself in the ICPC. So I got my camera and posted my video on YouTube and waited for the results and finally, I got accepted and even more on that I got the chance to work with the ICPC News team on the contest hall.\u003c/p\u003e\u003cp\u003eMy preparations for the ICPC went fine getting all the paperwork. Sometimes it is problems to attend because of where you live. I faced some basic problems that everyone had while living in Syria. I got a problem paying for the visa and my ticket because there was no online payment and then I got my visa because it was delayed about 4 days before the travel time, but with some really awesome people from the ACPC and SCPC helped me a lot.\u003c/p\u003e\u003cp\u003eAfter all the preparations have been done we started a 24 hours trip from my hometown in Syria all the way to Beijing crossing more than 3 countries using buses and planes. It was one of the longest trips I’ve ever had, but the end of it was one of the greatest cities on earth.\u003c/p\u003e\u003cp\u003eWhen we arrived, I was stunned by how many people are there in the ICPC. I’m used to participating and organizing small events and not something this big. But I realized something: more people sometimes means more fun. I can’t explain how amazing it was to share your story and get to meet a lot of people from so many countries around the world, and also being in the geekiest community ever. All the talks and the conversation we shared was about computer programing and some cool stuff happening in that field. I also got the chance to meet the greatest managing team ever and had a chance to meet people that were known to me in just a small name at the end of an e-mail.\u003c/p\u003e\u003cp\u003eBut finally, I got to meet the ICPC News team. I got my bag and fired up my laptop and waited for some task to help in with. Working on some photos using Photoshop and working on small Ideas and even helping in the live stream on the official page. What I loved the most about the team is how professional they are. And yeah, I used a mac for the first time and it isn’t that good… mmm maybe I’m windows fanboy, I don’t know.\u003c/p\u003e\u003cp\u003eAnd as I mentioned before, a big number of people also need an awesome huge place to host them all and Peking University is spectacular, amazing Campus, amazing students and I can’t really describe the contest hall. I think the photos should describe it all.\u003c/p\u003e\u003cp\u003eMaybe I have more fun working than really having fun, but the ICPC is full of fun activities either with the teams and friends, or you can ditch all ICPC stuff and go walking in beautiful Beijing. We even got a chance for an awesome trip to visit and climb the Great Wall of China. One piece of advice if you’ll ever go there and you’re a full-time programmer and you’re not used to doing a lot of sports. Are you thinking DON’T climb it just stay on the bus and take a nap. Is it worth it? Kind of: the view from up there is a crazy and an awesome view and you can buy a medal with your name carved on it to always remember that hard time that left you unable to walk for about half a day afterward.\u003c/p\u003e\u003c/div\u003e","tags":["icpc","beijing, china","peking","acm"]}}