{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1481380904,"rating":450,"authorHandle":"gKseni","modificationTimeSeconds":1481712900,"id":48981,"title":"\u003cp\u003eCode Festival 2016: interview and photos from participants\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/48616\"\u003eCode Festival 2016\u003c/a\u003e was held in Tokyo on 25-30 of November. Boris \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/qwerty787788\" title\u003d\"Grandmaster qwerty787788\"\u003eqwerty787788\u003c/a\u003e Minaev has shared with us his impressions, and Maxim \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Zlobober\" title\u003d\"International Grandmaster Zlobober\"\u003eZlobober\u003c/a\u003e Ahmedov and Nicolay \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/KAN\" title\u003d\"Grandmaster KAN\"\u003eKAN\u003c/a\u003e Kalinin shared photos.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eTo start with, let\u0027s mention that,\u003c/em\u003e \u003ca href\u003d\"https://atcoder.jp/\"\u003eAtCoder\u003c/a\u003e \u003cem\u003eand\u003c/em\u003e \u003ca href\u003d\"http://ru.indeed.com/about\"\u003eIndeed company\u003c/a\u003e \u003cem\u003eannounced the festival. How many quals were there? In what way were they arranged?\u003c/em\u003e\u003cbr /\u003e— There were 3 contests, in which you could take part. In the first part TOP-10 were selected, in the second one — TOP-5, the third one — TOP-5. To sum up, there are 20 foreigners to be selected. \u003c/p\u003e\u003cp\u003e— \u003cem\u003eWhich quals the Japanese had then?\u003c/em\u003e\u003cbr /\u003e— Probably the same, but 200 participants passed the qual there.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eThat means, the event is more orientated on Japanese people?\u003c/em\u003e\u003cbr /\u003e— The previous years the event was held only for Japanese, this year they decided also to invite some foreigners.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eHow long did the contest lasted?\u003c/em\u003e\u003cbr /\u003e— It was quite short. To pass it you had to solve all the problems. It turned out that in first 15 minutes the first 3 out of 5 problems needed to be hand in, and other two are handed in later — you had to think hard on them. The foreigners had to hand in everything taking into account the penalty time.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eThe rules of АСМ?\u003c/em\u003e\u003cbr /\u003e— Nearly. You don\u0027t loose anything for penalty attempts, that means it\u0027s possible to submit problems any number of times\u003c/p\u003e\u003cp\u003e— \u003cem\u003eNo debugging, no testing — just submit, and that\u0027s all?\u003c/em\u003e\u003cbr /\u003e— Yes, it was possible. In addition they also showed verdict on every test. \u003c/p\u003e\u003cp\u003e— \u003cem\u003eWas it clear from the very beginning that those who passed the samplings would be waited in Japan?\u003c/em\u003e\u003cbr /\u003e— Yes. They payed for the road — bought the tickets. They fed me a bit during the event. On the fifth day I was invited to the \u003ca href\u003d\"http://ru.indeed.com/about\"\u003eIndeed\u003c/a\u003e office. Indeed is the American company, which decided to open an office in Tokyo. For an hour they were talking about what the company is doing, and then there was a diner with the engineers. Five people came, three of them were Russians, who work in Yandex. They were communicating with the Russian-speaking public. They told us, that came to Tokyo because of the desire of traveling.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/6.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e Organizers provided us with the access to the internet by giving routers including Sim with some already payed traffic.   \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eIs it true that in Japanese offices there are balconies with special plants as a recreation area?\u003c/em\u003e\u003cbr /\u003e— Exactly in the Indeed office there are no. The engineers said they reconstructed their American office here — they all came from Austin.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/7.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e The competition was held in a business area of the city, which had huge office buildings made of glass and metal.     \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eHow many days did the contest lasted?\u003c/em\u003e\u003cbr /\u003e— During 4 days, from the early morning, 8 o’clock, till 10 o\u0027clock in the evening. The fifth day was a day off.\u003c/p\u003e\u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/k/5.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e Sakura blossoms even in winter. \u003ci\u003eComment and photo: Nicolay Kalinin\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e — \u003cem\u003eDid you have an excursion in Tokyo?\u003c/em\u003e\u003cbr /\u003e— No, we went for a walk on our own on the last day. It would have been really interesting spend more time walking and looking: obviously, I didn\u0027t manage to see everything. \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/k/6.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e The Skytree participants (starting from the right: Nicolay  \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/kan\" title\u003d\"Grandmaster kan\"\u003ekan\u003c/a\u003e Kalinin, Michail \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/LHiC\" title\u003d\"Legendary grandmaster LHiC\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eL\u003c/span\u003eHiC\u003c/a\u003e Ipatov, Boris \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/qwerty787788\" title\u003d\"Grandmaster qwerty787788\"\u003eqwerty787788\u003c/a\u003e Minaev, Gennadiy \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e Korotkevich, Alexey \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/AlexDmitriev\" title\u003d\"International Grandmaster AlexDmitriev\"\u003eAlexDmitriev\u003c/a\u003e Dmitriev, Alexandr \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Kostroma\" title\u003d\"Grandmaster Kostroma\"\u003eKostroma\u003c/a\u003e Ostanin, Maxim \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/zlobober\" title\u003d\"International Grandmaster zlobober\"\u003ezlobober\u003c/a\u003e Ahmedov)   \u003ci\u003eComment and photo: Nicolay Kalinin\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/8.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e The highest point available to visitors, 451m.  \u003ci\u003eComment and photo:Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/k/7.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e Shinto shrine and us (starting from the right: Gennadiy \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e Korotkevich, Nicolay \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/kan\" title\u003d\"Grandmaster kan\"\u003ekan\u003c/a\u003e Kalinin, Alexey \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/AlexDmitriev\" title\u003d\"International Grandmaster AlexDmitriev\"\u003eAlexDmitriev\u003c/a\u003e Dmitriev, Boris \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/qwerty787788\" title\u003d\"Grandmaster qwerty787788\"\u003eqwerty787788\u003c/a\u003e Minaev, Alexandr \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Kostroma\" title\u003d\"Grandmaster Kostroma\"\u003eKostroma\u003c/a\u003e Ostanin, Maxim \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/zlobober\" title\u003d\"International Grandmaster zlobober\"\u003ezlobober\u003c/a\u003e Ahmedov, Michail \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/LHiC\" title\u003d\"Legendary grandmaster LHiC\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eL\u003c/span\u003eHiC\u003c/a\u003e Ipatov)  \u003ci\u003eComment and photo: Nicolay Kalinin\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/15.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e Gena is touched by the girls from Japanese ads.   \u003ci\u003eComment and photo:Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/16.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e I am still impressed by the face on the foreground.   \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eWhat were the contests?\u003c/em\u003e\u003cbr /\u003e— \u003ca href\u003d\"https://atcoder.jp/post/58\"\u003eMany different ones\u003c/a\u003e. It all happened like that: at the beginning there was \u003ca href\u003d\"http://cf16-final-open.contest.atcoder.jp/\"\u003ea personal contest\u003c/a\u003e that lasted 3 hours and consisted of \u003ca href\u003d\"http://cf16-final-open.contest.atcoder.jp/assignments\"\u003e10 problems of different challenge\u003c/a\u003e, 220 participants took part in it. The problems were both difficult and easy. There is an interesting effect because of this: it was not necessary to do all the problems on the full point. You are given a few points for small problems, but more points for the bigger ones. At the end, Gena \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e solved all the problems, except the last subproblem of last problem, and he won! You could not solve several problems, but \u003ca href\u003d\"http://cf16-final.contest.atcoder.jp/standings\"\u003estill get into TOP-20\u003c/a\u003e. The name of the contest was Final. Out of it 20 people get into Grand Final. \u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/k/1.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e The look of the hall.  \u003ci\u003eComment and photo: Nicolay Kalinin\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eWho of did the TOP-20 consisted?\u003c/em\u003e\u003cbr /\u003e— 6 persons from Japan, the rest are foreigners. \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/rng_58\" title\u003d\"International Grandmaster rng_58\"\u003erng_58\u003c/a\u003e was the judge. The Japanese were strong competitors.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/1.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e We were given the earphones through which came good interpretation.  \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003eThe second contest was like that: they sorted the participants by their rating on the basis of the first contest Final. And after that 3 (\u003ca href\u003d\"http://cf16-tournament-round1-open.contest.atcoder.jp/\"\u003e1\u003c/a\u003e, \u003ca href\u003d\"http://cf16-tournament-round2-open.contest.atcoder.jp/\"\u003e2\u003c/a\u003e, \u003ca href\u003d\"http://cf16-tournament-round3-open.contest.atcoder.jp/\"\u003e3\u003c/a\u003e) stages by half an hour each, where your compete inside your «eight»(team). TOP-4 from each «eight» moves to another stage. There they again split into team of eight. At the third stage the winners are only TOP-3. It is done on purpose, for if you did it not really good at the first stage, at the next one you are given the competitors of equal skills. That gives an opportunity to win.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/k/4.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e All the foreigners sit close to each other and near the stage.   \u003ci\u003eComment and photo: Nicolay Kalinin\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003eTo sum it all up, every stage has its own 4 winners and 4 losers. The winners go further, the losers have to quit.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/5.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e The winners of personal blitz tour on the second day.  \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eWhat presents are provided?\u003c/em\u003e\u003cbr /\u003e— Just some promotional prizes like stickers. To be honest, there were really cool problems. For instance, Codeforces have problems, where you have to write some kind of structure, technical ones. But there you have only half an hour to do two problems, and you have invent, think over an idea — that\u0027s the difference.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/k/2.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e Immediately after the contest there was an awarding ceremony. That is the way my envelope looks like, there are congratulations inside.  \u003ci\u003eComment and photo: Nicolay Kalinin\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eIs there a problem you remembered?\u003c/em\u003e\u003cbr /\u003e— There were too many, that\u0027s why no, I don\u0027t remember any.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eWe were talking now about the second contest, am I right?\u003c/em\u003e\u003cbr /\u003e— Yes, there also was \u003ca href\u003d\"http://cf16-exhibition-open.contest.atcoder.jp/\"\u003ea contest\u003c/a\u003e, where TOP-3 foreigners, TOP-3 Japanese and 3 organizers took part. They dealt with \u003ca href\u003d\"http://cf16-exhibition-open.contest.atcoder.jp/assignments\"\u003etwo problems\u003c/a\u003e had half an hour. The online translation of their work was shown.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/2.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e Online-translation.  \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eWho was in TOP-3 Foreigners?\u003c/em\u003e\u003cbr /\u003e— \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/sevenkplus\" title\u003d\"Grandmaster sevenkplus\"\u003esevenkplus\u003c/a\u003e and \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Um_nik\" title\u003d\"Legendary grandmaster Um_nik\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eU\u003c/span\u003em_nik\u003c/a\u003e. At every stage it was possible to participate in parallel round, if you’ve lost. In the end the team of organizers won — they were the only who did the second problem. The others didn\u0027t manage to do anything, gave their thumbs down on the contest. But probably there was bad teamwork, that\u0027s the reason why. That\u0027s funny, everything was made for people to get fun. \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://cf16-relay-open.contest.atcoder.jp/\"\u003eThere was a contest\u003c/a\u003e, where in your team were 11 guys: 10 from Japan and one foreigner. You have 1,5 hour and 2 computers: the one to write on, another is for reading the code. Moreover, you have \u003ca href\u003d\"http://cf16-relay-open.contest.atcoder.jp/assignments\"\u003e11 problems\u003c/a\u003e — everybody has to do one. You get a sticker on your back with a number of problem. The problem are spread between each other at the very beginning. \u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/3.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e The teams are putting up colorful T-shirts before the entertaining contest on the second day.  \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eIf you haven\u0027t finished you are not allowed to exchange the problems?\u003c/em\u003e\u003cbr /\u003e— No, everybody works by themselves. But you can come to the computer, send the code, get WA, go and read the code, while somebody else is still writing his problem. We were not allowed even exchange the pieces of paper. The accent was made on the fact, that you had to solve the problem by yourself. And you need to explain him how to solve it.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/k/3.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e This is my team.  \u003ci\u003eComment and photo: Nicolay Kalinin\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003eThat was fun, because Japanese are not really good at English. On average, you can easily speak in English with 2 out of 10. And it likely be a Korean guy, who came to Japanese university by exchange. So it went like I was talking to a person who was good at English, and after he translated into Japanese to the others.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eCan you say that a foreigner will probably be the best in the team?\u003c/em\u003e\u003cbr /\u003e— Yes, but some were lucky to have a «strong» Japanese. There are several people of high professionalism, but the rest are very average. The problems were selected to match the level. The easiest were as easy as (a+b) problems of one-two «if». The hardest one was about the dynamic on wood.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/4.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e Our team on the second entertaining tour on the second day.  \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eDid you do it?\u003c/em\u003e\u003cbr /\u003e— Yep, and it happened that, in my team I didn\u0027t solve it. I was a bit mistaken, when creating the idea. The difficulty also was that I had to explain to Japanese, what I had just written, for them to find my fault (by the way, I could do it only on computer which was meant to read on). There was not much time.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/9.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e Debugging through the method of precise look.  \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eDid you notice some specific in Japanese strategy of doing the problems?\u003c/em\u003e\u003cbr /\u003e— I think, no. It was difficult to understand for one contest. The problem was in organizing the work in a right way. If somebody stuck up on a problem, he needed to be called and talked about the problem.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/13.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e You can tweet, but only not about the problems. Japanese :) \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eThat means, you played a role of coordinator?\u003c/em\u003e\u003cbr /\u003e— Yep, I had remove that one, ask if one can write, if he understood everything, how much time did he need — things like that.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eEverybody wrote on C++?\u003c/em\u003e\u003cbr /\u003e— Yes, but I used Java.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eI see, you are an old ITMO school student :) What about Grand Final?\u003c/em\u003e\u003cbr /\u003e— They send 20 people to a remote village — 1,5 hour from Tokyo. There was \u003ca href\u003d\"http://cf16-exhibition-final-open.contest.atcoder.jp/\"\u003ea ordinary contest\u003c/a\u003e which lasted for 3 hours and \u003ca href\u003d\"http://cf16-exhibition-final-open.contest.atcoder.jp/assignments\"\u003econsisted of 10 problems\u003c/a\u003e.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/10.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e The last hotel’s hall, we lived in. It looks very decent and beautiful inside.  \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/k/8.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e The view from the hotel where the participants of Grand Final lived.  \u003ci\u003eComment and photo: Nicolay Kalinin\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eDid Gena win?\u003c/em\u003e\u003cbr /\u003e— No, \u003ca href\u003d\"http://cf16-exhibition-final.contest.atcoder.jp/standings\"\u003ehe got the second prize\u003c/a\u003e. He needed two minutes more to hand in the problem and win.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/k/9.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e Grand Final — had our place at the tables with food served on it.     \u003ci\u003eComment and photo: Nicolay Kalinin\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eWho won then?\u003c/em\u003e\u003cbr /\u003e— \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/W4yneb0t\" title\u003d\"International Grandmaster W4yneb0t\"\u003eW4yneb0t\u003c/a\u003e from Zurich. The problems were quite specific, mathematically orientated, we needed to think and create. I usually don\u0027t solve such problems in my team, that\u0027s why I didn\u0027t show my best, but got a lot of joy while creating the ideas.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eThere was also a conference on the Code Festival, yes?\u003c/em\u003e\u003cbr /\u003e— Right. They persuaded Gena to talk with the audience for about an hour. That was very interesting. A list of questions was already made, and Gena answered them from the stage. He gave an answer in English, and after that he was translated into Japanese. \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/rng_58\" title\u003d\"International Grandmaster rng_58\"\u003erng_58\u003c/a\u003e gave another question in Japanese, and it was interpreted back to Gena in English. That was the system of translation. There was also another conference where \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/rng_58\" title\u003d\"International Grandmaster rng_58\"\u003erng_58\u003c/a\u003e took part, but only on Japanese language, so we didn\u0027t come.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/14.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e In the picture: «I wrote my first program, when I was 7…»   \u003ci\u003eComment and photo:Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eWas rng_58 a presenter? Did he fulfilled himself in a role of a showman?\u003c/em\u003e\u003cbr /\u003e— It wasn\u0027t actually a show, just a answer-question talk.\u003c/p\u003e \u003cdiv style\u003d\"background-color: rgb(250,250,250);padding: 1.0em;\"\u003e The conference is retold by Maxim Ahmedov: \u003cbr /\u003e\u003cbr /\u003e 4. Why do you have such a nickname? \u003cbr /\u003e     — Just remember the nickname you had at the age of seven, and don\u0027t ask, why it is like that. This word was written on Gena’s skies.\u003cbr /\u003e \u003cbr /\u003e 5. What is your favorite competition? \u003cbr /\u003e — Challenging question, but as part of this talk, let\u0027s say that it is Code Festival. \u003cbr /\u003e \u003cbr /\u003e 6. Do you consider sport programming to be useful for science studies and job search? \u003cbr /\u003e — Don\u0027t know, I don\u0027t work yet, but it seems that sport programming is useful in EVERY sphere (teaches you to think no worse than post-secondary education). Competitive programming made me a person who I am now. \u003cbr /\u003e \u003cbr /\u003e 7. What is important to win the contests for you? Speed, accuracy, knowledge, experience or gifted mind? \u003cbr /\u003e  — I believe, that every point is important except the gifted mind, because everything can be developed through hard work. \u003cbr /\u003e \u003cbr /\u003e 8. What is your favorite IDE?\u003cbr /\u003e — Far Manager. Nothing else is given to Gena, he uses only debug-output, only hardcore. The only thing Gena needs — is a autoindent redactor. In other cases he trash everybody out even without syntax lighting. \u003cbr /\u003e \u003cbr /\u003e 9. Which strategy your team used, when you took part in ICPC? \u003cbr /\u003e — I think it\u0027s important, that we actually never thought about the strategy, didn\u0027t loose our time on its discussion. We just did our best, moved to our targets. That was enough.  \u003cbr /\u003e  Here Gena commented on the fact that, there are twice more words in his answers in Japanese than in English. \u003cbr /\u003e After the interpretation, Gena decided, that it wasn\u0027t enough, so he added the description of the strategy. In other words, it\u0027s important to read the problems. He also said, that probably Japanese teams may have things arranged in a different way. Here rng_58 took the word and noticed, that they really had things done differently, he wasn\u0027t allowed to a computer at the final, they ruled on account of strategy. \u003cbr /\u003e \u003cbr /\u003e 10. What do you think about the frozen standings? (Makoto said there are various opinions on that account. That a burning issue.) \u003cbr /\u003e — Gena said, he feels more confident, when he sees the outcome table. Some teams wait for the freeze on purpose to send their решение,  and no to give a hint to the others, that the problem is easy. He also mentioned, that is exсiting, when the team does four problems in a period of freeze and «jumps higher and higher» on the standings table. \u003cbr /\u003e \u003cbr /\u003e 11. How often do you face some new things in the problems taking into consideration your rich experience?\u003cbr /\u003e — It depends on the contest. Some of them make their goal to introducing technical, challenging problems, not оригинальные ones. I suppose, one can find a big amount of interesting ideas, there will be enough for the next 20 years. \u003cbr /\u003e \u003cbr /\u003e 12. How many T-shirt from contests do you have?\u003cbr /\u003e — To count the number of t-shirts  that are NOT from contests would be easier. Gena said, he doesn\u0027t count them, probably, he has more than 100 of them, or even 500.\u003cbr /\u003e \u003cbr /\u003e 13.  What do you usually do while being on a plane? \u003cbr /\u003e —Gena didn\u0027t say it clear,  but no film watching, no laptop, just sleeping.\u003cbr /\u003e \u003cbr /\u003e 14. Where were you yesterday? \u003cbr /\u003e — Gena said, he walked through the city, he climbed the Tokyo tower, ate sushi. \u003cbr /\u003e He wondered about places the natives advise to go. Makoto replied, saying that when living for a long  time at one place, you start to forget about its. \u003cbr /\u003e \u003cbr /\u003e 15. What do you do with your friends in ITMO in your daily life? \u003cbr /\u003e — It took Gena long to answer: «We prepare contests, have lunches and dinners, sometimes have some entertainments и activities with friends and girlfriend.»\u003cbr /\u003e \u003cbr /\u003e 17. What\u0027s your favorite Caribbean island?\u003cbr /\u003e — Everybody laughed, and Gena admitted he had never been there, but he would be eager to go to Caribbean\u0027s on a contest. \u003cbr /\u003e  \u003c/div\u003e\u003cp\u003eAlso some entertaining games were arranged: lots of board games, completions: for example, who is the best in playing the drums. There were Guitar Hero and drums. You had to beat the drum in the right rhythm. Moreover, there were competitions in writing haiku or hieroglyphs.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/11.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e Between the event we played board games. As it’s nearly impossible to understand anything in them, Gena and Borya asked a Japanese guy to show the most amusing one. We needed to hit the sections out of hexagonic field, without making a penguin fall (including its construction). Sound easy, but exciting. That was a great fun.   \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eBoth, foreigners and Japanese participated?\u003c/em\u003e\u003cbr /\u003e— More Japanese, when talking of haiku and hieroglyphs.\u003c/p\u003e\u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/12.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e After the entertaining part till the closing part the audience was entertained by specially invited Japanese toast-master — a man, who joked, or did the push-ups to music (what for?) and drew strange hieroglyphs at the camera. \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eWhat prizes did the winners get?\u003c/em\u003e\u003cbr /\u003e— For Final and Grand Final money was raffled. Final TOP-20 winners were awarded 400K yens, Grand Final TOP-3 winners were awarded 500K yens. Good prizes. The 20th place got 20K yens, if I am not mistaken. Not so much, but still a pleasure.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eDid you managed to communicate with the Japanese people? What are their impressions of foreign competitors?\u003c/em\u003e\u003cbr /\u003e— Suppose, that was interesting. They got new experience. Judging by Japanese participants reaction on Gena’s conference, to listen about the team strategy was a real excitement for them. Clear, that having a talk with a top participant in programming was really cool.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eDid you manage to find some new friends from another countries?\u003c/em\u003e\u003cbr /\u003e— The majority of time we spend talking to Russian speaking guys.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eWhat was special about opening and closing ceremonies?\u003c/em\u003e\u003cbr /\u003e— Nothing special at the opening ceremony. At the closing one, while giving the awards, the organizers invited the real crackjackes. The World Champion in beating the drums, he showed us how to do it right. There also was invited a guy, who is great at drawing hieroglyphs, and he made a kind of show. When he gave people prizes, he also asked, what did they want him to draw for them. And one winner replied: «I would like you to draw \u0026quot;10 power to 9 plus 7\u0026quot;». And that guy did it somehow! On top of all that the interpreter girl didn\u0027t have knowledge in programming sphere, so it was really hard for her to explain \u0026quot;10 power to 9 plus 7\u0026quot;. A Japanese sitting next to us asked if she interpreted in a right way, and when said: «She didn\u0027t», he gave us a right translation.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eWhat food did you try?\u003c/em\u003e\u003cbr /\u003e— Traditional: sushi, sashimi. Every man has his taste, you know. I would call that food droll. I wouldn\u0027t have been able to eat if forever, but to try it during the week was an interesting experience.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/k/10.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e Came to eat to a place, which probably worked 24/7. Four of us were fed up with this set.   \u003ci\u003eComment and photo: Nicolay Kalinin\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— \u003cem\u003eCould you describe the total feedback? Faced any snobbism about making the competitions international.\u003c/em\u003e\u003cbr /\u003e— Didn\u0027t hear of such things. I enjoyed exactly the fact, that the competitions were mass-made. Lots of various action.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/files/codefestival2016/a/17.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003csmall\u003e It was 2:30 by night, but the traffic is more than busy.  \u003ci\u003eComment and photo: Maxim Ahmedov\u003c/i\u003e \u003c/small\u003e \u003c/center\u003e\u003c/div\u003e","tags":["codeforces::news","longread","code festival 2016"]}}