{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1421523562,"rating":-2,"authorHandle":"wildcraft","modificationTimeSeconds":1421523808,"id":15841,"title":"\u003cp\u003eHelp needed for this Algorithm Problem\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi Guys , Could you please help me to find out the algorithm for this problem.\u003c/p\u003e\u003cp\u003eNOTE : What I tried ? a:) I tried to think of subset sum variation. b:) I have also tried some sort of sorting + two pointer approach.\u003c/p\u003e\u003ch2\u003eBut I am not able to find out good running time for this problem.Please help me guys to solve this problem.\u003c/h2\u003e\u003cp\u003eShinchan\u0027s mom has asked Shinchan to go to market and buy some groceries for dinner. But wait, she don\u0027t know how much they will cost. Being a experienced housewife, she know that the maximum possible cost of these groceries can be C. But she can\u0027t say about minimum cost so let it be 1. That is cost of groceries can be any integer between 1 and C, inclusive.\u003c/p\u003e\u003cp\u003eIn Kasukabe, Shinchan\u0027s land, coins are of N denominations. Let these values be V \u003d {v1, v2, ..., vN}. Given these values and C, maximum cost of grocery, help Shinchan in finding minimum number of coins he need to take to market so that he can buy the groceries. He can have any number of coins of any given denomination.\u003c/p\u003e\u003cp\u003eConstraints: 1 \u0026lt;\u003d C \u0026lt;\u003d 10^5 1 \u0026lt;\u003d N \u0026lt;\u003d 10^5 1 \u0026lt;\u003d vi \u0026lt;\u003d 10^5, 0 \u0026lt; i \u0026lt;\u003d N All elements of V are distinct.\u003c/p\u003e\u003cp\u003eInput In first line we have two space separated integer, C N, maximum possible cost of grocery and number of types of coins. In next line there are N space separated integers, values of different types of coins.\u003c/p\u003e\u003cp\u003eOutput Print the minimum number of coins Shinchan can take to market so that he can pay any value between 1 and C, inclusive. If it is not possible then print -1. Sample Input (Plaintext Link)\u003c/p\u003e\u003cp\u003e20 4 1 2 5 10\u003c/p\u003e\u003cp\u003eSample Output (Plaintext Link)\u003c/p\u003e\u003cp\u003e5\u003c/p\u003e\u003c/div\u003e","tags":["dp","array","data structures"]}}