{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1424947809,"rating":88,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1424958359,"id":16646,"title":"\u003cp\u003eVK Cup 2015 — Informational Letter\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi Codeforces! \u003c/p\u003e\u003cp\u003eThe VK company (vk.com), the largest social network in Europe and the most popular site in Russia and Ukraine, announces the competition for russian-speaking programmers VK Cup 2015.\u003c/p\u003e\u003cp\u003eAs you can see, the reborn VK Cup is focused on Russian-speaking programming lovers. Indeed, the whole VK developer team speaks Russian, most social network users communicate in Russian and the head office of the company is located in St. Petersburg. Those are the reasons we decided to concentrate on the competition for russian-speaking participants — most of the social network code is written by medal winners and ACM-ICPC finals champions. We believe that when we support the enthusiasm of young people towards solving problems and studying algorithms, that we make the world better and invest for the future of our company.\u003c/p\u003e\u003cp\u003eThat is not the only innovation of the championship: unlike many other championships conducted by companies, VK Cup 2015 will have two-man teams competing with each other, the participants’ age ranges from 14 to 23 years. \u003c/p\u003e\u003cp\u003eThough we focus on the Russian-speaking participants, we are happy to share our problems and rounds with the participants from the whole world. For that reason, all problems of the championship will be translated into English and will be available to solve after the official championship rounds are over. Besides, in some rounds the participants from around the world can take part unofficially, side by side with the official championship contestants. We will be happy to give out 50 brand T-shirts of the Championship to the best out of competition unofficial participants of Round 3. We will be happy to see interest towards the problems of our championship!\u003c/p\u003e\u003cp\u003eVK Team\u003c/p\u003e \u003cdiv style\u003d\"text-align: center;\"\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/vkcup2015/VKCup-MIN2.png\" style\u003d\"width: 666.0px;margin: 2.0em auto;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e\u003c/div\u003e","tags":["vkcup","vk"]}}