{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1462710792,"rating":64,"authorHandle":"Alex7","modificationTimeSeconds":1462713293,"id":44763,"title":"\u003cp\u003eLet\u0027s get some data :D [a short survey]\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eSo I\u0027m very curious to see how those factors correlate to your codeforces rating and other competitive programming accomplishments.\u003c/p\u003e\u003cp\u003eI hope that enough people will answer those questions so we\u0027d get a representative sample and see what works on average and what doesn\u0027t.\u003c/p\u003e\u003cp\u003e1- How old were you when you solved your first competitive programming problem?\u003c/p\u003e\u003cp\u003e2- What is your primary programming language? \u003c/p\u003e\u003cp\u003e3- How many hours do you (on average) train weekly?\u003c/p\u003e\u003cp\u003e4- How many hours do you estimate that you\u0027ve trained your entire life?\u003c/p\u003e\u003cp\u003e5- How many minutes do you spend on average thinking about a problem before giving up and reading the tutorial? \u003c/p\u003e\u003cp\u003e6- How many hours do you sleep on average?\u003c/p\u003e\u003cp\u003e7- Do you drink coffee and/or other caffeinated beverages during competitions? \u003c/p\u003e\u003cp\u003e8- Do you drink coffee and/or other caffeinated beverages during training?\u003c/p\u003e\u003cp\u003e9- How many years have you been training? \u003c/p\u003e\u003cp\u003e10- How much did your school promote critical thinking Rate on the scale of 1-10 (1 being rote learning all memorization no thinking at all and 10 being awesome super genius teachers)\u003c/p\u003e\u003cp\u003e11- How many months did it take you to reach Div 1?\u003c/p\u003e\u003cp\u003eI know that those are a lot of questions but please answer them so I can prepare some wonderful graphs and stats.\u003c/p\u003e\u003cp\u003eAlso feel free to suggest any other factors that might have some impact.\u003c/p\u003e\u003cp\u003ePlease answer in this \u003ca href\u003d\"http://goo.gl/forms/TcmxOZ31Mb\"\u003eform\u003c/a\u003e because it will make the data much neater :D \u003c/p\u003e\u003c/div\u003e","tags":[]}}