{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1507048200,"rating":82,"authorHandle":"savinova","modificationTimeSeconds":1507197364,"id":54933,"title":"\u003cp\u003eОтчет о деятельности Botan Investments за сентябрь + рассказ Михаила Рубинчика о том, как зарабатывать в АСМ\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ сентябре в грантовой программе фонда Виктора Шабурова \u003cstrong\u003eBotan Investments\u003c/strong\u003e приняли участие 16 вузов. Больше всего студентов пришли на тренировки в ТПУ (Томск) — 42 человека, СГУ (Саратов) — 32 человека, УрФУ (Екатеринбург) — 24 человека. Больше всего тренировок за сентябрь провели КФУ (Казань) — 11 тренировок и МГУ (Саранск) — 9 тренировок. Также в сентябре к программе для преподавателей присоединились новые участники, это ННГУ им. Н. И. Лобачевского (Нижний Новгород) и ОГУ (Оренбург). \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBotan Investments\u003c/strong\u003e выступил спонсором квалификационного этапа Четвертьфинала ACM-ICPC Южного подрегиона, олимпиады по программированию в рамках международного форума “Объединяя параллели” на Дальнем Востоке и технического форума РИФ.Технологии. \u003cbr /\u003e\u003cbr /\u003e \u003c/p\u003e\u003ccenter\u003e \u003cdiv style\u003d\"width: 90.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/f9/e6/f9e66485e385a863a06004e16492fbf254d6b0a1.jpg\" style\u003d\"width: 90.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e \u003csmall\u003eОлимпиада по программированию в рамках форума “Объединяя параллели”\u003c/small\u003e \u003c/center\u003e \u003cbr /\u003e В группе \u003ca href\u003d\"https://vk.com/botaninvestments\"\u003eBotan Investments в ВК\u003c/a\u003e можно почитать новые посты \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik\" title\u003d\"Мастер MikhailRubinchik\"\u003eMikhailRubinchik\u003c/a\u003e \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_245\"\u003eо подготовке задач на сборы\u003c/a\u003e и о том, \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_259\"\u003eна чем держится АСМ сообщество\u003c/a\u003e. А сегодня Михаил подготовил рассказ о том, как можно зарабатывать, занимаясь ACM. \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e Всем привет! \u003cbr /\u003e\u003cbr /\u003e Недавно был \u003ca href\u003d\"//codeforces.com/blog/entry/53852\"\u003eпост\u003c/a\u003e от \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/TeaPot\" title\u003d\"Международный гроссмейстер TeaPot\"\u003eTeaPot\u003c/a\u003e. Там он задавался вопросом, станет ли АСМ ICPC спортом. На вопрос отвечать я не умею, хотя какие-то наблюдения по этому поводу у меня есть. Может быть, об этом я напишу отдельный пост позже. \u003cbr /\u003e\u003cbr /\u003e Желание заниматься тем, что нравится, вместо того, чтобы идти работать, вполне естественно. Поэтому сегодня я хочу поговорить о возможностях заработать деньги, оставаясь внутри АСМ и занимаясь только им. \u003cbr /\u003e\u003cbr /\u003e Почему я считаю, что компетентен говорить об этом? Например, потому что я один из тех, кому это удалось. Я не преподаю в университете, не работаю программистом, а занимаюсь исключительно АСМ. Я уже больше 10 лет в АСМ-тусовке и за это время немало общался с людьми, которые тоже зарабатывают внутри АСМ (правда, у большинства это не единственный источник дохода). \u003cbr /\u003e\u003cbr /\u003e Я не только расскажу о имеющихся возможностях, но и дам рекомендации, к кому обращаться во многих случаях. Конкретные вакансии в сфере спортивного программирования не известны в широких кругах, вы не найдёте их на хедхантере и подобных сайтах :) Поэтому эти сведения правда не так легко найти. \u003cbr /\u003e\u003c/p\u003e\u003cbr /\u003e \u003ccenter\u003e \u003cdiv style\u003d\"width: 70.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/7c/2a/7c2a0f1ac83c340d099343242d8bb5f858fcf8ff.jpg\" style\u003d\"width: 90.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e \u003c/center\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e Давайте обсудим все возможности. Если вы знаете ещё какие-то варианты, пишите их в комментариях. \u003cbr /\u003e\u003cbr /\u003e 1. Можно готовить задачи на онлайн-платформы. Есть немало платформ, которым требуются задачи. Платят довольно неплохо, на мой взгляд, например, \u003ca href\u003d\"https://www.codechef.com/problemsetting/setting\"\u003ecodechef.com/problemsetting/setting\u003c/a\u003e. Буду рад, если оставите в комментариях ссылки на стоимости подготовки задач на других платформах (сходу помню про codeforces, atcoder, csacademy, topcoder, hackerearth, hackerrank. Что ещё?). \u003cbr /\u003e\u003cbr /\u003e 2. Можно работать координатором на этих же платформах. Мы много слышим о координаторах cf. Опять же, может кто-нибудь составить список сайтов, где в данный момент есть координаторы и где они бывают нужны? На cf, думаю, достаточно написать \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Штаб, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e, если вы хотите стать координатором. Вас, как минимум, будут иметь в виду :) \u003cbr /\u003e\u003cbr /\u003e 3. А ещё можно работать тестером на этих же платформах. Такая должность уже есть не везде. На hackerearth у задачи есть автор и тестер отдельно. Тестер должен писать альтернативные решения, выявлять баги. Например, Богдан \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/I_love_Tanya_Romanova\" title\u003d\"Международный гроссмейстер I_love_Tanya_Romanova\"\u003eI_love_Tanya_Romanova\u003c/a\u003e Прищенко был там тестером. Видимо это значит, что у них координатор играет более слабую роль, выполняя работу организационного характера — сводит тестеров и авторов (может, что-то ещё). \u003cbr /\u003e\u003cbr /\u003e 4. Можно готовить задачи на ACM ICPC, например, на четвертьфиналы. Я думаю, за подготовку везде что-то платят. Свяжитесь с жюри вашего чф и скажите, что хотите участвовать в разработке задач. Или необязательно вашего. Например, мы проводим кволы и будем рады, если вы захотите стать соавторами. Преимущество кволов в том, что большинство задач простые, поэтому от вас не потребуется суперуровень АСМщика. Если вам это интересно, напишите мне. \u003cbr /\u003e\u003cbr /\u003e 5. Помимо четвертьфиналов некоторые вузы проводят внутренние соревнования. Например, у нас проходят шесть соревнований в год: два любительских и четыре для профи. Для них мы не придумываем свежие задачи, а берём готовые контесты и усложняем или упрощаем под уровень участников. Тут тоже есть нехватка авторов (часто я сам делаю все, потому что никто не вызвался, хотя я был бы рад отдавать все контесты). Если вам это интересно, свяжитесь со мной. У нас будут личные туры для профи в октябре и в декабре, можно поучаствовать в их подготовке. \u003cbr /\u003e\u003cbr /\u003e 6. Можно быть организатором контестов/сборов. Благо сейчас и соревнований, и сборов много. Я сам занимался организацией всех наших соревнований в 2012-2013 годах (\u003ca href\u003d\"https://habrahabr.ru/post/185054/\"\u003eпост с самоиронией о ЧУ 2013\u003c/a\u003e). По договорённости я делал это от Контура. Я думаю, это везде решается ситуативно: где-то универ находит деньги, где-то местные спонсоры. Насколько я знаю, наиболее развито это в МФТИ: у них есть большой отдел, который занимается организацией сборов и олимпиад. \u003cbr /\u003e\u003cbr /\u003e 7. Можно быть админом/координатором сборов, т.е. заливать все контесты в систему, проверять их готовность, искать контесты, которые ещё не засвечены. Сейчас этим занимается почти на всех сборах snark. Но ведь он не железный, а число сборов растёт. Так что я считаю, что этот рынок открыт :) Можно обращаться к организаторам сборов, если хотите в этом помочь. Я думаю, что и они будут рады, и Олег. \u003cbr /\u003e\u003cbr /\u003e 8. Можно быть руководителем программного комитета сборов. Эта тема относительно свежая. Сейчас стало много тематических сборов (в основном с подачи МФТИ). На эти мероприятия нужно находить авторов, проверять задачи на качество и т.д. На сборах МФТИ этим занимается Миша \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Endagorion\" title\u003d\"Международный гроссмейстер Endagorion\"\u003eEndagorion\u003c/a\u003e Тихомиров. Но опять же, количество сборов растёт, и я думаю, что вот-вот понадобятся новые люди :) А может, они уже нужны. \u003cbr /\u003e\u003cbr /\u003e 9. Можно выступать на сборах и готовить разборы. На все сборы привлекают лекторов и авторов. Обычно нужно собрать тематический контест + провести лекцию перед ним + провести разбор. Я около пяти раз ездил как лектор на подобные сборы. Это нерегулярный доход, но, помимо непосредственно заработка, появляется возможность познакомиться с организаторами и участниками. \u003cbr /\u003e\u003cbr /\u003e 10. Если вам не нравится участвовать в существующих сборах, вы можете делать свои. Я четыре раза приезжал в разные организации провести лекции/контесты на недельку (один раз в вуз, два раза в школу, один раз в it-компанию). Это пользуется спросом, но рынка ещё нет, поэтому те, кто хотят организовать у себя сборы, и те, кто могут их провести, пока не очень умеют находить друг друга :) \u003cbr /\u003e\u003cbr /\u003e 11. Можно заниматься репетиторством. Для меня, например, это является одним из основных источников доходов. Кто-то может возразить, что репетиторство не считается за АСМ ICPC. Но я готовлю школьников именно к АСМ ICPC/IOI, не к ЕГЭ :) От классического тренерства это отличается только тем, что гораздо более регламентирован формат и фиксировано время, которое вы тратите на ученика. Рынок существует, но, конечно, он небольшой. Здесь ещё сложнее, чем со сборами. На сборы часто не поездишь, так что клиентов нужно немного. А учеников лучше иметь много и постоянно находить замену, чтобы вы не “простаивали”. У меня это недавно начало получаться, но тут всё очень индивидуально, и, может, завтра снова перестанет работать. Думаю, что здесь важна репутация + мне помогло то, что у меня есть опыт подготовки студентов к ЧМ. Возможно, у Андрея \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/andrewzta\" title\u003d\"Гроссмейстер andrewzta\"\u003eandrewzta\u003c/a\u003e Станкевича вся почта и соц.сети завалены такими заявками :) \u003cbr /\u003e\u003cbr /\u003e 12. Можно быть тренером, в конце концов :) АСМ развивается, и всё больше вузов активно в нем участвуют. Здесь так же, как и с организационной работой — нужно найти того, кто будет вам платить. Это может быть компания или универ. Мне за тренировки в УрФУ по сколько-то платит и Контур, и универ. Это не является основным источником дохода (возможно, к сожалению), но это интересно и важно для меня, поэтому этим я занимаюсь больше всего. \u003cbr /\u003e\u003cbr /\u003e 13. Наконец, мы все любим решать задачки. А после того, как вы решили задачку, можно написать научную статью. У меня есть около 10 задач, которые я одновременно использовал в научных статьях и в АСМ. Вы считаете, что не способны на создание чего-то нового? Ок, есть куча результатов в АСМ, которые так и не добрались в науку. И есть куча обзорных журналов. Изучите посты на cf, опубликуйте результаты, описывая их как фольклор из ACM ICPC. Пусть декартово дерево по неявному ключу в конце концов кто-то опишет в научной статье :) Мне в своей последней статье пришлось описывать персистентное ДО с проталкиванием, поскольку ни одной статьи о нем не было, а я использовал его для решения задачи. Кстати, теперь можно ссылаться :) \u003cbr /\u003e\u003cbr /\u003e Вспоминайте ещё один способ заработать в АСМ ICPC и пишите комментарии. Начните прямо сейчас ;) \u003c/p\u003e\u003c/div\u003e","tags":["botan investments","виктор шабуров"]}}