{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1496237233,"rating":11,"authorHandle":"dalex","modificationTimeSeconds":1496237233,"id":52290,"title":"\u003cp\u003eEnglish pronouns in problem statements\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI\u0027ve just met a comment with a link to a problem statement. There was such text in the statement:\u003c/p\u003e\u003cp\u003e\u003cem\u003eSoon the professor realized that reconstructing Anatoly’s code and the test tree from his output was not a simple task and that the result might be ambiguous. You will have to help her find all possible reconstructions of Anatoly’s code.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eDon\u0027t you see something weird here? I think it should be:\u003c/p\u003e\u003cp\u003e\u003cem\u003eSoon the professor realized that reconstructing Anatoly’s code and the test tree from his output was not a simple task and that the result might be ambiguous. You will have to help \u003cstrong\u003ehim\u003c/strong\u003e find all possible reconstructions of Anatoly’s code.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eor:\u003c/p\u003e\u003cp\u003e\u003cem\u003eSoon the professor realized that reconstructing Anatoly’s code and the test tree from his output was not a simple task and that the result might be ambiguous. You will have to help \u003cstrong\u003ethem\u003c/strong\u003e find all possible reconstructions of Anatoly’s code.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eI know that people either use the gender that is more common for a person, e.g. \u003cem\u003ehe\u003c/em\u003e for drivers and \u003cem\u003eshe\u003c/em\u003e for nurses, or just use \u003cem\u003ethey\u003c/em\u003e (my English teacher said \u003cem\u003ethey\u003c/em\u003e is correct). I\u0027ve wandered across Wikipedia (here is one of the links: \u003ca href\u003d\"https://en.wikipedia.org/wiki/English_personal_pronouns#Use_of_he.2C_she_and_it\"\u003ehttps://en.wikipedia.org/wiki/English_personal_pronouns#Use_of_he.2C_she_and_it\u003c/a\u003e), but haven\u0027t found anything about preferrable usage of female pronouns.\u003c/p\u003e\u003cp\u003eHowever, I\u0027ve read really a lot of English statements, and everywhere the female pronouns are used! For children and professors, for drivers and miners, for rabbits and foxes, for everything and everyone. Why?\u003c/p\u003e\u003c/div\u003e","tags":["english","statements","grammar"]}}