{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1494713523,"rating":27,"authorHandle":".o.","modificationTimeSeconds":1494713583,"id":51976,"title":"\u003cp\u003eAre there some defects caused by \u0026quot;#define int long long\u0026quot; in competitive programming?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi. \u003c/p\u003e\u003cp\u003eToday I got WA on F just because I forgot to use \u003ccode\u003elong long\u003c/code\u003e instead of \u003ccode\u003eint\u003c/code\u003e on 1 line of code..\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/38/e5/38e5d7c50973dce1e6db6466efcce88ad8bcc386.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eAlthough I used a bunch of compile options from this \u003ca href\u003d\"//codeforces.com/blog/entry/15547\"\u003eblog post\u003c/a\u003e, it couldn\u0027t catch that bug. (I removed some of the options because it didn\u0027t work on my computer, maybe that could be the reason.)\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/22/16/2216dfddee075954927481f2fdc60e435fa28fbf.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eRecently my rating has dropped a lot because I had silly mistakes for at least one problem, so I am finding a way how to avoid mistakes. \u003c/p\u003e\u003cp\u003eAnd I thought of my failed hack of \u003ca href\u003d\"//codeforces.com/contest/806/submission/26929512\"\u003ethis solution\u003c/a\u003e. I got -50 points just because I couldn\u0027t find the \u0026quot;\u003ccode\u003e#define int long long\u003c/code\u003e\u0026quot; line and provided a huge input for the problem.\u003c/p\u003e\u003cp\u003eAt first I was quite upset and thought they did such thing to deceive hackers, but nowadays I\u0027m thinking that\u0027s quite a great way to avoid mistakes. So I decided to use \u003ccode\u003e#define int long long\u003c/code\u003e for the next rated round. But maybe there are some defects on this trick I couldn\u0027t find, so I would like to know some disadvantages caused by \u003ccode\u003e#define int long long\u003c/code\u003e. Could you please help me?\u003c/p\u003e\u003cp\u003eThanks in advance. :D\u003c/p\u003e\u003c/div\u003e","tags":[]}}