{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1408389581,"rating":14,"authorHandle":"phantom11","modificationTimeSeconds":1408390004,"id":13444,"title":"\u003cp\u003eCodeforces Favourite Blog Update Notifier\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThere are so many blogs coming up on codeforces everyday and we sometimes loose the blog which we are following which have got new comments. One of my friends, \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/xorfire\" title\u003d\"Expert xorfire\"\u003exorfire\u003c/a\u003e wanted something like this in his recent \u003ca href\u003d\"//codeforces.com/blog/entry/13427\"\u003eblog\u003c/a\u003e yesterday, in which I have also \u003ca href\u003d\"//codeforces.com/blog/entry/13427#comment-183261\"\u003ecommented\u003c/a\u003e my idea, and so I decided to write a script to automate the procedure. Firstly thanks to \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/xorfire\" title\u003d\"Expert xorfire\"\u003exorfire\u003c/a\u003e for coming up with this idea.\u003c/p\u003e\u003cp\u003eYou can download the zipped folder from \u003ca href\u003d\"https://dl.dropboxusercontent.com/u/111130681/codeforces_blog_update_notifier.zip\"\u003ehere\u003c/a\u003e. Extract it to some folder name of your choice. Inside it you will find many files which are actually dependencies, but you need to open just \u003cstrong\u003enotification.exe\u003c/strong\u003e file. I will describe the the functionality now.\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eUsername / Password fields -\u0026gt; Update them once in the beginning or whenever you want to change your username password. You do not need to write it every time.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAdd Favorite Blog -\u0026gt; Add the complete URL of the blog you want to follow. Example -\u0026gt; \u0026quot;http://codeforces.com/blog/entry/12727\u0026quot; (quotes for clarity). You can add as many as you want one by one.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eManage stored blogs -\u0026gt; If you want to delete some blogs, click this button and it will show your complete list in a new window. There will be delete option beneath every URL. You can delete any number of them, and then close the popped up window. \u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eRun Notifier -\u0026gt; This is the main thing. It will search all your favorite blogs and notify you for those which have new comments. It takes around 10 second for each blog (depends on your internet) . So run it and forget it for a minute (I assume you will not have more than 6-7 fav blogs, otherwise it will take more time). A new window will open where you will find the blogs which have new comments. These are click-able links and on clicking will redirect you to the concerned blogs.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eI have made this in 8-9 hours and have given absolutely no time to beautify it. Also it was my first time to use GUI in python. So you may find it ugly, but it works well and that is what is important. Also I have made it for personal use of everyone. So don\u0027t try to be smart and do unnecessary things to hack it like writing some blogs which do not exist at all (It might fail \u0026amp; I don\u0027t mind it). I made it for the welfare and personal use of the community and also in quick time, so use it in the right spirit. There are no security measures , (your username and password are stored in a file in the same directory) , so do not use it in public systems. I have tested in on Windows 7 and Windows XP and it works fine on both.\u003c/p\u003e\u003cp\u003eI hope you all will like it!!!\u003c/p\u003e\u003c/div\u003e","tags":["blog","blog_notifier"]}}