{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399089235,"rating":-19,"authorHandle":"measu80","modificationTimeSeconds":1399089235,"id":12135,"title":"\u003cp\u003eushered Battle of King \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eagainst Memphis Thunder ushered Battle of King Mountain. Prior to war four times dragged into extra time both teams, the game turned out to be a plus and dedication during the war, while also adding four consecutive games to become the NBA unprecedented record. Towards the end of overtime, Durant 2 penalty 1. Although the Thunder defense\u003ca href\u003d\"http://www.airfreeshoes.es/nike-roshe-run-c-56.html\"\u003enike roshe run baratas\u003c/a\u003e  under the Grizzlies after the attack, but one-third of the final 2.6 seconds when Durant\u0027s shot bounced off the rim out. Although Ibaka grabbed the offensive rebound and up into, but the shot had rung the final whistle. Grizzlies finally on the road to 100 over 99 to win the Battle of King Mountain, with a total score of 3:2 back home.Postgame news conference, unfortunately defeated the Thunder coach Brooks or two whether Durant and Westbrook few seemed very depressed. Durant critical moment in a penalty of two to become the first focus. Durant then throws the first ball has been in preparation for the first two penalty goals bald referee Joe — Crawford suddenly rushed forward, grabbed the basketball toward technology platform, said a few words. Durant was disrupted the rhythm of playing the final second penalty box out. Reporters asked about the circumstances Thunder coach, he began to look hesitantly, then said:. \u0026quot;It was a very embarrassing situation, I can only say,\u0026quot; Durant threw the same question, he said :. \u0026quot;I want to try to keep the focus was put the ball into the penalty, but unfortunately I was not able to do I do not know exactly what happened, but in any case I should have put the ball into the penalty\u0026quot; would be the Grizzlies\u0027 Conley describe the situation a bit more specific: \u0026quot;At that time (after Crawford put the ball away) I saw Durant one, we are wondering what to do in Crawford, but we are confused . Hey, having said that, I think it worked last night (not Durant throws). \u0026quot;Durant once midway through the fourth three-pointers to help the Thunder a short\u003c/p\u003e\u003cp\u003ego-ahead score, but after several attacks Thunder, Durant actually just stood weak-side end of the third corner position, then almost basketball without his hands. A reporter asked coach Brooks dictates whether it is a deliberate tactic, handsome cloth replied: \u0026quot;We did arrange Durant stood in the weak side corner bait, wanted to give\u003ca href\u003d\"http://www.airfreeshoes.es/nike-free-run-2-c-26.html\"\u003enike free run 2 venta\u003c/a\u003e  Reggie — Jackson opened the space to see if he could have played, but unfortunately No success \u0026quot;while Durant also chose to obey the coach\u0027s arrangement, he said:.\u0026quot; Sometimes in the game you have to do some bait, I am no opinion, I believe that my teammates. \u0026quot;Although Westbrook scored 30 points, 10 rebounds and 13 assists in a triple-double, but his shot selection is very problematic. 10 of the 31 shots he has repeatedly shot too hasty in the game. After the game a reporter asked this question, is that it does not Westbrook replied:. \u0026quot;There were times when I could be shot too early, but they always give me the opportunity to shoot 15 feet, I think I have 10 years 9 times to get it dropped the ball, I need to keep my aggressiveness. \u0026quot;Unfortunately, the data do not support his point of view and, after the game\u0027s statistics show Westbrook the game outside the paint actually shooting just 3 of 17 shots rather throw a 7 Trey\u0027s performance is even more dismal. Although he did not steal and dunk near the end of the regular time is a direct cause of the Thunder can tie the game into overtime, but it is clear that the performance was not enough to bring victory to the Thunder.Lost the Battle of King Mountain Thunder will be a guest at Memphis on Thursday night. The situation has ominous thunder down on the upcoming facing life and death battle also expressed confidence. Whether or coach Brooks Westbrook and Durant \u003c/p\u003e\u003cp\u003esaid: \u0026quot;We won the ball in there, where we know how to win.\u0026quot; Only if the state of the continuation of these games the Thunder\u0027s performance, I\u0027m afraid today\u0027s game, has been became their home in Oklahoma City this season farewell. Beijing time on April 30, NBA Western playoffs against the Memphis Grizzlies Oklahoma City Thunder fifth game in okc arena war. The results of both scored again in overtime, when the referee confirme\u003ca href\u003d\"http://www.airfreeshoes.es/nike-free-50-v4-c-16.html\"\u003ezapatillas nike free 5.0 v4\u003c/a\u003e  Ibaka tipped to be invalid after the buzzer, the Grizzlies point advantage with a tough win, won the Battle of King Mountain.also gave an interview to a reporter.A reporter asked: \u0026quot;4 consecutive games into overtime and won one of the three games, is what makes a team become so tenacious \u0026quot;Tony Allen said: \u0026quot;We work together, everyone plays their own characteristics, Mike Miller in overtime hit consecutive two key three-pointers, constantly attacking the basket Conley, Marc Gasol and blue Dov in the paint for us to contain. \u0026quot;A reporter asked, last year\u0027s playoffs, the Grizzlies in the game against the Thunder also won the fifth game, does that mean that the Grizzlies have a great chance to qualify for this year Tony Allen was not just a triumphalist, he calmly replied: \u0026quot;We are not going to consider we\u0027ve got the match point, we want to dedicate to focus on the next game, we played together for a long time , and alsoExperienced many ups and downs, so we will not be taken lightly. \u0026quot;For a dramatic game, Tony Allen also said: \u0026quot;We once 20 points ahead, even in the race at the last minute we were still controlled the game, b\u003c/p\u003e\u003c/div\u003e","tags":[]}}