{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399087036,"rating":-33,"authorHandle":"realab4","modificationTimeSeconds":1399087036,"id":12124,"title":"\u003cp\u003emade a preliminary determination\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eteam also has made a preliminary determination, in talking about what young players left a impression, he mentioned several names — \u0026quot;can not generalize a series of women who A career 杨力维 and é? good performance. \u0026quot;He turned his head and looked around Ji Yanyan,\u0026quot; Yan Yan\u0027s defense has made great progress, and Lu Wen already has a quality worl\u003ca href\u003d\"http://www.shoejordan.fr/air-jordan-1-c-1.html\"\u003eair jordan 1 pas cher\u003c/a\u003e  d-class striker. \u0026quot;Maher said,\u0026quot; We do not intend to lay off, then back to Beijing we have three weeks of training, field training and then go to Europe, we have a race in Russia, which is one of our big test. offensively until then perhaps dependence on Lu Wen will reduce our physical confrontation is the problem, when faced with a stronger physical confrontationAs ambassador, Hao Haidong this year has been to Foshan and Kunming two Division participated in the event, but during the game had been \u0026quot;stick to their posts,\u0026quot; opening and closing ceremonies are extremely fit to attend the event, interview, patiently posed with everyone. \u0026quot;This is what I need to assume the responsibility, if time is scheduled to be over, I will try to attend every stop activities,\u0026quot; he said. Speaking campus football development situation in recent years, Hao Haidong somewhat encouraging, \u0026quot;the country is also a lot of talent from campus football inside out, such as Japan, so we are now beginning to grasp the popularity of football on campus, the promotion is good , then we have to concern how to improve, how can more talent, the design of this system is very important to take a long time for patience and commitment. \u0026quot;Hao Haidong himself in football has experienced growth, maturity and perfection, he also hopes to be able to bring the kids Greenery more experience, he said: \u0026quot;By participating in the football \u003c/p\u003e\u003cp\u003egame, kids football training in the kind of fighting spirit , he also experienced the need to withstand setbacks, these are very valuable for them, and is given the football, so the role of the great football, football brings children a healthy body, healthy personality. \u0026quot;Speaking of the development of Chinese football, Hao Haidong said that at present we do in the Long March to lift his leg, the road is still long, but the most important is that everyone is willing to pay for it and invest, rather than stay in talking about it, or complaining about the team\u0027s achievements and the like, \u0026quot;We need to find the root development of Chinese football, do it step by step, a little bit to progress, and so the next ten or twenty years or even decades later Let\u0027s look at the Chinese football can not change \u003ca href\u003d\"http://www.shoejordan.fr/air-jordan-5-c-5.html\"\u003eair jordan 5 acheter\u003c/a\u003e  some. \u0026quot;(China Sports Daily, Xu Ke)Yesterday, the Xi\u0027an institute affiliated sports school principals Wenjun said, \u0026quot;We have seen a variety of questions online, that is not the manipulation of race ah, is not let foreign players to take the title ah, but this game are not the Olympics, even an annual regular season are not really, no need to do so ah and regulations of this competition is to participate in their personal capacity, not on behalf of the unit, \u0026quot;Zhang Wenjun said:.\u0026quot; These two kids ages are still small, This matter has been encountered spooked, especially those who talk to them online, and now the two are great mood swings and they made a mistake, it should be criticized, but it should give them the mistakes and wrongs chance) Wan Hui Times Cup 2014 National Men\u0027s Basketball Championship three people recently held in Shishan Town, Foshan, including Everest, the new century and Foshan Lion three CBA teams, including 22 team\u003c/p\u003e\u003cp\u003es took part in the high level of competition.It is understood that this competition was held for the first time in accordance with the national uniform standards FIBA highest level three basketball tournament, eventually outplay Tigers defeated the Leafs Bank team win, Foshan Lion Shi Hongfei team is to win the three points Ball Challenge champion. Tigers coach Du Feng said in an interview after the game, three basketball because of the different rules set with five matches, the greater the intensity of the game, defense requirements are higher for young players have a good workout roleThis year, the Women\u0027s National Team\u0027s little roses are growing. Although that support Steel Roses heyday in the achievement gap is not small, but their progress is worthy of recognition. \u0026quot;From the East Asian Games,\u003ca href\u003d\"http://www.shoejordan.fr/air-jordan-3-c-3.html\"\u003eair jordan 3 homme\u003c/a\u003e  the Chinese team to help these youngsters in recent years, the Japanese team won the first time in the Four Nations, we have won over the years did not win the Korean women\u0027s football. From the results is good, the process we also try to do some of the leading football philosophy is now close to the try. \u0026quot;Hao Wei Yu certainly in the performance of girls, but also that the current team has many problems to be solved. \u0026quot;In particular, the ability to grasp the opportunity in front of, oppression and mobile defensive response capabilities, we also need to further improve.\u0026quot;Need to strive to improve themselves deeply, so girls Women\u0027s National Team training very hard. \u0026quot;Now we often practiced three times a day, we really feel there is a lot of missing classes, want to fill up quickly. These kids is not easy to come back from the United States zipper and beat the league, the league national team training camp kick again, basically no holidays, indeed is very tired, so this evening to put a fake, they very happy. \u0026quot;girls efforts Hao Wei in the eyes. \u0026quot;We also measure, in the end the team can accept what \u003c/p\u003e\u003c/div\u003e","tags":[]}}