{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1486405799,"rating":231,"authorHandle":"poikniok","modificationTimeSeconds":1486405950,"id":50285,"title":"\u003cp\u003eCodechef Removing Problems from Long Contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eSo when I woke up this morning I saw that Codechef removed 2 of the 7 problems that were in the monthly long contest, \u003ca href\u003d\"https://www.codechef.com/FEB17?order\u003ddesc\u0026amp;sortBy\u003dsuccessful_submissions\"\u003elink\u003c/a\u003e, because they were “found to be available online”. I wanted to make this post to protest this decision, as I feel like this sets a bad precedent, and does not have many benefits in my opinion. \u003c/p\u003e\u003cp\u003eMy issue lies with the fact that part of reason I compete in long contest is so that when I do indeed solve a problem, I enjoy being able to look at other solutions after the contest is over, and learning from them. Removing problems makes this impossible I believe, and is also simply discouraging.\u003c/p\u003e\u003cp\u003eIn addition I feel like the Codechef writers should spend 10 minutes Googling around before putting problem in. If they can not find anything in 10 minutes than I would say even if the problem can indeed be found somewhere, say on Chinese blog with code written in assembly, that it is nontrivial enough to find that it is okay to include the problem. \u003c/p\u003e\u003cp\u003eHaving problems included for 3 days, letting people solve them and spent a lot of time thinking about them, and then removing them, makes for a bad contest in my opinion. As somebody who solved the problems without finding solutions online I would have been perfectly happy if they kept the problems, the fact that other people may have solved them by Googling does not upset me at all, particularly since in my opinion Googling is always a part of Codechef long contests, as at the very least for approximation problems and the like one can frequently find academic papers on the topic. \u003c/p\u003e\u003cp\u003eAnyway just wanted to make my opinion known, I don’t suppose the Codechef people likely care what I think, but maybe if people agree with me then they can change their policy for future. \u003c/p\u003e\u003c/div\u003e","tags":[]}}