{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1462516296,"rating":26,"authorHandle":"daga","modificationTimeSeconds":1462519198,"id":44729,"title":"\u003cp\u003eCodeChef SnackDown 2016\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eSnackDown is envisioned to be an annual multi-round global programming tournament conducted by CodeChef. The aim with SnackDown is to pit the best programming minds from across the globe against each other for the ultimate title of “SnackDown Champions.” Apart from the bragging right and the title comes with a wide assortment of cool merchandises, a hefty cash award, and a Software Engineering job offer with Directi, the parent company of CodeChef. After multiple online rounds the best teams are flown down for the grand finale at the CodeChef headquarters, Directiplex in Mumbai, India.\u003c/p\u003e\u003cp\u003eSnackDown is the largest onsite programming event held in India, with participation of teams from all over the globe. More importantly, it is open for anyone with a knack of programming. Whether you are studying in school, a college student, a working professional, a home-schooled wonder or a self taught programming brilliance, you are absolutely eligible to take part and win prizes.\u003c/p\u003e\u003cp\u003eRegister \u003ca href\u003d\"https://www.codechef.com/snackdown/2016/?REF\u003ddaga_07\"\u003ehere\u003c/a\u003e! and keep starring the \u003ca href\u003d\"https://www.codechef.com/snackdown/2016/news\"\u003eupdates\u003c/a\u003e, it may do a trick.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePrizes:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e1st\u003c/strong\u003e: $10,000 \u003cstrong\u003e2nd\u003c/strong\u003e: $5,000 \u003cstrong\u003e3rd\u003c/strong\u003e: $3,000 and lot more\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/df/18/df18ffa6c36c0041f48539a5a88929ebac178f93.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codechef","snackdown2016"]}}