{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1435740398,"rating":199,"authorHandle":"ArtDitel","modificationTimeSeconds":1435824098,"id":19010,"title":"\u003cp\u003eChallenge24 2015 writeup\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi all, we participated in challenge24 as aimfund team (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/zeliboba\" title\u003d\"Grandmaster zeliboba\"\u003ezeliboba\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/artditel\" title\u003d\"Candidate Master artditel\"\u003eartditel\u003c/a\u003e,\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Zhukov_Dmitry\" title\u003d\"Grandmaster Zhukov_Dmitry\"\u003eZhukov_Dmitry\u003c/a\u003e), took 6th place and here is my writeup. We really love challenge24 and 24-hour format, thank you guys for making it, and we are waiting for the next year. But I should say that writeup will be mostly negative because of overall impression.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e Psyho\u0027s 1st place writeup with solutions: \u003ca href\u003d\"//codeforces.com/blog/entry/19023\"\u003ehttp://codeforces.com/blog/entry/19023\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/25/cd/25cd63ac95dc079c34f5b0bf221d1311c51ec591.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e .\u003c/p\u003e\u003cp\u003eThe first negative moment was not the fact of a postpone, but the unknowing of exact schedule and orgs silence. We think it happened because of sponsor issue.\u003c/p\u003e\u003cp\u003eNext strange stage was the onsite network test and team placement. There were no seating chart so we picked the random room with 3/5 russian teams. There were no test targets too, we had neither server ip nor checklist, the only thing we did was setting switch and checking power adapters.\u003c/p\u003e\u003cp\u003eAt the contest day we came in the same room and waited for the start. It was really unexpected to find only 6 tasks in problemset, we thought more would come, but it didn\u0027t. By the way, submit interface didn\u0027t work for the first 2-3 hours.\u003c/p\u003e\u003cp\u003eA, D and E were pretty straightforward tasks and almost every team solved them. Tests for \u0027E\u0027 were broken, and it took 2-3 hours to fix them.\u003c/p\u003e\u003cp\u003eF task meant to be online game with all teams competing each other in 20 rounds. But what we found was: incomplete statement, it looked like someone forgot to include 2 or 3 pages, and offline server, which went online only after 6-10 hours of competition. Next 6-8 hours jury was trying to fix it and finally they changed literally the whole tasks 4 hours before the end! I think it was one of the worst moments of the contest. Last thing to mention is the scores, which appeared 3-4 hours after the round end.\u003c/p\u003e\u003cp\u003eC task was the best one, but it wasn\u0027t enough to save the contest. In this task you have assembly language with: in, out, mov, rmov, jmp, jz, jnz, jneg, add, sub, div, xor, mul. You were given assembly compiler, binary runner and 3 binaries (without asm code, so you should decompile or reverse them somehow) and the task was to optimize the size and run-time of these binaries. Sounds tasty. We started optimising first binary, because it had no input, only output. Overall idea was to optimize the algorithm and then make constant micro optimisations. For example in second binary you should implement the sorting algo.\u003c/p\u003e\u003cp\u003eBut there was a problem too: the scoring system. You could spend hours writing good solution (nlogn head-sort or merge-sort), optimize initial binary by ten times and get... ONE point of 400. It happened because of strange formula and unknowing what input data is used by the jury. It is a big array or small? How many tests do they have? We implemented 4 different algorithms, combined them and got 50 points only.\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e# simple insertion sort\nmov 0, array_ptr\nread_loop:\n  in 4\n  jz 4, end\n  rmov 4, *0\n\n  mov 8, 0\n  mov 12, 8\n  sub 12, four\n  swap_loop:\n    mov 4, *12\n    jz 4, swap_end\n    sub 4, *8\n    jneg 4, swap_go\n    jmp swap_end\n    swap_go:\n      mov 4, *12\n      mov 16, *8\n      rmov 16, *12\n      rmov 4, *8\n      sub 12, four\n      sub 8, four\n  jmp swap_loop\n  swap_end:\n  add 0, four\njmp read_loop\n\nend:\nmov 0, array_ptr\nprint_loop:\n  mov 4,*0\n  jz 4, 0\n  out 4\n  add 0, four\njmp print_loop\n\nfour:\ndw 4\narray_ptr:\ndw array\nzero:\ndw 0\narray:\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eB task was the worst one. It\u0027s a task with a physical construction with a video stream of it. You controll the fan that moves around the field with ping-pong ball on it, and your target is to lead the ball into the hole. Your team have 16 attempts: 4 unrated, 4 without obstacles, 8 with them. One ball will cost you around 100 points, it\u0027s a difference between 4th, 5th and 6th places.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"last rounds for task B\" src\u003d\"/predownloaded/73/31/7331367ab233feb023c15fda382d11f66cec6521.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eI think jury expected that someone will use video recognition but no one did. All teams just watched the video and played with a keyboard. And every team did almost the same thing every round, so the score was mostly the matter of luck and agility.\u003c/p\u003e\u003cp\u003eI understand how difficult it is to make such an event and I want to participate in the next ch24, so I hope that jury will look at this writeup and will try to avoid/overcome all mentioned issues in the future.\u003c/p\u003e\u003cp\u003eP.S. And thanks for massage, it\u0027s really great feature for such event ;) And \u003ca href\u003d\"http://ch24.org/gallery2015.html\"\u003ehere\u003c/a\u003e you can find photos \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"20 minutes of massage\" src\u003d\"/predownloaded/f4/4a/f44a21634b6970cebd3fc693bb855c1471a02358.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["ch24","challenge24","2015","writeup","budapest"]}}