{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1430133839,"rating":22,"authorHandle":"RussianCodeCup","modificationTimeSeconds":1430133839,"id":17606,"title":"\u003cp\u003eRCC2015 — Второй квалификационный раунд — разбор задач\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003eAnalysis QR2 RCC 2015\u003c/h1\u003e \u003ch2\u003eЗадача A. Турникеты в метро.\u003c/h2\u003e\u003cp\u003e\u003cb\u003eИдея:\u003c/b\u003e Дмитрий Филиппов.\u003cbr /\u003e \u003cb\u003eРеализация:\u003c/b\u003e Дмитрий Филиппов.\u003cbr /\u003e \u003cb\u003eРазбор:\u003c/b\u003e Виталий Аксёнов.\u003cbr /\u003e \u003c/p\u003e\u003cp\u003e  По условию задачи нужно найти момент времени, когда числа, отображаемые на турникете у двух мальчиков, будут отличаться в \u003ci\u003ek\u003c/i\u003e раз.  В первую очередь разберём случай \u003ci\u003ek\u003c/i\u003e\u003d1, в этом случае ответ — YES, если на обоих турникетах показывается 99 или  если \u003ci\u003ea\u003c/i\u003e \u003d \u003ci\u003eb\u003c/i\u003e. Иначе, несложно заметить, что правильный момент времени наступит  не раньше, чем у какого-то мальчика количество поездок станет меньше 99. Перейдём сразу к первому такого моменту.  У нас осталось всего не более 99 вариантов подходящих дней. Переберём и проверим каждый из них на то, что он удовлетворяет условию задачи. \u003c/p\u003e \u003ch2\u003eЗадача В. Игра.\u003c/h2\u003e \u003cb\u003eИдея:\u003c/b\u003e Николай Ведерников.\u003cbr /\u003e \u003cb\u003eРеализация:\u003c/b\u003e Николай Ведерников.\u003cbr /\u003e \u003cb\u003eРазбор:\u003c/b\u003e Николай Ведерников.\u003cbr /\u003e \u003cp\u003e  По условию задачи нужно найти математическое ожидание длины пути с первого уровня до последнего.  Для этого воспользуемся методом динамическим программированием. \u003c/p\u003e \u003cp\u003e  В \u003ci\u003edp\u003c/i\u003e[\u003ci\u003ei\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e] будет хранить математическое ожидание длины пути,  если мы начнем на \u003ci\u003ei\u003c/i\u003e-м этаже в \u003ci\u003ej\u003c/i\u003e-ой комнате и пойдём до последнего уровня.  Тогда ответ на нашу задачу будет хранится в \u003ci\u003edp\u003c/i\u003e[1][1]. \u003c/p\u003e \u003cp\u003e  Будет решать задачу с последнего уровня до первого. Понятно, что \u003ci\u003edp\u003c/i\u003e[\u003ci\u003en\u003c/i\u003e \u0026amp;plus; 1][\u003ci\u003ex\u003c/i\u003e] \u003d 0,  где \u003ci\u003ex\u003c/i\u003e от 1 до \u003ci\u003en\u003c/i\u003e \u0026amp;plus; 1. Теперь зная ответ для (\u003ci\u003ek\u003c/i\u003e \u0026amp;plus; 1)-го уровня, посчитаем  значение динамики для \u003ci\u003ek\u003c/i\u003e.  \u003c/p\u003e\u003cul\u003e  \u003cli\u003e  Если \u003ci\u003ea\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e][0] \u0026lt; \u003ci\u003ea\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e][1],  тогда \u003ci\u003edp\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e] \u003d \u003ci\u003edp\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e \u0026amp;plus; 1][\u003ci\u003ej\u003c/i\u003e] + \u003ci\u003ea\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e][0].  Где \u003ci\u003ea\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e][0] —  длина коридора с \u003ci\u003ek\u003c/i\u003e-го уровня \u003ci\u003ej\u003c/i\u003e-ой комнаты  в \u003ci\u003ej\u003c/i\u003e-ую комната на (\u003ci\u003ek\u003c/i\u003e \u0026amp;plus; 1)-ом уровне.  А \u003ci\u003ea\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e][1] —  длина коридора с \u003ci\u003ek\u003c/i\u003e-го уровня \u003ci\u003ej\u003c/i\u003e-ой комнаты  в (\u003ci\u003ej\u003c/i\u003e \u0026amp;plus; 1)-ую комната на (\u003ci\u003ek\u003c/i\u003e \u0026amp;plus; 1)-ом уровне.  \u003c/li\u003e  \u003cli\u003e  Если \u003ci\u003ea\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e][0] \u0026gt; \u003ci\u003ea\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e][1],  тогда \u003ci\u003edp\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e] \u003d \u003ci\u003edp\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e \u0026amp;plus; 1][\u003ci\u003ej\u003c/i\u003e \u0026amp;plus; 1]  + \u003ci\u003ea\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e][1].  \u003c/li\u003e  \u003cli\u003e  Если \u003ci\u003ea\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e][0] \u003d \u003ci\u003ea\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e][1], тогда  \u003ci\u003edp\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e] \u003d (\u003ci\u003edp\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e \u0026amp;plus; 1][\u003ci\u003ej\u003c/i\u003e] +  \u003ci\u003edp\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e \u0026amp;plus; 1][\u003ci\u003ej\u003c/i\u003e \u0026amp;plus; 1]) / 2 + \u003ci\u003ea\u003c/i\u003e[\u003ci\u003ek\u003c/i\u003e][\u003ci\u003ej\u003c/i\u003e][0].  Так как мы могли равно вероятно пойти как по первому коридору, так и по второму с равной вероятностью.  \u003c/li\u003e  \u003c/ul\u003e  \u003cp\u003e\u003cbr /\u003e После подсчёта ответ на задачу будет храниться в \u003ci\u003edp\u003c/i\u003e[1][1]. \u003c/p\u003e \u003ch2\u003eЗадача С. Палочки и Шарниры.\u003c/h2\u003e \u003cb\u003eИдея:\u003c/b\u003e Георгий Корнеев.\u003cbr /\u003e \u003cb\u003eРеализация:\u003c/b\u003e Григорий Шовкопляс.\u003cbr /\u003e \u003cb\u003eРазбор:\u003c/b\u003e Григорий Шовкопляс.\u003cbr /\u003e \u003cp\u003e В этой задаче нам дана последовательность палочек, соединенных шарнирами, которая может принимать форму любой ломаной, с ребрами равными длинам соответствующих палочек. В условии эта фигура была названа цепочкой. Нужно найти минимальный радиус такой окружности, что в нее можно поместить цепочку, при этом центр окружности должен совпадать с началом первой палочки. \u003c/p\u003e \u003cp\u003e Рассмотрим решение с помощью двоичного поиска по ответу. Очевидно, что если цепочка помещается в окружность, то она поместится и в окружность большего радиуса. \u003c/p\u003e \u003cp\u003e Теперь надо научиться проверять, что окружность может вместить в себя цепочку. Идея проста: наберем максимальное количество палочек, такое что их суммарная длина меньше либо равна радиусу окружности. Если больше палочек нет, то задача решена. Иначе, смотрим, можем ли поместить следующую: если ее длина минус сумма предыдущих больше радиуса (развернули ее в шарнире на 180 градусов, и она вышла за пределы окружности), значит, уместить цепочку в эту окружность нельзя, иначе — на окружности найдется точка, на которую можно положить следующий шарнир, а значит, эта палочка поместится. Теперь проверяем, что длина оставшихся палочек меньше диаметра окружности, что равносильно тому, что мы можем разложить все оставшиеся шарниры на окружность, и цепочка поместится в окружность. \u003c/p\u003e \u003ch2\u003eЗадача D. Числа Фибоначчи.\u003c/h2\u003e\u003cp\u003e\u003cb\u003eИдея:\u003c/b\u003e Илья Збань.\u003cbr /\u003e \u003cb\u003eРеализация:\u003c/b\u003e Виталий Аксёнов.\u003cbr /\u003e \u003cb\u003eРазбор:\u003c/b\u003e Виталий Аксёнов.\u003cbr /\u003e \u003c/p\u003e\u003cp\u003e  По условию задачи нужно найти сумму \u003ci\u003ek\u003c/i\u003e-ых степеней первых \u003ci\u003en\u003c/i\u003e чисел Фибоначчи по модулю 10\u003csup\u003e9\u003c/sup\u003e+23.  Самое первое действие заключалось в разложении модуля на множители:  10\u003csup\u003e9\u003c/sup\u003e+23 \u003d 3·11\u003csup\u003e2\u003c/sup\u003e·61·45161.  Давайте посчитаем нужную сумму по каждому из этих модулей и восстановим по Китайской Теореме об Остатках  ответ на задачу. \u003c/p\u003e \u003cp\u003e  Для каждого модуля по отдельности задача решается следующим образом. Найдём период чисел Фибоначчи.  Для наших модулей они получаются небольшими, и предпериод всегда равен 0.  Посчитаем сумму \u003ci\u003ek\u003c/i\u003e-ых степеней чисел Фибоначчи на данном периоде и ещё небольшом кусочке.  Тогда ответ на задачу при фиксированном \u003ci\u003en\u003c/i\u003e будет равен сумме нескольких периодов и сумма на маленьком кусочке. \u003c/p\u003e \u003cp\u003e  Получив ответ для каждой из меньших задач, восстанавливаем ответ для начальной задачи. \u003c/p\u003e \u003cp\u003e  К сожалению, на данном этапе задача не заканчивалась. Нужно придумать любую оптимизацию для того, чтобы программа прошла по времени.  Можно было применить следующие: избавиться от двойного взятия по модулю при быстром возведении в степень, предварительно  предподсчитав числа в степенях степени двойки, либо возводить не в степень \u003ci\u003ek\u003c/i\u003e, а воспользоваться теоремой  Эйлера и возводить в степень по модулю \u003ci\u003eφ\u003c/i\u003e. \u003c/p\u003e \u003ch2\u003eЗадача E. Телепорты.\u003c/h2\u003e \u003cb\u003eИдея:\u003c/b\u003e Илья Збань.\u003cbr /\u003e \u003cb\u003eРеализация:\u003c/b\u003e Илья Збань.\u003cbr /\u003e \u003cb\u003eРазбор:\u003c/b\u003e Илья Збань.\u003cbr /\u003e \u003cp\u003e  В задаче дано \u003ci\u003en\u003c/i\u003e точек-телепортов, от которых можно отразиться, и требуется проверить,  можно ли добраться из стартовой точки до конечной. \u003c/p\u003e \u003cp\u003e  Заметим, что два отражения подряд относительно точек \u003ci\u003ei\u003c/i\u003e, \u003ci\u003ej\u003c/i\u003e прибавят к координате текущей точки вектор  \u003ci\u003ef\u003c/i\u003e(\u003ci\u003ei, j\u003c/i\u003e) \u003d (2(\u003ci\u003ex\u003c/i\u003e\u003csub\u003ej\u003c/sub\u003e — \u003ci\u003ex\u003c/i\u003e\u003csub\u003ei\u003c/sub\u003e), 2(\u003ci\u003ey\u003c/i\u003e\u003csub\u003ej\u003c/sub\u003e — \u003ci\u003ey\u003c/i\u003e\u003csub\u003ei\u003c/sub\u003e)).  Если мы знаем, что в ответе четное число отражений, то задачу можно свести к следующей: можно ли представить вектор  (\u003ci\u003ex\u003c/i\u003e\u003csub\u003ef\u003c/sub\u003e — \u003ci\u003ex\u003c/i\u003e\u003csub\u003es\u003c/sub\u003e, \u003ci\u003ey\u003c/i\u003e\u003csub\u003ef\u003c/sub\u003e — \u003ci\u003ey\u003c/i\u003e\u003csub\u003es\u003c/sub\u003e) суммой векторов \u003ci\u003ef\u003c/i\u003e(\u003ci\u003ei, j\u003c/i\u003e).  Случай с нечетным числом векторов в ответе сводится к задаче с четным числом, если первым действием отразить стартовую точку  относительно любого телепорта (может показаться, что нужно перебрать все \u003ci\u003en\u003c/i\u003e вариантов первого хода, но на самом деле это не обязательно)  и попытаться решить задачу с четным числом векторов в ответе. \u003c/p\u003e \u003cp\u003e  Заметим, что не нужно использовать все \u003ci\u003en\u003c/i\u003e\u003csup\u003e2\u003c/sup\u003e векторов \u003ci\u003ef\u003c/i\u003e(\u003ci\u003ei, j\u003c/i\u003e): \u003ci\u003ef\u003c/i\u003e(\u003ci\u003ei, j\u003c/i\u003e) \u003d \u003ci\u003ef\u003c/i\u003e(1, \u003ci\u003ej\u003c/i\u003e) — \u003ci\u003ef\u003c/i\u003e(1, \u003ci\u003ei\u003c/i\u003e).  Итак, у нас в рассмотрении остался всего \u003ci\u003en\u003c/i\u003e-1 вектор. Утверждается, что целочисленную линейную оболочку целочисленных векторов  можно представить как целочисленную линейную оболочку всего двух некоторых векторов, т.е. эта оболочка — некоторая сетка на плоскости. \u003c/p\u003e \u003cp\u003e  Будем добавлять в рассмотренное множество векторы по одному и поддерживать два вектора, задающие линейную комбинацию всех уже добавленных.  Один вектор будет иметь вид \u003ci\u003ev\u003c/i\u003e\u003csub\u003e1\u003c/sub\u003e \u003d (\u003ci\u003ex\u003c/i\u003e\u003csub\u003e1\u003c/sub\u003e, 0), где \u003ci\u003ex\u003c/i\u003e\u003csub\u003e1\u003c/sub\u003e — минимально возможное  положительное, а второй — \u003ci\u003ev\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e \u003d (\u003ci\u003ex\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e, \u003ci\u003ey\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e), где \u003ci\u003ey\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e —  минимально возможное положительное, и 0 ≤ \u003ci\u003ex\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e \u0026lt; \u003ci\u003ex\u003c/i\u003e\u003csub\u003e1\u003c/sub\u003e. \u003c/p\u003e \u003cp\u003e  Пока все добавленные векторы коллинеарны, используя алгоритм Евклида легко находить, какой единственный вектор может представить своей  линейной комбинацией все остальные. Как только в рассмотренном множестве появляется хотя бы одна пара неколлинеарных векторов, векторы  пересчитываются иначе. Пусть добавлен был вектор \u003ci\u003ev\u003c/i\u003e\u003csub\u003e3\u003c/sub\u003e. \u003c/p\u003e \u003cp\u003e  Чтобы найти новый вектор \u003ci\u003ev\u003c/i\u003e\u003csub\u003e1\u003c/sub\u003e, надо посмотреть на GCD двух векторов: старого \u003ci\u003ev\u003c/i\u003e\u003csub\u003e1\u003c/sub\u003e, и вектора с минимальным  \u003ci\u003ex\u003c/i\u003e вида (\u003ci\u003ex\u003c/i\u003e, 0), представимого линейной комбинацией векторов \u003ci\u003ev\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e и \u003ci\u003ev\u003c/i\u003e\u003csub\u003e3\u003c/sub\u003e. Для этого нужно найти  минимальное решение уравнения \u003ci\u003ek\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e · \u003ci\u003ey\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e + \u003ci\u003ek\u003c/i\u003e\u003csub\u003e3\u003c/sub\u003e · \u003ci\u003ey\u003c/i\u003e\u003csub\u003e3\u003c/sub\u003e \u003d 0. \u003c/p\u003e \u003cp\u003e  Чтобы найти новый вектор \u003ci\u003ev\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e, надо рассмотреть вектор вида \u003ci\u003ek\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e · \u003ci\u003ev\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e +  \u003ci\u003ek\u003c/i\u003e\u003csub\u003e3\u003c/sub\u003e · \u003ci\u003ev\u003c/i\u003e\u003csub\u003e3\u003c/sub\u003e. Нужно найти любое решение уравнения \u003ci\u003ek\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e · \u003ci\u003ey\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e +  \u003ci\u003ek\u003c/i\u003e\u003csub\u003e3\u003c/sub\u003e · \u003ci\u003ey\u003c/i\u003e\u003csub\u003e3\u003c/sub\u003e \u003d GCD(\u003ci\u003ey\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e, \u003ci\u003ey\u003c/i\u003e\u003csub\u003e3\u003c/sub\u003e), и прибавить несколько раз новый  \u003ci\u003ev\u003c/i\u003e\u003csub\u003e1\u003c/sub\u003e, чтобы гарантировать минимальность по х-координате. \u003c/p\u003e \u003cp\u003e  Зная два вектора, задающие сетку, легко проверить, что данный вектор представим в виде их целочисленной линейной комбинации: нужно всего лишь проверить, что его коэффициенты разложения по этим двум векторам являются целыми числами. \u003c/p\u003e\u003c/div\u003e","tags":[]}}