{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1468329934,"rating":7,"authorHandle":"GoTo","modificationTimeSeconds":1468337764,"id":46004,"title":"\u003cp\u003eШкола GoTo по машинному обучению и интернету вещей на ФКН ВШЭ, август 2016\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eС 1 по 8 августа в Москве пройдет городская школа GoTo по машинному обучению и интернету вещей, организованная совместно с факультетом компьютерных наук НИУ ВШЭ.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eК участию приглашаются школьники и студенты возрастом до 22 лет, прошедшие предварительный отбор в рамках выбранного направления. Отбор прежде всего нацелен на проверку навыков программирования и мотивации, а также для разделения на разные потоки начинающих и опытных участников. От начинающих мы с радостью примем решения задачи любыми способами, а опытные участники имеют возможность заявить о себе и выиграть \u003cstrong\u003eгрант на бесплатное обучение\u003c/strong\u003e. Обладатели 10 грантов на бесплатное обучение и скидок будут объявлены 20 июля.\u003c/p\u003e\u003cp\u003eНаправлению ML предложена задача по созданию рекомендательной системы на реальных данных телеканалов от партнера школы компании E-contenta, направлению IoT – по созданию умного светофора с пробками, оповещающего вас в Telegram о том, что пора выдвигаться домой после работы. Вот и сами задания: \u003ca href\u003d\"https://docs.google.com/document/d/1n6EOjwbyPLcSjvyqo2zq_xwvIwrR-zwaKBWv71Z5Bns/edit\"\u003eML\u003c/a\u003e и \u003ca href\u003d\"https://docs.google.com/document/d/1urCq1tXMpoYTMjgpkFB01EiQQ-OGVnI8UmluuodovYk/edit?usp\u003dsharing\"\u003eIoT\u003c/a\u003e. \u003ca href\u003d\"https://habrahabr.ru/company/econtenta/blog/303458/.\"\u003eСтатья на Хабре\u003c/a\u003e о метриках в помощь. \u003c/p\u003e\u003cp\u003eВ программе школы участников ждут лекции от ведущих экспертов об актуальности и областях применения ML и интернета вещей, а также большой блок практических мастер-классов. Начинающие смогут пройти базовый курс, после чего присоединятся к потоку более опытных участников, которые сразу займутся разбором кейсов и решением выбранной задачи. Второй блок программы представляет собой командную работу над выбранным проектом под руководством опытного куратора. \u003c/p\u003e\u003cp\u003eРяд задач по созданию рекомендательных систем и NLP на реальных данных и IoT-решений будет предложен организаторами и партнерами, идеи участников также приветствуются. По окончанию школы каждая команда презентует свой проект перед экспертным жюри и получит сертификаты об окончании школы, а также некоторые участники смогут получить приглашения на стажировку у партнеров или менторскую поддержку в дальнейшем.\u003c/p\u003e\u003cp\u003eПодробности: \u003ca href\u003d\"http://goto.msk.ru/school\"\u003egoto.msk.ru/school\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["школа","машинное обучение","фкн","вшэ","интернет вещей","грант"]}}