{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1403376028,"rating":35,"authorHandle":"Enchom","modificationTimeSeconds":1403378457,"id":12774,"title":"\u003cp\u003eCEOI Day 1 Tough problem\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everybody,\u003c/p\u003e\u003cp\u003eRecently I participated in day 1 of CEOI unofficially online (invitation-only) and even though I performed poorly, after the competition we discussed the solutions of all problems. Except one. Here is the problem, any ideas would be very helpful! I will also include the results we found while trying to solve it below. Here is the problem, shortened because the real statement was quite long. I also changed a little bit the idea of the way of the testing to make it more clear, since what matters is the idea.\u003c/p\u003e \u003chr /\u003e\u003cp\u003eA and B want to break into a top-secret laboratory. The security system asks a question. The question 1\u0026lt;\u003dq\u0026lt;\u003dN is represented by a number. They are sure that the question the system will ask will be x or y. The answer to question x is \u0026quot;yes\u0026quot; and the answer to question y is \u0026quot;no\u0026quot;. When the question was asked, A and B were separated, and unfortunately only A remembered the questions x and y, while B was the one next to the door ready to answer. Now A must shout exactly one number h (1\u0026lt;\u003dh) and encode in it all the information B needs to answer the question. Help them by writing the following two programs :\u003c/p\u003e\u003cp\u003e1) for given values N,x,y return a number h that is the number A shouted.\u003c/p\u003e\u003cp\u003e2) for given values N,q,h return true for \u0026quot;yes\u0026quot; or false for \u0026quot;no\u0026quot;, if q is the question and h is the number A shouted to B.\u003c/p\u003e\u003cp\u003eThe second program will always receive an h that was produced by your first program.\u003c/p\u003e\u003cp\u003eScore is as follows : for h\u0026gt;\u003d21 — 0 points\u003c/p\u003e\u003cp\u003efor h\u003d20 — 27 points\u003c/p\u003e\u003cp\u003efor h\u003d19 — 30 points\u003c/p\u003e\u003cp\u003efor h\u003d18 — 33 points\u003c/p\u003e\u003cp\u003efor h\u003d17 — 37 points\u003c/p\u003e\u003cp\u003efor h\u003d16 — 42 points\u003c/p\u003e\u003cp\u003efor h\u003d15 — 50 points\u003c/p\u003e\u003cp\u003efor h\u003d14 — 60 points\u003c/p\u003e\u003cp\u003efor h\u003d13 — 75 points\u003c/p\u003e\u003cp\u003efor h\u0026lt;\u003d12 — 100 points\u003c/p\u003e\u003cp\u003ewhere h is the largest value your first program produced in any of the tests.\u003c/p\u003e\u003cp\u003eConstraints : 1\u0026lt;\u003dN\u0026lt;\u003d920 and your program can be run on 2,000,000 tests (all possible inputs, obviously).\u003c/p\u003e\u003cp\u003eTime Limit : 7s Memory Limit : 256MB\u003c/p\u003e\u003cp\u003eExample \u003c/p\u003e\u003cp\u003eThe first program encode(N,x,y) was called a few times, and returns the following values:\u003c/p\u003e\u003cp\u003eencode(5,1,2) \u003d 12\u003c/p\u003e\u003cp\u003eencode(5,4,5) \u003d 2\u003c/p\u003e\u003cp\u003eencode(5,1,2) \u003d 12\u003c/p\u003e\u003cp\u003eencode(5,3,5) \u003d 4\u003c/p\u003e\u003cp\u003eencode(5,4,5) \u003d 2\u003c/p\u003e\u003cp\u003eencode(5,5,2) \u003d 1\u003c/p\u003e\u003cp\u003eThen the second function decode(N,q,h) should return :\u003c/p\u003e\u003cp\u003edecode(5,1,12) \u003d true\u003c/p\u003e\u003cp\u003edecode(5,4,2) \u003d true\u003c/p\u003e\u003cp\u003edecode(5,2,12) \u003d false\u003c/p\u003e\u003cp\u003edecode(5,3,4) \u003d true\u003c/p\u003e\u003cp\u003edecode(5,5,2) \u003d false\u003c/p\u003e\u003cp\u003edecode(5,2,1) \u003d false\u003c/p\u003e \u003chr /\u003e\u003cp\u003eDuring the compeition almost all of us found a solution for h\u003d20, I managed to solve it for h\u003d16 and Hristo Venev managed to get h\u003d14. However none of us managed to get any idea for h\u003d13 or full score. Any ideas will be appreciated!\u003c/p\u003e\u003cp\u003eThanks in advance !\u003c/p\u003e\u003c/div\u003e","tags":["problem","ceoi","2014","day1","hard","compression","encode","decode","help"]}}