{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1435572915,"rating":269,"authorHandle":"fcspartakm","modificationTimeSeconds":1435663425,"id":18958,"title":"\u003cp\u003eTestlib and Polygon Updates (June, 2015)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003ePreviously, my contribution to the development of Codeforces was limited only by rounds preparation (\u003ca href\u003d\"/contest/508\" title\u003d\"Codeforces Round 288 (Div. 2)\"\u003eCodeforces Round #288 (Div. 2)\u003c/a\u003e, \u003ca href\u003d\"/contest/518\" title\u003d\"Codeforces Round 293 (Div. 2)\"\u003eCodeforces Round #293 (Div. 2)\u003c/a\u003e, \u003ca href\u003d\"/contest/525\" title\u003d\"Codeforces Round 297 (Div. 2)\"\u003eCodeforces Round #297 (Div. 2)\u003c/a\u003e). But a month ago, I joined the wonderful Codeforces team led by Mike Mirzayanov (\u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e). Traditionally, to understand all the niceties of this project, my work begun from Polygon system. I would like to tell you about its changes.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://polygon.codeforces.com/\"\u003ePolygon\u003c/a\u003e is a system for the preparation of programming problems. All Codeforces rounds and many other olympiads prepared in Polygon. Everyone at any time can use this system.\u003c/p\u003e\u003cp\u003eTo edit the files in Polygon now used \u003ca href\u003d\"http://ace.c9.io/\"\u003eAce Editor\u003c/a\u003e. It has a nice looking syntax highlighting and autocompletion (you have to press Ctrl + Space). Soon planned to implement this editor in Codeforces.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/11/a7/11a797b61205d6c66980e2d8843dfb6e2fd85bba.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eUnfortunately, \u003ca href\u003d\"http://ace.c9.io/\"\u003eAce Editor\u003c/a\u003e not support scrolling text on the smartphones and the tablets. Because of that the old text editor was left on them.\u003c/p\u003e\u003cp\u003eButton View Source has appeared on the validator, checker and interactor pages. When you press this button you can see the source code file. It is convenient because now you can see the source code of standart checkers.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/6f/18/6f18e58ce4ef9934c4e5f47e464ffa12fe686fb7.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eAlso useful changes have been made in \u003ca href\u003d\"https://github.com/MikeMirzayanov/testlib\"\u003eTestlib library\u003c/a\u003e, which also work in Polygon. Now you can specify in validator different restrictions for different testsets and for different test groups. To register validator you need to use \u003ccode\u003eregisterValidation(argc, argv);\u003c/code\u003e, and methods \u003ccode\u003evalidator.group()\u003c/code\u003e and \u003ccode\u003evalidator.testset()\u003c/code\u003e appeared in validator.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/da/bc/dabc1294b68ed92ede325fc0ad4e8a138e18fe87.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eTo check test by validator from command line using testset and group you need to write command \u003ccode\u003eval.exe --testset \u0026quot;testsetName\u0026quot; --group \u0026quot;groupName\u0026quot; \u0026lt; testFile\u003c/code\u003e.\u003c/p\u003e\u003cp\u003eThis changes useful, for example, for preparing school problems where allocated different test groups. Also this changes will allow to use in Codeforces round multitestsets, prohibiting use such tests in hacking attempts.\u003c/p\u003e\u003cp\u003eIt becomes easier to check cover of different cases by tests. It is supporting in Polygon in tab Invocation.\u003c/p\u003e\u003cp\u003eIf in validator you indicated variable name (this function ignores variable which contains digits in their names), then if you have no tests, in which this variable reaches minimal or maximal values, after perform Invocation, you wil get warning about it.\u003c/p\u003e\u003cp\u003eBesides it in testlib/Polygon appeared additional functionality, which we called features. Often (usually it helpful for coordinator of preparing problems) required to check that tests cover different cases (patterns). For example in graph problem, probably, you have to be sure that you have tests with disconnected graphs and big trees. To guaranteed it now is enough to add in validator to the begining declaration of two feature support — \u003ccode\u003eaddFeature(\u0026quot;disconnected\u0026quot;);\u003c/code\u003e and \u003ccode\u003eaddFeature(\u0026quot;big-tree\u0026quot;);\u003c/code\u003e. In the main part of validator after read graph you can check him on connectivity and if the graph is disconnected you may fix it by calling \u003ccode\u003efeature(\u0026quot;disconnected\u0026quot;);\u003c/code\u003e. Similary with tree: if graph is a big tree you may fix it by calling \u003ccode\u003efeature(\u0026quot;big-tree\u0026quot;);\u003c/code\u003e.\u003c/p\u003e\u003cp\u003eWhen you startup invocation Polygon will alert you, if there is the declared feature, which did not met in tests. In out examples it will say, that tests does not contains disconnected graph and big trees.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/12/2b/122be04db6f3dc39cc8c3c6d6cbf12bdcf2b25e2.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eIntroduction the Features will be useful for a person, who check ready problem or ready contest. But we think that also it will be very helpful for problem writers.\u003c/p\u003e\u003cp\u003eValidator output information about achieving extreme variable values and about features, if you add to call validator in command line parameter \u003ccode\u003e--testOverviewLogFileName log.txt\u003c/code\u003e. Polygon reads and parses exactly this logs to show warnings for you.\u003c/p\u003e\u003cp\u003eSoon you will get new and new improvements! I wish to all good summer mood!\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","polygon","testlib","полигон"]}}