{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1402086630,"rating":-5,"authorHandle":"lovro-sinda","modificationTimeSeconds":1402086675,"id":12588,"title":"\u003cp\u003eInvitation To CodeChef June Challenge 2014\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eA new season, marks the beginning of many things new. And we cherish them all. As we enter into the second half of the year, we look forward to make it surpass its precursor in terms of excitement, fun, and some delicious crunchy contests. Just like the monsoon snacks, you enjoy sitting on your porch watching the rain drops drip down the windowpane. And we start with our June Challenge 2014.\u003c/p\u003e\u003cp\u003eKeeping up with the picturesque view around, our problem-setting panel is adorned by some of the finest programmers from across the world. Like the first rain of the season, you surely would not want to miss the June Challenge.\u003c/p\u003e\u003cp\u003eSo, here are the details of the contest:\u003c/p\u003e \u003cpre\u003eStart Date: Friday, 6th June, 2014 at 15:00 HRS (IST)\nEnd Date: Monday, 16th June, 2014 at 15:00 HRS (IST)\nLink: June Challenge 2014.  -\u0026gt; http://www.codechef.com/JUNE14/\u003c/pre\u003e\u003cp\u003eKnow the contest timing in your region here.\u003c/p\u003e\u003cp\u003eWe hope you all will make a big spatter with your performance. So, join in the June Challenge 2014 and pour in the submissions for next ten days.\u003c/p\u003e\u003cp\u003eTo add a tad more color to your grounding for the contest, we have the editorials of the hot and sizzling May contests. Go enjoy them, with the June contest and rainproof your preparations.\u003c/p\u003e \u003cpre\u003eEditorials - May Challenge 2014\nEditorials - May Lunchtime 2014\nEditorials - May Cook-Off 2014\u003c/pre\u003e\u003cp\u003eThat is all from the chef’s kitchen for the first monsoon contest. Wind down and make a splash.\u003c/p\u003e\u003cp\u003eFor any doubts, queries, or some monsoon greetings, you can write to us at \u003ca href\u003d\"mailto:feedback@codechef.com\"\u003efeedback@codechef.com\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAlternatively, you can also call us at: +91 — (22) — 30797709 (On Weekdays between 11:00 am to 8:00 pm).\u003c/p\u003e\u003cp\u003eLove \u0026amp; Luck!\u003c/p\u003e\u003c/div\u003e","tags":["codechef"]}}