{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1490161654,"rating":45,"authorHandle":"Slamur","modificationTimeSeconds":1490162381,"id":51133,"title":"\u003cp\u003eФинал и виза в США: заявление DS-160\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПри заполнении заявления DS-160 на визу США у нас возникло несколько вопросов, которые не особо понятно где прописаны или как интерпретировать. Мы прочитали, что иммиграционное законодательство США довольно жесткое, поэтому могут возникнуть проблемы из-за любого не совсем корректного ответа на вопрос заявления. Поэтому если вы уже получили визу на финал в США, то мы будем очень признательны, если вы поможете ответить на следующие вопросы:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eВ пункте \u0026quot;Кто оплачивает вашу поездку?\u0026quot; непонятно, что писать. С одной стороны, перелет оплачиваем мы сами, с другой — проживание и питание оплачивают нам организаторы финала. И полет, и проживание являются важными составляющими поездки, поэтому просто опустить их кажется немного странным. Что вы указывали в этом пункте?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВ пункте \u0026quot;Кто с вами летит?\u0026quot; указывали ли вы кого-нибудь из членов команды и/или тренера? Если да, то в качестве кого: друг, бизнес-партнер, другой тип отношений? Если нет, то стоит ли на собеседовании говорить о них — соревнование-то командное все-таки?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВ пункте \u0026quot;Кто может подтвердить о вас информацию в США?\u0026quot; единственное, что приходит на ум — указать организаторов финала. Но какую именно информацию о них писать? На данный момент мы смогли собрать вот такую информацию, но возможно мы что-то не так поняли или не так интерпретировали:\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e \u003col\u003e   \u003cli\u003eOrganization name: THE ACM-ICPC PROGRAMMING CONTEST\u003c/li\u003e   \u003cli\u003eRelationship to You: OTHER\u003c/li\u003e   \u003cli\u003eU.S. Street Address (Line 1): ONE BEAR PLACE\u003c/li\u003e   \u003cli\u003eCity: WACO\u003c/li\u003e   \u003cli\u003eState: TEXAS\u003c/li\u003e   \u003cli\u003eZIP Code (if known): 97356\u003c/li\u003e   \u003cli\u003ePhone Number: 12542991410\u003c/li\u003e   \u003cli\u003eEmail Address: \u003ca href\u003d\"mailto:manager@acmicpc.org\"\u003emanager@acmicpc.org\u003c/a\u003e\u003c/li\u003e \u003c/ol\u003e \u003cul\u003e   \u003cli\u003eВ пункте \u0026quot;Текущее место работы\u0026quot; лучше указать университет или все же работу, как наиболее \u0026quot;прибыльный\u0026quot; вариант? Кое-где пишут, что чем больше заработок, тем проще доказать, что ты захочешь вернуться, но с другой стороны в данный момент мы едем на студенческие соревнования, так что указать университет кажется логичнее.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eP.S. Если у вас возникали проблемы с чем-то другим при подаче заявления/собеседовании на визу, то мы будем признательны, если вы поделитесь с нами этим опытом.\u003c/p\u003e\u003c/div\u003e","tags":["acm icpc world finals","виза","сша"]}}