{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1509550823,"rating":123,"authorHandle":"bayleef","modificationTimeSeconds":1509552581,"id":55524,"title":"\u003cp\u003eProjectEuler+\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI\u0027m quite sure some of you have ever participated in a HackerRank contest. And after going to \u0026quot;Compete\u0026quot; page and seeing \u0026quot;ProjectEuler+\u0026quot; as an active contest for about several months or even years you could have wondered \u0026quot;How can it be for so long\u0026quot;?\u003c/p\u003e\u003cp\u003eProjectEuler is a well-known website with no need for advertising. So, instead of describing countless beautiful features of it, I\u0027d better tell some of its disadvantages for me as a competitive programmer. You see, in my humble opinion, there is no honor in boasting \u0026quot;Oh, my program runs in just two minutes on my modern laptop\u0026quot; when it\u0027s possible to write the same program which runs in several milliseconds.\u003c/p\u003e\u003cp\u003eThat\u0027s why ProjectEuler+ exists. At first glance, you see the exact same statement, but then... multitest? And constraints ten or even thousand times bigger than they were in original problem? And time limit is just a couple of seconds? Well, such rules seem to be more familiar to us.\u003c/p\u003e\u003cp\u003eI wanted to write this blog a month later when we have 200 problems translated from the original PE but recently a problem was created that stays unsolved for a week — the first time we have such problem. So, I invite everyone to participate in ProjectEuler+ and dilute our leaderboard a bit.\u003c/p\u003e\u003cp\u003eAlso, I want to ask \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Легендарный гроссмейстер tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e on behalf of the creator of the 194th problem and the tester of the problem (which is me) to try solving it (and finally give the opportunity for us to finally submit our 100% correct solution which we are not allowed to do until the first accept).\u003c/p\u003e\u003cp\u003eOh, and by the way, the link: \u003ca href\u003d\"https://www.hackerrank.com/contests/projecteuler/\"\u003ehttps://www.hackerrank.com/contests/projecteuler/\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["#hackerrank","project euler","projecteuler"]}}