{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1525364996,"rating":1973,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1526534514,"id":59228,"title":"\u003cp\u003eCodeforces: Updates in rating and rounds\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/21/a3/21a33b497ee8a34a678befc3f79745eb69a9cf07.png\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eIt\u0027s time for news. I hope you will enjoy!\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eWe reduce the rating bound for the orange color. Thus, now the orange rating (and the \u003cem\u003eMaster\u003c/em\u003e title) will start from 2100 rating units.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe lower bound of the rating for \u003cem\u003elegendary grandmasters\u003c/em\u003e is increased to 3000 rating units. Thus, right now in the community, 14 participants meet this requirement. Real legends!\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eFor rounds like \u0026quot;Div. 2 Only\u0026quot; the upper bound of the rating for official participation is increased. Now everyone whose rating is less than 2100 (i.e., before \u003cem\u003emasters\u003c/em\u003e) will be able to register for such rounds to participate officially, their rating will be updated based on the results of the round. We do not plan to increase the complexity of Div. 2 rounds. Practice shows that the problems of such rounds are interesting and useful for participants \u0026quot;below the orange\u0026quot;.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eFor parallel Div. 1 and Div. 2 rounds we don’t change the rating bound between divisions. So Div. 1 edition of the round continue to include participants with the rating from 1900 and above.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAs an experiment, we plan to host rounds of simplified complexity (Div. 3). In such rounds, the official results will include participants with ratings less than 1600. We plan to include in these rounds simple training problems that will help beginner participants to gain skills and to get new knowledge in a real contest. Since even in the Div. 2 rounds regularly some Div. 1 users register new account and take high place, we also expect such unsportsmanlike behavior in the Div. 3 rounds. We will exclude from the official standings of Div. 3 rounds and put in a separate rooms all those who can’t be reliably called to be a real participant. Accounts that materially participated in less than 2 rating rounds (materially means solved at least one problem there) before the start of the Div. 3 rounds, and those who have ever gained 1900 or more rating units will not get into the official standings and will be assigned to separate rooms. However, this does not mean that there is no rating recalculation for them. Thus, the rating will be updated for all users whose rating is strictly less than 1600 at the time of the start of a round. Perhaps we will experiment with the definition of who should be considered a reliable Div. 3 participant. And thanks to \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/VLamarca\" title\u003d\"Candidate Master VLamarca\"\u003eVLamarca\u003c/a\u003e for \u003ca href\u003d\"/blog/entry/59170\"\u003ethe post about idea of Div.3 rounds\u003c/a\u003e!\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eUpdating the boundaries of ratings and changing colors is not an instantaneous process. For this reason, the website may still have outdated information for some time. We are working to apply the announced changes during the day.\u003c/p\u003e\u003cp\u003eI hope you enjoy this news.\u003cbr /\u003e — \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","updates","rating","colors"]}}