{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1410814955,"rating":10,"authorHandle":"m.radwan","modificationTimeSeconds":1411456735,"id":13805,"title":"\u003cp\u003eQualification System\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eAl Salam Alykom Everyone,\u003c/p\u003e\u003cp\u003eThis post explains how the ECPC qualifications work, the qualifications consist of 4 ACM style contests which will be held on 21st, 23rd, 25th and 29th sept. 2014, teams with higher number of problems solved will have higher priority to attend the ECPC, ties will be broken using time penalties.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eThere\u0027s also one testing round which will be held on 20th sept. 2014 to get you introduced to the system.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eAll contests will be held onsite in faculty of Engineering 10.00 AM in the morning, Contest will start on 10 AM, so please arrive earlier 9.30+\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eBefore we start with the rules please go create a team, and make sure you always register with your team not as a single contestant.\u003cbr /\u003e You can create a team by going to your profile on codeforces (click your name in the right corner), then go to teams tab and create a team for you and your teammates, note that they must accept it.\u003c/p\u003e\u003cp\u003eHere are the rules you need to know:-\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e1) All 3 team members must gather at faculty of engineering one of selected labs, however you must bring your laptops as machines there are not setup.\u003cbr /\u003e  — LAB 204 (If you have an internet connection or hotspot please go there) \u003cbr /\u003e  — LAB on 5th floor Electrical engineering building. \u003cbr /\u003e 2) Only one machine can be used for coding, other machines can be used for reading problems or reading code (NOTHING else no code changes).\u003cbr /\u003e 3) Googling for solutions/codes is obviously not allowed and considered as cheating, anyone found to do so will be disqualified.\u003cbr /\u003e 4) You cannot copy pre-written codes from your machine, however you are free to retype them, just as ACM contests you have a printed library you are free to retype whatever you want from it.\u003cbr /\u003e 5) No Virtual/home participation is allowed, you must enter the contest onsite, unless you have a direct permission from me (which I won\u0027t give unless you have a very good reason).\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eHere are some information about the contest you need to know:-\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e1) Contest problem statements will be posted as a blog post (PDF) when the contest starts, there\u0027s NO other place you can find the statements, so you do have to download the statements from the blog post.\u003cbr /\u003e 2) Problem statements follow random order, there also might be two problems labeled with problem A, so make sure you check the problem name before submitting.\u003cbr /\u003e 3) All problems use I/O from files (Except for the testing round).\u003cbr /\u003e 4) Some problems need bignumbers or bigintegers so you know how to use this in java, or have bigint library in your C++ library.\u003cbr /\u003e 5) Contest problems are easy but somewhat indirect.\u003cbr /\u003e 6) You are encouraged to discuss the problems on this group after the contest ends, we might try to give a brief hints for the solution if we have time.\u003cbr /\u003e 7) You are encouraged to have discussion sessions and discuss your solutions with each other.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eGood Luck Everyone! Feel free to ask questions if you have any!\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eUPD1: Quals are now onsite, testing round is online.\u003cbr /\u003e UPD2: Lab 204 doesn\u0027t have internet so 12 teams would have to bring internet hotspots with them, and bring chargers for your phones if you\u0027ll use them.\u003cbr /\u003e UPD3: We won\u0027t be able to do quals on 27th since faculty will be closed, so the round on 27th is optional and online.\u003c/p\u003e\u003c/div\u003e","tags":[]}}