{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1434453890,"rating":0,"authorHandle":"TsunamiNextYear","modificationTimeSeconds":1434456599,"id":18615,"title":"\u003cp\u003eDay 3 Analysis\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eProblem A.\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/problemset/problem/445/A\"\u003eDZY Loves Chessboard\u003c/a\u003e\u003c/p\u003e\u003cp\u003eImagine all the cells of the board were good, what will be the perfect pattern?\u003c/p\u003e\u003cp\u003eIt will be the chessboard pattern.\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e\u003cbr /\u003e-------------------------------------\n| B | W | B | W | B | W | B | W | B |\n-------------------------------------\n| W | B | W | B | W | B | W | B | W |\n-------------------------------------\n| B | W | B | W | B | W | B | W | B |\n-------------------------------------\n| W | B | W | B | W | B | W | B | W |\n-------------------------------------\n| B | W | B | W | B | W | B | W | B |\n-------------------------------------\n| W | B | W | B | W | B | W | B | W |\n-------------------------------------\n\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eNow imagine after we colour all the cells with this pattern ... If we turn any of the cells into bad cells, this would not affect the validity of the pattern.\u003c/p\u003e\u003cp\u003eSo all we have to do is to colour all the board with this pattern, and then cover all bad cells.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCode:\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/contest/445/submission/11605136\"\u003e11605136\u003c/a\u003e\u003c/p\u003e \u003chr /\u003e\u003cp\u003e\u003cstrong\u003eProblem B.\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/problemset/problem/415/A\"\u003eMashmokh and Lights\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThis is a direct implementation problem.\u003c/p\u003e\u003cp\u003eWe will process the buttons clicked one by one.\u003c/p\u003e\u003cp\u003eFor every button, we check for all the light with index greater than or equal to the index of the button, and turn them off if they are still turned on, and remember that the current button closed it.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCode:\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/contest/415/submission/11605504\"\u003e11605504\u003c/a\u003e\u003c/p\u003e \u003chr /\u003e\u003cp\u003e\u003cstrong\u003eProblem C.\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/problemset/problem/550/A\"\u003eTwo Substrings\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThis was somehow a tricky problem.\u003c/p\u003e\u003cp\u003eFor the first thought, one can generate all occurrences of the string \u0026quot;AB\u0026quot; and then generate all occurrences of the string \u0026quot;BA\u0026quot;, and then compare every pair of occurrences and check if they overlap.\u003c/p\u003e\u003cp\u003eBut there is an easier way to solve it.\u003c/p\u003e\u003cp\u003eWe can just find the \u003cstrong\u003efirst\u003c/strong\u003e occurrence of the string \u003cstrong\u003e\u0026quot;AB\u0026quot;\u003c/strong\u003e and the \u003cstrong\u003elast\u003c/strong\u003e occurrence of the string \u003cstrong\u003e\u0026quot;BA\u0026quot;\u003c/strong\u003e and check if they overlap.\u003c/p\u003e\u003cp\u003eAnd we also find the \u003cstrong\u003efirst\u003c/strong\u003e occurrence of the string \u003cstrong\u003e\u0026quot;BA\u0026quot;\u003c/strong\u003e and the \u003cstrong\u003elast\u003c/strong\u003e occurrence of the string \u003cstrong\u003e\u0026quot;AB\u0026quot;\u003c/strong\u003e and check if they overlap.\u003c/p\u003e\u003cp\u003eWe are guaranteed to find an answer this way if it exists.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCode:\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/contest/550/submission/11605743\"\u003e11605743\u003c/a\u003e\u003c/p\u003e \u003chr /\u003e\u003cp\u003e\u003cstrong\u003eProblem D.\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/problemset/problem/485/B\"\u003eValuable Resources\u003c/a\u003e\u003c/p\u003e\u003cp\u003eLet\u0027s first assume that we are required to build a rectangular city.\u003c/p\u003e\u003cp\u003eThe solution for the task would be getting the maximum and minimum X coordinate among all points and the difference between maxX and minX will determine one of the side lengths of the rectangle.\u003c/p\u003e\u003cp\u003eThe difference between maxY and minY will determine the other side length.\u003c/p\u003e\u003cp\u003eNow to convert this rectangle into a square without losing any resources, we will expand the smaller side length to be equal to the bigger side length.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCode:\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/contest/485/submission/11605881\"\u003e11605881\u003c/a\u003e\u003c/p\u003e \u003chr /\u003e\u003cp\u003e\u003cstrong\u003eProblem E.\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/contest/520/problem/B\"\u003eTwo Buttons\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThis problem can be visualized as a standard graph problem, where every number representing a node and the buttons represent edges between the nodes.\u003c/p\u003e\u003cp\u003eSo we need to calculate shortest path in an un-weighted directed graph. The easiest way to do this is using breadth first search algorithm (bfs).\u003c/p\u003e\u003cp\u003eThe most tricky part is determining the upper limit for the numbers in the graph.\u003c/p\u003e\u003cp\u003eWe can\u0027t set the upper limit to 10^4 because the blue button allows us to decrease the number, which means we can exceed the required number and then use the blue button to reach our required number.\u003c/p\u003e\u003cp\u003eBut obviously we will not need to increase the number more than 2*10^4, since the starting number is always less than 10^4.\u003c/p\u003e\u003cp\u003eSo the upper limit should be any number \u0026gt;\u003d 2 * 10^4\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCode:\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/contest/520/submission/11606071\"\u003e11606071\u003c/a\u003e\u003c/p\u003e \u003chr /\u003e\u003cp\u003e\u003cstrong\u003eProblem F.\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/problemset/problem/550/C\"\u003eDivisibility by Eight\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThis problem has lots of solution, I will try to describe the easiest one.\u003c/p\u003e\u003cp\u003eFirst of all if the given number includes at least one zero, we can take this zero as our output, just like the second sample input.\u003c/p\u003e\u003cp\u003eNow we should make some observation about divisibility by 8.\u003c/p\u003e\u003cp\u003eA number is divisible by 8 if and only if its last three digits form a number that is divisible by eight.\u003c/p\u003e\u003cp\u003eThis means that if we have a number consisting of three digits and we added a fourth digit to its left, this wont change it divisibility by 8.\u003c/p\u003e\u003cp\u003eSo we will just try every possible number of 1, 2, or 3 digits that we can form out of the given number and check if it is divisible by 8.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCode:\u003c/strong\u003e \u003ca href\u003d\"//codeforces.com/contest/550/submission/11606467\"\u003e11606467\u003c/a\u003e\u003c/p\u003e \u003chr /\u003e\u003c/div\u003e","tags":[]}}