{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1500476320,"rating":73,"authorHandle":"E621","modificationTimeSeconds":1500476320,"id":53384,"title":"\u003cp\u003eStrange Team Selection System of ICPC Japan Domestic Contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eICPC regional contest season is coming. Here in Japan, the first round of Japanese ICPC regional contest was held last week, and the result is up now. \u003ca href\u003d\"http://icpc.iisf.or.jp/2017-tsukuba/results/\"\u003eLink\u003c/a\u003e \u003c/p\u003e\u003cp\u003eYou can see the passed team as shaded blue, and \u0026quot;A/B/C\u0026quot; means how the team was advanced (A is just because of the good result, B is the newest universities coming to ICPC, C is the director\u0027s arbitrary decision).\u003c/p\u003e\u003cp\u003eAs soon as you take a look on the sheet, you can find how some of the top teams are eliminated from the selection. This year, at most 4 teams from the same university can advance to the next round, and 6 out of 7 top teams are from the same university, The University of Tokyo. The tragedy has happened. 6th and 7th team are eliminated from the contest, even though they were much (!) better than 38 teams advancing to the Asia Regional!\u003c/p\u003e\u003cp\u003eSome of you here knows how notorious the team selection of ICPC Asia regional is: complex concept of slots and multiple participation, as well as CJHwang\u0027s arbitral decisions. Here in Japan Domestic, it\u0027s not quite different: every year there are some troublesome arbitral selections, unfair choosing rules.\u003c/p\u003e\u003cp\u003eOf course, the official tries to maintain the number of universities they invite, since it\u0027s crucial for deciding how many teams from the site can advance to the World Finals. However, the current strategy is obviously not a good idea. I agree that they have to keep the number of distinct schools, yet it\u0027s nonsense that they are setting a limit of the number of teams from a university. If I were the admin, firstly I\u0027d choose 30 teams which are the first rank of their university, then I\u0027d choose unselected teams from the top. I can\u0027t believe that the admins don\u0027t feel anything about choosing the 40th team (even 2nd in the university) over the 6th team.\u003c/p\u003e\u003cp\u003eThat is the (notorious) case of Japanese ACM-ICPC. How is it like in other countries? I\u0027m the most curious about the system in Taiwan, since National Taiwan University dominates Taiwan regional every year, and I might be able to find some coincidence from that. Also, are there any other good ways of solving the issue? I\u0027d like to see many people\u0027s comments.\u003c/p\u003e\u003c/div\u003e","tags":["icpc","selection","team","regional"]}}