{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1471162599,"rating":17,"authorHandle":"VastoLorde95","modificationTimeSeconds":1471169403,"id":46556,"title":"\u003cp\u003eCFStat: A Python Script for CF Submission Statistics!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi there.\u003c/p\u003e\u003cp\u003eI have written a simple Python script that can do a couple of nifty things:\u003c/p\u003e \u003col\u003e   \u003cli\u003eCompare the problems solved by user X but not by user Y\u003c/li\u003e   \u003cli\u003eGive you a weekly breakdown of your problem solving performance on Codeforces\u003c/li\u003e   \u003cli\u003eReturn a list of all your submissions till a specified point so that you can do your own analyses :)\u003c/li\u003e \u003c/ol\u003e\u003cp\u003e\u003ca href\u003d\"https://imgur.com/gallery/XGJ2b\"\u003eScreenshot\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eLink\u003c/h2\u003e\u003cp\u003e\u003ca href\u003d\"https://github.com/VastoLorde95/CFStat\"\u003eGithub Repo\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eHow to install\u003c/h2\u003e\u003cp\u003ePre-requisites:\u003c/p\u003e \u003col\u003e   \u003cli\u003ePython 2.7\u003c/li\u003e   \u003cli\u003ePython Beautiful Soup 4\u003c/li\u003e   \u003cli\u003ePython requests\u003c/li\u003e   \u003cli\u003ePython tabulate\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eOnce you have the prerequisites installed, simply place the CFStat folder to the directory where you want to write your script. Then in your script use \u003ccode\u003eimport CFStat\u003c/code\u003e. \u003c/p\u003e\u003ch2\u003eMini-Documentation\u003c/h2\u003e \u003col\u003e   \u003cli\u003e\u003ccode\u003egetSubmissions(user, page_mx, print_flag \u003d False)\u003c/code\u003e: Generates a list of all submissions from the first \u003ccode\u003epage_mx\u003c/code\u003e number of pages made by \u003ccode\u003euser\u003c/code\u003e and prints this list if \u003ccode\u003eprint_flag\u003c/code\u003e \u003d \u003ccode\u003eTrue\u003c/code\u003e. Your submissions will be pushed into a list of 3-tuples: time-stamp of submission, problem code and verdict. You can use this list to perform any kind of additional analyses that you want :)\u003c/li\u003e   \u003cli\u003e\u003ccode\u003egetWeeklyStatistics(user, mx, aggregate)\u003c/code\u003e : Using the submissions list generated from the previous function, this generates a table for each week between \u003ccode\u003estart_year\u003c/code\u003e to \u003ccode\u003eend_year\u003c/code\u003e with statistics like % of WAs etc. \u003cstrong\u003eNote\u003c/strong\u003e: Week no is as per the \u003cem\u003eISO Calendar\u003c/em\u003e.\u003c/li\u003e   \u003cli\u003e\u003ccode\u003ecompareUsers(user1, mx1, user2, mx2)\u003c/code\u003e : Using the first \u003ccode\u003emx1\u003c/code\u003e submissions of \u003ccode\u003euser1\u003c/code\u003e and first \u003ccode\u003emx2\u003c/code\u003e pages of \u003ccode\u003euser2\u003c/code\u003e, this function prints a list of all problems solved by \u003ccode\u003euser1\u003c/code\u003e but not by \u003ccode\u003euser2\u003c/code\u003e\u003c/li\u003e   \u003cli\u003e\u003ccode\u003estart_year\u003c/code\u003e and \u003ccode\u003eend_year\u003c/code\u003e are global variables used in \u003ccode\u003egetWeeklyStatistics()\u003c/code\u003e to generate a table for statistics for each week between \u003ccode\u003estart_year\u003c/code\u003e to \u003ccode\u003eend_year\u003c/code\u003e. Modify these according to your needs.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eI guess a lot of things can be automated to make this tool more user-friendly but I got lazy handling cases with the dates and stuff so feel free to fix this for the community :P Everyone is welcome to fork the repository and contribute :)\u003c/p\u003e\u003cp\u003eThe code may take up to a minute to fetch 50 pages of submissions and this number may change depending on your internet speed. If your connection is slow then the script might skip some of your submissions.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eP.S. No this tool is not bug free and I claim no responsibility if it causes any kind of harm to your computer. Use at your own risk\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":["cfstat","tool","oye","teri"]}}