{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1428190522,"rating":163,"authorHandle":"Devushka","modificationTimeSeconds":1432151246,"id":14191,"title":"\u003cp\u003eУниверситет ИТМО. Кафедра КТ.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет!\u003c/p\u003e\u003cp\u003eМеня много спрашивают, кого и как учат на кафедре КТ и есть ли там что-то, кроме олимпиадного программирования.\u003c/p\u003e\u003cp\u003eПора ломать стереотипы!\u003c/p\u003e\u003cp\u003eНиже – подробный (укороченный три раза) рассказ о месте, где я учусь, – кафедре КТ Университета ИТМО.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e1. Вводные\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eУниверситет ИТМО (www.ifmo.ru) находится в Санкт-Петербурге. Входит в 15 вузов программы \u003ca href\u003d\"http://www.ifmo.ru/ru/stat/232/povyshenie_konkurentosposobnosti_5dr100.htm\"\u003e5 top 100\u003c/a\u003e. Ректор – Владимир Николаевич Васильев, проф., член корр. РАН, Вице-президент Российского Союза ректоров.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://www.ifmo.ru/ru/viewdepartment/24/kafedra_kompyuternyh_tehnologiy.htm\"\u003eКафедра компьютерных технологий\u003c/a\u003e (КТ) входит в состав факультета информационных технологий и программирования.\u003c/p\u003e\u003cp\u003eВ 2013 году была издана книга \u003ca href\u003d\"http://is.ifmo.ru/belletristic/2013/ctd-history.pdf\"\u003e«История кафедры КТ»\u003c/a\u003e, в которой рассказаны захватывающие истории и мотивирующие моменты жизни кафедры.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e2. Обучение\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e   \u003cli\u003eМатематика\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eМатанализ читают лучшие математики города – доценты СПбГУ Додонов Николай Юрьевич и Кохась Константин Петрович. Курс матанализа длится 6 семестров. Кохась Константин Петрович – медалист международной олимпиады школьников по математике. Линейную алгебру читает Рыжков Александр Евгеньевич – тренер сборной ИТМО по математике. Математики участвуют в IMC и олимпиаде им. Ярника, проводят \u003ca href\u003d\"http://mathdep.ifmo.ru/ncumc/\"\u003eNCUMC\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eДискретную математику, теорию сложности, алгоритмы и структуры данных, теорию формальных языков и грамматик преподает Андрей Сергеевич Станкевич. Обладатель премий (в области образования и не только), медалей, наград, известный во всем мире тренер команд университета. Подробнее не только о его курсах можно почитать \u003ca href\u003d\"http://neerc.ifmo.ru/wiki\"\u003eздесь\u003c/a\u003e.\u003c/p\u003e \u003cul\u003e   \u003cli\u003eПрограммирование\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eБольшинство прикладных курсов по программированию на кафедре читают приглашенные специалисты из компаний (Яндекс, Транзас, DevExperts, JetBrains, Mail.ru Group). Приятно отметить, что большинство из них – выпускники ИТМО. Благодаря этому наши студенты получают наиболее актуальные знания.\u003c/p\u003e\u003cp\u003eC++, Java, Haskell, Assembler. Android, OS, архитектура ЭВМ, сети – джентльменский набор знаний позволит не только использовать любые технологии, но и понимать особенности их совместной работы.\u003c/p\u003e\u003cp\u003eНапример, компания Транзас занимается разработкой симуляторов для обучения пилотов самолетов и кораблей. Важной частью их продуктов является высокая точность расчетов и моделирования. Антон Ковалев, начальник отдела систем подготовки данных и ГИС компании Транзас ведет на кафедре КТ вычислительную геометрию. Антон – выпускник нашей кафедры. После курса Антона ИТМО 1 2013 пересекает на финале отрезки абсолютно точно (и не сдает задачу G). Вы знаете Антона по \u003ca href\u003d\"http://russiancodecup.ru/tasks/round/16/B\"\u003eзадаче\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e3. Сотрудничество с IT-компаниями\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eСотрудничество с компаниями не ограничивается преподаванием сотрудников в университете. Начиная с третьего курса студенты должны проходить практику. Часто их выбором оказываются Яндекс, Транзас, DevExperts, JetBrains, Mail.ru Group, Facebook, Google. Около 80% студентов третьего курса имеют опыт работы в компании. Ежегодные презентации проектов для практики позволяют выбрать интересное направление исследований или разработки.\u003c/p\u003e\u003cp\u003eВыпускниками факультета создано более 40 компаний с общей численностью сотрудников более 2000 человек. Например, Михаил Бабушкин, Станислав Столяр, Роман Елизаров, Артем Козырев основали компанию \u003ca href\u003d\"http://www.devexperts.com/en/company/a/about.html\"\u003eDevExperts\u003c/a\u003e, в которой работает более 370 сотрудников. Компания занимается разработкой софта для высокоскоростной торговли на бирже. \u003c/p\u003e\u003cp\u003eУгадайте, какой курс ведет Роман? Параллельное программирование.\u003c/p\u003e\u003cp\u003eКомпания Mail.ru совместно с Университетом ИТМО проводит Russian Code Cup.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e4. Научная деятельность\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eВ ИТМО реализуются четыре программы мегагрантов, среди которых – профессор Питер Слот (h \u003d 41). На кафедре работает \u003ca href\u003d\"http://irc.ifmo.ru/87845/\"\u003eмеждународная лаборатория «компьютерные технологии»\u003c/a\u003e, в которой не только выпускники КТ занимаются исследованиями в области искусственного интеллекта, генетических алгоритмов, теории автоматов, биоинформатики, машинного обучения. За 2014 год сотрудники МНЛ опубликовали 80 индексируемых статей и представили 30 докладов на конференциях, получили 12 грантов. Исследования производятся в партнерстве с ETH Zurich, Washington University in St. Louis, University of Jyvaskyla, Институтом Биоинформатики, Lulea University, Aalto University.\u003c/p\u003e\u003cp\u003eC научной деятельностью, публикациями, конференциями и многим другим вы можете ознакомиться на официальном \u003ca href\u003d\"http://is.ifmo.ru\"\u003eсайте\u003c/a\u003e Анатолия Абрамовича Шалыто, научного руководителя, профессора, основателя автоматного программирования, а также автора \u0026quot;Заметок о мотивации\u0026quot;.\u003c/p\u003e\u003cp\u003eЛаборатория проводит регулярные научные семинары для студентов кафедры и гостей, часть бакалаврских и магистерских работ студентов КТ основывается на проведенных в лаборатории исследованиях. Лаборатория с удовольствием будет сотрудничать со студентами, желающими реализовать свой научный потенциал.\u003c/p\u003e\u003cp\u003eВ ИТМО реализуется программа \u003ca href\u003d\"http://www.ifmo.ru/ru/listjep/mezhdunarodnye_obrazovatelnye_programmy.htm#ixzz3WWwKNnLO\"\u003eдвойных магистерских программ\u003c/a\u003e, которая позволяет обучаться в магистратуре вуза-партнера и после защиты диплома на английском языке получить магистерский диплом не только ИТМО, но и другого университета.\u003c/p\u003e\u003cp\u003eВ университете регулярно проходят открытые лекции приглашенных ученых, а среди почетных докторов ИТМО есть авторы быстрой сортировки, С++ и Интернета.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e5. Инфраструктура\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eУниверситет ИТМО находится в самом историческом месте Санкт-Петербурга, на Петроградской стороне в 5 минутах от метро, 10 минутах от Петропавловской крепости.\u003c/p\u003e\u003cp\u003eСтуденческий городок – 20 минут до университета пешком. Комнаты общежития рассчитаны на 2-3 человека. В студенческом городке работает множество спортивных секций, есть столовая, учебные комнаты, тренажерный зал, настольный теннис, танцевальный зал, киноклуб, комната с музыкальными инструментами.\u003c/p\u003e\u003cp\u003eВ Университете работает \u003ca href\u003d\"http://sumit.ru/alumni.html\"\u003eстартап инкубатор\u003c/a\u003e, позволяющий предприимчивым студентам начать свое дело не выходя из ИТМО. Партнерство с венчурными фондами, стартап сообществами и инвестиционными ангелами и эндаумент фонд университета позволяют стартовать с комфортом.\u003c/p\u003e\u003cp\u003eКроме кафедры КТ в состав Университета ИТМО входит более пятнадцати факультетов, активно функционирует ассоциация студенческого самоуправления, спортивный клуб, радио университета. Обычная студенческая жизнь кипит с сентября по июль, и студенты кафедры всячески приветствуются как её часть (\u003ca href\u003d\"https://vk.com/areesha\"\u003eAReesha\u003c/a\u003e, \u003ca href\u003d\"https://vk.com/missitmo\"\u003eудачи\u003c/a\u003e!)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e6. Учебный процесс\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eКТ принимает без вступительных испытаний всех победителей и призеров олимпиад школьников по математике и информатике любого уровня. Последние годы мы набираем на первый курс 90-120 человек, практически все кроме двух-трех из которых являются призерами олимпиад школьников. Пара человек поступает к нам на кафедру по ЕГЭ с баллами 289-300.\u003c/p\u003e\u003cp\u003eВесь набор первого курса кафедры разделяется на отдельные учебные группы, которые немного отличаются уровнем нагрузки. В 2015 году мы планируем выделить из КТ группу, в которой еще больше усилим программу. Изначально в усиленную группу попадут топ-25 по результатам олимпиад и личного собеседования студентов. В первом семестре все лекции групп будут одинаковыми, однако студенты усиленной группы кроме высоких результатов практик должны будут участвовать в дополнительных курсах. По результатам сессии студенты будут перегруппированы, так что изначальное распределение не помешает попасть в про-группу.\u003c/p\u003e\u003cp\u003eВ первом семестре студенты участвуют в конкурсе на стипендию правительства СПб (5000р) + получают дополнительную стипендию университета (5000р для победителей ВсОШ) + дополнительная стипендия для призеров и победителей Всероссийской олимпиады школьников (5000р) + все студенты кафедры получают стипендию (5000 рублей). В случае успешной (без троек) сдачи сессии все имеющиеся стипендии продлеваются. Таким образом тройка на первой сессии может стоить вам 60 000 рублей. Однако даже с такой мотивацией без троек сдают первую сессию далеко не все.\u003c/p\u003e\u003cp\u003eОдним из важных нововведений 2015 года станет апгрейд обучения английскому языку, который для первокурсников КТ будут преподавать носители и профессионалы центра English First. В учебном плане на занятия английским предусмотрено 4 часа в неделю.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e7. Мероприятия\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eКафедра КТ проводит четвертьфинал NEERC, полуфинал NEERC, ВКОШП, ИОИП, Интернет-олимпиады, олимпиаду Информационные технологии, Russian Code Cup, региональный этап ВсОШ по информатике. Сотрудники и студенты КТ входят в жюри заключительного этапа ВсОШ по информатике. \u003c/p\u003e\u003cp\u003eКроме подготовки задач кафедра занимается инфраструктурой и организацией мероприятий, работа над которыми позволяет получить опыт работы в команде, окружении, системе, научиться принимать решения и нести за них ответственность, строить, улучшать и масштабировать процессы, работать не только с другими студентами, но и с профессионалами и выпускниками, познакомиться с представителями десятков университетов.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e8. Спортивное программирование\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eОно есть. ОК.\u003c/p\u003e\u003cp\u003eТренировки проходят два раза в неделю, желающие студенты слушают дополнительные курсы по продвинутым алгоритмам и структурам данных. По результатам выступлений команды могут быть переформированы, лучшие по результатам отбора отправляются на Петрозаводские, Ижевские, МФТИ сборы. Активные команды участвуют в Открытом Кубке, отборах на открытые чемпионаты. \u003c/p\u003e\u003cp\u003eПриветствуется участие и в нестандартных соревнованиях, таких как Challenge 24, Marathon 24. Для команды-финалиста к этому набору добавляются сборы в Урозере (с СПбГУ и ПетрГУ) и Цюрихе (с ETH Zurich). Тренировки команд являются важной частью жизни Университета, который оплачивает участие команд во всех необходимых соревнованиях. PR отдел ИТМО внимательно следит за выступлениями студентов и привлекает журналистов в мир СП.\u003c/p\u003e\u003cp\u003eСтуденты и сотрудники кафедры проводят серию \u003ca href\u003d\"http://neerc.ifmo.ru/pcss/\"\u003eмеждународных сборов\u003c/a\u003e для вузов со всего мира, в том числе для таких университетов как UCLA, Peking University, ETH Zurich, Harbin Institute of Technology, Tongji University. Университет ИТМО является девятикратным чемпионом России и шестикратным чемпионом мира по программированию. Тренер команд университета – \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/andrewzta\" title\u003d\"Гроссмейстер andrewzta\"\u003eandrewzta\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e9. Обратная сторона медали\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eНа самом деле, обучение на кафедре достаточно сложное и вместе с этим интересное. Чтобы успешно закончить сессию и понимать каждый предмет, нужно потратить немало времени и сил. Но все силы, которые вы потратите, непременно окупятся. Каждый курс, действительно, полезен студенту, как будущему профессионалу своего дела. Преподаватели кафедры не будут ничего делать за вас, но помогут вам с чем угодно. Если вы хотите и готовы много работать, то вы получите огромное удовольствие от учебного процесса. \u003c/p\u003e\u003cp\u003e~\u003c/p\u003e\u003cp\u003eОсобенностью университета и особенно кафедры является ее динамичность. Мы следим за качеством образования, нам важно поддерживать постоянную связь со студентами нашей кафедры, получать отзывы о курсах и преподавателях. Ежегодно мы вводим новые курсы в программу обучения, модифицируем старые. Идеи для изменения программы предлагают сами студенты. Это, действительно, доступно для студентов принять участие в образовательном процессе и сделать кафедру лучше.\u003c/p\u003e\u003cp\u003eНаша кафедра – это одна большая дружная семья :)\u003c/p\u003e\u003c/div\u003e","tags":["#itmo","#ct"]}}