{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1416034220,"rating":33,"authorHandle":"RodionGork","modificationTimeSeconds":1416035512,"id":14713,"title":"\u003cp\u003eProgramming as Art or Craft\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cem\u003eHere was \u003ca href\u003d\"/blog/entry/14698\"\u003ethe post\u003c/a\u003e on searching for \u0026quot;interesting\u0026quot; job by red coder. And here was \u003ca href\u003d\"http://codeforces.ru/blog/entry/14698#comment-196815\"\u003ethe question\u003c/a\u003e by \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Ralor\" title\u003d\"Expert Ralor\"\u003eRalor\u003c/a\u003e about whether it is possible to get used to some dull job over the time. So this trashy post is just an answer to this question (I failed to fit it into comment field).\u003c/em\u003e\u003c/p\u003e\u003cp\u003eThe full question reads like this:\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eNot meaning to offend with my question — but does not the dislike (disgust?) to dull/general/non-creative job disappear with the time (or age)? What about other people, colleagues etc.? I can say for sure that I met people who enjoy simple job all right!\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eI\u0027d say that people are different! I think there are two major categories of coders in IT-industry:\u003c/p\u003e \u003col\u003e   \u003cli\u003eThose who do coding even when at home, in their free time;\u003c/li\u003e   \u003cli\u003eAnd those who do not.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eI do not mean they are \u0026quot;good\u0026quot; and \u0026quot;bad\u0026quot; programmers :)\u003cbr /\u003eBut I learned of the existence of such division late enough. I was telling to some of my colleague of some problem I\u0027ve recently met at ProjectEuler — and he suddenly asked:\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eYou do coding at home? Why???\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eAnd I also asked \u0026quot;And you do not???\u0026quot; — and he answered \u0026quot;No surely, I prefer to watch TV\u0026quot;. I said I have no TV (I put it out of my apartments for some good people may take care of it).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTwo kinds of coders in industry and their career profile\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eA couple of years ago I worked in some big outsourcing company. I met several nice people here, working in neighboring project. Let us call them Eve, Peter, Hiram and Simon (all four were senior developers building some national search portal for one of European countries).\u003c/p\u003e\u003cp\u003eDuring the course of the year Hiram and Simon left the company. Since then they probably changed jobs once more. Also they both are slightly crazy about side-projects.\u003c/p\u003e\u003cp\u003eHiram tried to create some unsuccessful finance-related web-site, then some multi-player Android game — later they both left their jobs and spent a month on some vague start-up (unsuccessful too as I understand). And now they are hired again by some great high-load related company providing services for giants like paypal etc.\u003c/p\u003e\u003cp\u003eMeanwhile Eve and Peter continue working in the same company where I met them (I myself changed the job twice since then).\u003c/p\u003e\u003cp\u003eThey are quite content with the job here. They do not code at home. For them it is a nice job which allows to gain enough money for other activities or hobbies.\u003c/p\u003e\u003cp\u003eThough as far as I suspect Simon and Hiram now have fatter salaries (my own grew about 1.5 times since then).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eConclusion\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eSo I just say — people are different. I suspect that most of coders involved in competitive programming belong to the first group of \u0026quot;passionate coders\u0026quot;, but nevertheless there exist many other nice developers. Well, not all of them even know hexadecimal though they may work for many years. I think it is good. :)\u003c/p\u003e\u003cp\u003e\u003cem\u003eP.S. probably it is also worth mentioning that when junior coder gets his first (or second) job, he/she usually enjoys it very much not regarding whether it is dull or creative. But this is because of novelty, so I do not mention this case.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e","tags":["art","craft","programming"]}}