{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399081851,"rating":-23,"authorHandle":"reign88","modificationTimeSeconds":1399081851,"id":12100,"title":"\u003cp\u003egrip on top now dare to do wine\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003egrip on top now dare to do wine, eating problems to resolve themselves to the outside.The problem is that people send out gifts and red envelopes get to eat their own subtraction definitely be a positive number, the estimated balance still too many. Otherwise, who would do the banquet it For the study of learning tricky, the current situation is still Eliminated.Netizen \u0026quot;peach\u0026quot; said forged invitations, notices o\u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-2013-c-48.html\"\u003etienda nike air max 2013\u003c/a\u003e  f meetings, etc. abroad (border) tourism, to really be called a visa invitation letter, called a fake invitation letter for approval, specifically to cope with going abroad (border) study management. Also, in order to facilitate reimbursement, to help make two stroke single, fully in accordance with the public in the form of a walk, nothing less than a variety of learning content, communication and visit, but actually by the addition of a \u0026quot;tour\u0026quot; itinerary to go, the content of natural is a sightseeing tour.Netizen \u0026quot;eat goods cutest\u0026quot; point of view is more direct and sharp: study tours are also very particular about, you can study tour to Qingdao city planning and construction work, study tour to Qufu cultural heritage protection and development work, study tours to Taishan tourism development and even to environmental protection work in Tibet study tours, study tours to negotiate the Anglo-American democracy work.In addition, users also had formalism, privileges were sharply critical thinking and expose, CCDI Supervision website almost original excerpts.More than 700 cases investigatedWhile children are users of all kinds of corruption tricky drying, while children and the rest of the commission is to investigate a variety of discipline inspection and supervision institutions.In the Central Discipline Inspection Commission of Supervision website \u0026quot;exposure table\u0026quot; column, a total of 29 cases of central and local exposure, the number of exposed cases in April, and occupy 14 of \u003c/p\u003e\u003cp\u003ethe 29.The case focused on the problems exposed: tardiness, absenteeism, work during online shopping, playing games, Gongjusiyong, received public funds, public funds, public funds to travel, lavish weddings, illegal subsidies and other aspects of welfare . Illegal time, mostly in 2013.For most of the country in violation of work discipline penalties conduct standards generally given a warning or demerit. If the perpetrator of the Department of Chinese Communist Party, the party gave a lot of warnings and probation punishment.For lavish, public funds and Gongjusiyong, penalties varying standards throughout.\u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-95-bb-c-35.html\"\u003enike air max 95 bb online\u003c/a\u003e  Some local administrative and party warning, in some places it is a serious warning or removed from their posts, and then a little harsh punishment is dismissal.Data from the Central Discipline Inspection Supervision site analysis, the central and state agencies as well as state-owned enterprises and 32 local party organizations including Xinjiang Production and Construction Corps, including the exposure frequency contrast, the former rare.There are only nine departments of Ministry of Education, Ministry of Environmental Protection, etc. exposure, the highest frequency of exposure which the Ministry of Education. State-owned enterprises, currently only CNPC, Sinopec, China Telecom and China Aluminum personnel problems of their own to be the exposure, where the oil and China Aluminum highest frequency exposure, other state-owned enterprises, especially the central enterprises did not see the exposure of illegal activities . Not yet known, is not \u003c/p\u003e\u003cp\u003ethere illegal activities, or that the majority of these state-owned enterprises in its internal behavior only in a \u0026quot;digest.\u0026quot;Core Tip: Having considered the report to the Central Commission for Discipline Inspection of the CPC Central Committee Political Bureau Standing Committee of the Conference Research Conference, decided to give Li City expelled from the party, dismissed from the above acts at Li City has a serious disciplinary offense, and confiscated their discipline proceeds; their alleged crime and involving money or property transferred to judicial organs according to law.21st Century Business Herald Xinhua April 29 news, recently, approved by the CPC Central Committee, the CPC Central Commission\u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-90-em-c-29.html\"\u003enike air max 90 em mujer\u003c/a\u003e  for Discipline Inspection on the eighth alternate member, former deputy secretary of the Sichuan Provincial Committee Li Town serious violation of law issues file for inspection. After receiving the survey more than 16 months, Li began to enter the city case the judicial process.Prior to the official who announced the news, the Li City (called HIT under) alumni, fellow Northeast Shi Zhenhua, Langjiu Group Chairman Wang Junlin, MICE Group chairman Tang Hong, chairman Guoteng Industrial Group, Chengdu Guoteng at Harbin Institute of Technology Electronic Technology Co., Ltd. (300101.SZ, hereinafter referred to as Guoteng electronic) actual controller Yan He and other private entrepreneurs involved; are state-owned enterprises in Chengdu, the Chengdu Industry Investment Group Co., Ltd. (Chengdu Industry Investment Group), Chengdu Construction Engineering Group, one of the senior officers involved in the case.The investigation, Li City, taking advantage of his position to seek benefits for others, accepting huge \u003c/p\u003e\u003c/div\u003e","tags":[]}}