{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1528441646,"rating":70,"authorHandle":"sankalp_","modificationTimeSeconds":1529309326,"id":59895,"title":"\u003cp\u003eA general question about getting better at CP\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e[EDIT]\u003c/p\u003e\u003cp\u003eI think at this point we all can safely agree that there is no such thing as \u0026quot;talent\u0026quot; and even if there is such a thing,hard work beats talent any day.So I request you all to please stop arguing about this.I genuinely made this post to get all of your suggestions and get some tips/tricks which might help me along the way but this post had turned into more of an argument about why all the LGMs were born with this so called talent and are invincible and can\u0027t be reached. I believe that with enough hard work, anyone can reach LGM and if that is not happening, it is because we are not putting enough effort.I agree I\u0027m not the right person to say this when I myself am terrible at CP but I am willing to invest a lot of my time to get better at it.\u003c/p\u003e\u003cp\u003e[POST]\u003c/p\u003e\u003cp\u003eDear all,\u003c/p\u003e\u003cp\u003eI am not good at competitive programming but I am willing to put in the effort to get better at it. I had a small question which I though might help me and a lot of people like me who want to get better at CP.\u003c/p\u003e\u003cp\u003eIt is not a question asking how to solve problem X or which method to use.\u003c/p\u003e\u003cp\u003e1:\u003c/p\u003e\u003cp\u003eI just wanted to know if, let\u0027s say you start solving a question. Can you look at the question and realize.. Oh!! this question can be solved using DP or graphs or some paradigm Y. \u003c/p\u003e\u003cp\u003eOr rather, how long does it usually take for the idea to click in your head?\u003c/p\u003e\u003cp\u003e2:\u003c/p\u003e\u003cp\u003eAlso, do you have a specific method to determine what to use(I know it is not possible in most cases) like looking at the constraints or the time limit or anything like that?\u003c/p\u003e\u003cp\u003e3:\u003c/p\u003e\u003cp\u003eIs there any particular pattern you follow while solving problems? Like.. do you select a problem to solve in you free time randomly or based on a particular tag?\u003c/p\u003e\u003cp\u003e4:\u003c/p\u003e\u003cp\u003eI found a couple of good blog entries by Morass and DarthPrince from which I practice topic specific problems and I am practicing algorithms from CLRS. Are there any resources that I am missing? If so can you please specify the names or post the links?\u003c/p\u003e\u003cp\u003e5:\u003c/p\u003e\u003cp\u003eAlso, on an average basis, how much time do you spend on CP per day?\u003c/p\u003e\u003cp\u003eThank you.\u003c/p\u003e\u003c/div\u003e","tags":[]}}