{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1406638017,"rating":15,"authorHandle":"ALEXKIRNAS","modificationTimeSeconds":1406638462,"id":13229,"title":"\u003cp\u003eПравила проведение олимпиады\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет сообществу CodeForces!\u003c/p\u003e\u003cp\u003eЯ (как и все на КФ) не раз принимал участие в разных турнирах по программирования. Каждый турнир проводится по своим правилам. Немножко погуглив я нашел всего 3 вида турниров: \u003ca href\u003d\"https://ejudge.ru/wiki/index.php/ACM\"\u003eACM\u003c/a\u003e, \u003ca href\u003d\"https://ejudge.ru/wiki/index.php/KIROV\"\u003eKIROV\u003c/a\u003e, \u003ca href\u003d\"https://ejudge.ru/wiki/index.php/OLYMPIAD\"\u003eOLYMPIAD\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eПоскольку я ещё школьник, то принимаю участие во Всеукраинской олимпиаде по информатике. Она состоит с 4 этапов ( I – школьный, II – региональной, ІІІ – областной, IV – всеукраинский). Я хочу рассказать Вам как у нас, в Винницкой области, проводится ІІІ этап и услышать Ваше мнение о некоторых нюансах олимпиады. \u003c/p\u003e\u003cp\u003eПроводится ІІІ этап на базе Физико-математической гимназии № 17 г. Винница и их не безызвестного \u003ca href\u003d\"http://www.olymp.vinnica.ua/\"\u003eсервера\u003c/a\u003e (здесь кроме отбора команды области на финал UOI проводяться такые престижне для Украины соревнования как NetOI и «Турнир чемпионов» ).\u003c/p\u003e\u003cp\u003eИ так все начинается с того что участникам раздаются условия задач (всего 4 задачи). Каждое условие делится на 4 подпункта:\u003c/p\u003e\u003cp\u003e1 – само условие\u003c/p\u003e\u003cp\u003e2 – формат ввода\u003c/p\u003e\u003cp\u003e3 – формат вывода\u003c/p\u003e\u003cp\u003e4 – примеры\u003c/p\u003e\u003cp\u003eХочу заметить, что такого пункта как ограничения на время работы и память нету! Ну, если лимит на память не задается явно, но ясно, что он ограничен где-то в районе 32-64 Мб, чего вполне хватает на все задачи, то отсутствие лимита времени — это катастрофа. На самом деле тайм лимит формируется по такому методу: время_решение_авторской_программы_на_тесте * 1,5, то есть если авторское решение отработало на тесте за 0,07 сек то лимит для участников будет 0,07*1,5 \u003d 0,1 сек. Эта система не совершенна поскольку било такое что программа отработала на тесте за 0,1 сек и там стоит ТЛЕ, а на более «тяжёлом» тесте за 1,7 и там ОК. Жури аргументирует применение этого метода тем, что когда участник знает лимит времени, то он не ищет самое оптимальное решение а пробует «просунуть» решение через тайм лимит. Замечу что тайм лимит для всех тестов разный:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/26/58/26582846f9e3136ccab13d16bf16322d0267e418.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://i.piccy.info/i9/0ac5893c073ededc1902edf8759c994f/1406636920/408438/778788/TLE.jpg\"\u003eОригинал\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eКогда участник написал код решение, он должен отправить его на проверку. И тут ещё одна проблема. Участнику доступно два меню: «Отравить решение на проверку», «Сдать решение на финальную проверку». И так если открыть первое меню и отослать по нему решение, то оно будет скомпилировано и проверено на тестах с условия (то есть это меню служит для проверки правильности формату ввода/вывода и компиляции программы на сервере на этом список функций заканчивается). Если отослать решение по втором меню, то решение будет отослана на системною проверку, а вам прейдет уведомление что решение успешно отправлено на этом все. Отослать решение через такое меню можно ТОЛЬКО ОДИН РАЗ за весь турнир и если Ви уже отослали решение и нашли ошибку, то больше не сможете перепослать решение. Системное тестирование проходит после турнира и узнать правильна идея решения под час турнира НЕВОЗМОЖНО. Баллы начисляются только за пройдённые тесты, за тесты с условия начисляется по 0 балов. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/9e/9b/9e9bc7ac9a8e8b4f315ba2340c003dfdcc670daf.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://i.piccy.info/i9/beca33f248782857870278c5e533e519/1406637136/406659/778788/PS.jpg\"\u003eОригинал\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eСамое интересное, что на финале UOI (как и на IOI) решения сразу же после посылки тестируются на полном наборе тестов и в зависимости от количества пройдённых групп получают баллы (то есть по правилам KIROV).\u003c/p\u003e\u003cp\u003eПосле всего выше сказанного у меня к вам пара вопросов:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eкак называется вид турниров, что проводится у нас (в Винницкой области)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eрационально ли по таким правилам проводить турниры для школьников\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eкак можно заставить жури проводить турнир по правилам KIROV (как и финал UOI).\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eСпасибо за внимание)\u003c/p\u003e\u003c/div\u003e","tags":["всеукраинская олимпиада","правила контестов","вопрос"]}}