{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1510139659,"rating":-16,"authorHandle":"Siriuslight","modificationTimeSeconds":1510141090,"id":55660,"title":"\u003cp\u003eCode with Beauty\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI think some will agree with my opinions and some might feel it is not necessary in Competitive Programming. But, I feel that programming is not just about writing a correct a code that solves the purpose, but also how the code looks. \u003c/p\u003e\u003cp\u003eEveryone have their own style of writing codes. One of the persons whom I admire the most is \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/rajat1603\" title\u003d\"Гроссмейстер rajat1603\"\u003erajat1603\u003c/a\u003e(Rajat De). Rajat\u0027s codes are very well formatted and obviously they are correct. I think the people who are learning from reading other\u0027s code get benefited from these beautiful codes a lot. I personally feel very happy after seeing Rajat\u0027s code. There are also various other coders who code beautifully like our legendary champion \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Легендарный гроссмейстер tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e(Gennady Korotkevich). \u003c/p\u003e\u003cp\u003eI just want to advice everyone to write your codes like its your personal signature, follow your own style and maintain a symmetry. Try it, feels good. I am not a very good problem solver neither a good blogger. I just love beautiful codes.\u003c/p\u003e\u003cp\u003ePlease give suggestions, how this can be encouraged. \u003c/p\u003e \u003cul\u003e   \u003cli\u003eExtra points can be awarded if possible during contests.\u003c/li\u003e   \u003cli\u003eA new rating like contribution and contests rating for code beauty.\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":["#coding","#coding style","#beautiful"]}}