{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1480112354,"rating":349,"authorHandle":"aka.Sohieb","modificationTimeSeconds":1480112572,"id":48626,"title":"\u003cp\u003eComplaint against ACPC\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003e2 weeks ago the ACM-ICPC Arab regional contest was held.\u003c/p\u003e\u003cp\u003eOur \u003ca href\u003d\"//codeforces.com/team/24593\"\u003eTeam\u003c/a\u003e participated in it after earning gold medals at the ECPC (\u003ca href\u003d\"https://icpc.baylor.edu/regionals/finder/ecpc-2016/standings\"\u003e3rd place\u003c/a\u003e).\u003c/p\u003e\u003ch2\u003eOur Sad Story\u003c/h2\u003e\u003cp\u003eDuring the contest we came upon a problem that no other team has attempted yet, and we actually submitted about 6 solutions for it, with the first two getting TLE response and the other four getting WA.\u003c/p\u003e\u003cp\u003eAfter failing to see what the problem is with our code we decided to leave it be and concern ourselves with other problems, that was nearly at minute 140.\u003c/p\u003e\u003cp\u003eAfter exactly 194 minutes from the start of the contest another team attempted the problem only to get WA. Also, at minute 214 another team (which happens to be the champion of both the ECPC and the ACPC) submitted a solution and also got a WA.\u003c/p\u003e\u003cp\u003eThen after a few minutes we find that there was some problems with the judge\u0027s solution and that all solutions to such problem were rejudged. This was after minute 214 of the contest (probably minute 220 or so). It turned out that our solution that we submitted at minute 90 was the correct solution, thus we were the first team to get the problem Accepted (from 4th submission, by the way).\u003c/p\u003e\u003cp\u003eLooking at the wasted time, that was more than 2 hours out of a 5 hour contest, which is 40% of the entire duration. We were held back for at least an hour trying to debug a solution that was already correct! and another hour until we were told that the solution was indeed correct. Not to mention the stress that we felt the entire time because at the time we decided to leave the problem be, we were in the middle of the scoreboard with only 2 problems solved while the top team solved 6 problems.\u003c/p\u003e\u003cp\u003eNow, 9 teams from our region have all been qualified to the WF (6 of them were Egyptians) and we weren\u0027t among them, the last team to qualify held the 13th position in the standings with 6 problems solved, while we solved 5 problems held the 15th position.\u003c/p\u003e\u003cp\u003eWe went to the closing ceremony to see what they would do to fix the issue, but it turned out that only the judging team knew about the issue and nobody else. Not to mention that nobody apologized to our team not in the closing ceremony nor in person! :(\u003c/p\u003e\u003cp\u003eWhat we see now is that we have been screwed, and if we were given at least 30 more minutes we would have solved 2 more problems at least, because near the end of the contest we had a minor bug in a solution and only needed little more time to fix it, and another correct solution ready on paper.\u003c/p\u003e\u003cp\u003eWe sent a complaint mail to the ACPC executive director but with no response. Then we escalated this matter to the ICPC sending another complaint mail to ( Contest Manager, Director — Regional Contests, Director — Judging, ICPC Technical Director, ICPC Deputy Executive Director, ICPC Executive Director, ACM HQ Coordinator, World Finals Director, Director, North Africa and the Middle East Contest ) but it has been 10 days and nobody responded.\u003c/p\u003e\u003ch4\u003eIs it too hard for the ACPC judging team to make and test 12 problems in a year?!!!\u003c/h4\u003e\u003cp\u003eNote that, this problem only got submissions before the judges fixed the issue from only 3 teams: Ours (which was affected by the issue the most), another one (which was paricipating unofficially), and the final one was the champion.\u003c/p\u003e\u003cp\u003eAnother Note, this happened to our team 3 time this year, The first one was in the local contest, we attempted a problem and only getting WA then after the contest day we talked with the judge finding out there is a issue in the intended solution and ours was AC, but we were the 1st so that did not affect us badly. The 2nd time was in the national contest \u003ca href\u003d\"//codeforces.com/gym/101147\"\u003eECPC 2016\u003c/a\u003e we attempted problem K only getting WA then after more than 30 minutes it become AC as there were invalid test cases, but that also did not affect us very badly as we were still held 3rd place. But the 3rd time was at the regional contest making our 2 years of training meaningless :(\u003c/p\u003e\u003c/div\u003e","tags":["the very unlucky team","acm-icpc","acpc","ecpc"]}}