{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1513717476,"rating":107,"authorHandle":"mfv","modificationTimeSeconds":1513718549,"id":56485,"title":"\u003cp\u003eРазборы задач региональных этапов Всероссийской олимпиады школьников по информатике\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e27 и 29 января 2018 года пройдёт региональный этап Всероссийской олимпиады школьников по информатике.\u003c/p\u003e\u003cp\u003eВ помощь готовящимся к нему школьникам представляю \u003ca href\u003d\"https://www.youtube.com/watch?v\u003dC-o5dFoBThI\u0026amp;list\u003dPLES6U-jjEXsfKmlupYYs021LDpEE4LxV0\"\u003eвидео разборы задач регионального этапа прошлых лет\u003c/a\u003e. На момент публикации статьи (20.12.2017) в списке воспроизведения разборы пятидесяти задач, в том числе все задачи B и C (средней сложности) обоих туров сезонов 2008/2009 — 2016/2017 (по 18 задач), а также 13 из 18 задач D (самых сложных задач туров).\u003c/p\u003e\u003cp\u003eВ ходе каждого разбора обсуждаются идеи решения задачи и реализуется решение на C++. \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eРабота над разборами продолжается, в конце декабря 2017 — начале января 2018 планируется разбор наиболее сложных из задач A (самых простых задач туров), а также оставшихся задач D.\u003c/p\u003e\u003cp\u003eРазборы проходят в рамках проекта \u0026quot;3.5 задачи в неделю\u0026quot; раз в два дня, всего в ходе проекта записаны разборы более 550 задач.\u003c/p\u003e\u003cp\u003eАвтор разборов (голос за кадром): Меньшиков Фёдор Владимирович,\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eавтор книги \u003ca href\u003d\"http://e-maxx.ru/bookz/files/menshikov.djvu\"\u003e\u0026quot;Олимпиадные задачи по программированию\u0026quot;\u003c/a\u003e,\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eучастник финала студенческого чемпионата мира по программированию 2003,\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eтренер десятков победителей и призёров заключительных этапов Всероссийской олимпиады школьников по информатике и ВКОШП разных лет,\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eрепетитор по олимпиадному программированию.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":["альтернативный разбор","всероссийская олимпиада","региональный этап"]}}