{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1407755799,"rating":149,"authorHandle":"prof.PVH","modificationTimeSeconds":1407772778,"id":13361,"title":"\u003cp\u003eTopCoder SRM 629 — Long time with no SRMs\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eTomorrow, SRM 629 will be held at \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?\u0026amp;day\u003d12\u0026amp;month\u003d08\u0026amp;year\u003d2014\u0026amp;hour\u003d11\u0026amp;min\u003d00\u0026amp;sec\u003d0\u0026amp;p1\u003d179\"\u003e11:00 EDT\u003c/a\u003e. This SRM is 3 weeks after the previous one (SRM 628 was on Jul 22, my birthday :D ). 3 weeks without TopCoder (except TCO14 Round 3), I\u0027m sure that many people and I miss TopCoder too much! A sad fact that the number of SRMs is decreasing recently. After some months with 4 SRMs each, July has only 2, August has 3, and it\u0027s still not sure about next months. I don\u0027t know the reason, but it will be a great pity if there aren\u0027t any more SRMs.\u003c/p\u003e\u003cp\u003eI like some SRM rules. The one I like most is that the ratings will change if we open a problem. This forces us to try our best to solve problems, or our ratings will decrease much (we can\u0027t keep our ratings unchange by not making any submissions). The next one is value of a problem starts decreasing when we open it (not from the beginning of the contests). We don\u0027t have to choose which problem to solve first, and next. I also prefer to have coding and challenging phase separately, since the cost of challenging will be reduced.\u003c/p\u003e\u003cp\u003eI hope there will be more SRMs in the future, as many as recent months. Wishing you a wonderful SRM and high rating. Don\u0027t forget to share your thinking about TopCoder and discuss the round problems here AFTER CONTEST ENDS.\u003c/p\u003e\u003cp\u003eThank you.\u003c/p\u003e\u003c/div\u003e","tags":["topcoder","srm","629"]}}