{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1491210552,"rating":123,"authorHandle":"yeputons","modificationTimeSeconds":1491211017,"id":51395,"title":"\u003cp\u003eAre Codeforces pages sometimes rendered blank during fast browsing with Firefox?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIn the last few weeks or even months I\u0027ve noticed that my use scenario for Codeforces became broken. Here it is:\u003c/p\u003e \u003col\u003e   \u003cli\u003eOpen the main page.\u003c/li\u003e   \u003cli\u003eScan \u0026quot;Recent actions\u0026quot; for interesting posts.\u003c/li\u003e   \u003cli\u003eOpen all of them in new tabs with mouse.\u003c/li\u003e   \u003cli\u003eGo and read posts and comments.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eThe problem is: approximately half of 5-10 opened tabs is rendered empty. Empty in the following sense: there is tab\u0027s title, one can see source HTML (e.g. the page is loaded), but the page itself is completely blank. DOM tree contains something (not too much), but \u003ccode\u003e\u0026lt;body\u0026gt;\u003c/code\u003e\u0027s height is zero:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/b7/34/b734c91d1414be8524738c3a79288b855ecbcf1c.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eFor comparison, here is the same page, rendered correctly (note that now we have several new scripts and a \u003ccode\u003e\u0026lt;div id\u003d\u0026quot;body\u0026quot;\u0026gt;\u003c/code\u003e):\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/7b/c0/7bc001675a5eac1599a10acaad19358ce47c2b2b.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eSteps to reproduce:\u003c/p\u003e \u003col\u003e   \u003cli\u003eTake Firefox on Windows. My version is 52.0.2 (32 bit). I was unable to reproduce the problem in Chrome.\u003c/li\u003e   \u003cli\u003eTake arbitrary ISP — I was able to reproduce the problem both directly and via encrypted proxy.\u003c/li\u003e   \u003cli\u003eYou don\u0027t have to log in — I was able to reproduce the problem in a fresh Firefox session (\u003ccode\u003efirefox -P -no-remote\u003c/code\u003e and create a new profile; this guarantees no strange cookies on external websites). However, I was unable to reproduce the problem in \u0026quot;Private Browsing\u0026quot;.\u003c/li\u003e   \u003cli\u003eOpen the main Codeforces\u0027 page.\u003c/li\u003e   \u003cli\u003eHold down Ctrl and click link to an arbitrary user\u0027s profile from \u0026quot;Top rated\u0026quot;. Click it fast: 10-20 times during several seconds.\u003c/li\u003e   \u003cli\u003eCheck all tabs one-by-one:\u003c/li\u003e \u003c/ol\u003e \u003cul\u003e   \u003cli\u003eExpectation: after loading indicator stops spinning, page is rendered and I can see Codeforces\u0027 logo and user\u0027s profile.\u003c/li\u003e   \u003cli\u003eReality: some tabs, even after loading indicator disappears, remain completely blank.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eI suspect that this is caused by some cookies set by either Codeforces or its analytics/like scripts (e.g. VK/Facebook).\u003c/p\u003e\u003c/div\u003e","tags":["bug","bugs","codefroces","bug report","codeforces website"]}}