{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1514824865,"rating":1319,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1514841475,"id":56831,"title":"\u003cp\u003eCodeforces: Results of 2017\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/e4/09/e40915ee54c5991b91098756a90270d94be893b3.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHappy New Year, Codeforces!\u003c/p\u003e\u003cp\u003eI hasten to wish the whole community (and including me) correct programs, sudden insights, beautiful ideas and interesting problems!\u003c/p\u003e\u003cp\u003eI hope that you have met the new year at least as fun as I am. Have you had enough sleep after New Year\u0027s Eve? This year, the traditional post summarizing the past year, I sat down to write only on January 1, 2018. I hope that I will not have to sum up the whole year.\u003c/p\u003e\u003cp\u003eThis post is important to me, since it draws a line to all the work done by the Codeforces team and the entire community in 2017. Many thanks to the team: all of the achievements listed below are the result of joint efforts. We did an excellent job! The community must know its heroes. In 2017, \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/KAN\" title\u003d\"Grandmaster KAN\"\u003eKAN\u003c/a\u003e (problem coordinator), \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/gritukan\" title\u003d\"International Grandmaster gritukan\"\u003egritukan\u003c/a\u003e (second problem coordinator), \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/netman\" title\u003d\"Master netman\"\u003enetman\u003c/a\u003e (ex-second problem coordinator), \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/kuviman\" title\u003d\"Master kuviman\"\u003ekuviman\u003c/a\u003e (developer), \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/fcspartakm\" title\u003d\"Candidate Master fcspartakm\"\u003efcspartakm\u003c/a\u003e (developer), \u003ca class\u003d\"rated-user user-black\" href\u003d\"/profile/SladeThe\" title\u003d\"Unrated, SladeThe\"\u003eSladeThe\u003c/a\u003e (developer) and \u003ca class\u003d\"rated-user user-green\" href\u003d\"/profile/gKseni\" title\u003d\"Pupil gKseni\"\u003egKseni\u003c/a\u003e (manager). Great contributions were provided by the students of the Saratov University: \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/BledDest\" title\u003d\"Candidate Master BledDest\"\u003eBledDest\u003c/a\u003e, \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/PikMike\" title\u003d\"Expert PikMike\"\u003ePikMike\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Vovuh\" title\u003d\"Candidate Master Vovuh\"\u003eVovuh\u003c/a\u003e, and \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Perforator\" title\u003d\"Grandmaster Perforator\"\u003ePerforator\u003c/a\u003e — educational rounds, trainings in Codeforces::Gym and help in the development. I radiate the rays of gratitude to problem writers and testers: you create interesting content for many thousands of programmers from all over the world. Many thanks to all those who helped with the special projects, wrote interesting posts and good comments. All together, we were able to make Codeforces better!\u003c/p\u003e\u003cp\u003eSo, let\u0027s move on to the results. It seems to me, this year again has something to brag about. \u003cbr /\u003e\u003c/p\u003e\u003ch5\u003eClients and Partners\u003c/h5\u003e\u003cp\u003eWe are always pleased when companies pay attention to the programming contest whether in order to find the brightest talent (yes, you are!) candidates, whether it is to support our community and just show themselves to you. Very pleased that this year the list of our partners long and varied. Many come again, and it’s inspiring. Here is a list of companies with whom or for whom we hosted competitions: VK, Harbour.Space University, 8VC, Mail.Ru, MemSQL, Playrix, Tinkoff Bank and AIM Tech. In this list, I did not consider the company to whom we just hosted a mirror of their main event.\u003c/p\u003e\u003cp\u003eHere is the list of key partners of 2017:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eTelegram and personally Pavel Durov is supporting Codeforces activities for many years, every regular round is conducted with their help, thank you!\u003c/li\u003e   \u003cli\u003eVK — VK Cup 2017,\u003c/li\u003e   \u003cli\u003eHarbor.Space University — several joint with BootCamp rounds and Educational Rounds,\u003c/li\u003e   \u003cli\u003e8VC — a joint mini-championship 8VC Venture Cup 2017,\u003c/li\u003e   \u003cli\u003eMail.Ru — Technocup 2017 and Russian AI Cup 2017,\u003c/li\u003e   \u003cli\u003eMemSQL — MemSQL Start [c] UP 3.0,\u003c/li\u003e   \u003cli\u003ePlayrix — Playrix Codescapes Cup,\u003c/li\u003e   \u003cli\u003eTinkoff Bank — mini-championship Tinkoff Challenge,\u003c/li\u003e   \u003cli\u003eAIM Tech — AIM Tech Round 4.\u003c/li\u003e \u003c/ul\u003e\u003ch5\u003eMajor innovations\u003c/h5\u003e\u003cp\u003eWe have done a lot of work to improve Codeforces and Polygon. Much of the work to improve infrastructure, stability, performance is not visible to everyone. The list below contains the main improvements.\u003c/p\u003e\u003ch6\u003ePolygon: \u003ca href\u003d\"https://polygon.codeforces.com\"\u003ehttps://polygon.codeforces.com\u003c/a\u003e – platform to prepare programming problems\u003c/h6\u003e \u003col\u003e   \u003cli\u003eManagement of test groups on the page with the list of tests, autocompletion of test groups by name, sorting by them.\u003c/li\u003e   \u003cli\u003eList of the contests to which a problem belongs, accessible from the interface of its editing.\u003c/li\u003e   \u003cli\u003eImproved interface for creating stress tests: checkboxes for solutions, inheritance of a list of solutions when copying a stress test.\u003c/li\u003e   \u003cli\u003eWarnings on problems are reflected on the contest page.\u003c/li\u003e   \u003cli\u003eSend letters about changing an access to a problem/contest.\u003c/li\u003e   \u003cli\u003eShow the reason for the failure checker verification.\u003c/li\u003e   \u003cli\u003eSearch by problem author.\u003c/li\u003e   \u003cli\u003eWarnings to use readXXX without a parameter name in a validator.\u003c/li\u003e   \u003cli\u003eShow the change log in the web interface.\u003c/li\u003e   \u003cli\u003eImproved support for problems with the same name in a single contest.\u003c/li\u003e   \u003cli\u003eStress tests for interactive problems.\u003c/li\u003e   \u003cli\u003eTest groups supported in validator tests.\u003c/li\u003e   \u003cli\u003eShow the problem description in search results.\u003c/li\u003e   \u003cli\u003eSort contests by modification time.\u003c/li\u003e   \u003cli\u003eImproved support for test input in a statement for interactive problems.\u003c/li\u003e   \u003cli\u003eValidator tests no longer require a checker.\u003c/li\u003e   \u003cli\u003eAdd examples of generators, validators, checkers and interactors in the problem edit interface.\u003c/li\u003e   \u003cli\u003eUpdated olymp.sty.\u003c/li\u003e   \u003cli\u003eFixed XSS when adding problem tags.\u003c/li\u003e   \u003cli\u003eFixed a zero-revision problem search.\u003c/li\u003e   \u003cli\u003eBy default, the memory limit is 256MB now.\u003c/li\u003e   \u003cli\u003eAdd multiple tests from files without ZIP-archive.\u003c/li\u003e   \u003cli\u003eImproved support of the Ukrainian language in the statements.\u003c/li\u003e   \u003cli\u003eSupport for drafts in contest properties textarea.\u003c/li\u003e   \u003cli\u003eThe preview of the tests has been redesigned, its work has been significantly improved.\u003c/li\u003e   \u003cli\u003eDisplay the last commits on the contest page.\u003c/li\u003e   \u003cli\u003eSupport for the role of \u0026quot;translator\u0026quot; for a problem.\u003c/li\u003e   \u003cli\u003eTests autorenumeration so that the examples go exactly first.\u003c/li\u003e   \u003cli\u003eImproved renumeration of tests with selection and moving of the selected tests.\u003c/li\u003e   \u003cli\u003eWarning if the testset contains the same tests.\u003c/li\u003e   \u003cli\u003eAdd contests by UID, not by id.\u003c/li\u003e   \u003cli\u003eA problem URL now contains a UID.\u003c/li\u003e   \u003cli\u003eAdd statements to a package separately by sections (legend, input, output, etc.).\u003c/li\u003e   \u003cli\u003eRename files on the Files tab.\u003c/li\u003e   \u003cli\u003eAdditional address to send emails about changes in a problem.\u003c/li\u003e \u003c/ol\u003e\u003ch6\u003eCodeforces\u003c/h6\u003e \u003col\u003e   \u003cli\u003eProblem/contest proposals interface and management.\u003c/li\u003e   \u003cli\u003eNotifications (bell at the top of the site).\u003c/li\u003e   \u003cli\u003eAutomatic removing of cheaters from virtual contests.\u003c/li\u003e   \u003cli\u003eImproved interface for answers to questions for writers.\u003c/li\u003e   \u003cli\u003eLog on via Facebook and improved linking to external accounts.\u003c/li\u003e   \u003cli\u003eCities/countries have been reworked, now you can choose them from a list generated from geodatabase.\u003c/li\u003e   \u003cli\u003eDomains for groups.\u003c/li\u003e   \u003cli\u003eIntegration with Polygon to show tutorials in blog posts.\u003c/li\u003e   \u003cli\u003eImproved the way to add tests from hacks.\u003c/li\u003e   \u003cli\u003eCustomized logo on the contests list page.\u003c/li\u003e   \u003cli\u003eInformation about special rules in the sidebar of contest pages.\u003c/li\u003e   \u003cli\u003eImproved training management for coaches (support for freezing, etc.).\u003c/li\u003e   \u003cli\u003eA tag about an atypical problem (*special).\u003c/li\u003e   \u003cli\u003eShow the history of communication with a user when answering on her/his message.\u003c/li\u003e   \u003cli\u003eImproved community support in the framework of Botan Investments grant program.\u003c/li\u003e   \u003cli\u003eSearch has been improved in Codeforces::Gym.\u003c/li\u003e   \u003cli\u003eAutologout of all sessions except the current one when changing the password.\u003c/li\u003e   \u003cli\u003ePrint support for contests in domain groups.\u003c/li\u003e   \u003cli\u003eCalendar of contests.\u003c/li\u003e   \u003cli\u003eSupport for built-in website custom forms for special registrations and surveys.\u003c/li\u003e   \u003cli\u003ePersonal private messages of rule violations.\u003c/li\u003e   \u003cli\u003eMultiple system performance improvements.\u003c/li\u003e   \u003cli\u003eInheriting (copying) a mashup from another contest.\u003c/li\u003e   \u003cli\u003eDiagnosis of solutions in C++.\u003c/li\u003e \u003c/ol\u003e\u003ch5\u003eStatistics\u003c/h5\u003e\u003cp\u003eI already wrote a year ago that every year I’m very excited to summarize statistics. I\u0027m very pleased to report the growth of Codeforces for all major metrics! For me, these numbers and charts mean a lot. First of all, that all efforts find a response among those who are interested in solving problems and programming contests. It\u0027s inspiring!\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2017/2017-registered-users-by-months.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eThe growth in the number of registered users. More than 600 thousand registrations!\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2017/2017-active-users.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eCounted only participated in rated events in period July-December. More than 35000 active contest participants!\u003cbr /\u003e\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2017/2017-submissions.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eYou’ve sent more than million solutions in 2017!\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2017/2017-blog-posts.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003e Blog posts with positive score, having at least +5 votes, having at least +20 votes, having at least +100 votes. The total number of posts is not interesting, because a lot of trash/spam, which immediately disappears and the result much depends on how we protect against bots and inadequate. A bit less than in the last year. Write more! \u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2017/2017-comments.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eAll positive scored comments, having at least +5 votes, having at least +20 votes. The growth is small, but it exists.\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2017/2017-countries.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eBrazil broke into the top! The greatest relative increase in India, China, Bangladesh, Vietnam, Brazil, Poland and Indonesia.\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2017/2017-pageviews-ga.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003ePageviews, about +25% in 2017!\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2017/2017-visits-ga.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eVisits, more than +20% in 2017!\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2017/2017-visitors-ga.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eVisitors, about +20% in 2017!\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e\u003cp\u003eThis is not included in the charts, but there is an increase in:\u003c/p\u003e \u003cul\u003e   \u003cli\u003enumber of hosted rounds,\u003c/li\u003e   \u003cli\u003enumber of new problems,\u003c/li\u003e   \u003cli\u003enumber of new trainings in Codeforces::Gym.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eSumming up, the year 2017 was a success! I look with enthusiasm at the next.\u003c/p\u003e\u003cp\u003eHello, 2018!\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","results","2017"]}}