{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1480594428,"rating":244,"authorHandle":"ErdemKirez","modificationTimeSeconds":1480597034,"id":48756,"title":"\u003cp\u003eWhy We Are Going To ACM-ICPC Finals?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi Codeforces,\u003c/p\u003e\u003cp\u003eMe(\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ErdemKirez\" title\u003d\"International Grandmaster ErdemKirez\"\u003eErdemKirez\u003c/a\u003e), \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/muratakburak\" title\u003d\"Candidate Master muratakburak\"\u003emuratakburak\u003c/a\u003e and \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/onuryildiz\" title\u003d\"Expert onuryildiz\"\u003eonuryildiz\u003c/a\u003e have a competitive programming team which name is LogicError in \u003ca href\u003d\"https://en.wikipedia.org/wiki/TOBB_University_of_Economics_and_Technology\"\u003eTOBB ETU\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eLike a month ago, we participated at SEERC 2016. When there\u0027s just a minute before the contest finished, I completed writing problem A and submitted it. It gave a wrong answer because in one line I wrote \u0026quot;a[i]\u0026quot; instead of \u0026quot;b[i]\u0026quot;. I changed it immediately but I wasn\u0027t be able to submit it because contest had finished. I downloaded code to my flash drive, hoping that somebody add this problem to Gym in Codeforces.\u003c/p\u003e\u003cp\u003eThanks to \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Temirulan\" title\u003d\"International master Temirulan\"\u003eTemirulan\u003c/a\u003e, he added SEERC 2016 to Gym, I submitted my code on Codeforces, and it passed. I got very sad because we got 6th place and lost 2th place because of one tiny bug, and chance of going ACM-ICPC Finals same time.\u003c/p\u003e\u003cp\u003eTwo days ago I got an e-mail from \u0026quot;ICPC Manager\u0026quot;, which named \u0026quot;IMPORTANT: Please certify your team.\u0026quot; I didn\u0027t read it carefully and I thought it was just a \u0026quot;certificate\u0026quot; about 6th place. I was just about to delete it then I thought maybe I can use that certificate some time. I clicked to e-mail but there were no links, pictures, pdfs in there. I read the first sentence and got a little heart attack,\u003c/p\u003e\u003cp\u003e\u0026quot;CONGRATULATIONS! Your team, LogicError, has advanced to the 41st Annual ACM-ICPC World Finals sponsored by IBM and hosted by Excellence in Computer Programming, Inc. from May 20–25, 2017 in Rapid City, South Dakota, USA.\u0026quot;\u003c/p\u003e\u003cp\u003eI stared at my phone like WTF IS GOING ON for five minutes. Then I realised we\u0027re going to ACM-ICPC Finals.\u003c/p\u003e\u003cp\u003eWe will be the first Turkish team which is going to finals, so we\u0027re really happy about it. It\u0027s a great success for us. However here\u0027s the main part I want to learn. Why we are going to finals? As far as I know, top 3 teams are qualified for finals. It made a big surprise for us and made us really happy.\u003c/p\u003e\u003cp\u003eThanks to whoever thinks \u0026quot;Let\u0027s top 6 team go to finals this year\u0026quot;!\u003c/p\u003e\u003c/div\u003e","tags":["seerc","acm icpc","stupiderdem"]}}