{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1511592048,"rating":-13,"authorHandle":"Meenachinmay","modificationTimeSeconds":1511592138,"id":55995,"title":"\u003cp\u003eLast Night Thought for doing better in CP : A new way to think for CP problems :)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003elast night after finishing my work i was thinking about my day that how i did and how many problems i solved but the ans was that i did not solve much problems.then i just found the reason that i have to try something new and i have to find that what is the main cause so that new programmers in competitive programming world can not do much better in starting and even after a long time.the ans is the \u003cstrong\u003ewe do not know how our mind works?\u003c/strong\u003e i have a little tip which i am using and trust me that is much powerful tip for our community because we people need it much,when even we solve a problem we think about it with very high concentration but for only few minutes then our mind starts getting irritate so the tip is. #### \u003cstrong\u003eif you are not able to reach to the solution then please take a break and try to solve some easier problem then return back to that problem again and repeat this process.\u003c/strong\u003e the science behind this is that when our mind got overflow of thinking then its need a particular chemical release to charge it up again and to get confidence and some time to make connection with our past save data,and chemical is release whenever we do something good whenever we achieve something our mind release that chemical i hope you are getting me i am not doctor but this truth and this tip can very useful for new comers.\u003c/p\u003e\u003cp\u003ei am giving the link for a video where you can watch the same thing i told you above it will help you to understand what i want to share with you exactly.thank you guys see you again..stay happy and peaceful coder :) \u003ca href\u003d\"https://youtu.be/WTr12dK2Se0?list\u003dPLPt2dINI2MIa3AdNEfMlWS-RXqkpMdUC3\"\u003eit will surly help you guys\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["#cp","#foucsed thinking","#better cp"]}}