{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1460033221,"rating":109,"authorHandle":"adurysk","modificationTimeSeconds":1460460001,"id":44233,"title":"\u003cp\u003eInsomnia 2016\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eBrace yourselves, Insomnia is coming!\u003c/p\u003e\u003cp\u003ePAG and SDSLabs, IIT Roorkee bring to you their flagship programming contest, Insomnia\u002716.\u003c/p\u003e\u003cp\u003eContest begins 21:00 IST on 9th of April, 2016\u003c/p\u003e\u003cp\u003eIt will be a team event (upto 3 members). Languages allowed are C/C++ and Java. The contest will consist of 20 problems, tough enough to keep you engaged for the entire duration. It is being conducted on our own platform, \u003ca href\u003d\"https://codevillage.sdslabs.co/\"\u003eCodeVillage\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eCarrying forward the tradition of Insomnia, which started as an overnight programming contest, it is the second consecutive time that it is being organised as an 24-hour contest.\u003c/p\u003e\u003cp\u003eProblem setters include members of 11coders, ACM-ICPC world finalist for this year and previous world finalists as well.\u003c/p\u003e\u003cp\u003eFollow the event at our facebook \u003ca href\u003d\"https://www.facebook.com/events/195338937517187/\"\u003eevent page\u003c/a\u003e. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate:\u003c/strong\u003e\u003cbr /\u003eCash prizes worth 40K INR to be won!\u003cbr /\u003eOverall: 1st Prize — Rs. 15,000 2nd Prize — Rs. 10,000\u003cbr /\u003eIndian Teams: 1st Prize — Rs. 10,000 2nd Prize — Rs. 5,000 \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate 2:\u003c/strong\u003e 3 hours into the contest! Out of 350 submissions, 110 have been accepted. 181 teams are solving our problem set.\u003c/p\u003e\u003cp\u003enfssdq and waisw are on top after solving 6 problems, and ctuFIT is following them on third place after solving 5 problems. 8 problems are still unsolved. Register now and solve them!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate 3:\u003c/strong\u003e With just a little below 9 hours to go, we have a new participant, M3M3T3M3 (\u003ca href\u003d\"//codeforces.com/profile/izrak\"\u003eizrak\u003c/a\u003e) from Sydney, who is Red on Codeforces, on top our leaderboard after solving 12 problems.\u003c/p\u003e\u003cp\u003eHe is closely followed by algoogla who have 11 ACs, and angleiitd is on third with 9 correct submissions.\u003c/p\u003e\u003cp\u003e4 problems still unsolved! Register at \u003ca href\u003d\"https://codevillage.sdslabs.co/\"\u003ehttps://codevillage.sdslabs.co/\u003c/a\u003e to see if you can solve them.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate 4:\u003c/strong\u003e 6 hours remain!\u003c/p\u003e\u003cp\u003eIt\u0027s all one way traffic at the top of the leaderboard, with M3M3T3M3 solving 16, ahead of algoogla who have 13 ACs. Anta is not too far behind with 12 correct submissions.\u003c/p\u003e\u003cp\u003e40K at stake. Who\u0027s going to take it all?\u003c/p\u003e\u003cp\u003eFollow the leaderboard here: \u003ca href\u003d\"https://codevillage.sdslabs.co/competitions/insomnia16/leaderboard\"\u003ehttps://codevillage.sdslabs.co/competitions/insomnia16/leaderboard\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate 5:\u003c/strong\u003e With less than 3 hours to go, anta has overtaken izraq to reach the top of the leaderboard. Both have 17 accepted submissions! anta who has been so far solving all problems sequentially, now faces the hardest problem of the set, yet unsolved. It\u0027s going to be interesting to see how this goes.\u003c/p\u003e\u003cp\u003eTry the problems at \u003ca href\u003d\"https://codevillage.sdslabs.co/\"\u003ehttps://codevillage.sdslabs.co/\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFinal Update:\u003c/strong\u003e What a thriller! \u003cbr /\u003eanta manages to submit Problem S in the last 5 minutes of the contest to clinch the top position in the leader board. Here are the winners:\u003c/p\u003e\u003cp\u003eOverall Winners:\u003cbr /\u003e 1. anta\u003cbr /\u003e 2. algoogla\u003c/p\u003e\u003cp\u003eIndian Winners:\u003cbr /\u003e 1. angleiitd\u003cbr /\u003e 2. Survivor\u003cbr /\u003e The winners shall be contacted soon regarding their prize money.\u003c/p\u003e\u003cp\u003eWe hope you enjoyed the problem-set. The editorials will be shared shortly.\u003cbr /\u003e Meanwhile, kindly fill this feedback form, so that we can improve your experience with us. We would love to hear from you. \u003ca href\u003d\"https://docs.google.com/forms/d/15BhyHY33PDvic0Y3NUCzUGobHc0NboSPhDU3nzO6md0/viewform\"\u003eFeedback form\u003c/a\u003e\u003c/p\u003e\u003cp\u003eYou can see the full leader board \u003ca\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAfter Contest:\u003c/strong\u003e Thanks everyone for making Insomnia\u002716 a successful event! \u003cbr /\u003eProblem Set — \u003ca href\u003d\"https://goo.gl/SOrLX3\"\u003ehttps://goo.gl/SOrLX3\u003c/a\u003e \u003cbr /\u003eEditorials — \u003ca href\u003d\"https://goo.gl/dT2l1k\"\u003ehttps://goo.gl/dT2l1k\u003c/a\u003e \u003cbr /\u003e\u003cbr /\u003eFor any doubts/queries, feel free to post on \u003ca href\u003d\"https://www.facebook.com/groups/sdspag/\"\u003ePAG\u0027s FB Group\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/3a/41/3a41a652b2a894b98bb36a05c7686b035f746ca2.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}