{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1400504139,"rating":28,"authorHandle":"MiptLited","modificationTimeSeconds":1400822903,"id":12347,"title":"\u003cp\u003eМосковский фестиваль спортивного программирования VIII Кубка им. И.Н. Векуа\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e24 и 25 мая 2014 года состоится \u003ca href\u003d\"http://it-edu.mipt.ru/ru/programming_festival_2014\"\u003e\u003cstrong\u003e«Московский фестиваль спортивного программирования VIII Кубка им. И.Н. Векуа»\u003c/strong\u003e\u003c/a\u003e, проводимый совместно Московским государственным университетом им.М.В.Ломоносова и Московским физико-техническим институтом (государственным университетом) на базе московского учебного центра МФТИ.\u003c/p\u003e\u003cp\u003eВ рамках Московского фестиваля по спортивному программированию пройдет очный тур Международной олимпиады по программированию на Кубок И.Н. Векуа. \u003c/p\u003e\u003cp\u003eОлимпиада будет проходить одновременно на 5 площадках: в Тбилиси, в Москве, в Новосибирске, в Виннице и в Санкт-Петербурге. На главной площадке чемпионата в Тбилиси соберутся команды со всего постсоветского пространства, вышедшие в финал Международного чемпионата ACM ICPC по спортивному программированию. \u003c/p\u003e\u003cp\u003e«Московский фестиваль спортивного программирования VIII Кубка им. И.Н. Векуа» является уникальнейшей возможностью принять участие в престижной Международной олимпиаде \u0026quot;у себя дома\u0026quot; и, благодаря прямой трансляции, стать очевидцем основных событий чемпионата в Тбилиси.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eМосковский фестиваль спортивного программирования пройдет в 2 тура:\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003e1 тур — командный зачет на VIII Кубок им. И.Н. Векуа;\u003c/strong\u003e\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003e2 тур — шестой личный чемпионат \u0026quot;MIPT open\u0026quot;.\u003c/strong\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eПосле чемпионата пройдет награждение участников. Церемония награждения победителей личного и командного контестов будет проводиться по итогам результатов «Московского фестиваля спортивного программирования VIII Кубка им. И.Н. Векуа» на площадке города Москвы.\u003c/p\u003e\u003cp\u003e«Московский фестиваль спортивного программирования VIII Кубка им. И.Н. Векуа» ставит перед собой цель собрать команды для очного поединка, команды-резерв для состязания с лучшими командами мировой программистской элиты. \u003c/p\u003e\u003cp\u003eФестиваль пройдет в Московском корпусе МФТИ (г. Москва, Дмитровское шоссе, д.9, Учебный центр МФТИ). \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://it-edu.mipt.ru/ru/programming_festival_2014/rasp\"\u003eПредварительное расписание.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eУчастие бесплатное, \u003ca href\u003d\"http://it-edu.mipt.ru/ru/programming_festival_2014/reg\"\u003eрегистрация на сайте\u003c/a\u003e открыта до 23 мая 2014г.\u003c/strong\u003e \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eВНИМАНИЕ! Регистрация отдельная на каждый тур!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eПодробную информацию вы можете получить в Центре развития ИТ-образования МФТИ по тел. +7-495-408-56-18, e-mail: \u003ca href\u003d\"mailto:acm.training@phystech.edu\"\u003eacm.training@phystech.edu\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["кубок векуа","москва"]}}