{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1514827853,"rating":63,"authorHandle":"DarthPrince","modificationTimeSeconds":1514828633,"id":56833,"title":"\u003cp\u003eAlgoBase — Let\u0027s translate e-maxx! (Random Prizes)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHappy new year people!\u003c/p\u003e\u003cp\u003eNew year has always been special in competitive programming community, especially in Codeforces. We see different kinds of magic every year in Codeforces, and we\u0027re so grateful for them; thank you \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e. But, what if we too could show people some magic? \u003c/p\u003e\u003cp\u003eI was talking to one of my friends the other day, about competitive programming resources, and he reminded me that \u003ca href\u003d\"http://e-maxx.ru/\"\u003eMAXimal\u003c/a\u003e is one the greatest resources for studying algorithms and data structures, however, it\u0027s not available to everyone since it\u0027s in Russian only. Of course, one could use google translate and try to understand it, but we all know even if it works, it\u0027s going to take a lot of time. So I had an idea! What if we translate all the articles in e-maxx to English? Of course, this isn\u0027t a job for one person, so I coudln\u0027t do it alone. And then, it crossed my mind... Crowd-sourcing! Everyone can contribute! Not only Russian speakers, but also others can use google translate for help. We\u0027re going to translate e-max together!\u003c/p\u003e\u003cp\u003eSo I started today and spent the whole January 1st writing a website that\u0027s going to be a competitive programming resource available to everyone, in English (and later on, maybe even in other languages!). I called it \u003ca href\u003d\"http://algobase.me\"\u003eAlgoBase\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eYou can register at \u003ca href\u003d\"http://algobase.me\"\u003eAlgoBase\u003c/a\u003e and submit the articles you\u0027ve translated. For now, we\u0027re only going to translate the \u0026quot;algo\u0026quot; section of \u003cem\u003ee-maxx\u003c/em\u003e. The deadline to submit your translated articles is February 14th. Avoid altering the materials and translate them as they are. After the deadline, the best translated version of each article (chosen by votes) are going to be published (with the name of their translator) on AlgoBase.\u003c/p\u003e\u003cp\u003eTo make it more interesting, \u003cstrong\u003etwo\u003c/strong\u003e published articles (on AlgoBase) are going to be chosen \u003cstrong\u003erandomly\u003c/strong\u003e and their translators (more specifically, their usernames) are going to be the \u003cstrong\u003eheroes of my CodeForces round\u003c/strong\u003e (my next round after articles are published). And also, \u003cstrong\u003etwo\u003c/strong\u003e other published articles are going to be chosen \u003cstrong\u003erandomly\u003c/strong\u003e and their translators will get AlgoBase \u003cstrong\u003eT-Shirts\u003c/strong\u003e. The selection is between articles, so the more articles you translate, the more chance you\u0027ll have at winning ;)\u003c/p\u003e\u003cp\u003eHappy translating!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTODO:\u003c/strong\u003e Soon there will be a list of submitted translations available so that we know what articles have been translated and etc. Also it\u0027s possible that \u003cstrong\u003ewe add more prizes if more people participate!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e Apparently there\u0027s a project named \u003ca href\u003d\"https://github.com/e-maxx-eng/e-maxx-eng/\"\u003ee-maxx-eng\u003c/a\u003e with the goal of translating e-maxx. But there are a lot of algorithms on e-maxx and only some in this project. But still, some pages are already translated. Therefore, \u003cstrong\u003ethe pages that are translated and present in e-maxx-eng are NOT ACCEPTED\u003c/strong\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["algobase","e-maxx","english","crowd-sourcing"]}}