{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1433503170,"rating":37,"authorHandle":"starius","modificationTimeSeconds":1433503170,"id":18346,"title":"\u003cp\u003enumeric vs numerical\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВчера в \u003ca href\u003d\"http://lua-users.org/lists/lua-l/\"\u003eсписке рассылки Lua\u003c/a\u003e было \u003ca href\u003d\"http://lua.2524044.n2.nabble.com/ANN-Lua-5-3-1-rc1-now-available-tp7667665p7667701.html\"\u003eобсуждение\u003c/a\u003e, в каких случаях правильно использовать слова \u0026quot;numeric\u0026quot; и \u0026quot;numerical\u0026quot;. Думаю, здесь это может пригодиться.\u003c/p\u003e\u003cp\u003eВ словарях слова numeric и numerical \u003ca href\u003d\"http://english.stackexchange.com/questions/53015/what-are-the-rules-for-the-use-of-words-that-have-a-variant-ending-in-al\"\u003eчислятся как синонимы\u003c/a\u003e, однако используются они по-разному. Кроме того, в некоторых значениях или переводах их можно спутать со словами numeral, digital и digit.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003enumeric\u003c/strong\u003e — про то, что состоит из чисел. Перевод на русский: \u003cstrong\u003eчисловой\u003c/strong\u003e. Примеры: numeric variable, numeric field.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003enumerical\u003c/strong\u003e — про то, что работает с числами или основывается на числах. Перевод на русский: \u003cstrong\u003eчисленный\u003c/strong\u003e. Примеры: numerical methods (численные методы), numerical reasoning (математическое мышление, т.е. способность делать выводы на основе множества чисел).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003enumeral\u003c/strong\u003e — как существительное, переводится на русский как \u003cstrong\u003eчислительное\u003c/strong\u003e. Если используется как прилагательное, то относится к обозначению числа (предлагаю перевод \u0026quot;цифровой\u0026quot;).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003edigital\u003c/strong\u003e — в узком смысле то же, что numerical, в широком смысле — всё, что связано с компьютерами, перевод \u003cstrong\u003eцифровой\u003c/strong\u003e. Пример: Digital Millennium Copyright Act — Закон об авторском праве в цифровую эпоху.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003edigit\u003c/strong\u003e — цифра. Редко используется в значении \u0026quot;палец\u0026quot;.\u003c/p\u003e\u003cp\u003eПривожу несколько цитат от носителей языка.\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eI think \u0026quot;numeric\u0026quot; is definitely the preferred form here. While the two words may be near-synonymous by a dictionary definition, the common usage is different.\u003c/p\u003e\u003cp\u003eThe term \u0026quot;numeric\u0026quot; is most frequently used to describe things that CONSIST of numbers, while the term \u0026quot;numerical\u0026quot; is most frequently used to describe things that USE numbers. For example, a \u0026quot;numeric value\u0026quot; is the result of an arithmetic expression, and a \u0026quot;numeric field\u0026quot; can contain a number, but a \u0026quot;numerical method\u0026quot; employs a series of computed number values to approximate a result that is difficult to evaluate directly and \u0026quot;numerical reasoning\u0026quot; describes one\u0027s ability to derive meaning from a set of numbers. \u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003e\u003ca href\u003d\"http://lua.2524044.n2.nabble.com/ANN-Lua-5-3-1-rc1-now-available-tp7667665p7667687.html\"\u003eCoda Highland\u003c/a\u003e\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eWhat ABOUT \u0026quot;numeral\u0026quot;? It means a symbol representing a digit or number as a noun, and it means pertaining to denoting a number as an adjective. In both cases it\u0027s about how a number is written, rather than how it\u0027s handled.\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003e\u003ca href\u003d\"http://lua.2524044.n2.nabble.com/ANN-Lua-5-3-1-rc1-now-available-tp7667665p7667701.html\"\u003eCoda Highland\u003c/a\u003e\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003enumeric \u003d consisting entirely of numbers (\u0026quot;a numeric ID\u0026quot;)\u003c/p\u003e\u003cp\u003enumerical \u003d involving numbers (\u0026quot;some numerical process\u0026quot;)\u003c/p\u003e\u003cp\u003enumeral \u003d the written form of a single digit (e.g. 1 or one)\u003c/p\u003e\u003cp\u003edigital \u003d technically means numerical, but more commonly taken to mean \u0026quot;associated with computers\u0026quot;\u003c/p\u003e\u003cp\u003edigit \u003d the symbols used to represent numbers (i.e. the symbols 0, 1, 2, 3, 4, 5, 6, 7, 8, 9), though it\u0027s also valid to refer to the digits of non-written numbers, e.g. \u0026quot;the third digit of my secret code is 4\u0026quot; (and this example phrase also implies that said code is numeric, else you\u0027d say \u0026quot;third character\u0026quot; or (not really correctly) \u0026quot;third letter\u0026quot;) digit also \u003d finger or thumb, but this is less common\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003e\u003ca href\u003d\"http://lua.2524044.n2.nabble.com/ANN-Lua-5-3-1-rc1-now-available-tp7667665p7667714.html\"\u003eRena\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}