{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399079225,"rating":-3,"authorHandle":"dustr80","modificationTimeSeconds":1399079225,"id":12094,"title":"\u003cp\u003ebut their hard work over\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eed when difficult and awkward, but their hard work over the years of sweat is hard to describe.The past two years, with the youth soccer community on Pill concern the improvement of the degree of attention, the local youth football development has been greatly improved. 2011 onwards, Pill campus football special funds included in\u003ca href\u003d\"http://www.freeasicscheap.co.uk/nike-free-run-2-c-26.html\"\u003enike free run 2 sale\u003c/a\u003e  the budget, funded by $ 100,000 per year. It is understood that local authorities have views on further strengthening the implementation of the work to form youth football discussion paper, which proposed the establishment of Zhidan county football management, the preparation of 10 people, a substantial increase in the intensity of football funds invested, while building covers an area of 100 acres Comprehensive training base, each school had at least one sentinel professional football teachers. \u0026quot;Our starting point is not the pursuit of results, and the popularity of football is still mainly the young people to promote the physical and mental development, so good seedling onto the bigger stage,\u0026quot; said Li Gang.On a clear Zhidan County Football Association emblem engraved with \u0026quot;100\u0026quot; numbers, \u0026quot;Our vision is to use 100% effort to build a hundred years of football,\u0026quot; Chang Bao Ding explained the original intention of the design. In its official website has an electronic countdown: from \u0026quot;Pill dream day\u0026quot;, as well as 32,640 days, this figure is constantly updated effort from the team to the fans, to create local culture, training of local players, attract home away long, have both market advantage, Harbin this new division to the next Super \u003c/p\u003e\u003cp\u003eLeague a lot of effort. After lively, football will test people\u0027s determination, patience and perseveranceThe eighth round of the Super League, the new army Harbin Yi Teng team home games for the first time, more than 30,000 spectators flood of Harbin Convention and Exhibition Centre Court, big cheer, momentum, the club is not inferior to the old home atmosphere. The same passion for the field more than the group, the lack of experience of the young man desperately chasing rush, passed the ball to where, where there toward the stampede. Until injury time before the whistle, Harbin Yi Teng team in front of Beijing Guoan still create dangerous situations. So hard blows, there is no slack, allowing \u003ca href\u003d\"http://www.freeasicscheap.co.uk/nike-free-run-2-c-26.html\"\u003enike free run 2 womens\u003c/a\u003e  viewers to feast their eyes, so that ball commentary bluntly spirit is commendable, it is brought applause.As the highest latitude Division, Harbin expand the Chinese professional soccer layout map. To have such views, unexpected. More unusual is a rare opportunity for fans here to witness professional football league, but the tendency among the main stand and the visitors are not mutually exclusive, and more concerned about the full enjoyment of viewing pleasure.In fact, there are geographical tendency itself is not bad, professional sport is a major feature of the local culture can become a good brand, which has long been a pioneer in the European and American professional sports to prove with practice. There localization support, easier to get fans and media recognition. Although professional sports through the operation of the market allocation of resources, the dominant flow of talent, but we can not simply treated as commodities. Harbin Yi Teng team only one substitutes the locals, so a team composed of players from t\u003c/p\u003e\u003cp\u003ehe other place will not be kicked out of the home of the local natural style Buyiburao scraping and removing the ball forward is a Bigfoot I do not see an impact of local cultural characteristics inherent within this body of foreign teams.What North Bard\u0027s football tradition, which says, I am afraid nobody say where. Delicious exotic dishes again, or miss the taste of home cooking, side soil support people. Culture must be characteristic of the brand, it is a matter of professional football came to Harbin sooner or later have to face. Yi Teng team\u0027s first Super League season, the novelty has not been finished, the war has been over eight, are lost every battle, not a sub-plot. From the team to the fans, to create local culture, training of local players, to attract foreign land long, have both \u003ca href\u003d\"http://www.freeasicscheap.co.uk/nike-free-50-c-19.html\"\u003enike free 5.0+ running shoes\u003c/a\u003e  benefits market, Harbin Division to the new Super League under a lot of effort. After lively, football will test people\u0027s determination, patience and perseverance. APB only 17 years old teenager Du Zhangjie to Frankfurt studies it. By Henan football career Foundation recommended got a chance to crack the German Frankfurt workout. In recent days, Du Zhangjie demonstrated high football talent, highly praised the coaching staff, do not rule out signing possible.Duzhang Jie, nicknamed \u0026quot;Little World of Warcraft\u0026quot; is Henan Jianye U17 team, he was born in December 1997 in Zhengzhou. Father wanted to send him to learn to play basketball, did not think he liked basketball class next door to football. Duzhang Jie Zheng road growth has been famous coach Ma Ji primary cultivation. In 2010, he successfully enter Jianye ladder line U15 team. 2011, in the \u0026quot;Soong Ching Ling Cup\u0026quot; competition, to help the team as captain Du Zhangjie third. 2013\u003c/p\u003e\u003c/div\u003e","tags":[]}}