{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1524814334,"rating":638,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1524815443,"id":59136,"title":"\u003cp\u003eCodeforces: Thanks for the support!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/70/a9/70a96afc574eb7a6ee37d8a1ee175f91b2b3c83a.png\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHello!\u003c/p\u003e\u003cp\u003eThis blog post is about the end of the crowdfunding campaign dedicated to the 8th anniversary of Codeforces. Everything worked out. Hooray!\u003c/p\u003e\u003cp\u003eFor us, it is very important to support not only in terms of the collected budget, but as a powerful indicator that Codeforces is important to you. It was very pleasant to read words of gratitude and congratulations. Thank you!\u003c/p\u003e\u003cp\u003eWe received more than 1000 donations from community members from around the world. For 45 days we\u0027ve collected more than $60000 dollars. The collected funds will allow us to continue to move forward, to please you with new contests and improvements of the system.\u003c/p\u003e\u003cp\u003eI am happy to report that starting in May 2018, we will be able to slightly increase rewards for problem writers.\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eRound type\u003c/th\u003e       \u003cth\u003eUSD\u003c/th\u003e       \u003cth\u003eRubles\u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003eDiv 1 + Div 2\u003c/td\u003e       \u003ctd\u003e$250+*$150\u003d$400 \u003c/td\u003e       \u003ctd\u003e26000 rub \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003eDiv 2 \u003c/td\u003e       \u003ctd\u003e$125+*$75\u003d$200 \u003c/td\u003e       \u003ctd\u003e13000 rub \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003e\u003csmall\u003eWe tie the money paid in rubles to the Central Bank of Russia exchange rate, rounded to the closest sum in rubles divisible by 5 (according to the rules of mathematical rounding). The table shows the values that were up-to-date when this post was published. An asterisk marks the bonus that is given if the round is prepared in time and without major issues in problems. \u003c/small\u003e\u003c/p\u003e\u003cp\u003eIn addition, the collected funds will help to increase a reward of the problem coordinators \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/KAN\" title\u003d\"Grandmaster KAN\"\u003eKAN\u003c/a\u003e and [user:gritikan]! Guys, you\u0027re doing a very important job, thank you for that!\u003c/p\u003e\u003cp\u003eImprovement of Codeforces hardware has already been launched, which will help improve the stability of the system and keep up with the growth of the audience.\u003c/p\u003e\u003cp\u003eTo all those of you who are expecting a gift from us (certificate, T-shirt, hoodie), I remind that it is necessary to fill in or update the information in the profile about the \u003ca href\u003d\"/settings/address\"\u003edelivery address\u003c/a\u003e. Please do not delay this!\u003c/p\u003e\u003cp\u003eThank you again for your support!\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","8 years"]}}