{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1433945918,"rating":73,"authorHandle":"kien_coi_1997","modificationTimeSeconds":1433945918,"id":18460,"title":"\u003cp\u003eAn efficient way to control energy in a contest (Part 3)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eWhile training, contestants does not often care about pressure. So, in a contest, many people tend to adjust pressure instinctively. This auto mechanism is not good.\u003c/p\u003e\u003cp\u003eWhen you are in really high pressure, you will realize that your body becomes cold, and hands start to shake. Many people don\u0027t know why. The fact is that, in the situation, your brain are consuming very much energy, causing body\u0027s heat loss and shaky hands. Under such high pressure, you can hold on only 30-60 minutes and then become exhausted (i means run out of energy).\u003c/p\u003e\u003cp\u003eIn this chapter, I am going to discuss about the way to master pressure (I means the way to control pressure proactively). This experience can enhance your efficiency in contests, especially helps you to prevent erratic performances. .\u003c/p\u003e\u003ch1\u003eChapter 3. Pressure\u003c/h1\u003e\u003ch2\u003eWhat is pressure?\u003c/h2\u003e\u003cp\u003ePressure is caused by a huge number of reasons. However, the two main reasons I want to discuss here are anxiety and concentration.\u003c/p\u003e\u003cp\u003eThe more anxiety is, the more pressure is. Usually, anxiety does not help you anything. Especially in contests, anxiety is not good at all. Therefore, in contests, if you worry that your result will be low, your performance is bad, ... remember that these thoughts are preventing you.\u003c/p\u003e\u003cp\u003eThe more concentration is, the more pressure is. Contradict to anxiety, you can complete more jobs thanks to more concentration. More importantly, concentration is what people can easily control. Therefore, adjusting concentration is the simple+efficient way to control pressure.\u003c/p\u003e\u003cp\u003eSo, what is the final definition of pressure? In a certain time interval, the more effort your brain makes, the more pressure is. Therefore, we can say that, pressure is the energy amount the brain consumes in a time interval. In other words, the pressure specifies how fast energy is consumed.\u003c/p\u003e\u003ch2\u003eNot all of jobs require concentration\u003c/h2\u003e\u003cp\u003eConcentration means high pressure. High pressure means fast consuming energy. In other words, when you concentrate, you will consume energy fast.\u003c/p\u003e\u003cp\u003eYou should realize that many jobs are not affected by concentration. In other words, no matter how hard you concentrate, the result+time of such jobs are not changed. Repeated jobs and straight-forward jobs are some typical examples.\u003c/p\u003e\u003cp\u003eIf you are a coder, there are code pieces you have written hundreds times. These code pieces definitely do not need concentration: #include , #define ..., for (int i\u003d1; i\u0026lt;\u003dn; i++), ...\u003c/p\u003e\u003cp\u003eMany people think that reading statements requires concentration, I don\u0027t think so. Here, “not concentrate” doesn\u0027t mean “do carelessly”. “Not concentrate” means do things in a normal+comfortable way. In order to understand statements well without concentration, the solution is to proactively read statements slower. With a slow reading speed, you can understand statements well without concentration.\u003c/p\u003e\u003cp\u003eIt is obvious that the more you concentrate, the faster your jobs are completed. However, the relationship “speed – concentration” is not ideal. For example, in order to read 2 times faster, you have to concentrate much more than 2x normal level.\u003c/p\u003e\u003cp\u003eOptimally, different jobs need different concentration levels. Understanding which jobs does not need concentration, you are able to save a considerable amount of energy, then use such energy amount in other jobs.\u003c/p\u003e\u003ch2\u003eConcentrate when you get stuck\u003c/h2\u003e\u003cp\u003eImagine that, you have to push a heavy box. If you don\u0027t push hard, the heavy box can\u0027t move, no matter how long you push. In the situation, the solution is to push with much power.\u003c/p\u003e\u003cp\u003eBecause you are a coder like me, I\u0027m sure that you have faced the following case. When I was a beginner, many times, I spent 1-2 hours thinking about a problem, but finally, I can\u0027t find out any ideas. The fact is that, in these useless 1-2 hours, instinctively, people tend to maintain a normal level of pressure. When you are stuck, if you don\u0027t increase the pressure, probably you will maintain the deadlock for a long time, about 1-2 hours. In this time, you waste not only time but also energy. Therefore, while you are stuck, maintaining normal pressure is dangerous.\u003c/p\u003e\u003cp\u003eThe worse the deadlock is, the bigger modification you need. Increasing pressure is necessary to create modifications. Although only increasing concentration may be not enough to break the deadlock, this step is important and there is no reasons to ignore this step.\u003c/p\u003e\u003ch2\u003eSummary\u003c/h2\u003e\u003cp\u003ePressure specifies how fast you consume energy. Concentration level is easy to be controlled. Adjusting concentration is the simple+efficient way to control pressure.\u003c/p\u003e\u003cp\u003eDifferent jobs need different concentration levels. Repeated jobs and straight-forward jobs need low pressure. Nevertheless, breaking deadlock needs high pressure.\u003c/p\u003e\u003cp\u003eConcentration improves the working speed but consumes energy faster. The relationship between “speed – concentration” is not ideal. It means that, in order to improve the speed a little, you may have to concentrate much more. Therefore different jobs need different concentration levels.\u003c/p\u003e\u003cp\u003e“Working without concentration” is different from “careless working”. By proactively slowing down the speed, the mistakes will be still limited, you will still be sure about what you are doing.\u003c/p\u003e\u003cp\u003eThe bigger deadlock is, the more you have to modify. While you are stuck, increasing pressure is necessary and there are no reasons to ignore this step.\u003c/p\u003e\u003ch2\u003eP/S (but important)\u003c/h2\u003e\u003cp\u003eIn chapter 2, I said, in a contest, the time you run out of energy should be the ending time of the contest. Controlling pressure enables you to do this.\u003c/p\u003e\u003cp\u003eBy estimating how much energy you remain (in chapter 2), you will know how you should control pressure. For example, when a contest is going to end, if you still have much energy, you should increase the pressure.\u003c/p\u003e\u003ch2\u003eP/S\u003c/h2\u003e\u003cp\u003eMy article is not ended. There will be 2 more parts in this article. I have not finished them because this article require a long time.\u003c/p\u003e\u003cp\u003eI will be glad if you share your own experience.\u003c/p\u003e\u003cp\u003eThis is the link to the previous chapters: \u003ca href\u003d\"//codeforces.com/blog/entry/18114\"\u003ehttp://codeforces.com/blog/entry/18114\u003c/a\u003e\u003c/p\u003e\u003cp\u003eNếu bạn đọc tiếng Việt thì có thể xem bài viết ở đây: \u003ca href\u003d\"https://sites.google.com/site/kc97ble/skill/kiem-soat-nang-luong-trong-ki-thi-phan-3\"\u003ehttps://sites.google.com/site/kc97ble/skill/kiem-soat-nang-luong-trong-ki-thi-phan-3\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["experience"]}}