{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1489607398,"rating":87,"authorHandle":"RussianCodeCup","modificationTimeSeconds":1489925624,"id":51001,"title":"\u003cp\u003eRussian Code Cup 2017 — Announcement\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi, everyone!\u003c/p\u003e\u003cp\u003eWe are pleased to announce Russian Code Cup 2017! Qualification rounds will start in April, the Final round will be held online in September. Each of the three Qualification rounds will allow 200 participants to qualify for Elimination round, top 50 from Elimination round will proceed to Final round. The problems will be both in Russian and in English.\u003c/p\u003e\u003cp\u003eThe full schedule of the tournament can be found at \u003ca href\u003d\"http://russiancodecup.ru\"\u003ehttp://russiancodecup.ru\u003c/a\u003e, you can also register there. Note that you must register for the new season even if you took part in the previous tournaments.\u003c/p\u003e\u003cp\u003eWe still have more than two weeks before the first Qualification, so we would like to invite everyone to the warm up round that will take plance on \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dRCC+2017+Warmup\u0026amp;iso\u003d20170319T14\u0026amp;p1\u003d166\u0026amp;ah\u003d2\"\u003eSunday, March 19, 14-00 Moscow time\u003c/a\u003e. Visit \u003ca href\u003d\"http://russiancodecup.ru\"\u003ehttp://russiancodecup.ru\u003c/a\u003e to take part in the round, it will be 2 hours long.\u003c/p\u003e\u003cp\u003eGood luck to everyone and see you at Russian Code Cup 2017!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e We remind you that the Warmup Round will start at 14-00 Moscow time. Problems of the Warmup Round are based on IOIP problems (Russian contest for high school students, run today at several cities) that are prepared by the same team of authors. We kindly ask students that take part in IOIP to play fairly and not to try to take part in RCC Warmup. Good luck to everyone!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2:\u003c/strong\u003e Thanks to all participants that made a real stress testing for our judging machines. Unfortunately we had long queues during the first hour, they were fixed, and from the middle of the contest the waiting time in most cases was limited to 2-3 minutes. We will make sure there would be no queues during further rounds.\u003c/p\u003e\u003c/div\u003e","tags":[]}}