{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1513710177,"rating":0,"authorHandle":"ValgesMalges","modificationTimeSeconds":1513710177,"id":56479,"title":"\u003cp\u003eFirst week.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone, I want to start off by saying that I understand some of these concepts are completely new to some of you, you just need to read about what you didn\u0027t understand or ask me either here or on my fb account or my email \u003ca href\u003d\"mailto:haneen.saleh95@gmail.com\"\u003ehaneen.saleh95@gmail.com\u003c/a\u003e\u003c/p\u003e\u003cp\u003eCOMPLEXITY \u003c/p\u003e\u003cp\u003eThe first thing we did was talk about the complexity of an algorithm, and that to avoid getting a Time Limit Exceeded verdict-like the verdict we got by submitting the first solution to the interesting drinks problem, we didn\u0027t have enough time to apply binary search to that problem- if the time limit is two seconds than the complexity of your solution should be less than 10^7, and if it was one second then it should be less than 10^6. In the link below I will put any external resources, I added a slide show about complexity. \u003ca href\u003d\"https://drive.google.com/open?id\u003d1Cw_AKzcjgSStCbCBtMy8OHMJRykmj74p\"\u003ehttps://drive.google.com/open?id\u003d1Cw_AKzcjgSStCbCBtMy8OHMJRykmj74p\u003c/a\u003e \u003c/p\u003e\u003cp\u003eBINARY SEARCH \u003c/p\u003e\u003cp\u003eBinary search is the process of eliminating half of a range because that range has numbers outside of our interest.\u003c/p\u003e\u003cp\u003eHere is little demonstration. \u003ca href\u003d\"https://www.cs.usfca.edu/~galles/visualization/Search.html\"\u003ehttps://www.cs.usfca.edu/~galles/visualization/Search.html\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe complexity of finding a number in a range is log (n). This is very fast, in comparison with the naive O(n) solution. Here is an explained code: \u003ca href\u003d\"https://ideone.com/M7GX8c\"\u003ehttps://ideone.com/M7GX8c\u003c/a\u003e please solve this problem to fully understand binary search \u003ca href\u003d\"http://www.spoj.com/problems/BSEARCH1/\"\u003ehttp://www.spoj.com/problems/BSEARCH1/\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWe also explained binary search the answer, where instead of searching for the number, you search for the answer to the problem. we solved problem !Hasan \u003ca href\u003d\"//codeforces.com/gym/101257/problem/D\"\u003ehttp://codeforces.com/gym/101257/problem/D\u003c/a\u003e\u003c/p\u003e\u003cp\u003ePlease note that the questions for this week will not be on binary search instead I will put easy implemintation problems so you would get used to the format and everything \u003c/p\u003e\u003cp\u003eBest of luck! \u003c/p\u003e\u003c/div\u003e","tags":[]}}