{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1471989878,"rating":44,"authorHandle":"P_Nyagolov","modificationTimeSeconds":1471989878,"id":46750,"title":"\u003cp\u003eAn Interesting Problem with Tree\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everybody,\u003c/p\u003e\u003cp\u003eRecently I decided to look for some problems involving queries on trees and the last I found was this — \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1752\"\u003ehttp://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1752\u003c/a\u003e \u003cstrong\u003e(note that this is not the problem I am asking about)\u003c/strong\u003e. In short, there is an unweighted tree with N\u0026lt;\u003d20000 nodes and Q\u0026lt;\u003d50000 queries are given. Each query contains a vertex V and distance D. You are to find some vertex that is on distance exactly D from V or report that there is no such vertex.\u003c/p\u003e\u003cp\u003eThe problem above has a fairly simple solution if you have solved some problems about diameters and LCA. However, when I first read the problem, I misunderstood it and I thought it was asking for how many vertices are there such that the distance from them to V is exactly D. After spending an hour of thinking, I looked at the discussions for some hints and I saw that this was not the problem.\u003c/p\u003e\u003cp\u003eAnyway, I think the problem which I thought I should solve is quite interesting and I wonder if someone has a solution to it. If so, please share your ideas. Also, I would love it if you can give me some more problems about queries on trees, here is one I really liked — \u003ca href\u003d\"http://www.spoj.com/problems/DRTREE/\"\u003ehttp://www.spoj.com/problems/DRTREE/\u003c/a\u003e and also one prepared by myself — \u003ca href\u003d\"http://www.spoj.com/problems/MAXCHILDSUM/\"\u003ehttp://www.spoj.com/problems/MAXCHILDSUM/\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThanks in advance! :)\u003c/p\u003e\u003c/div\u003e","tags":["queries","trees","data structures","help"]}}