{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1524469019,"rating":6,"authorHandle":"singh1495","modificationTimeSeconds":1524469019,"id":59067,"title":"\u003cp\u003einteresting problem\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThe Travelling Ant There is an Ant that lives in Baskerville and loves to travel. As Baskerville is a small place, it consists of only 5 cities placed one next to each other.\u003c/p\u003e\u003cp\u003eThere is a train between each successive cities ie between City 1 — City 2, City 2 — City 3, ... City 5 — City 1. Note that our Ant loves to travel and gets happy after making exactly N train trips and returning back to home. Ant lives in the city 1 from where she begins her journey. She asks you to find the number of ways she can make N train trips and come back to home.\u003c/p\u003e\u003cp\u003eSince the number of ways can be huge, print that number modulo 10^9 + 7.\u003c/p\u003e\u003cp\u003eInput First line contains T, the number of test cases. Then T lines follow. Each line contains a single integer n, representing the number of train trips the ant needs to make.\u003c/p\u003e\u003cp\u003eOutput For each test case, print a single line containing the answer to the problem.\u003c/p\u003e\u003cp\u003eConstraints 1 \u0026lt;\u003d T \u0026lt;\u003d 1000 0 \u0026lt;\u003d n \u0026lt;\u003d 10^18\u003c/p\u003e\u003cp\u003eSample Input 3 0 3 4 Sample Output 1 0 6 Explanation In first case, ant has to make 0 trips. So the ant stays at city 1 and has only 1 option. In second case, ant has to make 3 trips. No matter what combination we try, we can never reach back to city 1 back after 3 trips. So answer is 0. In third case, ant makes 4 trips. There are 6 ways in which it can reach back to city 1. Way 1: 1--\u0026gt;2--\u0026gt;1--\u0026gt;2--\u0026gt;1 Way 2: 1--\u0026gt;2--\u0026gt;3--\u0026gt;2--\u0026gt;1 Way 3: 1--\u0026gt;5--\u0026gt;1--\u0026gt;5--\u0026gt;1 Way 4: 1--\u0026gt;5--\u0026gt;4--\u0026gt;5--\u0026gt;1 Way 5: 1--\u0026gt;5--\u0026gt;1--\u0026gt;2--\u0026gt;1 Way 6: 1--\u0026gt;2--\u0026gt;1--\u0026gt;5--\u0026gt;1\u003c/p\u003e \u003chr /\u003e\u003cp\u003ehow can i solve this\u003c/p\u003e\u003c/div\u003e","tags":[]}}