{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1502105765,"rating":156,"authorHandle":"E621","modificationTimeSeconds":1502105765,"id":53733,"title":"\u003cp\u003eHow Japanese IOI team is selected\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI think this is the right time of showing the way of team selection in Japan, so I spare time for writing a blog, instead of preparing for Distributed Code Jam finals.\u003c/p\u003e\u003cp\u003eCompared to other countries, Japanese selection rules are very simple. Perhaps this is the simplest rule among the countries getting gold medal almost every year.\u003c/p\u003e\u003cp\u003eThere are 3 rounds to go to IOI. Each round is \u003cstrong\u003eindependent\u003c/strong\u003e so even if you don\u0027t do well in the previous round, you wouldn\u0027t have disadvantages for the next round (as long as you are qualified).\u003c/p\u003e\u003ch2\u003e1. JOI Qualification Round (JOI 予選)\u003c/h2\u003e\u003cp\u003eThe number of participants is a bit larger than 1,000. There are 6 tasks and contest duration is 3 hours. Judging from the past years\u0027 problems, the first task is really easy (like \u0026quot;I have 10 integers, and I\u0027ll give you 9 of my integers and the sum of all my integers. Can you guess the remaining integer?\u0026quot;), and about 5 students can solve the last task. This round is held online, and it seems AtCoder system will be used for the first time this year. If you have participated in Selection Camp before, you are automatically qualified to the Final Round. Otherwise, about 60 students with highest score advance to the next round, and there are other qualified students that even I don\u0027t know how are selected ( BLACK BOX :( ).\u003c/p\u003e\u003cp\u003eYou can find and solve past problems on Aizu Online Judge. Some problems are translated in English and some can be read through Google Translate.\u003c/p\u003e\u003ch2\u003e2. JOI Final Round (JOI 本選)\u003c/h2\u003e\u003cp\u003eThis is the national championship. The top 3 members are awarded medals and laptops. The number of participants is 70 to 80, and the contest is held in Tokyo or Tsukuba (the next IOI\u0027s place). You don\u0027t have to pay for your travel fee and staying cost, and the contest takes 2 days (including practice session and party). That\u0027s why I started to participate in JOI when I was 8th grade.\u003c/p\u003e\u003cp\u003eUsually, the contest has 5 problems and 4 hours, and cutoff line is between 2 full-solutions and 3 full-solutions (I think). Sometimes the last problem of this round is the hardest problem of the year.\u003c/p\u003e\u003cp\u003eYou can also find and solve past problems on Aizu Online Judge.\u003c/p\u003e\u003ch2\u003e3. JOI Spring Camp (JOI 春合宿)\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eThe most important round for participants. The national team is selected by the result of this camp.\u003c/strong\u003e Around 20 students with highest score in the Final Round can participate in this camp.\u003c/p\u003e\u003cp\u003eUsually, the camp contains 4 competition days (the camp itself is 7 days long, including practice round, lectures, and awarding ceremony of the Final Round). In each day, there\u0027s an IOI-styled contest with 3 or 4 problems and 5 hours. Despite only batch-style problems are used in previous two rounds, various kinds of problems are seen in this camp, including output-only, communication task, encode-decode task, etc. \u003c/p\u003e\u003cp\u003eThe problems used in the camp are known as \u0026quot;toughest yet most interesting problems\u0026quot; in Japan. I agree with the \u0026quot;toughest\u0026quot; for this year, because even \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/yutaka1999\" title\u003d\"International Grandmaster yutaka1999\"\u003eyutaka1999\u003c/a\u003e couldn\u0027t solve more than a half of the problems. \u0026quot;Most interesting\u0026quot;? I can\u0027t judge it since there are so many interesting contests in Japan, thanks to AtCoder.\u003c/p\u003e\u003cp\u003eThe top 4 students are selected for Japanese national team of IOI. Oh, what a simple selecting method.\u003c/p\u003e\u003cp\u003eYou can find past problems \u003ca href\u003d\"http://www.ioi-jp.org/camp/index.html\"\u003ehere\u003c/a\u003e (Japanese) and judge is on AtCoder (\u003ca href\u003d\"http://joisc2017.contest.atcoder.jp/\"\u003eexample\u003c/a\u003e, by changing the URL you can submit to past problems). Luckily, this year\u0027s problems are translated in English, so you can practice without the help of Google Translate (\u003ca href\u003d\"http://www.ioi-jp.org/camp/2017/2017-sp-tasks/index.html\"\u003eawoo\u003c/a\u003e).\u003c/p\u003e\u003ch2\u003e4. JOI Open Contest\u003c/h2\u003e\u003cp\u003ePractice contest for IOI, usually held in June or July. Usually 3 problems in 5 hours.\u003c/p\u003e\u003cp\u003eThis is not related to national team selection, so students can be relaxed to take part in the contest. the problem statement is provided in both Japanese and English. You can find further explanation on Codeforces (maybe \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/joisino\" title\u003d\"Grandmaster joisino\"\u003ejoisino\u003c/a\u003e posts about this contest every year).\u003c/p\u003e\u003ch2\u003e5. Conclusion\u003c/h2\u003e\u003cp\u003ePracticing with other country\u0027s OI problems seems very helpful, but they are often written only in their mother languages. Translating problems is a demanding work and nobody wants to do without payment. That means learning a new language for competitive programming practice makes sense (really?).\u003c/p\u003e\u003c/div\u003e","tags":["ioi","practice","japan","team"]}}