{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1465631201,"rating":225,"authorHandle":"MikhailRubinchik.ru","modificationTimeSeconds":1465631201,"id":45362,"title":"\u003cp\u003eЧто должен делать тренер?\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eЯ тут в очередной раз решил растечься мыслью по посту (и может быть потом посражаться в комментариях с самарцами).\u003c/p\u003e\u003cp\u003eЯ тренирую студенческие команды не так давно (реально активно года 3). И последние пару лет я постоянно пытался расспрашивать наиболее титулованных тренеров (прежде всего Андрея Станкевича, Андрея Лопатина, но немного других), пытался экспериментировать и что-то придумывать сам.\u003c/p\u003e\u003cp\u003eЯ хотел попробовать это всё упорядочить и написать пост, но в процессе общения с разными тренерами/универами/командами я понял, что всё везде сильно по-разному и если сделать пост только о моём опыте, то будет довольно однобоко. А хочется, чтоб такой пост мог послужить \u0026quot;методичкой\u0026quot; для начинающих тренеров, которые учат людей как с самого нуля, так и на более крутых уровнях.\u003c/p\u003e\u003cp\u003eПоэтому я решил сначала собрать больше информации от сообщества. Вопрос, который я задаю каждому читающему и комментирующему, шире, чем тот, который я вынес в заголовок. Что должен делать универ (это собирательное понятие из всех людей, кто в универе что-то делает для icpc) для АСМщика? Т.е. организация местных соревнований, поездок, лекции, тренировки, подбор сокомандников. Все подобные вещи можно и нужно включать в ответы. Возможно, вы считаете, что что-то нужно оставлять студенту, а от чего-то студента надо обязательно избавить. В общем, я бы хотел собрать как можно больше разнообразных мыслей по этому поводу. \u003c/p\u003e\u003cp\u003eЕсли обсуждение вызовет живой интерес, то после будет пост, собирающий информацию из комментариев и добавляющий что-то из того, что я собрал ранее и моё видение этого. В итоге хочется понять преимущества сильных вузов и недостатки слабых и помочь слабым усилиться.\u003c/p\u003e\u003cp\u003eЕсли у вас хватит дерзости, может посравнивать наших мэтров (итмо, СПбГУ, мгу, мфти и других) и попробовать предположить, у кого в чём преимущества. Также можно сравнивать их с провинциальными вузами и предполагать, чем столичные тренеры лучше провинциальных.\u003c/p\u003e\u003c/div\u003e","tags":[]}}