{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1505917147,"rating":31,"authorHandle":"misis","modificationTimeSeconds":1505917305,"id":54655,"title":"\u003cp\u003eО хакерах, зрении и сеточках, или хакатон VisionHack\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДоброго времени суток!\u003c/p\u003e\u003cp\u003eНаконец-то мы \u003cstrike\u003eпроснулись\u003c/strike\u003e \u003cstrike\u003eпротрезвели\u003c/strike\u003e собрались и написали пост о состоявшемся на прошлой неделе хакатоне VisionHack. Итак, поехали.\u003c/p\u003e\u003cp\u003e11-13 сентября в НИТУ “МИСиС” прошел хакатон по машинному зрению \u003ca href\u003d\"http://visionhack.misis.ru\"\u003eVisionHack\u003c/a\u003e, в организации которого участвовала и наша секция спортивного программирования. Наши тренеры, Игорь Мамай, Дарья Крохина и Сергей Савинов, а также участники секции Павел Кулагин и Никита Кодосов входили в организационный комитет как авторы задач и ответственные за систему проверки. Стоит отметить, что автоматическая система проверки — это уникальная черта нашего хакатона, позволяющая получить честные непредвзятые результаты. На других подобных соревнования достижения участников оцениваются, как правило, на основании презентаций, что дает преимущество талантливым ораторам и иногда прекрасные идеи могут просто потеряться.\u003c/p\u003e\u003cp\u003eВсего в хакатоне приняли участие 27 команд из ведущих университетов мира. НИТУ “МИСиС” представляли на хакатоне 4 команды, две из которых вошли в десятку сильнейших. Мы особенно рады, что в 3 из 4 команд были учащиеся нашей секции, которые не только нашли время прийти, но и показали хорошие результаты. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/16/50/1650386ec4c77aea0d4cf794fa6b6ec7e6b939c0.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e\u003cp\u003eОсновной тур VisionHack, в ходе которого требовалось решать задачи и кодить, длился 48 часов. На нем требовалось детектировать разные события на видеороликах. Всего в основном туре было пять событий: проезд под мостом/надземным переходом или въезд в туннель, пересечение лежачего полицейского, пересечение зебры, детектирование работающих дворников, а также детектирования знаков въезда и выезда из города. Азарт был настолько велик, что многие участники за это время спали не больше 5 часов. Что удивительно, практически все нашли силы не только поприсутствовать на церемонии закрытия, но и отпраздновать это событие в кругу других участников и организаторов. Для многих участников наш хакатон оказался удивительным шансом пообщаться с людьми со всего мира, работающими в той же области, ведь в нем принимали участие не только команды ведущих российских университетов, но и студенты из MIT (массачусетского технологического института), Кэмбриджа, Политехнического Универститета Каталонии и многих других. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/c1/43/c1437c5ff5c84cf252adabbd45133cdc35a5cb67.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eОтдельно стоит сказать несколько слов о призовом фонде мероприятия. Награды вручались в трех отдельных категориях. Во-первых, конечно же призы по общему зачету. Первое место с большим отрывом заняла команда МГУ DoubleA Team, второе место — команда МФТИ DeepMIPT, а третье — еще команда МГУ GMLvision. Стоит отметить, что все три команды решали задачи с помощью ИНС, а вот команда, оказавшаяся на четвертом месте предпочла не использовать сети и опиралась на обработку и анализ изображений. Также призы вручались по отдельным номинациям. В трех из них (мостах, знаках города и дворниках) также выиграла команда DoubleA, в детектирование зебры лучшими оказался DeepMIPT, а вот лежачих полицейских лучше всех находила команда из Иннополиса RoadAR.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/23/fe/23fe3b859fb2f49168b0304829aa4fb98f65e3fb.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eВ ходе VisionHack участники не только решали интересные задачи и общались между собой, но и слушали лекции от представителей научного и бизнес сообществ. К сожалению, для участников было практически нереально поприсутствовать хотя бы на половине лекций, ведь они шли одновременно к самим хакатоном. Хотелось бы отметить прекрасную лекцию \u003ca href\u003d\"https://ru.wikipedia.org/wiki/Пирожков,_Владимир_Вячеславович\"\u003eВладимира Пирожкова\u003c/a\u003e, которая помогла по-новому взглянуть как на технический прогресс в целом, так и на происходящие в наше время изменения.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/1f/4a/1f4ae12113e7e46f05a3535926c0a9b7832747ae.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eVisionHack оказался по-настоящему крупным и успешным соревнованием, участие в котором принесло всем море эмоций. Техническая часть соревнования была подготовлена “на ура”, и, даже если возникали вопросы, всегда можно было задать вопрос жюри и получить исчерпывающий ответ.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/68/15/68157a26d50ee2fefb11ecf2bd71ed3ce17e923d.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}