{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1478953060,"rating":104,"authorHandle":"gKseni","modificationTimeSeconds":1479211661,"id":48355,"title":"\u003cp\u003eXI Открытая олимпиада школьников по программированию: основные ссылки, правила и комментарий организатора\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/34/d1/34d131486d670ba8c26fef2baed70d408af7ba1f.png\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eНачался первый тур отборочного этапа \u003ca href\u003d\"https://olympiads.ru/zaoch/2016-17/index.shtml\"\u003eXI Открытой олимпиады школьников по программированию\u003c/a\u003e. Опубликованы \u003ca href\u003d\"https://olympiads.ru/zaoch/2016-17/zaoch/problems.shtml?20161110\"\u003eусловия первых четырех задач\u003c/a\u003e, открыты \u003ca href\u003d\"https://olympiads.ru/ej/client?contest_id\u003d131\u0026amp;locale_id\u003d1\"\u003eрегистрация на олимпиаду и вход в соревнование\u003c/a\u003e, а также \u003ca href\u003d\"https://olympiads.ru/ej/register?contest_id\u003d131\u0026amp;locale_id\u003d1\"\u003eперсональные страницы участников\u003c/a\u003e, \u003ca href\u003d\"https://olympiads.ru/zaoch/2016-17/faq.shtml\"\u003eчасто задаваемые вопросы\u003c/a\u003e. Появилась ссылка на \u003ca href\u003d\"https://olympiads.ru/zaoch/2016-17/current_standings.shtml\"\u003eтекущие результаты\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eОлимпиада проводится в два этапа. Первый этап — заочно через интернет, состоит из длинного и короткого туров, принять в нем участие могут все желающие — однако в конкурсном зачете участвуют только школьники, остальные — вне конкурса. Правила заочного тура \u003ca href\u003d\"https://olympiads.ru/zaoch/2016-17/zaoch_rules.shtml\"\u003eздесь\u003c/a\u003e. Заключительный этап — очный.\u003c/p\u003e\u003cp\u003eВ этом году организаторы олимпиады отошли от традиционного формата отборочного этапа, который на этот раз будет состоять из двух туров. Длинный тур — с 10 ноября 2016 года по 10 января 2017 г — состоит из 8 задач. 4 опубликованы сразу, остальные будут доступны после 10 декабря. Короткий тур пройдёт с 14 по 16 января 2017 года. В течение данных трёх дней каждый участник должен выбрать пять часов и написать тур в режиме реального соревнования.\u003c/p\u003e\u003cp\u003eПо результатам заочного этапа определятся школьники, которые будут приглашены на заключительный очный этап олимпиады. Он пройдет в Москве, 9-11 марта 2017 года.\u003c/p\u003e\u003cp\u003eОрганизаторы стараются подбирать задачи таким образом, чтобы они были интересны как новичкам, так и старожилам олимпиадной информатики. Необычный формат соревнования позволяет жюри в задачах отойти от традиционных тем школьных олимпиад по программированию.\u003c/p\u003e\u003cp\u003eЖюри олимпиады призывает всех участников действовать честно, не обсуждать друг с другом решения задач и не делиться написанным кодом. К сожалению, каждый год некоторые участники заочного этапа не допускаются к участию в очном этапе из-за выявления случаев списывания с их участием.\u003c/p\u003e\u003cp\u003eГлеб \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/GlebsHP\" title\u003d\"Гроссмейстер GlebsHP\"\u003eGlebsHP\u003c/a\u003e Евстропов, один из организаторов олимпиады, ответил на несколько моих вопросов:\u003c/p\u003e \u003cdiv style\u003d\"background-color: rgb(250,250,250);padding: 1.0em;\"\u003e — \u003ci\u003eДолго вы готовились?\u003c/i\u003e\u003cbr /\u003e    — Работа над задачами московских олимпиад начинается в первых числах сентября. В это время традиционно проводится заседание методической комиссии, на которое приглашаются все студенты-олимпиадники и заинтересованные в школьных олимпиадах люди. На встрече обсуждаются идеи задач. А идей нужно много — цикл московских школьных олимпиад включает \u003ca href\u003d\"https://olympiads.ru/team/\"\u003eМКОШП\u003c/a\u003e, \u003ca href\u003d\"https://olympiads.ru/mosolymp/\"\u003eОлимпиаду для 6-9 и 10-11 классов\u003c/a\u003e, \u003ca href\u003d\"https://olympiads.ru/zaoch/2016-17/index.shtml\"\u003eОткрытую олимпиаду\u003c/a\u003e. С этого года добавилась ещё \u003ca href\u003d\"http://megapolis.educom.ru/ru\"\u003eОлимпиада мегаполисов\u003c/a\u003e. Можно считать, что мы постоянно готовимся :) \u003cbr /\u003e\u003cbr /\u003e   — \u003ci\u003eКто и как выбирал задачи?\u003c/i\u003e\u003cbr /\u003e     — Итоговое обсуждение и отбор задач происходит уже в более тесном кругу методической комиссии, состав которой периодически меняется. Бессменным остаётся её председатель и вдохновитель — Елена Владимировна Андреева.  \u003cbr /\u003e  \u003cbr /\u003e   — \u003ci\u003eКакие интересные случаи при подготовке были? \u003c/i\u003e\u003cbr /\u003e      — В олимпиадном мире, как правило, «интересные» случаи при подготовке означают «неприятные». Организаторам мероприятий вообще редко нравятся неожиданности.  \u003cbr /\u003e  \u003cbr /\u003e   Мне очень хорошо запомнился случай на открытой олимпиаде 2014-15 учебного года. У нас в варианте тура была красивая конструктивная интерактивная задача, которую во время соревнования многие участники сдали очень простым рандомным решением. Сначала мы подумали, что это слабые тесты. В итоге оказалось, что можно доказать асимптотическую оптимальность такого решения. Это было действительно «интересно». Но в тот момент сюрприз был неприятным, поскольку сильно повлиял на итоговые результаты. \u003cbr /\u003e  \u003cbr /\u003e   Мы серьёзно работаем над улучшением процесса разработки задач — сейчас готовим не 8 задач (именно столько нужно для проведения двух туров), а немного больше. После проводим прорешивание для студентов-олимпиадников — это помогает нам лучше оценить сложность и новизну задач. Заодно позволяет использовать оставшиеся задачи как запасные — на случай возникновения каких-либо трудностей. \u003cbr /\u003e  \u003cbr /\u003e   Наша олимпиада развивается. Три года назад организация вышла на новый уровень, благодаря появлению генерального спонсора — \u003ca href\u003d\"http://1c.ru/\"\u003eкомпания 1С\u003c/a\u003e. В прошлом году мы впервые пригласили к участию иностранных участников, не владеющих русским языком. Это были две команды — из Болгарии и Румынии. В этом году планируем дополнительно пригласить сборные некоторых других стран, с которыми мы пересекаемся на аналогичных международных соревнованиях в Болгарии и Румынии. Именно эти страны были приглашены к нам самыми первыми — как благодарность за приглашение на свои олимпиады. \u003c/div\u003e\u003c/div\u003e","tags":["codeforces::news","заочка","открытая олимпиада"]}}