{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1429213238,"rating":82,"authorHandle":"nk.karpov","modificationTimeSeconds":1429232835,"id":17439,"title":"\u003cp\u003eНовый бакалавриат в СПбГУ\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДобрый вечер, данная информация может быть полезна для поступающих в 2015 году.\u003c/p\u003e\u003cp\u003eВ СПбГУ открывается новый бакалавриат по направлению \u0026quot;Математика и теоретическая информатика\u0026quot;. Его основная цель дать студентам современное образование как в фундаментальной математике, так и в теоретической информатике (наверное второе интересно для аудитории codeforces).\u003c/p\u003e\u003cp\u003eВы можете узнать про это в \u003ca href\u003d\"https://vk.com/public92123936\"\u003eпаблике Вконтакте\u003c/a\u003e и на \u003ca href\u003d\"http://www.chebyshev.spb.ru/bachelor_program/\"\u003eсайте лаборатории им. Чебышева\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eЕсли вы попадёте в эти 45 человек, то лекции вам будут читать учёные мирового уровня (некоторые курсы на матмехе и в АУ Я слушал от них, и это были отличные курсы), достаточно посмотреть на состав совета программы, в частности его возглавляет \u003ca href\u003d\"https://ru.wikipedia.org/wiki/%D0%A1%D0%BC%D0%B8%D1%80%D0%BD%D0%BE%D0%B2,_%D0%A1%D1%82%D0%B0%D0%BD%D0%B8%D1%81%D0%BB%D0%B0%D0%B2_%D0%9A%D0%BE%D0%BD%D1%81%D1%82%D0%B0%D0%BD%D1%82%D0%B8%D0%BD%D0%BE%D0%B2%D0%B8%D1%87\"\u003eСтанислав Смирнов\u003c/a\u003e и в него входит \u003ca href\u003d\"https://ru.wikipedia.org/wiki/%D0%93%D0%B8%D1%80%D1%88,_%D0%AD%D0%B4%D1%83%D0%B0%D1%80%D0%B4_%D0%90%D0%BB%D0%B5%D0%BA%D1%81%D0%B5%D0%B5%D0%B2%D0%B8%D1%87\"\u003eЭдуард Гирш\u003c/a\u003e и \u003ca href\u003d\"https://ru.wikipedia.org/wiki/%D0%9C%D0%B0%D1%82%D0%B8%D1%8F%D1%81%D0%B5%D0%B2%D0%B8%D1%87,_%D0%AE%D1%80%D0%B8%D0%B9_%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B8%D1%87\"\u003eЮрий Матиясевич\u003c/a\u003e, которые по всей видимости и ответственны за часть \u0026quot;теоретическая информатика\u0026quot; в названии специальности. Пожалуй, для людей которые хотят узнать математику (может уже думали поступать на чистмат СПбГУ) это прекрасный шанс.\u003c/p\u003e\u003cp\u003eОднако, если понимаете, что такое количество математики вас не привлекает, а хотите научится программировать и получить математику в формате \u0026quot;как она должна читаться программистам\u0026quot; добро пожаловать в \u003ca href\u003d\"http://mit.spbau.ru/bachadmission\"\u003eбакалавриат АУ\u003c/a\u003e, про который наверняка уже слышали в прошлом году.\u003c/p\u003e\u003cp\u003eНе стоит забывать, что если вы находитесь в Санкт-Петербурге, тут есть \u003ca href\u003d\"https://compscicenter.ru/\"\u003eCS center\u003c/a\u003e, \u003ca href\u003d\"http://logic.pdmi.ras.ru/csclub/\"\u003eComputer Science клуб\u003c/a\u003e и \u003ca href\u003d\"http://mit.spbau.ru/mastersadmission\"\u003eмагистратура АУ\u003c/a\u003e. Во всех них читаются отличные и интересные курсы (говорю как слушатель).\u003c/p\u003e\u003c/div\u003e","tags":["спбгу","матмех","ау","cs","математика","бакалавриат","магистратура"]}}