{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1411801272,"rating":9,"authorHandle":"kostya_by","modificationTimeSeconds":1411801272,"id":14001,"title":"\u003cp\u003eТретья неделя. Упражнения.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПо традиции, дублирую письмо с упражнениями тут.\u003c/p\u003e \u003chr /\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eКазалось бы, только недавно закончилась третья марафонская 4х часовая лекция. Как время бежит! Нельзя терять не минуты! \u003c/p\u003e\u003cp\u003eИтак:\u003c/p\u003e\u003cp\u003eОчень советую вам дорешать задачу про максимальный ксор(\u003ca href\u003d\"http://codeforces.ru/problemset/problem/282/E\"\u003ehttp://codeforces.ru/problemset/problem/282/E\u003c/a\u003e ), а также две задачи на подмаски(Областная олимпиада 2012 года, задача Конкурс и \u003ca\u003ehttp://codeforces.com/contest/383/problem/E)\u003c/a\u003e. Все три задачи очень полезные. Тем более, я уже два раза вам рассказал как решать каждую из них, так что теперь все должно быть понятно до предела. \u003d)\u003c/p\u003e\u003cp\u003eТакже, очень советую дорешать задачу про черепашку(\u003ca\u003ehttp://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1699)\u003c/a\u003e. Те, кто чувствует себя по-уверенее в LCA — постарайтесь досдать ее без подсматривания куда-либо, остальным же рекомендую изначально еще раз пройтись по методу поиска LCA(\u003ca\u003ehttp://e-maxx.ru/algo/lca_simpler)\u003c/a\u003e, а только потом браться за решение задачи про черепашку. Напоминаю вам, что метод бинарного подъема входит в негласный список алгоритмов, которые знать просто необходимо, так что советую тем, кто его еще не понял, его разобрать. Все вопросы можно будет задать на следующей лекции, можно отправить письмо мне на почту(\u003ca\u003ekostya.sokol.by@gmail.com)\u003c/a\u003e, а также спросить меня в скайпе(kostya-by). Видите как много способов спросить и получить ответ! Не теряйте свой шанс узнать что-то новое и интересное.\u003c/p\u003e\u003cp\u003eНа этой неделе не был разобран один гроб(\u003ca href\u003d\"http://www.codechef.com/problems/SEAARC\"\u003ehttp://www.codechef.com/problems/SEAARC\u003c/a\u003e) — иначе бы мы просто не успели бы поговорить про хеши — но он будет разобран в следующий раз.\u003c/p\u003e\u003cp\u003eИтак, задачи этой недели:\u003c/p\u003e\u003cp\u003eУпражнения: \u003c/p\u003e \u003cpre\u003e\u003ccode\u003e1) http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1517\n2) http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1590\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eГробы:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e1) http://codeforces.com/contest/343/problem/D\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eНа лекции я обещал другой гроб, но с тех пор он изменился. Понятие “гроб” обесценивается до предела! Гроб этой недели является небольшим упражнением на темы “Дерево отрезков” и “Эйлеров обход графа”. \u003c/p\u003e\u003cp\u003eЯ сознательно даю вам очень мало и очень простые упражнения и гроб в этот раз, чтобы вы все-таки успели закрыть хвосты с прошлых недель. Раз те задачи были заданы, то они должны быть сданы большинством. Я призываю всех еще активнее включится в работу, ибо вы достаточно тормозите мой план на этот учебный год. Серьезно! Было задано 14 задач, у первого места решено только 4! Ну куда это годно! Если бы вы хотя бы задавали вопросы — мне было бы проще понять, что вы не понимаете. А так — вы не задаете вопросы, но и не сдаете задачи. Как я по-вашему должен понимать такое? \u003c/p\u003e\u003cp\u003eВ общем, к следующей неделе или готовьте вопросы по тому, что непонятно, или сдавайте много задач.\u003c/p\u003e\u003cp\u003eУдачно всем порешать воскресный отбор на ВКОШП, а также домашние задачки!\u003c/p\u003e\u003cp\u003eСокол Константин.\u003c/p\u003e\u003c/div\u003e","tags":["лицей бгу","упражнения"]}}