{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1472541163,"rating":6,"authorHandle":"So_Cold","modificationTimeSeconds":1472650325,"id":46846,"title":"\u003cp\u003eTRAKA — TRAKA SPOJ \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"http://www.spoj.com/problems/TRAKA/\"\u003ehere\u003c/a\u003e is the problem\u003cbr /\u003e it\u0027s really an interesting problem but just a few people have solved it \u003cbr /\u003e I came up with o(n^2 * log2(n)) solution (using dp and segment tree)\u003cbr /\u003e it could pass only 40% of test cases \u003cbr /\u003e someone told me it could be solved using convex hull trick \u003cbr /\u003e so please explain your solution \u003cbr /\u003e thanks in advance \u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003ethe problem\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003ethere are N workers in Mirko\u0027s factory. They are manufacturing cars on a conveyor belt, in a pipeline fashion.\u003c/p\u003e\u003cp\u003eWorkers are denoted by numbers 1 – leftmost, to N — rightmost. Each of the workers does his specific job and requires certain amount of time to complete it.\u003c/p\u003e\u003cp\u003eProduction of a single car starts with worker #1 (Mirko). After he had finished with his part of the job, worker #2 takes over, after him #3... When worker #N finishes with his part, the car is finished.\u003c/p\u003e\u003cp\u003eMirko and his workers have to produce M cars and they must produce them in order 1 to M.\u003c/p\u003e\u003cp\u003eFor every worker i we know T[i] — time required for him to do his part of the job.\u003c/p\u003e\u003cp\u003eFor every car j we know factor of assembly complexity F[j].\u003c/p\u003e\u003cp\u003eTime in minutes for worker i to finish his part of he job on the car j is computed as a product T[i]*F[j].\u003c/p\u003e\u003cp\u003eAfter some worker has finished working on a car, he has to give it to the next worker instantly, without any delay (weird company policy).\u003c/p\u003e\u003cp\u003eFor that reason, the worker receiving the car has to be free (he must not be working on some other car). In order to fulfill this condition, Mirko has to choose a good timing to start building a new car. To be efficient, he’ll wait minimum number of minutes until he is certain that all of the conditions described are met.\u003c/p\u003e\u003cp\u003eWrite a program which will, given worker times and factors of complexity for each car, compute total time required for producing all of the cars.\u003c/p\u003e\u003cp\u003eN,M \u0026lt;\u003d 100,000 T[i],F[i]\u0026lt;\u003d 10,000 \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e","tags":["convexhull","help"]}}