{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1494070648,"rating":-25,"authorHandle":"adipt","modificationTimeSeconds":1494070648,"id":51869,"title":"\u003cp\u003eDistributed Code Jam practice mode + small rules change — Google Code Jam 2017\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eJust trying to earn some contribution :P\u003c/p\u003e\u003cp\u003eTo all those who qualified for Round 2 of Code Jam 2017 and Distributed Code Jam Round 1, congratulations.\u003c/p\u003e\u003cp\u003eAlthough all of you must have recieved an email with the following contents, this post is just a reminder in case you didn\u0027t read it.\u003c/p\u003e\u003cp\u003eRound 2 will take place on Saturday, May 13, and it will run for 2 hours and 30 minutes. The top 500 contestants in Round 2 will advance to Round 3; the top 1000 will win a t-shirt. Distributed Round 1 will take place on Sunday, May 14, and it will run for 3 hours. The top 500 contestants in Distributed Round 1 will advance to Distributed Round 2; anyone in those 500 who did not win a t-shirt in Round 2 will win a t-shirt. Be sure to review the \u003ca href\u003d\"https://code.google.com/codejam/schedule\"\u003econtest schedule\u003c/a\u003e to see when each round starts in your time zone.\u003c/p\u003e\u003cp\u003eYou can familiarize yourself with the Distributed Code Jam format via the \u003ca href\u003d\"https://code.google.com/codejam/resources/quickstart-guide#dcj\"\u003eguide\u003c/a\u003e and the \u003ca href\u003d\"https://code.google.com/codejam/resources/faq#dcj\"\u003eFAQ\u003c/a\u003e. Also, a \u0026quot;Distributed Code Jam Practice A\u0026quot; round, featuring almost all of the 2015 and 2016 DCJ problems, is now available and will run until 4 PM UTC on Friday, May 12. This \u0026quot;round\u0026quot; is an optional practice opportunity; it will not be posted on the Past Problems page, and the full scoreboard will not be available even to participants. You can access the round via \u003ca href\u003d\"https://codejam.withgoogle.com/codejam/contest/4334486/dashboard\"\u003ethis link\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eIn this and other practice rounds (but NOT the actual competitive rounds), you will be able to see your Large results (in addition to the Small results) during the contest by using the My Submissions link on the dashboard. \u003cstrong\u003eNote that in the 2017 contest, including the practice rounds, there is a \u003cem\u003e10 minute cooldown period on Large resubmissions\u003c/em\u003e.\u003c/strong\u003e You will not be able to see the full scoreboard for this or any other practice round; the link will exist as usual for a Code Jam round, but it will not work. Feel free to use the \u0026quot;Ask a Question\u0026quot; link on the dashboard, but response time may be slow and there may be no response over the weekend. See the FAQ for more details.\u003c/p\u003e\u003c/div\u003e","tags":["dcj"]}}