{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1528484310,"rating":-1,"authorHandle":"AlexArdelean","modificationTimeSeconds":1528545667,"id":59907,"title":"\u003cp\u003eHelp with Div. 2 477- D\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello ! I am having trouble with Codeforces round #477 Div. 2 D — Resource distribution.\u003c/p\u003e\u003cp\u003eI cannot find any special test case in which this type of thinking is wrong : \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eExplanation of the code\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFirst we can binary search the minimum k1 such that the value of the smallest element \u0026gt;\u003d x1 / k1, after that we can just sort the vector and remember the initial positions of the elements that so we can just verify that the (k1 + 1)-th element \u0026gt;\u003d x2 / (n — k1), because n — k1 is the maximum number of elements for the second service that we divide x2 by. If the inequality is correct then we can just output the solution(meaning we output the indices of elements in the vector because we stored them). Do the same by finding the minimum k2. If you find no solution output No\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eExplaining :\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eObservation\u003c/strong\u003e : if the smallest elements of the groups respects the condition of value \u0026gt;\u003d x / k then the rest of the elements will respect it.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFact\u003c/strong\u003e : The smallest element of the vector needs to be in a group also.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eA conclusion of the fact\u003c/strong\u003e : We can just find ki(where i is 1 or 2, we analyze both), then to be sure that we can build the other group we can find the most suitable case to be biggest n — ki.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAnother Conclusion\u003c/strong\u003e : We can binary search ki, and to have the largest numbers, so by the observation we made earlier, we can just grab the smallest elements for this group after which we get the most suitable condition, \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eConplexity\u003c/strong\u003e : Complexity of O(N + log2(N) * 2 + N * log2(N)) \u003d O(NlogN).\u003c/p\u003e\u003cp\u003eBut with this type of thinking i get a WA on test 5 ! I would really thank anybody who helps me ! This is my submission \u003ca href\u003d\"/contest/967/submission/39044055\" title\u003d\"Submission 39044055 by AlexArdelean\"\u003e39044055\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["#477","div. 2","#where wrong"]}}