{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1491999092,"rating":194,"authorHandle":"malcolm","modificationTimeSeconds":1492082723,"id":51549,"title":"\u003cp\u003eHFT Battle 2017\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch3\u003eHello Codeforces!\u003c/h3\u003e\u003cp\u003e\u003ca href\u003d\"http://hftbattle.com\"\u003eHFT Battle 2017\u003c/a\u003e is going on – the trading algorithms competition, in which every participant can try on an HFT researcher’s hat. The goal is to create a stable and profitable HFT algorithm by researching a market microstructure and a behaviour of the financial instrument. In May we will be hosting another 24-hour competition in code optimization and speeding up based on algorithms created during HFT Battle. We hope that Codeforces users will especially like this format :)\u003c/p\u003e\u003cp\u003eDuring the competition we provide you a set of real HFT-instruments for research and strategy analysis and real market data from one of the world’s largest exchanges. Same as last year, trading conditions are simplified compared to the real ones: there are lower fees and \u003ca href\u003d\"https://docs.hftbattle.com/en/HFAQ.html#simulator\"\u003eround-trip\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAlso there are some significant differences from the previous competition:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eYou are able to create your strategies both in C++ or Python.\u003c/li\u003e   \u003cli\u003eWe made it possible to participate in teams. To do this you should create a single account for the entire team and provide the information about one of the participants during the registration process.\u003c/li\u003e   \u003cli\u003eYou can call out any other participant for a duel, where your strategies can see and affect each other’s transactions. Let the battle begin!\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003eHow to start\u003c/h3\u003e\u003cp\u003eTo make the strategy development easier, we have prepared the \u003ca href\u003d\"https://docs.hftbattle.com/en/strategy/base_strategy.html\"\u003esample strategy\u003c/a\u003e and collected few ideas for the algorithm improvement \u003ca href\u003d\"https://docs.hftbattle.com/en/strategy/ideas.html\"\u003eat one place\u003c/a\u003e with the corresponding code examples.\u003c/p\u003e\u003cp\u003eWe suggest you to start with the brief documentation, which will be enough for you to become familiar with the competition system. Also we have developed the offline development package: \u003ca href\u003d\"https://github.com/hftbattle/hftbattle\"\u003ehttps://github.com/hftbattle/hftbattle\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe competition ends on the 30th of April 2017. The final testing will be held after that on a set of 20 new trading sessions.\u003c/p\u003e\u003cp\u003eThis year TOP-20 participants will be awarded with valuable prizes. The best competitors will be invited to an interview at AIM Tech and will have an opportunity to join our team.\u003c/p\u003e\u003cp\u003eWe will be happy to hear your feedback! You may use “Support” button in the web interface or text directly to \u003ca href\u003d\"mailto:help@hftbattle.com\"\u003ehelp@hftbattle.com\u003c/a\u003e. You may also join the active discussion of the contest in our \u003ca href\u003d\"http://t.me/hftbattle\"\u003eTelegram channel\u003c/a\u003e!\u003c/p\u003e\u003cp\u003eIt is not required to have any specific economical knowledge to create your strategy. Basic C++ or Python skills would be enough. We are confident that most of Codeforces participants will be able to reach excellent results!\u003c/p\u003e\u003cp\u003eWe wish you high rating and great results in HFT Battle 2017!\u003c/p\u003e\u003c/div\u003e","tags":["hftbattle","aimtech"]}}