{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1403893520,"rating":82,"authorHandle":"Vani","modificationTimeSeconds":1403897128,"id":12874,"title":"\u003cp\u003e[Attention] Personal training for ACM/ICPC\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone,\u003c/p\u003e\u003cp\u003eI’m one of the contestants in World Final 2014 and won the third place (the champion of Asia) in the competition with my team Obsidian.\u003c/p\u003e\u003cp\u003eIn the coming summer vacation, I want to find some partners who are somehow poor in algorithm competition and would like to train in this vacation. I can help you with some tough problems in online judge or other problems related to ACM/ICPC (such as the strategy during a contest). We can communicate via skype.\u003c/p\u003e\u003cp\u003eThe motivation of the project is that I want to be more proficiency of English communication (I’m Chinese and somehow poor in English), and I’m aware of that I can help others with my advantages (algorithm competition) while practicing oral English.\u003c/p\u003e\u003cp\u003eIf you are interested in this project, please contact with me via E-mail (\u003ca href\u003d\"mailto:echooatmeal@gmail.com\"\u003eechooatmeal@gmail.com\u003c/a\u003e)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPDATE:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eI have to explain that this \u0026quot;training\u0026quot; is not the real training and it is indeed like experience sharing. If you meet some tough problems in online judge, you can ask me for help (If I can solve this problem). Besides, I will shared my strategy and experience in competition.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eI want to become a friend with you rather than a teacher.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eI have received lots of mails and I\u0027m so sorry that I have no plenty time for everyone who is interested in this project. So the person whose mother tongue is English or send mail earlier takes precedence. But you can also communicate with me via Codeforces talk or e-mail, and I will help you as possible as I can.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eI\u0027m sorry that I can not reply everyone who sent e-mail to me due to the gigantic number of mails I have received. I will notice you if I considered you as a participator.\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":["training","world finals 2014","communication"]}}