{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1438625912,"rating":291,"authorHandle":"DarthPrince","modificationTimeSeconds":1439830371,"id":19571,"title":"\u003cp\u003eThe 1st Hunger Games\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces.\u003c/p\u003e\u003cp\u003eHunger games is a programming tournament.\u003c/p\u003e\u003cp\u003eFor participating in this tournament, you should join as a participant in \u003ca href\u003d\"//codeforces.com/group/qcIqFPYhVr\"\u003ethis group\u003c/a\u003e until the \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?day\u003d10\u0026amp;month\u003d8\u0026amp;year\u003d2015\u0026amp;hour\u003d19\u0026amp;min\u003d30\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003edeadline\u003c/a\u003e. After the deadline you\u0027ll be able to join only as spectator.\u003c/p\u003e\u003cp\u003eIn some time after the deadline (exact time will be published) tournament starts as a long contest in the group. At first, there will be some problems. Each day, organizers will add a non-negative number of problems to the contest. Also, at the end of each day, a non-negative number of participants from the bottom of the scoreboard will be deleted from the contest (to practice) and become spectators (not able to submit any more). Also, people that don\u0027t submit any code in first two-three (exact time will be published) days will become spectators.\u003c/p\u003e\u003cp\u003eFinally, there will be 20 peoples remaining at the end. We\u0027re still deciding about their prizes.\u003c/p\u003e\u003cp\u003eDuration of the tournament is not known yet. It will be published (it may be several weeks!).\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/34/e3/34e327b8ab11b98122e409a3aca271f0ee7e1077.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eProblems of the tournament may be copied (borrowed) from Codeforces or any online judge but we\u0027ll do our best to put \u003cstrong\u003enew problems\u003c/strong\u003e that we wrote ourselves. Also you may find a classic problem. To sum up, \u003cstrong\u003eanything may happen\u003c/strong\u003e in this tournament. Don\u0027t be shocked even if you see some April-fools-day-contest-problem-style problem.\u003c/p\u003e\u003cp\u003eCheating and copying codes is forbidden(even copying your own old code) and you\u0027ll be disqualified from the the tournament if we catch you.\u003c/p\u003e\u003cp\u003eI think this is a good opportunity to practice and compete for all Codeforces members, because there will be hard and easy problems and good for everybody.\u003c/p\u003e\u003cp\u003eAfter the tournament ends, you\u0027ll be able to submit its problems in practice.\u003c/p\u003e\u003cp\u003eCurrently, organizers team consists of AmirMohammad Dehghan(\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/PrinceOfPersia\" title\u003d\"Master PrinceOfPersia\"\u003ePrinceOfPersia\u003c/a\u003e) and Keyvan Khademi(\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/keyvankhademi\" title\u003d\"Master keyvankhademi\"\u003ekeyvankhademi\u003c/a\u003e) but of course some more people will join.\u003c/p\u003e\u003cp\u003eStay tuned, all future news will be published in the \u003ca href\u003d\"//codeforces.com/group/qcIqFPYhVr\"\u003egroup\u003c/a\u003e blogs.\u003c/p\u003e\u003cp\u003eMay the odds be ever in your favor.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e Ali Asadi(\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/AliA\" title\u003d\"Candidate Master AliA\"\u003eAliA\u003c/a\u003e) joined our team.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD1:\u003c/strong\u003e Tournament starts at \u003ca href\u003d\"http://timeanddate.com/worldclock/fixedtime.html?day\u003d12\u0026amp;month\u003d8\u0026amp;year\u003d2015\u0026amp;hour\u003d19\u0026amp;min\u003d30\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003eAugust 12\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2:\u003c/strong\u003e Tournament is starting in about 3 hours. Don\u0027t forget to participate. Initially there will be 5 easy problems; But get ready, cause this shit\u0027s about to get heavy (problems will be added one by one during the tournament).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTeam are not allowed.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eYou can read the news in the \u003ca href\u003d\"//codeforces.com/group/qcIqFPYhVr/blog/entry/888\"\u003eMemorial service\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["hunger-games","1st","tournament","killing"]}}