{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399085488,"rating":-26,"authorHandle":"bask89","modificationTimeSeconds":1399085488,"id":12120,"title":"\u003cp\u003eclub will buy two players to\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003epurposes, Tuoxi Er said: \u0026quot;This summer, the club will buy two players to strengthen the team\u0027s lineup thickness.\u0026quot;In fact, Tuoxi Er not satisfied with this, he said:. \u0026quot;We will not stop there, for the future of Inter Milan, the more ideas we have, we want the club to achieve fiscal balance and self-financing this and more importantly, we want to create a brand with an international reputation, this will be our trademark. all plans are long-term, we hope to help the team to have more cooperation with international partners \u003ca href\u003d\"http://www.shoejordan.fr/air-jordan-1-c-1.html\"\u003eair jordan 1 retro\u003c/a\u003e  to Milan, together with us to build a better future for Inter Milan. \u0026quot;\u0026quot; Let us break this evening! \u0026quot;\u0026quot; Oh wow! \u0026quot;When the coach Hao Wei gave the order, the girls cheered. Originally, the National Olympic Sports Center is preparing for the Asian Cup in China Women\u0027s rare to rest one night recently they often practiced three times a day, to prepare for the intensity is not small.From half past three in the afternoon began, the team had begun to diversify simulated combat training. More than two hours down, the girls were transformed multiple access pass and shooting drills with everyone to make every effort, we are one relic \u0026quot;salvage\u0026quot; together, were wet with sweat. \u0026quot;Recently our training content is mainly to build the team as a whole on the basis of the local seek a breakthrough, so we lifted up on a personal capacity. Wish the team the ability to improve the strength and quality through training, playing in the Asian Cup a little more relaxed. \u0026quot;Chinese women\u0027s football coach Hao Wei told reporters that the team which is mainly of training \u003c/p\u003e\u003cp\u003eto prepare for mid-May in Vietnam\u0027s Asian Cup. \u0026quot;Because the matter of the World Cup Asian Cup qualifying places, we definitely want to fully achieve good results. Currently there are 29 people on the list of this training, the final squad will have 23 people, including three goalkeepers.\u0026quot;Women\u0027s National Team present this injury there is a certain degree, which is preparing for the biggest difficulty facing the Asian Cup. \u0026quot;Now the training of players, there are five people with varying degrees of injuries in the league. Additionally Ma Jun, Wang frost hurt the league in Korea, has been determined not to play the Asian Cup and we Jizhao the Ma Xiaoxu over, but her knee has been a problem, we\u0027re\u003ca href\u003d\"http://www.shoejordan.fr/air-jordan-9-c-10.html\"\u003eair jordan 9 pas cher\u003c/a\u003e  giving her to check if she is unable to guarantee the normal training, may also be absent from the Asian Cup. \u0026quot;Besides playing abroad Wu Haiyan, Lijia Yue 4 people rejoin and training time delays. \u0026quot;Wu Haiyan just come back, Lijia Yue club let them go over there, we played for a long time telephone communication and coordination, she had to go back to rejoin the club to play a game and then come back.\u0026quot; Nevertheless, Hao Wei still expressed teams Asian Cup strive confidence good results. \u0026quot;Judging from the packet, the Chinese team in the group has an advantage, although the last two years did not, and Thailand, Mian Diandui played against, but the Chinese team\u0027s ability to be on top of them. South Korea is also to fear, nearly two second Four Nations Cup we won, including East Asian rivals, but we can not say the opponents to win at least some psychological advantage. \u0026quot;Yesterday, peer contact to the 2014 National League Xi\u0027an station 10 km road race men\u0027s 10 km champion Guo Xianglong professional group. For Keith Cheung was beaten issue, \u003c/p\u003e\u003cp\u003eGuoxiang Long said she will not comment, but he believes there is a running race in physical conflict is normal, but fights are rare.郭祥龙 born in 1990, is now studying at Peking University, registered in Inner Mongolia team. He told reporters: \u0026quot;Because of frequent and Keith Cheung went to attend the game, so we were also Jiaoshu, his strength is stronger than me, before I win lose less, but also beat him I did not know that two people running race in. starting phase and tactical reasons, physical contact between players is normal, but the last I heard that fight, such a thing is rare in long-distance running. \u0026quot;School saysNo conspiracy behind the incidentApril 27, came from Maryland to attend the \u003ca href\u003d\"http://www.shoejordan.fr/nike-lebron-10-c-23.html\"\u003enike lebron 10 chaussure\u003c/a\u003e  2014 National League Xi\u0027an station 10 km road race competitions Keith Cheung, the way the game was twice beaten by others; 28, Lee (20 years old, from Shandong) and hit Mr Lee students participating (17 years old, from Hebei), their schools public apology (newspaper on the 28th, the 29th consecutive reports).Yesterday morning, Lee resides sports school vice principal subsidiary Xi\u0027an institute Wang Lijun Li Zhaolin and coaches traveled to Maryland, on behalf of the school\u0027s students and two hit Keith Cheung was beaten to apologize and condolences. \u0026quot;Talk pretty good, and I treasure the coach had previously been a strong athlete, but also very familiar with each other, so communication was very good.\u0026quot; 11:30 last night, has returned to Xian Li Zhao Lin said.It is understood that the 10 km road race National League Xi\u0027an station 10 km professional group of men, all from the third to the eighth Xi\u0027an institute students. For speculation whether there is a conspiracy behind the argument, Li Zhao Lin said, \u0026quot;absolutely no.\u0026quot; \u0026quot;This game, we had 26 \u003c/p\u003e\u003c/div\u003e","tags":[]}}