{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1485183684,"rating":113,"authorHandle":"csacademy","modificationTimeSeconds":1485184808,"id":49966,"title":"\u003cp\u003ePlatform Changes\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces!\u003c/p\u003e\u003cp\u003eIt\u0027s been a while since our last blog post. We\u0027ve been working hard on several features that we are happy to share with you.\u003c/p\u003e\u003ch4\u003eGmail spam\u003c/h4\u003e\u003cp\u003eFirst of all, we suspect some of our users using gmail didn\u0027t get our last emails, as they were considered spam. If you wish to further receive emails from us please check your spam folder and move the emails to inbox.\u003c/p\u003e\u003ch4\u003eEnforced templates\u003c/h4\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/c9/55/c955df1d45735923ff5492f70b86c4437d5ec63f.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eAll the interview problems, except for those that were used in CSA rounds, now support enforced templates in C++, Java, Python and Javascript. Basically, the template takes care of reading the input, calling the function you need to implement and printing the result. You can concentrate on solving the problem, not having to worry about all the messy details.\u003c/p\u003e\u003ch4\u003eInterviews\u003c/h4\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/dd/33/dd3379d000a2548fca3f522ba9a6b7779dc49321.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThis new section allows you to take an interview on demand. You can choose the difficulty and duration. The tasks are selected from those you didn\u0027t solve yet in the interview archive. You can access the interview section \u003ca href\u003d\"https://csacademy.com/interview/\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003ch4\u003eHourly contests\u003c/h4\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/d0/e1/d0e1f8544be15195c3bf2e258370b5a197ffaebc.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eEvery half-hour, a contest starts on CS Academy: every full hour highlights an algorithms-style contest and every hour-and-a-half an interview-style contest. This feature was introduced to reach a a few different points:\u003c/p\u003e \u003cul\u003e   \u003cli\u003egive users an incentive to stay on the website for a longer period of time\u003c/li\u003e   \u003cli\u003ebring old but great problems back into attention\u003c/li\u003e   \u003cli\u003eadd a bit of competitiveness outside our regular rounds\u003c/li\u003e   \u003cli\u003emost of all, make the problem-solving experience a bit more fun\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe problems are chosen from the archives, in a way that tries to ensure none of the participants had previously solved them.\u003c/p\u003e\u003ch4\u003eRating changes\u003c/h4\u003e\u003cp\u003eAs some of you noticed, we had a bug in the rating algorithm. We fixed it and recalculated all the ratings. We decided to change the cutoffs for red at 1700 and for yellow at 1600.\u003c/p\u003e\u003cp\u003eDon\u0027t forget to like us on \u003ca href\u003d\"https://www.facebook.com/csacademy\"\u003eFacebook\u003c/a\u003e, \u003ca href\u003d\"https://vk.com/realcsacademy\"\u003eVK\u003c/a\u003e and follow us on \u003ca href\u003d\"https://twitter.com/realCSAcademy\"\u003eTwitter\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":[]}}