{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1465648999,"rating":221,"authorHandle":"Gassa","modificationTimeSeconds":1466332230,"id":45366,"title":"\u003cp\u003eCodeforces Marathon Round 1\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi all!\u003c/p\u003e\u003cp\u003eI invite you to take part in Codeforces Marathon Round 1. It is an unrated contest in which the participants will have to solve one problem as best as they can. The problem is presumed not to have a fast full solution. A score is given for each individual test according to the quality of the answer found. The goal is to get the highest total score. The contest will go on for 10 days. The start time is \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dCodeforces+Marathon+Round+1\u0026amp;iso\u003d20160612T12\u0026amp;p1\u003d3905\"\u003eJune 12 at 12:00 MSK\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eDuring the main phase of the contest, solutions will be checked on examples and preliminary tests. After the main phase is over, the final solution of each contestant will be checked on the final test set, and the total score for this test set will determine the final scoreboard. The 10 top scoring participants, as well as 10 random participants who achieve a good enough score, will get T-shirts. The contest is supported by Codeforces and the Community Of Master Programming at St. Petersburg State University.\u003c/p\u003e\u003cp\u003eThis round is experimental: if something breaks, don\u0027t be upset, just write about it, and we will try to fix it.\u003c/p\u003e\u003cp\u003eSee you in the contest!\u003c/p\u003e\u003ch5\u003e\u003cstrong\u003eUpdate 1\u003c/strong\u003e (12.06.2016)\u003c/h5\u003e\u003cp\u003eYou can take part in the contest as a team of two people! Both participants must not be registered as individual participants. If you are already registered but did not take any action in the contest, registration can be canceled at the \u003ca href\u003d\"/contestRegistrants/684/friends/true\"\u003erespective page\u003c/a\u003e. Note: as the contest was initially planned for personal participation, if a team wins a T-shirt, it will get only one T-shirt.\u003c/p\u003e\u003ch5\u003e\u003cstrong\u003eUpdate 2\u003c/strong\u003e (19.06.2016)\u003c/h5\u003e\u003cp\u003eThere are a bit less than three days left till the end of the contest. Clarification: the 10 random T-shirts will be distributed among those who are not in the top 10, but get at least half of the possible score on the final tests (for 1000 tests, the boundary score is 500500).\u003c/p\u003e\u003cp\u003eTo the best of my knowledge, Felix did not yet get to the very end of the exam in any of the preliminary tests. Who will help the robot? If you did not yet try, it is easy to start: in the development pack available \u003ca href\u003d\"https://github.com/GassaFM/online-exam/\"\u003eon Github\u003c/a\u003e, there are example solutions in seven programming languages, and also tools to run a solution locally with the interactor.\u003c/p\u003e\u003c/div\u003e","tags":["marathon"]}}