{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1520704142,"rating":172,"authorHandle":"Minilek","modificationTimeSeconds":1520705322,"id":58287,"title":"\u003cp\u003eTeach Algorithms to high schoolers in Ethiopia?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi all,\u003c/p\u003e\u003cp\u003eI personally \u0026quot;grew up\u0026quot; in the programming contest community, especially before Codeforces began when TopCoder and UVA were two of the biggest sites. I\u0027m now a \u003ca href\u003d\"http://people.seas.harvard.edu/~minilek/\"\u003ecomputer science professor\u003c/a\u003e with a research focus on algorithms, which I don\u0027t think would have been true if it weren\u0027t for sites like this one. After my own experiences in my youth, I decided in my free time to provide such an experience for some young folks.\u003c/p\u003e\u003cp\u003eI co-organize a free intensive 4-week summer program in Addis Ababa, Ethiopia introducing high schoolers to programming and algorithms (AddisCoder: addiscoder.com). Over 150 students have completed previous iterations of the program. The students are very good. Alumni have gone on to study at Harvard, MIT, Princeton, Columbia, Brown, and many other institutions in the U.S., Ethiopia, Germany, and U.A.E. They have also gone on to work both as interns and full-time software engineers at Facebook, Google, Microsoft, Oracle, etc. A few alumni from the first offering of the course are now pursuing their PhDs in computer science or mathematics. (See the program website for program details and blurbs on some alumni).\u003c/p\u003e\u003cp\u003eAddisCoder will be offered again in 2018 with over 240 high school students and some college students (previous iterations each had less than 85 participants). Students are hand-picked by the Ministry of Education to be the top in the country, chosen from every region (Ethiopia has \u0026gt; 100 million people).\u003c/p\u003e\u003cp\u003eWe are looking for teaching assistants! We have funding to cover full expenses (flight, lodging, etc.) for some number of TAs.\u003c/p\u003e\u003cp\u003eIf you\u0027re interested, check out \u003ca href\u003d\"http://www.addiscoder.com/#apply\"\u003ehttp://www.addiscoder.com/#apply\u003c/a\u003e, or e-mail me at \u003ca href\u003d\"mailto:minilek@seas.harvard.edu\"\u003eminilek@seas.harvard.edu\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eI love the online programming contest community, and I think it would be great to do some outreach that gets citizens from even more countries involved. (All while getting a free trip to see another country. :))\u003c/p\u003e\u003cp\u003e-Jelani Nelson (\u0026quot;Minilek\u0026quot;)\u003c/p\u003e\u003c/div\u003e","tags":[]}}