{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1464472751,"rating":625,"authorHandle":"Bredor","modificationTimeSeconds":1464806046,"id":45106,"title":"\u003cp\u003eUnbelieveable story of success at ACM ICPC final\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003ePreparing to contest\u003c/h1\u003e\u003cp\u003eFor long time I haven\u0027t been writing stories about my life. As Nietzsche said — Bredor died, and I don\u0027t feel so good myself. You might be thinking that I went into booze.\u003c/p\u003e\u003cp\u003eActually, I have really been drinking so much all this time, but I had more important activities: once upon a time I came to my college to find a company to drink. There I saw an advertisment about programming competitions, but I found that competitive programming is sense less in school and it didn\u0027t attract my attention. Soon, I was summoned to the dean, and the dean told me: \u0026quot;mr. Rudolph Gotov, there is noone except you who can win this contest!\u0026quot;. I refused him at first time certainly, but then he offered me hard choices such as to continue winning all contests or to stop to arrange night parties at college campus. The choice was not great, and I went looking for a team. Because of stupid rules I could not invite my friends from Bratsk into the team, so I had to search teammates among my classmates. The first one who I picked to the team knew only the Dota site in the Internet, and the another one had a deal only with Pornhub, but I guessed we would be a great team, because I was in the team. My commitment, perseverance and skill played the significant role in our success, and we went to the finals of the international competition ACM-ICPC (wtf what this letters mean).\u003c/p\u003e\u003ch1\u003eTrip\u003c/h1\u003e\u003cp\u003eIt was a short prelude, and now I would describe how we had fun in Phuket mor detaily, (in reason to green users to envy). It took me a short to get prepared for a flight, I just put some bottles of Jaguar and warm socks into the bag, and then I was ready to go.\u003c/p\u003e\u003cp\u003eFlight to Thailand took very long time (more than 10 hours), but it was really funny for me: I was picking up flight attendant during all flight, and when she offered me tea, I was joking, that I don\u0027t want to drink tea and I prefer 1.5% milk, which I took on board against the rules)). As for the flight I have done a whole pack om milk)) My teammates did not understand the joke, but I think they are not capable of humor, and only know how to solve problems.\u003c/p\u003e\u003ch1\u003eOrganization\u003c/h1\u003e\u003cp\u003eAs usual, I wasn\u0027t satisfacted with organization. Organizators said, that we have to find some food by ourselves. It wasn\u0027t a problem for me — due to my attractness I quickly picked up some thai-girl, which fed me, like a king, but my teammates left hungry (well, they are nerds, that is excusable). By the way, this was the first time I have even regreted for a little about my natural masculine appeal, because if usually it just means that I have success among girls, in Thailand I almost got in a trap (but, well, let\u0027s not talk about bad).\u003c/p\u003e\u003cp\u003eThe next day we just hung out at the hotel, nothing interesting, except all luxury and glamor, to which I was so used. We were swimming at the sea and were catching crabs on the beach. At night, we moved to the sea with my teammate and were building sand Castle (my teammate have never been on the sea, he always prefered to spend his time on codeforces). After some time a night guard found us and asked what we are doing. I answered \u0026quot;We are from Poland\u0026quot;, he nodded with some understanding and left us alone. After that my teammate found that wave has washed off his glasses which he left on the sand and he was crawling and looking for them))) Also, he said that solving problems is much more interesting than building foolish castles. It happens sometimes to got much more knowledge about person in just an hour than in a year of common training.\u003c/p\u003e\u003cp\u003eThere were a performance in the circus, and all photocameras were collected before the performance, even \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e had to give up . I began to argue and wrangle with this people, and occasionally have deleted all photos with asian girls, so I won\u0027t be able to demonstrate them(( And even accidentally have beated an eye of some nerd (I tried the local vodka, where there is a snake at the bottom, which can bite, if it you are drinking it wrong)) ) the hematoma has grown and he even went on awarding with it, such a bad luck:(\u003c/p\u003e\u003ch1\u003eContest\u003c/h1\u003e\u003cp\u003eUnfortunately, hardly accustomed to the good life, we had to get up at 6 am and go to contest. There where some strang guy who said that we put badges in wrong way, and we told him that his behaviour is not very manly, but he did not understand us, cause we were speaking in Russian.\u003c/p\u003e\u003cp\u003eProblems were quite basic and standard (even one Polish team solved 10 problems), we have accepted first 8 tasks soon, and then it went little harder. As it usually happens in such cases, I took all in my hands and have carried out the team. I entrusted to companions only to code three very simple problems (and to test my code on samples), in reason to them not miss. My noble worth us additional penalty, but medals were awarded, and it is fine.\u003c/p\u003e\u003ch1\u003eAwarding Ceremony \u0026amp; Afterparty\u003c/h1\u003e\u003cp\u003eAt the ceremony, when our tasks ligthed green on the big screen, we shouted, \u0026quot;Where you up to our smartness, motherfu...ers)))\u0026quot; but we were applauded so loud that no one heard.\u003c/p\u003e\u003cp\u003eAfter awarding the organizers arranged a fabulous party, and I, as a triumphator, decided to visit it. But instead of loads of alcohol and busty thai\u0027girls, who I expected to see, I found out a dubious party with the guys such as \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Um_nik\" title\u003d\"Legendary grandmaster Um_nik\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eU\u003c/span\u003em_nik\u003c/a\u003e and \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/-XraY-\" title\u003d\"Legendary grandmaster -XraY-\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003e-\u003c/span\u003eXraY-\u003c/a\u003e. I could not stand there for a long time and decided to went to the hotel to have a rest: I still hadn\u0027t reached a bottom of my bag with Jaguar.\u003c/p\u003e\u003cp\u003eIn short, we performed great)) Now I\u0027m going to visit my friend \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/MAXIMAN\" title\u003d\"Expert MAXIMAN\"\u003eMAXIMAN\u003c/a\u003e in Crimea)) He is an athlete but I think it\u0027s quite possible to force him to drink yazhka))\u003c/p\u003e\u003ch1\u003ePhotos\u003c/h1\u003e\u003cp\u003eWell, here some photos, you can envy me\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/2f/c5/2fc5b7dd8b551cf5c33ec82bc90200a47521b254.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e it\u0027s me against the background of some garbage from Phuket inscription\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/b7/6c/b76c4979549a0ebcd16d1c8212309450462d5ebe.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e I went to the sea, water is great))))\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/6d/c3/6dc3c766e0b74a62cd9279300fd9207d6ce6b09e.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e I\u0027m demonstraing my skills to local girls.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/67/ee/67eec072bfdabf02c340de9c0a73b54a8e5898c1.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  I come up with a new quote for Business Quotations (my public on vk.com).\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/1f/94/1f945b80c1a492b5d9b182d679a98f8cf54f9bc4.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  the country is changing, traditions remain\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/4b/7d/4b7d12c80ef627d7b32776b9ed31ce43068463f2.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  advertising contest\u003c/p\u003e\u003cp\u003eWho else participated in the final? Share your impressions!\u003c/p\u003e\u003c/div\u003e","tags":["#acmicpc","acm","daddy","carry","bredor","is","king","gg","wp","easy","izi"]}}