{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1420917455,"rating":57,"authorHandle":"anup.kalbalia","modificationTimeSeconds":1420917470,"id":15705,"title":"\u003cp\u003eCode, Compile and Run — An integrated development environment for the web on CodeChef\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI invite you all to use the newly launched \u003ca href\u003d\"http://codechef.com/ide\"\u003eweb IDE\u003c/a\u003e on CodeChef. It has some cool features:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eAn advanced code editor along with syntax highlighting. Love ‘vi’ or ‘emacs’? You will love this as well.\u003c/li\u003e   \u003cli\u003eAutocompletion of code (It isn’t great for the new programmers out there, so for them an option to disable it in settings menu is present.)\u003c/li\u003e   \u003cli\u003eExecution for all the languages available on CodeChef (50+)\u003c/li\u003e   \u003cli\u003eMore than 30 themes to choose from.\u003c/li\u003e   \u003cli\u003eDrag and drop a file and start editing. And download your code back in a file once you are done.\u003c/li\u003e   \u003cli\u003eFeel distracted with so many things on the browser? The full screen feature for you.\u003c/li\u003e   \u003cli\u003eLove saving your code templates? Do not need to carry it anywhere. Do it on the ide and that too a different one for each language.\u003c/li\u003e   \u003cli\u003eWell, last but not the least. Love keyboard shortcuts ? We have an surprise for you in settings menu.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eApart from these, one of the most important issue that we hope this will solve is the unintended cases of plagiarism. Yes this was the primary motivation for introducing this.\u003c/p\u003e\u003cp\u003eIt has been long, that after each contest many of our users get blocked and their ratings get reduced due to the cheating cases. Most of the time, we have realised that the problem was of the code being left “Public”! So here is a big relief for all those – once you submit your code, it is destroyed as soon as you get your execution result! Yes we do not save your code anywhere. In case you want to save your code, just use the download button to have a copy in your desktop.\u003c/p\u003e\u003cp\u003eThe way you may use it is:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eYou need to be logged in to CodeChef to use it.\u003c/li\u003e   \u003cli\u003eSelect a language of your choice from the drop down.\u003c/li\u003e   \u003cli\u003eSelect your favourite Editor’s (default, vim, emacs) key bindings.\u003c/li\u003e   \u003cli\u003eStart writing your code in the template provided.\u003c/li\u003e   \u003cli\u003eSwitch between the full screen mode to cut off the distraction.\u003c/li\u003e   \u003cli\u003eYou may use the auto code completion feature or switch it off using the setting.\u003c/li\u003e   \u003cli\u003eOnce you are done writing your code, you may download a copy.\u003c/li\u003e   \u003cli\u003eClick on the “Custom Input” check box to add your own input test data.\u003c/li\u003e   \u003cli\u003eClick on Run.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eUse it, play around and do not forget to leave your feedback! We have fixed the bugs reported so far but there may be a few more, we will like to know if you face any. \u003c/p\u003e\u003c/div\u003e","tags":["codechef","ide","online compiler"]}}