{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1419423445,"rating":260,"authorHandle":"Avalanche","modificationTimeSeconds":1421779646,"id":15345,"title":"\u003cp\u003ePolygon Updates (Fall-Winter 2014)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"https://polygon.codeforces.com/\"\u003e\u003cimg src\u003d\"/predownloaded/ef/54/ef547e91b2affc98e8d5018c3e39257a2a31e8e3.png\" style\u003d\"float: left;margin: 1.0em 2.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eHi Codeforces!\u003c/p\u003e\u003cp\u003eMy name is Maxim Gusarov and I joined the Codeforces developer team in September and am recently working with Vitaly \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/kuviman\" title\u003d\"Grandmaster kuviman\"\u003ekuviman\u003c/a\u003e Kudasov on improving the \u003ca href\u003d\"https://polygon.codeforces.com/\"\u003ePolygon\u003c/a\u003e system.\u003c/p\u003e\u003cp\u003eToday I would like to introduce you to the new potential of the system where all problems for the Codeforces rounds and many other programming contests are prepared.\u003c/p\u003e\u003ch4\u003eUpdate 1\u003c/h4\u003e\u003cp\u003eAs a user logs into the system, she can now use either the login or the email given at the registration. You can also attach the session to the IP address to enhance security.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/login-by-email-and-attach-to-ip.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eUpdate 2\u003c/h4\u003e\u003cp\u003eAny user who has the access to edit a problem can become its supervisor. The supervisor will always get email notifications about the changes committed to the problem even if they were committed as “Minor changes”. What you need to do is to open the problem, go to the “Manage Access” tab and set “Supervisor” after your name.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/supervisor2.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eThis option can be used for the problem author or the contest coordinator not to miss a single change.  \u003c/p\u003e\u003ch4\u003eUpdate 3\u003c/h4\u003e\u003cp\u003eYou can now create problems from the contest page.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/create-problem-from-contest-1.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eAs you create a problem you can issue all the required access to each contest developer. The newly created problem will automatically be included into the contest in which it was created.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/create-problem-from-contest-3.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eUpdate 4\u003c/h4\u003e\u003cp\u003eYou can now bookmark problems on the contest page. That is useful, for example, to mark complete problems or the problems that need some more editing. \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/favourite-contest-problems.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eUpdate 5\u003c/h4\u003e\u003cp\u003eThe main \u003ca href\u003d\"https://polygon.codeforces.com/\"\u003ePolygon\u003c/a\u003e page now has a link to the public \u003ca href\u003d\"https://github.com/Codeforces/polygon-issue-tracking/issues\"\u003egithub issue tracker\u003c/a\u003e. There you can send your feedback and suggestions.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/issue-tracker.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eUpdate 6\u003c/h4\u003e\u003cp\u003eFor convenient work with large tables we’ve added a subtle highlight of the row on which the cursor is pointing.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/row-highlight.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eUpdate 7\u003c/h4\u003e\u003cp\u003eAs you add new developers to a contest, you can now issue the chosen access to the contest problems if you have access to edit them yourself. Please note that the given operation rewrites the existing access of the added users to these problems (except the access of the problem owner).\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/access-for-added-users.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eSimilarly, as you remove a contest developer, you can now remove his access to the problems to which the current user has editing access. Naturally, this operation doesn’t affect the access of the problem owner.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/remove-problem-accesses-eng.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eUpdate 8\u003c/h4\u003e\u003cp\u003eFor more illustrating potential, we have redesigned the “Invocation” page. Each test is followed by the time that the solution spent in milliseconds and the memory used in megabytes. The last row of the table contains the maximum consumed time and memory for each solution. For each solution, color marks the tests with the worst solution performance, also the tests with the OK verdict that do not fit into the time limit divided by two and the tests with the TL verdict that fit into the time limit multiplied by two.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/invocation2.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eUpdate 9\u003c/h4\u003e\u003cp\u003eNow you can manage access to the contest problems in one go if you have an access to edit them yourself.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/group-access-change.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eUpdate 10\u003c/h4\u003e\u003cp\u003eNow the page with the problem list contains short info about the problems’ status, for example, whether the problem has or doesn’t have the checker or the interactor, whether the problem is interactive or not. Please note that this information is updated only as you commit the problem.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/problem-info2.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eUpdate 11\u003c/h4\u003e\u003cp\u003eThe “Advanced Setup” page now has an option of cloning a problem. You can clone any revision of the problem you need together with the editing history if you switch on it beforehand.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/clone-problem.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eUpdate 12\u003c/h4\u003e\u003cp\u003eYou can now preview the contest statements in HTML from the working copies and packages.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/view-as-html.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eUpdate 13\u003c/h4\u003e\u003cp\u003eTo lessen the chance of making a mistake, the “Commit Page” page now contains warnings about the current state of the problem. Now you will never forget to add the validator and tests for it.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/cautions2.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eUpdate 14\u003c/h4\u003e\u003cp\u003eAt last, the final update is about statement tests. To hide the particularities of the author’s solution from the contest participants, the author can create samples using the \u0026quot;Output in statements\u0026quot; field. Now as you create the package, the correctness of the output you printed is checked. You can turn the check off by switching the “Verify output for statements” option. \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/polygon-post/io-for-statements2.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003ch4\u003eConclusion\u003c/h4\u003e\u003cp\u003eI hope that the given innovations will make life easier for problem authors and decrease the probability of errors.\u003c/p\u003e\u003cp\u003eP.S. You can send your feedback and suggestions to me via personal messages or to \u003ca href\u003d\"https://github.com/Codeforces/polygon-issue-tracking/issues\"\u003ePolygon issue tracker\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["polygon","codeforces","testlib","problems"]}}