{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1464738949,"rating":233,"authorHandle":"Yousef_Salama","modificationTimeSeconds":1464738949,"id":45159,"title":"\u003cp\u003eTime to revive the Arab and Africa Region\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces Community,\u003c/p\u003e\u003cp\u003eI\u0027m Yousef Salama, a 17 year-old 1st year college student, one of the only 3 Egyptian silver medalists in the IOI.\u003c/p\u003e\u003cp\u003eThis is a call for help. We\u0027ve been suffering in our region from relatively zero progress in our competitive programming international performance for the past decade.\u003c/p\u003e\u003cp\u003eDuring the past 5 years, the Champions of the Super Region of Africa and Middle East in the World Finals of ACM ICPC were:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003e2012: German University in Cairo, with rank 81st on 112 teams. Rank Percentage: 72%\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e2013: Arab Academy for Science and Technology (Alexandria), with rank 72nd on 120 teams. Rank Percentage: 60%\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e2014: Alexandria University, with rank 66th on 122 teams. Rank Percentage: 54%\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e2015: The American University in Cairo, with rank 75th on 128 teams. Rank Percentage: 59%\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e2016: Cairo University — Faculty of Computers and Information, with rank 80th on 128 teams. Rank Percentage: 63%\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThese 5 different universities are from Egypt, 3 of them from Cairo, and 2 are from Alexandria. And yes, the funny fact is that we fight with each other but at a very low level.\u003c/p\u003e\u003cp\u003eOur community in Egypt is very large, exceeds 1 thousand problem solvers and contestants in ACM ICPC and IOI. What we are looking forward to, is to have a new peak, to get a medal in an ACM ICPC World Finals or at least start competing in the top 50% of the scoreboard.\u003c/p\u003e\u003cp\u003eWe don\u0027t have coaches who reached any further higher ranks. We don\u0027t have enough advanced knowledge, math or problem solving skills. We don\u0027t have good experience in training at advanced levels. However, we have lots of great minds that just need to be invested in the right way, with the help of the right person/coach.\u003c/p\u003e\u003cp\u003eAccording to our experience, we can say that our weaknesses are mainly because of our corrupted education. We\u0027re not raised to be great in math, or great in thinking or learning skills. The luckiest of us are those who notice that retardation in our education system and try to acquire what they lacked, either through the help of other seniors who help in coaching them or individually though self-efforts but usually at a very late age.\u003c/p\u003e\u003cp\u003eWe\u0027d be very glad if you could recommend an international coach for us, or if you can help and contribute to coach us in an onsite camp for the few best and promising ACM ICPC contestants in Alexandria, Egypt.\u003c/p\u003e\u003cp\u003eMany thanks for your appreciated help in advance!\u003c/p\u003e\u003c/div\u003e","tags":[]}}