{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1409241628,"rating":1,"authorHandle":"mochow","modificationTimeSeconds":1409252719,"id":13604,"title":"\u003cp\u003eHelp for LightOJ 1201\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI was trying to solve this problem \u003ca href\u003d\"http://lightoj.com/volume_showproblem.php?problem\u003d1201\"\u003ehttp://lightoj.com/volume_showproblem.php?problem\u003d1201\u003c/a\u003e on LightOJ. My algo was to split the graph into two sets (vectors A and B) (since the graph is undirected and acyclic and so bipartite). Then I found the maxBPM from A to B and the answer is number of nodes-maxBPM.\u003c/p\u003e\u003cp\u003eHere is my cod: \u003ca href\u003d\"http://paste.ubuntu.com/8170061/\"\u003ehttp://paste.ubuntu.com/8170061/\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWhat is my mistake actually?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eProblem Description:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026quot;Yes, I am the murderer. No doubt\u0026quot; I had to confess it in front of all. But wait, why I am confessing? Nobody wants to go to jail, neither do I. As you have suspected there is something fishy. So, let me explain a bit.\u003c/p\u003e\u003cp\u003eThe murder was happened in 19th June, at 11:30 pm this year (2009) according to the medical report. So, I was asking the judge \u0026quot;Can you find the time 19th June 11:30 pm in Bangladesh?\u0026quot; The judge informed other reporters to find the time. But alas! There was no time — \u0026quot;2009, 19th June, 11:30 pm\u0026quot;. So, the judge got a bit confused about my confession. So, I began to tell them, \u0026quot;The time the murder was happened, is not a valid time according to you. So, how can you claim that I am the murderer?\u0026quot;\u003c/p\u003e\u003cp\u003eAnd what happened next, you all know. I am in the streets again with a clean sheet.\u003c/p\u003e\u003cp\u003eBut now I have planned to kill again. I have a list of N mosquitoes which are to be killed. But there is a small problem. If I kill a mosquito, all of his friends will be informed, so they will be prepared for my attack, thus they will be impossible to kill. But there is a surprising fact. That is if I denote them as a node and their friendship relations as edges, the graph becomes acyclic.\u003c/p\u003e\u003cp\u003eNow I am planning when and how to kill them (how to get rid of the law!) and you have to write a program that will help me to find the maximum number of mosquito I can kill. Don\u0027t worry too much, if anything goes wrong I will not mention your name, trust me!\u003c/p\u003e\u003cp\u003eInput Input starts with an integer T (≤ 50), denoting the number of test cases.\u003c/p\u003e\u003cp\u003eEach case starts with a blank line and two integers N (1 ≤ N ≤ 1000) denoting the number of mosquito I want to kill and M denoting the number of friendship configurations. Each of the next M lines contains two integers a and b denoting that ath and bth mosquitoes are friends. You can assume that (1 ≤ a, b ≤ N, a ≠ b) and each friendship relation is given only once. As I have already mentioned, you will not find any cycle in the relations.\u003c/p\u003e\u003cp\u003eOutput For each case, print the case number and the maximum number of mosquitoes I can kill considering the conditions described above.\u003c/p\u003e\u003cp\u003eSample input output here: \u003ca href\u003d\"http://paste.ubuntu.com/8171545/\"\u003ehttp://paste.ubuntu.com/8171545/\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["lightoj","bipartite","graphs"]}}