{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1428228303,"rating":42,"authorHandle":"IlyaCk","modificationTimeSeconds":1428317392,"id":17288,"title":"\u003cp\u003eЕсть ли готовая прога, следящая, кому носить шарики?\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eНа ACM ICPC есть традиция -- давать за решение задачи шарик. Так что перед staff-ом возникает задача: вовремя узнавать, что куда-то там надо отнести шарик.\u003c/p\u003e\u003cp\u003eКонкретно на нашем 1-ом этапе она усложняется тем, что:\u003c/p\u003e\u003cp\u003e1) команде, которая решила задачу \u003cstrong\u003eпервой\u003c/strong\u003e, шарик гелиевый, а остальным -- воздушный. \u003c/p\u003e\u003cp\u003e2) Команды у нас сидят по разным аудиториям (не_очень хорошо, но спортзал нам никто не_даст и тем более никто не_будет тянуть в него всю проводку). \u003c/p\u003e\u003cp\u003e3) Админы нашей копии ejudge-а хотят привязку команд к логинам \u003cstrong\u003eдо\u003c/strong\u003e жеребьёвки, так что из логина нельзя быстро понять, где геометрически находится команда (надо смотреть табличку).\u003c/p\u003e\u003cp\u003eВ этих условиях, ситуация уже несколько запутанная, и хотелось_бы её автоматизировать в виде некоей tool-зы, которая будет иметь на входе табличку с соответствием логинов названиям команд \u003cstrong\u003eи их геометрическому размещению\u003c/strong\u003e (например, \u0026quot;ауд.126, комп.4\u0026quot;, \u0026quot;ауд.129, комп.1\u0026quot;), регулярно перечитывать табличку с текущими результатами, и писать в хронологическом порядке, какой шарик (с какой буквой задачи и гелиевый или обычный) куда отнести.\u003c/p\u003e\u003cp\u003e1) Есть ли что-то готовое, которое реально патчить под наши условия?\u003c/p\u003e\u003cp\u003e2) Если писАть самому, то как лучше всего вытягивать из ejudge-а данные о фактах успешных решений?\u003c/p\u003e\u003cp\u003e3) Какие тут вообще могут быть неочевидные моменты? Пока что я вижу два: (А) rejudge-и; (Б) носить_ли шарики во_время заморозки? (вроде_ж надо \u003cstrong\u003eне\u003c/strong\u003e_носить?)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e учитывая, что админить буду не_я, предпочтительны варианты, работающие через сеть \u003cstrong\u003eне\u003c/strong\u003e_на компе где собственно ejudge, и знающие максимум логин/пароль, которым представлены права JUDGE_LOGIN и VIEW_STANDINGS, но \u003cstrong\u003eне\u003c/strong\u003e_дающие прав как-то влиять на ход соревнования.\u003c/p\u003e\u003c/div\u003e","tags":[]}}