{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1498434649,"rating":128,"authorHandle":"Eran","modificationTimeSeconds":1498485150,"id":52902,"title":"\u003cp\u003eАкадемический университет: бакалавриат (\u003cs\u003e20 лет\u003c/s\u003e 2 года спустя)\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eБуквально несколько дней назад закончилась сессия. Как и мой первый год в Академическом университете и третий год в жизни бакалавриата...\u003c/p\u003e\u003cp\u003eА потому хочется поделиться некоторыми впечатлениями. И, по возможности, дополнить и без того весьма полный \u003ca href\u003d\"//codeforces.com/blog/entry/17837\"\u003eпост\u003c/a\u003e от Пети Смирнова, рассказать о каких-то изменениях в жизни бакалавриата.\u003c/p\u003e\u003ch2\u003eО том, как всё начиналось\u003c/h2\u003e\u003cp\u003eДля начала хочется рассказать о том, как всё начиналось, и кто у нас вообще учится в Академическом университете.\u003c/p\u003e\u003cp\u003eВ нашем году был набор 47 человек. Среди поступивших 14 человек — призёры и победители Всероса, причём двое по математике и один по физике. Также четверо — победители олимпиад 1 уровня (призёра для поступления не хватит). Оставшиеся 29 человек поступали по ЕГЭ.\u003c/p\u003e\u003cp\u003eВ текущем же году набор составит уже 36 человек.\u003c/p\u003e\u003cp\u003eПо уровню подготовки, как видно, люди действительно поступали совсем разные. Однако всё это было учтено при подготовке программы. В частности, в первую неделю обучения нам предложили написать тесты, по результатам которых нас распределили на группы по математике и программированию в зависимости от начальной подготовки. Так что скучать никому не приходилось ;)\u003c/p\u003e\u003cp\u003eЧто касается программы нашего курса, то Петя Смирнов подробно написал про неё в своём посте.\u003c/p\u003e\u003cp\u003eМогу лишь написать о некоторых изменениях по сравнению с 2014 годом. А именно, из программы пропала физика (что, наверное, для многих будет плюсом ;)). В остальном же всё осталось по-прежнему.\u003c/p\u003e\u003ch2\u003eОбучение\u003c/h2\u003e\u003cp\u003eУчиться приходится много. Очень. Очень много. У многих на учёбу может уходить и вовсе всё своё свободное время, так что надо быть готовым к этому. И пусть перед Новым годом мы смогли-таки найти время на то, чтобы поставить в студкомнате ёлку, но с тех пор так и не нашли время, чтобы разобрать её ;)\u003c/p\u003e\u003cp\u003eОсобенно сложной для многих выдалась первая четверть учебного года. К примеру, кто-то, поступая в университет, совсем не умел программировать, никогда не слышал об алгоритмах. Другие же, наоборот, имели большие пробелы в математике. А потому работать приходилось очень много.\u003c/p\u003e\u003cp\u003eНаверное, главное здесь — иметь желание, не бояться просить помощи у окружающих. И, как показала практика, все желающие за эти несколько месяцев подтянулись до необходимого уровня. Так что сильно беспокоиться не стоит ни тем, кто недостаточно уверенно себя пока что чувствует в этой сфере, ни тем, кто рассчитывает на сильную программу с первых дней. Всё это будет.\u003c/p\u003e\u003cp\u003eИз особенностей обучения, пожалуй, стоит выделить разделение предметов на лекции/практики. Так, сначала всему потоку читаются лекции, материал которых осознаётся и разбирается подробнее на практиках. В частности, поскольку практические занятия разделяются по довольно небольшим группам, к учащимся вырабатывается персональный подход, что не может не радовать.\u003c/p\u003e\u003cp\u003eРадует ещё и то, что преподавательский состав у нас в большинстве своём довольно молодой и весьма перспективный. Нудных лекций и практик у нас не бывает :)\u003c/p\u003e\u003cp\u003eДа и вообще в АУ царит очень дружелюбная и располагающая атмосфера. Вы в любой момент можете в спокойной обстановке пообщаться со своими преподавателями, куратором или однокурсниками. Вам всегда помогут разобраться, и даже могут приподнять настроение в совсем сложных ситуациях :)\u003c/p\u003e\u003cp\u003eА ещё у нас буквально с первых дней учёбы начали создаваться студенческие конспекты по основным предметам. Также по каким-то предметам конспекты ведут сами лекторы (к примеру, есть конспекты по алгоритмам от Серёжи Копелиовича и по дискретной математике от А.В. Омельченко). Ко второму семестру у нас даже появился \u003ca href\u003d\"https://cdkrot.me\"\u003eсайтик\u003c/a\u003e от \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/cdkrot\" title\u003d\"Кандидат в мастера cdkrot\"\u003ecdkrot\u003c/a\u003e, на котором выкладываются наши конспекты.\u003c/p\u003e\u003ch2\u003eОлимпиады\u003c/h2\u003e\u003cp\u003eХочется несколько слов сказать про олимпиады. Хотя, по-видимому, я и повторю уже сказанное Петей...\u003c/p\u003e\u003cp\u003eВо-первых, курс алгоритмов предполагает еженедельное решение контестов.\u003c/p\u003e\u003cp\u003eРазумеется, не всем этого хватает, а потому для любителей олимпиад у нас по субботам проводятся тренировки. Личные и командные. На большее, впрочем, хватает очень немногих... Но спорить не буду, такие находятся.\u003c/p\u003e\u003cp\u003eЕсли есть желание, то существует возможность поехать на Петрозаводские сборы.\u003c/p\u003e\u003cp\u003eЕсть также возможность съездить и на разные студенческие и не только олимпиады. В этом году нашу команду приглашали на командный чемпионат в Самару. Из более значимых — в этом году несколько наших команд успешно съездили на Google HashCode во Францию, а также уже второй год наши команды вполне достойно показывают себя на финале ACM :)\u003c/p\u003e\u003cp\u003eРазумеется, университет старается поддерживать все эти движения и оплачивать все поездки на подобные соревнования.\u003c/p\u003e\u003ch2\u003eОтдых\u003c/h2\u003e\u003cp\u003e\u0026quot;Какой же отдых?!\u0026quot;, — спросите вы после всех рассказанных страшилок о постоянной учёбе.\u003c/p\u003e\u003cp\u003eСвободного времени и правда, как правило, остаётся не слишком много. Но, как говорится, было бы желание.\u003c/p\u003e\u003cp\u003eТак, мы курсом выбирались в театр, ходили на лазертаг. На каникулах ездили компанией в Великий Новгород на Бегущий Город.\u003c/p\u003e\u003cp\u003eИ пусть даже это не слишком часто происходит, но зато отсутствие большого количества свободного времени компенсируется наличием в университете студенческих комнат. Если коротко, то это потрясающая возможность отдохнуть вместе со своими однокурсниками, пообщаться. Частенько в ней можно найти гитару вместе с любителями поиграть на ней. Есть холодильник и микроволновка с чайником. А в шкафу можно обычно найти какие-нибудь вкусняшки.\u003c/p\u003e\u003cp\u003eВ студкомнатах вообще всегда царит очень уютная атмосфера. А с некоторых пор даже появилась \u0026quot;стена боли\u0026quot;, на которой каждый может поделиться своей болью касательно учёбы и жизни :)\u003c/p\u003e\u003cp\u003eДля живущих в общежитии по выходным ещё бывает опция \u0026quot;загамать в настолки\u0026quot;. Просто чтобы отвлечься ненадолго от того потока информации, который приходится воспринимать за время учебной недели.\u003c/p\u003e\u003ch2\u003eОбщежитие\u003c/h2\u003e\u003cp\u003eК слову о. В общежитиях у нас очень круто :)\u003c/p\u003e\u003cp\u003eКомнаты весьма просторные. Есть комнаты на двоих и на троих. Последние, к слову, скорее напоминают полноценную квартиру. Всё, так сказать, включено. На каждом этаже есть своя кухня с холодильниками, микроволновыми печами и чайниками. Есть также постирочная и комната для сушки.\u003c/p\u003e\u003cp\u003eВ принципе, при желании всем этим можно оборудовать и свою комнату. И можете не беспокоиться, что в них не хватит места. Но особой необходимости в том точно нет.\u003c/p\u003e\u003cp\u003eТакже в общежитии предусмотрена специальная комната, в которой можно оставить ваш велосипед, если таковой имеется.\u003c/p\u003e\u003cp\u003eА ещё совсем скоро у нас откроется второй корпус общежития. И тогда станет совсем просторно жить :)\u003c/p\u003e\u003ch2\u003eВ завершение...\u003c/h2\u003e\u003cp\u003eГод закончился. У всех свои планы на это лето. Двое едут на стажировку в Google, ещё один человек — уже стажируется в JetBrains. К слову, все трое — милые девушки :)\u003c/p\u003e\u003cp\u003eОчень многие едут в ЛКШ в качестве преподавателей. А кто-то решил ботать и отдыхать в своё удовольствие.\u003c/p\u003e\u003cp\u003eПро себя могу сказать, что год прошёл очень продуктивно и интересно. Наверное, более дружного коллектива, чем здесь, мне до сих пор не приходилось встречать. И здесь ты всегда можешь быть уверен в том, что тебя поддержат. Что тебе объяснят непонятный материал и помогут справиться с нагрузкой. \u003c/p\u003e\u003cp\u003e...\u003c/p\u003e\u003cp\u003eПожалуй, на этом всё :)\u003c/p\u003e\u003c/div\u003e","tags":["spbau","2016-2017","спбау","бакалавриат"]}}