{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1456776358,"rating":164,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1458085130,"id":43229,"title":"\u003cp\u003eCROC 2016: Programming Championship\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/croc-eng-logo-200.png\" style\u003d\"float: left;margin: 0 1.5em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eIn the spring 2016 the company CROC together with Codeforces will hold the third Russian Open programming championship «CROC – 2016». The goal of this project, as before, — encourage of the most talented and innovative young specialists and stimulate interest to the information technology.\u003c/p\u003e\u003cp\u003eAs usual CROC company pays great attention to social projects, associated with the development of the IT-industry, to promotion of IT-professions and to the increasing interest in modern technology. CROC has rich experience of cooperation with universities, the organization of courses, seminars and competitions for pupils, students and experienced professionals.\u003c/p\u003e\u003cp\u003eThe registration to the championship will be open from March, 1st to March, 16. Anyone, regardless of nationality, place of residence and level of education, can be a participant. The official language of the competition is Russian. Championship participants will take part in two main rounds: elimination round, which will take place in early March, and the final. There will be 50 strongest participants competing in Moscow on April, 15. CROC will cover transport costs in the amount of no more than 10000 rubles (it is about 135 USD). All finalists should confirm their will and ability to visit Moscow to take part in the Final before March 25. CROC will not be able to help you with visa (if it needed), so our primary target audience is Russian participants and participants from some ex-USSR countries. But two years ago \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/rng_58\" title\u003d\"Legendary grandmaster rng_58\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003er\u003c/span\u003eng_58\u003c/a\u003e visited our Finals!\u003c/p\u003e\u003cp\u003eA warm welcome, meeting with the organizers of the event and experts in software development in the CROC, a festive buffet, a fascinating game round and great prizes and gifts are waiting for the finalists. Previous programming championship by CROC was held in 2013 and brought together ~3500 programmers from all over Russia, CIS and other countries.\u003c/p\u003e\u003ch2\u003ePrizes\u003c/h2\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003e1 place — 100000 rubles\u003c/strong\u003e\u003c/li\u003e   \u003cli\u003e2 place — 70000 rubles\u003c/li\u003e   \u003cli\u003e3 place — 50000 rubles\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe prize for the winner of the game round is a laptop.\u003c/p\u003e\u003ch2\u003eSchedule stages of the championship\u003c/h2\u003e \u003cul\u003e   \u003cli\u003eQualification Round – 16 of March\u003c/li\u003e   \u003cli\u003eElimination Round – 18 of March\u003c/li\u003e   \u003cli\u003eFinals will be held on April 15 in Moscow in the office of the CROC (50 participants)\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eAll rounds will be open for unofficial participation for everyone. The Elemination and Finals rounds will be rated regardless of participation type (official or not).\u003c/p\u003e\u003ch2\u003eRegistration\u003c/h2\u003e\u003cp\u003eTo take part in the championship you have to register on the \u003ca href\u003d\"//codeforces.com/croc2016/register\"\u003especial page\u003c/a\u003e. Registration will be open until the end of the qualification round. Compete with the best programmers in the Open Championship \u0026quot;CROC-2016\u0026quot;!\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e \u003cbr /\u003e \u003c/p\u003e\u003ccenter\u003e \u003ca href\u003d\"//codeforces.com/croc2016/register\" style\u003d\"color: white;background-color: green;font-size: 26.0px;padding: 9.0px;\"\u003eRegister Now!\u003c/a\u003e \u003c/center\u003e \u003cbr /\u003e \u003cbr /\u003e\u003ch2\u003eThe history of the CROC championships\u003c/h2\u003e\u003cp\u003eThe upcoming championship will be the third championship, conducted by the CROC on Codeforces. You can find the information about this championships by clicking on the links below:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/croc2012?locale\u003den\"\u003echampionship CROC 2012\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/croc2013?locale\u003den\"\u003echampionship CROC 2013\u003c/a\u003e\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":["croc","championship","2016"]}}