{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1429559463,"rating":92,"authorHandle":"pllk","modificationTimeSeconds":1429561535,"id":17497,"title":"\u003cp\u003eProgramming contest book reviews\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThere are several programming contest books, but what do they contain and how good are they? Of course, it is difficult to know before buying and reading them. In this blog post I review programming contest books that I have read.\u003c/p\u003e\u003cp\u003eDo you know other books or have different opinions?\u003c/p\u003e \u003chr /\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003eProgramming Challenges: The Programming Contest Training Manual\u003c/strong\u003e\u003c/li\u003e   \u003cli\u003eURL: \u003ca href\u003d\"http://www.programming-challenges.com/\"\u003ehttp://www.programming-challenges.com/\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eAuthors: Steven Skiena \u0026amp; Miguel Revilla\u003c/li\u003e   \u003cli\u003eYear: 2003\u003c/li\u003e   \u003cli\u003ePrice (Amazon): 56.67 USD (paperback)\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cimg alt\u003d\"Programming Challenges\" src\u003d\"/predownloaded/12/d3/12d3d53dd2aa17f5be863defa5a94fb81575f01c.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThis is a classic book about programming contests, written more than ten years ago.\u003c/p\u003e\u003cp\u003eThe book contains 14 chapters that discuss topics such as data structures, combinatorics, dynamic programming, and computational geometry. Each chapter begins with an introduction to the topic, followed by a collection of programming tasks.\u003c/p\u003e\u003cp\u003eA lot has happened in the world of programming contests during the last ten years. While many chapters of the book are still relevant in modern contests, a lot of important material is missing. For example, the segment tree data structure is not even mentioned in the book.\u003c/p\u003e\u003cp\u003eThe text of the book is well written and easy to understand. However, the quality of the code examples is not good. For some reason, everything is coded using pure C, and many implementations are cumbersome and unnecessarily long. I was astonished to see implementations of Prim\u0027s and Dijkstra\u0027s algorithms with quadratic time complexities.\u003c/p\u003e\u003cp\u003eIt is clear that the book is outdated, and mastering the techniques presented in the book is not enough today. Still, it is nice to read the book, and it contains some material that I have not seen in other sources.\u003c/p\u003e \u003chr /\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003eCompetitive Programming 3: The New Lower Bound of Programming Contests\u003c/strong\u003e\u003c/li\u003e   \u003cli\u003eURL: \u003ca href\u003d\"http://cpbook.net/\"\u003ehttp://cpbook.net/\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eAuthors: Steven \u0026amp; Felix Halim\u003c/li\u003e   \u003cli\u003eYear: 2013\u003c/li\u003e   \u003cli\u003ePrice (Lulu): 26.99 USD (paperback), 35.99 USD (hardcover)\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cimg alt\u003d\"Competitive Programming 3\" src\u003d\"/predownloaded/36/e6/36e681cc66ea17a2c436fb897984b464b0495521.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThis book is an introduction to data structures and algorithms that are needed in modern programming contests. The book is intended for readers who have some background in algorithm programming. Both basic and advanced techniques are discussed.\u003c/p\u003e\u003cp\u003eA lot of material is covered in the book. There are nine chapters, and the first three of them concentrate on problem solving and data structures. After this, the next chapters discuss graph theory, mathematics, string processing and computational geometry. Finally, there are two chapters that contain more advanced material.\u003c/p\u003e\u003cp\u003eThe book is a good resource for getting a general picture of the topics that appear in programming contests. However, many algorithms are discussed so briefly that it can be difficult to really learn them from the book. So, while the book tells you what techniques you should learn, there are often better sources where you can actually learn them.\u003c/p\u003e\u003cp\u003eA general feeling when reading the book is that it is a draft of a book instead of a published book. The quality of the text and the pictures is often not good. In addition, there is too little empty space in the layout which makes the book difficult to read.\u003c/p\u003e\u003cp\u003eWhen I read the book for the first time, I suddenly noticed that I have read the same text before. Unfortunately, some content in the book is copied almost word for word from the USACO training pages without mentioning this to the reader.\u003c/p\u003e\u003cp\u003eWhile there are severe drawbacks in the current version of the book, it is still the best introduction to programming contests I have read. The authors know what they are speaking about, and the techniques discussed in the book are relevant in modern contests.\u003c/p\u003e \u003chr /\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003eLooking for a Challenge? The Ultimate Problem Set from the University of Warsaw Programming Competitions\u003c/strong\u003e\u003c/li\u003e   \u003cli\u003eURL: \u003ca href\u003d\"http://www.lookingforachallengethebook.com/\"\u003ehttp://www.lookingforachallengethebook.com/\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eYear: 2012\u003c/li\u003e   \u003cli\u003ePrice: 30 EUR (hardcover)\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/fa/f2/faf236da48ee07fe09b7e70ea9b2dd2c0fa6d221.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThis book contains a collection of tasks from Polish programming contests organized by the University of Warsaw. The book is written by a group of authors who have studied and worked at the university. There are 53 tasks in total, and for each task, the book contains a task statement and a detailed analysis how to solve the task.\u003c/p\u003e\u003cp\u003eFirst of all, this is not a beginner\u0027s book. Most tasks are difficult, and the book assumes that the reader already has a strong background in programming contests.\u003c/p\u003e\u003cp\u003eAn experienced contestant can learn a lot from the book. The analyses are very well written. Typically, an analysis begins with a history how the task was invented. After this, different ways how to approach the task are discussed. The analyses are mathematically rigorous but accessible.\u003c/p\u003e\u003cp\u003eThe only drawback in the book is that it is difficult to obtain. It can be ordered through the website of the book, but this is not as easy as one could think. Tip: if you don\u0027t get a reply for your order, try to send another order.\u003c/p\u003e\u003cp\u003eBy the way, many tasks from Polish contests are available for practice at \u003ca href\u003d\"http://main.edu.pl/\"\u003ehttp://main.edu.pl/\u003c/a\u003e. Polish tasks are usually both high-quality and difficult, so they are good material for practicing.\u003c/p\u003e\u003c/div\u003e","tags":["book review"]}}