{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1415128328,"rating":0,"authorHandle":"burakcetin","modificationTimeSeconds":1415619737,"id":14586,"title":"\u003cp\u003eUSACO 2013 January Silver: Square Overlap\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"http://www.usaco.org/index.php?page\u003dviewproblem2\u0026amp;cpid\u003d227\u0026amp;lang\u003den\"\u003eProblem 2: Square Overlap [Brian Dean, 2013]\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSizin yapiminda calistiginiz yeni bir RPG oyununda N tur yaratik vardir ve bu yaratiklar sadece kendilerine ayrilmis (x_i,y_i) merkezli ve tam olarak KxK boyutlarindaki kare seklinde bolgelerde dogabilirler. (kordinatlar tamsayi ve int e sigiyor).Bazi bolgelerde iki farkli tur yaratik dogmasi yani dogus alanlarinin kesismesi orada kasilan oyuncularin aleyhine olcacagindan yapimci boyle alanlar olmasini istememektedir fakat haritayi hazirlarken bunu unutmustur ve sizden boyle alanlar olup olmadigini bulmanizi istemektedir boylece duzeltecektir. Fakat kuzeniniz RPG leri cok sevdiginden sadece bir tane ikili dogus alani kesisiyorsa fark edilmesi zor oldugu icin bunu patrona soylemeyip kuzeninize orda kasilmasini soyleyecekseniz. girdi bicimi:\u003c/p\u003e\u003cp\u003e2\u0026lt;\u003dN\u0026lt;\u003d50.000 yaratik turu sayisi 1\u0026lt;\u003dK\u0026lt;\u003d1.000.000 dogus alanlarinin kenar uzunlugu (her zaman cift olacak) N tane sayi ikilisi x_i y_i dogus alanlarinin merkez kordinatlari\u003c/p\u003e\u003cp\u003eornek girdi:\u003c/p\u003e\u003cp\u003e4 6\u003c/p\u003e\u003cp\u003e0 0\u003c/p\u003e\u003cp\u003e8 4\u003c/p\u003e\u003cp\u003e-2 1\u003c/p\u003e\u003cp\u003e0 7\u003c/p\u003e\u003cp\u003eornegin aciklamasi:\u003c/p\u003e\u003cp\u003e4 tur hepsinin alani 6 x 6 ilkinin merkezi (0,0) vb.\u003c/p\u003e\u003cp\u003ecikti bicimi:\u003c/p\u003e\u003cp\u003eBirden fazla kesisim alani ikilisi varsa patronunuz oyunu duzeltecek yani -1 yazdirin. Bir tane kesism alani ikilisi varsa kuzeninize soyleyeceniz kasilma alaninin buyuklugu. (kuzeniniz de diger oyuncular gibi adil oynamak zorundaysa 0 yazdirin [hani cunku kasilabilecegi alan 0 oluyo ya ondan bunu bile acikladim bakin])\u003c/p\u003e\u003cp\u003eornek cikti:\u003c/p\u003e\u003cp\u003e20\u003c/p\u003e\u003cp\u003eOUTPUT DETAILS: 1. tur ile 3. turun dogus alanlari 20 birimlik bir kesisime sahip.\u003c/p\u003e\u003cp\u003eEDIT 1: \u003ca href\u003d\"//codeforces.com/contest/1/submission/8558212\"\u003ehttp://codeforces.com/contest/1/submission/8558212\u003c/a\u003e bu da kod. Konu kodun ilk satirinda yaziyor.\u003c/p\u003e\u003c/div\u003e","tags":["geometry","zorluk5"]}}