{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1421930267,"rating":-3,"authorHandle":"NeverSayNever","modificationTimeSeconds":1421930314,"id":15940,"title":"\u003cp\u003eHow to solve this problem from Quora Hackathon \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Fellas ,\u003c/p\u003e\u003cp\u003eI am trying to solve this problem from Quora Hackathon but not able to come up with a idea .. how to appraoch it ? \u003c/p\u003e\u003cp\u003eCan any one help ..\u003c/p\u003e\u003cp\u003eJust for the convenience i have copied the problem statement here otherwise you can use this \u003ca href\u003d\"https://www.hackerrank.com/contests/quora-haqathon/challenges/relatedquestions\"\u003e link \u003c/a\u003e\u003c/p\u003e\u003cp\u003eProblem Statement\u003c/p\u003e\u003cp\u003eFor the purposes of this problem, suppose Quora has N questions, and question i (1≤i≤N) takes Ti time to read. There exists exactly one path from any question to another, and related questions form undirected pairs between themselves. In other words, the graph of related questions is a tree.\u003c/p\u003e\u003cp\u003eEach time Steve reads a question, he will see a list of related questions and navigate to one that he hasn\u0027t read yet at random. Steve will stop reading once there are no unread related questions.\u003c/p\u003e\u003cp\u003eWhich question should we show first to Steve so that we minimize his total expected reading time? It is guaranteed that there is one unique question that is optimal.\u003c/p\u003e\u003cp\u003eInput Format\u003c/p\u003e\u003cp\u003eLine 1: A single integer, N\u003c/p\u003e\u003cp\u003eLine 2: N integers, Ti\u003c/p\u003e\u003cp\u003eLine 3...N+1: Each line contains two integers A, B indicating that question A and B are \u003c/p\u003e\u003cp\u003erelated\u003c/p\u003e\u003cp\u003eOutput Format\u003c/p\u003e\u003cp\u003eLine 1: A single integer, X, the best question to show first.\u003c/p\u003e\u003cp\u003eConstraints\u003c/p\u003e\u003cp\u003e1≤N≤105\u003c/p\u003e\u003cp\u003e1≤Ti≤106\u003c/p\u003e\u003cp\u003eSample Input\u003c/p\u003e\u003cp\u003e5\u003c/p\u003e\u003cp\u003e2 2 1 2 2\u003c/p\u003e\u003cp\u003e1 2\u003c/p\u003e\u003cp\u003e2 3\u003c/p\u003e\u003cp\u003e3 4\u003c/p\u003e\u003cp\u003e4 5\u003c/p\u003e\u003cp\u003eSample Output\u003c/p\u003e\u003cp\u003e3\u003c/p\u003e\u003c/div\u003e","tags":[]}}