{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1428323728,"rating":139,"authorHandle":"T-D-K","modificationTimeSeconds":1428323728,"id":17301,"title":"\u003cp\u003eПобеды в конкурсах программирования негативно коррелируют с успехами в работе\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eСобственно вот сабж: \u003ca href\u003d\"http://geektimes.ru/post/248580/\"\u003ehttp://geektimes.ru/post/248580/\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЦитата с GeekTimes:\u003c/p\u003e\u003cp\u003e\u0026quot;Если вы хотите построить успешную карьеру в сфере разработки ПО, ни в коем случае не увлекайтесь спортивным программированием и участием в конкурсах.\u003c/p\u003e\u003cp\u003eТакой вывод следует из беспристрастной статистики и дата-майнинга рабочих показателей сотрудников Google, рассказал Питер Норвиг в лекции, прочитанной 26 марта 2015 года в Венском техническом университете.\u003c/p\u003e\u003cp\u003eПитер Норвиг (Peter Norvig) — директор по исследованиям в Google, советник Ассоциации по улучшению искусственного интеллекта, автор одного из самых популярных вузовских учебников по ИИ.\u003c/p\u003e\u003cp\u003eВообще-то, лекция “How Computers Learn” тоже посвящена вопросам искусственного интеллекта и обучению компьютеров. Среди прочего, Питер Норвиг рассказал, как Google использует машинное обучение для найма новых сотрудников и оценки работы разработчиков.\u003c/p\u003e\u003cp\u003eДата-майнинг позволил определить, какие факторы коррелируют с успешной работой сотрудника. Большим удивлением для Норвига стало то, что победы в конкурсах спортивного программирования негативно коррелируют с успехами в повседневной работе.\u003c/p\u003e\u003cp\u003eПитер Норвиг видит причину в том, что участников конкурсов тренируют решать проблемы как можно быстрее, в то время как успех на рабочем месте требует более вдумчивой и медленной работы.\u0026quot;\u003c/p\u003e\u003cp\u003eНа работе надо мной уже начали прикалываться.\u003c/p\u003e\u003c/div\u003e","tags":[]}}