{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1464932960,"rating":103,"authorHandle":"gKseni","modificationTimeSeconds":1465138447,"id":45199,"title":"\u003cp\u003eТехнологии успеха: Начало пути\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДоброе утро, Codeforces!\u003c/p\u003e\u003cp\u003eПока новостей в мире спортивного программирования стало мало, погружаюсь в историю — читаю книгу В.Н. Васильева и В.Г. Парфенова «Технологии успеха».\u003c/p\u003e\u003cp\u003eС согласия авторов постепенно делюсь прочитанным. :)\u003cbr /\u003eБудут публиковаться части книги с ссылками на предыдущие посты. Рисунки и фотографии — также из книги. \u003c/p\u003e\u003chr /\u003e\u003chr /\u003e\u003cp\u003eСлучившаяся осенью 1991 г. историческая катастрофа привела не только к резкому ухудшению материального положения всех граждан распавшейся огромной страны, но и к разрыву связей между образовательными и научными учреждениями некогда единого государства.\u003c/p\u003e\u003cp\u003eВ первой половине девяностых годов Интернет и мобильная связь находились в России и странах ближнего зарубежья в состоянии начальной стадии развития и были доступны очень узкому кругу лиц. Транспортное сообщение между городами сделалось также практически малодоступным из-за неподъемных цен на билеты. В результате огромное число традиционных научно-технических и образовательных мероприятий (научных конференций, семинаров, олимпиад и т. д.), которые проводились во времена СССР, уменьшилось практически до нуля. Так, например, В.Г. Парфенов, который в советские времена посещал Москву практически ежемесячно, если не чаще, после 1991 г. в первый раз приехал в Москву спустя 10 лет — в 2001 г. для оформления канадской визы для поездки на финал в Ванкувер. Соответственно, преподаватели вузов и научные работники какого-либо российского города слабо себе представляли, какие процессы происходят в вузах и научно-исследовательских институтах других российских городов России, а тем более других стран ближнего зарубежья, и остались ли там, вообще, система высшего образования и наука.\u003c/p\u003e\u003cp\u003eПоявившиеся в момент самого мрачного безвременья соревнования студентов-программистов были как бы первым слабым отблеском света надежды в конце туннеля. Выяснилось, что советскую науку, высшую школу и систему работы с одаренными школьниками и студентами не так-то просто уничтожить, что практически во всех городах — в Москве, Санкт Петербурге, Минске, Саратове, Екатеринбурге, Владивостоке, Барнауле, Рыбинске — везде, остались ЛЮДИ, которые, несмотря на подчас невыносимые экономические условия, продолжают искать и обучать способных в области точных наук школьников и студентов и верят, что их усилия не будут напрасными и принесут в будущем пользу своим странам.\u003c/p\u003e\u003cp\u003eВспоминается, какое огромное впечатление на петербуржцев произвел подготовленный в Уральском государственном университете труд «Как стать чемпионом мира по программированию или разбор полетов», с которым можно ознакомиться в этой книге(Прим.: Будет опубликовано в следующих статьях. \u003cem\u003eCodeforces::News\u003c/em\u003e). Вдруг стало ясно, что жизнь, к счастью, осталась и идет не только в нескольких столичных вузах, но на Урале! И это ощущение наличия большого сообщества единомышленников, помогло нам всем выстоять и дожить до более светлых времен.\u003c/p\u003e\u003cp\u003eЧтобы донести до современной молодежи атмосферу того времени и кратко ознакомить с экономическими условиями, в которых приходилось работать, ниже приводится субъективный рассказ о том, как развивались события в Санкт-Петербурге в 1994-1996 г. на подходе к проведению полуфинальных соревнований Северо-Восточного Европейского региона. Думается, что похожая обстановка была и в других городах и вузах.\u003c/p\u003e\u003cp\u003eВ 1994 г. пошел третий год шоковой терапии, но никакого «света в конце туннеля» не просматривалось. Сложившуюся ситуацию хорошо характеризует заключительная часть новогоднего поздравления В.Г. Парфенова, обращенного к студентам и опубликованного в начале января 1994 г.: в газете Университета ИТМО «Кадры приборостроения»: «С пожеланием мне хочется обратиться к студентам выпускникам. Они в самом бедственном положении. Все закрыто. Неизвестно, куда им идти и что делать. И все же пожелаю им удачи!», Вот такая «замечательная» обстановка была в стране!\u003c/p\u003e\u003cp\u003eОтметим, что в те тяжелые годы большинство способных российских программистов и научных работников в области теоретической информатики покинули Россию. Кроме того, после распада великой державы перед большинством молодых и находящихся в трудоспособном возрасте российских докторов и кандидатов наук в области математики, физики, информационных технологий и техники встал трудный выбор. Либо «эвакуироваться с малолетними детьми и женами» из рухнувшей в нищету и хаос России в одну из развитых стран — благо часто научная специальность и уровень квалификации позволяли реализовать этот путь без особых проблем. Либо попытаться выстоять и сохранить интеллектуальный потенциал для развития высоких технологий в нашей стране. Кроме оттока заграницу, еще более существенный отток высококвалифицированных кадров шел из вузов в частный российский бизнес. В результате на некогда славных кафедрах ведущих университетов подчас в основном оставались только преподаватели пенсионного возраста, которые были не в состоянии поддержать достигнутый за многие десятилетия уровень. Особенно остро эти процессы проявлялись в области информационных технологий, где необходимо было постоянно обновлять учебные материалы, и преподаватели не могли использовать багаж знаний, накопленный в прежние благополучные годы.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/42/32/42326288f408f6b7830c541a980921c322f17bff.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eСоветская школа поиска и подготовки одаренных в области точных наук школьников и студентов считалась одной из лучших в мире. Советские школьники лидировали по числу медалей и дипломов, завоеванных на Международных олимпиадах по математике, физике и информатике.\u003c/p\u003e\u003cp\u003eВажной традицией советской (и естественно, петербургской) школы являлось участие победителей олимпиад всех уровней, ставших студентами, в обучении своих младших товарищей-школьников, а также в организации различных интеллектуальных состязаний и конкурсов.\u003c/p\u003e\u003cp\u003eВ Санкт-Петербурге из насыщенного интеллектуального петербургского «раствора» выкристаллизовывались «пассионарные» личности, обладающие таким редким сочетанием качеств, как одаренность в точных науках, блестящие организаторские способности, целеустремленность и харизма, высокий уровень коммуникабельности, жесткость и гибкость (используемые в зависимости от ситуации) в защите сообщества педагогов, студентов и школьников от неблагоприятных внешних воздействий, характерных для девяностых годов. Благодаря именно таким людям, в тяжелейших экономических условиях переходного периода удалось не только сохранить, но и развить петербургскую школу подготовки одаренных в области точных наук школьников и студентов. Запас прочности созданной в советское время системы работы с одаренными молодыми людьми оказался достаточным, чтобы выдержать обрушившиеся на страну испытания.\u003c/p\u003e\u003cp\u003eВ результате в девяностые годы сложилась ситуация, когда весьма сложные технологии и методология проведения олимпиад по информатике и программированию и подготовки их участников на уровне, соответствующем международным стандартам, поддерживались в стране в значительной своей части студентами, прошедшими в свое время школу олимпиад Всероссийского и Международного уровней. Передача технологий и методологии осуществлялась более десяти лет, вплоть до начала двухтысячных годов, по существу от одного поколения студентов другому.\u003c/p\u003e\u003cp\u003eВ 1992 г. произошел массовый отъезд из Санкт-Петербурга ведущих математиков, физиков и программистов, и практически всех высококвалифицированных педагогов, которые могли преподавать компьютерные дисциплины и готовить одаренных детей. Это значительно усложнило проведение работы со способными школьниками. И в этот критический момент всю интеллектуальную работу по подготовке одаренных школьников и проведению олимпиад по информатике в Санкт-Петербурге стал проводить выпускник 1991 г. 470 петербургской школы Антон Суханов, являвшийся «продуктом» упомянутого выше процесса кристаллизации пассионарных личностей. В 1991 г. одиннадцатиклассник Антон Суханов выиграл первое место на последней Всесоюзной олимпиаде школьников по информатике и стал, таким образом, последним чемпионом СССР по программированию. На Международной олимпиаде школьников по информатике в Афинах он завоевал серебряную медаль.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/97/d5/97d50ba293feed5911c8226fd1d25f54ff917341.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eв 1992 г. уже первокурсник математико-механического факультета Санкт-Петербургского государственного университета Антон Суханов встал к рулю сборной школьников Санкт- Петербурга по информатике. На этом посту удивительно быстро проявились его выдающиеся педагогические способности. Уже через год, в 1993 г., три его ученика — Илья Миронов, Роман Елизаров и Виктор Баргачев завоевали три из четырех мест в сборной школьников России, а второкурсник Суханов был назначен главным тренером сборной России. На Международной олимпиаде в Аргентине его ребята получили золотую и две серебряные медали. С этого же года Антон Суханов стал постоянным членом жюри Всероссийской олимпиады школьников но информатике. Осенью 1993 г. Суханов совместно с В.П. Тарасовым и В.Г. Парфеновым провел первую в России командную олимпиаду по программированию для школьников. При этом в качестве материальной базы Антон использовал компьютерные классы Дворца творчества юных и кафедры «Компьютерные технологии» Университета ИТМО. Для этих олимпиад Антон чуть ли не за несколько дней написал первую в мире систему автоматической проверки задач и про ведения тура, До этого на всех соревнованиях задачи запускались членами жюри вручную, а иногда даже и просматривались непосредственно «глазами». Кстати, именно из-за «просматривания глазами» в финале 1997 г. была первоначально ошибочно не засчитана правильно решенная задача команде Елизарова, и эта ошибка жюри была исправлена только через сорок минут.\u003c/p\u003e\u003cp\u003eНа следующий год на Международной олимпиаде школьников по информатике в Швеции возглавляемая Антоном сборная России одержала свою, пожалуй, самую громкую победу: Виктор Баргачев стал первым российским чемпионом мира, Роман Елизаров занял третье место, а сборная России в первый раз выиграла первое место в командном зачете (В составе сборной выступали также вятские школьники Антон Ляпунов и Виталий Беров, завоевавшие золотую и серебряную медали). В.Г. Парфенов до сих пор помнит, как солнечным летним днем приехавший из Стокгольма, где проходила олимпиада, Роман на вопрос о результатах выступления ответил: «Третье место». «В мире?!» -воскликнул потрясенный В.Г. Парфенов. «В мире» — скромно подтвердил Роман.\u003c/p\u003e\u003cp\u003eОсенью мрачного 1994 г. три ученика Антона стали студентами первого курса кафедры «Компьютерные технологии» Университета ИТМО. Блестяще подготовленные Антоном, они имели выдающиеся способности и достижения в области программирования, которая в дальнейшем стала основным полем деятельности кафедры и своеобразной визитной карточкой всего университета. Среди них был и третий школьник мира Роман Елизаров.\u003c/p\u003e \u003chr /\u003e\u003cp\u003eСледующая часть: \u003ca href\u003d\"//codeforces.com/blog/entry/45235\"\u003eТернистый путь к полуфиналу\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news","технологии успеха"]}}