{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1480413008,"rating":28,"authorHandle":"RockyB","modificationTimeSeconds":1480414035,"id":48697,"title":"\u003cp\u003eКак можно за небольшое время быстро и эффективно поднять свой уровень в спортивном программировании ???\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет CodeForces и сново я :D\u003c/p\u003e\u003cp\u003eПод небольшим временем я имею 6 — 12 месяцев.\u003c/p\u003e\u003cp\u003eЯ около 3-4 лет готовлюсь к олимпиадам по программированию, но первые 2 года у меня вообще получалось все печально, но за этот год я не плохо так прокачался и на протяжении большого времени мне не хватало алгоритмической подготовки, сейчас все иначе. Я как бы знаю не маленькое количество алгоритмов и применять их могу неплохо, но не вижу своего прогресса на CodeForces раундах и олимпиадах. Многие говорят просто решай много задач, даже при том что я начал уже решать div 1 B, C в больших количествах я все равно не чувствую прогресса. \u003c/p\u003e\u003cp\u003eОколо месяца назад, моя команда прошла на финал ВКОШП и потом мы начали решать прошедшие финалы, мы прорешали все финалы с 2010 года, и на каждом финале есть как минимум по 7 решенных задач и это дало совсем небольшой профит, но совсем незначительный.\u003c/p\u003e\u003cp\u003eИ я хотел бы к финалу Республиканской олимпиады очень сильно прокачаться но я не знаю что решать, что новое учить и потом может быть попасть на отбор IOI.\u003c/p\u003e\u003cp\u003eБуду безумно благодарен если сообщество CodeForces поможет мне с моими вопросами :) \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pixs.ru/showimage/aisbergusp_5598799_24223361.jpg\"\u003e\u003cimg alt\u003d\"Image Hosted by PiXS.ru\" border\u003d\"0\" src\u003d\"/predownloaded/1f/c5/1fc519495cfd597353b7ab4afaa9561032c3192e.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}