{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1475491196,"rating":37,"authorHandle":"gKseni","modificationTimeSeconds":1475492610,"id":47505,"title":"\u003cp\u003eСборы в Ростове и Самаре: Результаты, впечатления участников\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПодошли к концу сборы в Самаре, \u003ca href\u003d\"//codeforces.com/blog/entry/47110\"\u003eорганизованные фондом Виктора Шабурова Botan Investments\u003c/a\u003e на базе Самарского университета. Артем \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/VArtem\" title\u003d\"International Grandmaster VArtem\"\u003eVArtem\u003c/a\u003e Васильев, чемпион ACM ICPC 2015, и Николай \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Niko\" title\u003d\"Master Niko\"\u003eNiko\u003c/a\u003e Ведерников в течение рабочей недели готовили участников к четвертьфиналу. В сборах приняли участие восемь команд: пять команд Самарского университета, две команды УлГТУ (ребята специально приехали из Ульяновска) и одна из ПГУТИ. Команды каждый день писали пятичасовые контесты, а после Артем Васильев проводил разбор задач, попутно рассказывая незнакомые ребятам темы.\u003c/p\u003e\u003cp\u003eКак отмечают все участники, сборы проходили в боевой обстановке. По итогам заключительного контеста лучшей стала команда Самарского университета \u003cstrong\u003eHater\u003c/strong\u003e в составе Славы \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Slamur\" title\u003d\"Candidate Master Slamur\"\u003eSlamur\u003c/a\u003e Муравьева — поздравляем! Отсутствие сокомандников не помешало ему выиграть большую часть контестов.\u003c/p\u003e\u003cp\u003eПеред поездкой в Самару Артем и Николай также провели недельные сборы в Ростове для четырех команд Южного Федерального Университета: две команды из ИИМиКН ЮФУ (Ростов) и две из ИКТиИБ ЮФУ (Таганрог). Лучшей командой по итогам сборов стала команда из Таганрога \u003cstrong\u003eМММ\u003c/strong\u003e: Митина, Маныч, Минасян.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/44/00/4400571ee09433714ab030e3032db8d0dd8d9be7.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eАртем \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/VArtem\" title\u003d\"International Grandmaster VArtem\"\u003eVArtem\u003c/a\u003e Васильев проводит разбор задач\u003c/small\u003e \u003c/center\u003e\u003cp\u003eСофья \u003ca class\u003d\"rated-user user-black\" href\u003d\"/profile/savinova\" title\u003d\"Unrated, savinova\"\u003esavinova\u003c/a\u003e Савинова, координатор образовательных программ фонда Botan Investments, попросила участников самарских сборов поделиться впечатлениями о сборах и планами на четвертьфинал в Саратовском ГУ. \u003c/p\u003e\u003cp\u003eМаксим \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Sunar\" title\u003d\"Candidate Master Sunar\"\u003eSunar\u003c/a\u003e Кашичкин\u003cbr /\u003eУльяновский Государственный Технический Университет\u003cbr /\u003eКоманда \u003cstrong\u003eAllo eto Vova?\u003c/strong\u003e \u003c/p\u003e\u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e — \u003ci\u003eКакие у вас впечатления от сборов?\u003c/i\u003e\u003cbr /\u003e — Очень хорошие впечатления, достаточно хорошие тренировки перед четвертьфиналом.\u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eЧем сборы отличаются от тех, в которых вы обычно участвовали, от ваших обычных тренировок?\u003c/i\u003e\u003cbr /\u003e — От тренировок в вузе однозначно отличаются тем, что есть разборы. От других сборов — разве что меньше времени проходит, чем остальные сборы.\u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eУзнали что-то или просто все повторяли?\u003c/i\u003e\u003cbr /\u003e — Наверное, повторили. Улучшили, скажем так, знания.\u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eВаша команда едет на четвертьфинал? Какие ожидания?\u003c/i\u003e\u003cbr /\u003e — Да. Всего от нашего университета едет три команды. У нас ожидания выйти в полуфинал. У остальных — не знаю. \u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/0f/e6/0fe68cb0b59f7559a68826ce7627ecbfa6215900.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eКоманды УлГТУ \u003cb\u003eAllo eto Vova\u003c/b\u003e и \u003cb\u003eIgoryok\u003c/b\u003e во время контеста \u003c/small\u003e \u003c/center\u003e\u003cp\u003eРоман \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/RoyaLKoninA\" title\u003d\"Expert RoyaLKoninA\"\u003eRoyaLKoninA\u003c/a\u003e Муртазин\u003cbr /\u003eСамарский университет\u003cbr /\u003eКоманда \u003cstrong\u003eSSAU_RIP\u003c/strong\u003e \u003c/p\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e — \u003ci\u003eРасскажи про свою команду.\u003c/i\u003e\u003cbr /\u003e — Наша команда называется SSAU RIP, она только недавно собралась. Мы заменили одного человечка, к сожалению, ему стало неинтересно заниматься спортивным программированием, а нашей команде это интересно. Летом мы ездили в Сазаночку на сборы, там тоже каждый день были контесты. Нам нравился этот ритм жизни, поэтому такой ритм, как сейчас на сборах, когда каждый день контест, а потом еще разбор, и у тебя 7-8 часов в день полностью посвящено спортивному программированию — это нам нравится.  \u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eМотивирует?\u003c/i\u003e\u003cbr /\u003e     — Мотивирует очень сильно. Когда мы приходим сюда и видим, что мы можем что-то решать, а потом пытаемся понять и даже иногда понимаем, как решается то, что мы не решили, это дает мотивацию продолжать что-то делать.  \u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eКакие-то новые темы узнали на сборах? Или больше было повторение?\u003c/i\u003e\u003cbr /\u003e   — Мы потренировали то, что уже один раз писали, но неуверенно. Сейчас мы смогли написать это еще раз и поняли, что умеем это делать. Соответственно, в дальнейшем на контестах нам будет намного проще решать такие задачи.  \u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eКакие ожидания от четвертьфинала?\u003c/i\u003e  \u003cbr /\u003e    — Мы надеемся взять дипломы третьей степени, но так как дальше в полуфинал проходит две команды, а мы где-то на уровне третьей-пятой команды университета, то если смотреть реалистично, у нас не так много шансов попасть в полуфинал. Однако все возможно, и если постараться, то можно выбраться вперед.  \u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/2d/e5/2de533ed09d8ed4475a3e2952bb30da54fddf495.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eРоман \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/RoyaLKoninA\" title\u003d\"Expert RoyaLKoninA\"\u003eRoyaLKoninA\u003c/a\u003e Муртазин. Команда \u003cb\u003eSSAU_RIP\u003c/b\u003e  \u003c/small\u003e \u003c/center\u003e\u003cp\u003eПетасова \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/AnastasiaPetasova\" title\u003d\"Specialist AnastasiaPetasova\"\u003eAnastasiaPetasova\u003c/a\u003e Анастасия\u003cbr /\u003eСамарский Университет\u003cbr /\u003eКоманда \u003cstrong\u003ePrincess Celestia\u003c/strong\u003e \u003c/p\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e — \u003ci\u003eКакие впечатления от сборов?\u003c/i\u003e  \u003cbr /\u003e   — Это мои первые сборы. Впечатления замечательные, я для себя ощутила большой рост. Не понравилось только то, что условия были на английском языке, было тяжеловато, особенно когда кто-то из твоих тиммейтеров не приходит.  \u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eКак такой формат сборов — когда пишешь тренировки каждый день в течение недели?\u003c/i\u003e \u003cbr /\u003e   — Это самое лучшее, что можно было придумать. Я бы походила целый год, и может даже не один. Чаще нужно такие сборы проводить.  \u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eКакие-то новые темы для себя узнала?\u003c/i\u003e \u003cbr /\u003e  — Узнала, например, про выпуклые оболочки. Сложно, понравилось. Разборы тоже были достаточно подробные и интересные.  \u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eЧем-то отличается формат сборов от обычных тренировок в вузе?\u003c/i\u003e  \u003cbr /\u003e — Иногда у нас на тренировках, особенно для первокурсников, бывают лекции в начале, и потом на эти темы дают задачи на отработку. Мне кажется, на стартовых этапах это очень полезно. Но конкретно сейчас было полезнее именно порешать. Спасибо, очень крутые сборы! \u003c/p\u003e\u003cp\u003eСлава \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Slamur\" title\u003d\"Candidate Master Slamur\"\u003eSlamur\u003c/a\u003e Муравьев\u003cbr /\u003eСамарский Университет\u003cbr /\u003eКоманда \u003cstrong\u003eHater\u003c/strong\u003e \u003c/p\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e — \u003ci\u003eПредставься, пожалуйста. Как твоя команда называется?\u003c/i\u003e   \u003cbr /\u003e — Меня зовут Слава Муравьев, я студент второго курса магистратуры Самарского университета. Вообще моя команда называется Haters, но так как я играл один из команды, я был под ником Hater.  \u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eКак тебе сборы, какое впечатление? Было интересно соревноваться с другими командами?\u003c/i\u003e  \u003cbr /\u003e — Вообще мне понравилось, конечно. Такое недельное отвлечение почти от всех дел, от учебы. Решение контестов в довольно боевой обстановке, особенно когда есть виртуальные участники и ты смотришь на другие команды, более-менее представляешь себе, где ты. На самом деле, в одиночку писать это немного другой опыт, потому что если ты не видишь какой-то своей ошибки или важного дополнения, некому дать тебе другой взгляд, и приходится до всего доходить самому. Любой отход от компьютера подумать лишает твою команду компьютерного времени, в отличие от других команд, когда один может думать, а другой кодить что-то другое. Ты не можешь думать одновременно над несколькими задачами, и если в какой-то момент ты не можешь решить задачу, ты должен ее отложить.  \u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eУзнал ли ты что-то новое на сборах?\u003c/i\u003e   \u003cbr /\u003e — Я узнал много нового. Совсем в новинку для меня была триангуляция многоугольника, раньше я не встречался с такими задачами. Dynamic connectivity (динамическая связность), также некоторые виды динамик, некоторые виды просто каких-то подходов, которые здесь явно показали как применять на практике. Это было очень полезно. \u003cbr /\u003e   Я все-таки представляю не средний уровень, и многое из того, что рассказывали я уже слышал и просто дополнял свои знания. Для других, возможно, этот же разбор был не таким понятным, но цель разбора — не научить участников решать все задачи полностью, а дать основные идеи и сказать, такой-то блок вы можете посмотреть там-то.  \u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eКак тебе сама идея организовать сборы по программированию в Самаре?\u003c/i\u003e   \u003cbr /\u003e — Идея организовать сборы очень хорошая. Многие сборы проводятся в неудобное время, и если те, кто учатся в магистратуре еще могут выделить время для поездки в Ижевск или Петрозаводск, то младшим курсам тяжело дается такая поездка, поскольку возникают проблемы с учебой. Для младших курсов такой формат сборов, когда им не надо было никуда ехать, очень удобен. А пятичасовые контесты и разборы каждый день — это было довольно интересно и полезно. Здесь старались подбирать сложность задач под уровень команд, то есть каждой команде было над чем подумать.  \u003cbr /\u003e\u003cbr /\u003e — \u003ci\u003eСкоро уже четвертьфинал, какие у вас ожидания? Хочешь сказать какие-нибудь слова остальным, напутствие к четвертьфиналу от самой сильной команды?\u003c/i\u003e    \u003cbr /\u003e — У нас главное ожидание — пройти в Питер. Я всем желаю удачи, отобраться в полуфинал или хотя бы занять призовое место,  получить удовольствие от поездки, чтобы задачи были интересные, хорошие, и, конечно, чтобы они решались. И чтобы потом все продолжили заниматься спортивным программированием, не забросили, чтобы дальше развивались и достигли больших успехов. \u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/c0/bb/c0bb6023ccbf0c61f45fb51c3ee7d7af68a462ba.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eСлава \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Slamur\" title\u003d\"Candidate Master Slamur\"\u003eSlamur\u003c/a\u003e Муравьев. Команда \u003cb\u003eHater\u003c/b\u003e \u003c/small\u003e \u003c/center\u003e\u003c/div\u003e","tags":["codeforces::news","botan investment","интервью"]}}