{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399089350,"rating":-17,"authorHandle":"measu80","modificationTimeSeconds":1399089350,"id":12138,"title":"\u003cp\u003eGriffin 10 shots in the first\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003ePaul Curry steals the small Jordan buzzer tipped hit, scored the first 15 points, the Clippers 55-50 first half lead.Paul Curry whirlwind three-pointersCurry was Paul\u0027s first four steals, Jordan is followed by empty dunks scored 19 points, Griffin 10 shots in the first four fouls received, was benched, Jordan sent the 4th big hat, Teke Ge Lu Gang debut soon falls back, was carried back to the locker room. Jermaine O\u0027Neal dunks, rate Warriors patience to chase points, small empty dunks Jordan failed to recover in leaps anti-\u003ca href\u003d\"http://www.airfreeshoes.es/new-nike-air-presto-camo-c-79.html\"\u003ezapatillas nike air presto camo\u003c/a\u003e  capping attempted, fiercely fell to the ground, the Warriors gradually will be sent out to 4 points. David — Lee received a fifth foul, Andre Iguodala steals back dunks to make the score 65-67! Curry soared suddenly broke even five minutes, the Warriors ahead 1 point! Paul promptly answered with two three-pointers, the Clippers to 77-72 lead into the margins of the competition.Clippers triumph celebrate match pointClippers continued tight Curry, who even sent two assists, Griffin carom back feel, the two sides battle is heating up. Curry long shot again, none immediately answered with an ultra-long-range third, Griffin scored 16 points ,90-81! Paul Thompson foul beyond the arc made three free throws, the Clippers leading 10 points. Warriors intentionally Jordan consecutive fouls, sending the latter to the free throw line, a small penalty Jordan 6 4, Curry was steals appear first eight turnovers, setting a record single-game playoff career. Crawford counterattack layup wi will again steals the Warriors missed the opportunity to chase points, precarious. But Thompson hit the third drop in the bucket, Paul sent a critical moment 7 assists, Curry and David — Lee early end to give up the\u003c/p\u003e\u003cp\u003egame, the Clippers home Lectra opponents 3-2 lead celebrate match point. April 29 and before the Bobcats game, all the players gathered in Miami\u0027s ring off his T-shirt together, revealing anti-wear workout clothes to express their protest against racial discrimination and support Clippers player attitude. Stirling\u0027s son even stand up stance.Recently, the Los Angeles Clippers owner Sterling incidents involving racist remarks continuous fermentation, players, coaches and the media and even U.S. President Barack Obama, all of Stirling\u0027s remarks shocked. Although Sterling and his girlfriend\u0027s phone records were exposed in the process is very strange, does not rule out a \u0026quot;conspiracy theory\u0026quot; is possible, but the problem of racial discrimination in American society has always been taboo, untouchable in the NBA is also a restricted area. Stirling then evidence, now reduced to everyone \u003ca href\u003d\"http://www.airfreeshoes.es/nike-roshe-run-c-56.html\"\u003enike roshe run españa\u003c/a\u003e  shouting deserted situation can be described only themselves to blame.America\u0027s historical background and diverse social backgrounds, so that is very sensitive to the issue of racism. Under normal circumstances, everyone will avoid the word racist. Especially in public, called \u0026quot;Black people\u0026quot; is unlikely to be acceptable. Although the use of similar words in Stirling and his girlfriend\u0027s phone, but because of being public media, so it is transformed into a public event.\u0026quot;There have been a lot of sponsors, announced the end of the Clippers and related cooperation.\u0026quot; \u0026quot;Los Angeles Times,\u0026quot; the article said, \u0026quot;Los Angeles Mayor and NBA president of Silverstone have said, will make Stirling the most severe behavior punishment. Stirling recent days received a severe reprimand of the parties, and for the NBA, this is the most serious adverse events league in recent years occurred. \u0026quot;In the NBA, the league can talk nonsense boss, coaches can also dissatisfied with the referee, as long as you are willing to bear the high \u003c/p\u003e\u003cp\u003efines; between players can also punched another, as long as you are not afraid of being suspended; As such when the \u0026quot;Beast\u0026quot; Rohde Man, all sorts of bizarre behavior, the Union will not be interfered with. But everything premise is not detrimental to the public interest. This is why the referee 2004 Palace of Auburn Hills brawl (Metta World Peace beatings fans), and after the Donaghy gambling case, the cause of severe punishment by the league.But Stirling racial remarks, apparently broke the NBA can afford American society and the bottom line. \u0026quot;NBA is a very influential brand, Stirling behavior obviously biased, would certainly have a huge negative impact on NBA and injury.\u0026quot; \u0026quot;Los Angeles Times\u0026quot; commented.Stirling in 1981 to spend $ 12 million to acquire the team, along with Paul, Griffin and other star \u003ca href\u003d\"http://www.airfreeshoes.es/nike-free-run-2-c-26.html\"\u003enike free run 2 comprar\u003c/a\u003e players to join the Clippers values rise, before the \u0026quot;Fox\u0026quot; magazine about the valuation of its \u003cspan class\u003d\"tex-span\"\u003e575\u003ci\u003emillion\u003c/i\u003e, \u003ci\u003ebutifStirlingreallyreselltheteam\u003c/i\u003e, \u003ci\u003eaccordingtoU\u003c/i\u003e.\u003ci\u003eS\u003c/i\u003e.\u003ci\u003emediaprojections\u003c/i\u003e, \u003ci\u003eactualincomewillbemuchhigherthanthisestimate\u003c/i\u003e.\u003ci\u003eStirlingwillgofromhereAccordingtoNBAexistingprovisions\u003c/i\u003e, \u003ci\u003eeveniftheotherNBAteamownersunite\u003c/i\u003e, \u003ci\u003etheycannotbeforcedtosellSterlingClippers\u003c/i\u003e, \u003ci\u003ebuttheleaguecanbeattainedbyothermeans\u003c/i\u003e.\u0026quot;\u003ci\u003eAlliancewilltellStirling\u003c/i\u003e, \u003ci\u003eifyoucontinuetostay\u003c/i\u003e, \u003ci\u003ethenyouwillnothaveanypersonneldecisions\u003c/i\u003e, \u003ci\u003etheUnionwillnotallowyoutowatchthegame\u003c/i\u003e, \u003ci\u003eandthegeneralmanagerofcommunicationsandcontinuetosignplayers\u003c/i\u003e.\u0026quot;\u003ci\u003eFormerNBAconsultantAndrewTianjinBallyLancastersaidthisinaninterviewwithU\u003c/i\u003e.\u003ci\u003eS\u003c/i\u003e.\u003ci\u003emedia\u003c/i\u003e, \u0026quot;\u003ci\u003eIfyouchoosetoselltheteam\u003c/i\u003e, \u003ci\u003ethenyoucanget\u003c/i\u003e\u003c/span\u003e 700 million in revenue.\u0026quot;Rockets owner Leslie Alexander also for Silverstone advice, he suggested, the Clippers player\u003c/p\u003e\u003c/div\u003e","tags":[]}}