{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1480504326,"rating":0,"authorHandle":"armand","modificationTimeSeconds":1480504326,"id":48728,"title":"\u003cp\u003eArabella \u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eA. Relational Operator\u003c/p\u003e\u003cp\u003eՊահանջվում է համեմատության գործողություններ պարունակող արտահայտությունների ստուգումներ անել։ Առաջին տողում տրված է թեստերի T (1 ≤ T ≤ 128) քանակը։ Հաջորդ T տողերից յուրաքանչյուրը պարունակում է x op y տեսքի արտահայտություն, որտեղ x-ը և y-ը ամբողջ թվեր են (-100 ≤ x, y ≤ 100), իսկ op-ը հետևյալ վեց գործողություններից մեկն է. { !\u003d, \u003d\u003d, \u0026lt;, \u0026lt;\u003d, \u0026gt;, \u0026gt;\u003d }: Նկատենք, որ x-ը, op-ը և y-ը իրարից անջատված են բացակներով, ինչպես ցույց է տրված օրինակում։\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eB. Three Angles\u003c/strong\u003e **** Հնարավո՞ր է արդյոք տրված երեք անկյուններով եռանկյուն կազմել, որի մակերեսը լինի դրական։ Տրված է T թեստերի քանակը։ Ապա T տողերից յուրաքանչյուրում տրված է երեք թիվ։ Պետք է արտածել YES, եթե դրական մեկերեսով եռանկյուն հնարավոր է կառուցել։ Հակառակ դեպքում պետք է արտածել NO բառը։\u003c/p\u003e\u003cp\u003eC. Memory is Full Ջամալի հեռախոսն ունի k մեգաբայթ հիշողություն։ Նա ուզում է տեղարդել m Մբ չափով ծրագիր։ Բայց ազատ հիշողությունը չի բավականացնում։ Պետք է ինչ-որ ծրագրեր հանել, որ տեղ ազատվի։ Հանված ծրագրերի քանակը պետք է մինիմալ լինի։\u003c/p\u003e\u003cp\u003eՄուտքը Առաջին տողում տրված է T թեստերի քանակը։ Յուրաքանչյուր թեստ սկզբում տրված են k, m, n թվերը։ Հաջորդ տողում տրված են n թվեր՝ իրարից անջատված բացակներով։\u003c/p\u003e\u003cp\u003eԵլքը Պետք է արտածել ծրագրերի մինիմալ քանակը, որոնք պետք է հանել։\u003c/p\u003e\u003cp\u003eD. Sudoku  Տրված է 9x9 չափի թվանշանների մատրից։ Հարկավոր է տպել Valid բառը, եթե մատրիցը Սուդոկուի պայմաններին բավարարում է։ Հակառակ դեպքում պետք է տպել Invalid բառը։ Որպեսզի մատրիցը բավարարի Սուդոկուի պայմաններին, պետք է յուրաքանչյուր տողում, յուրաքանչյուր սյունում և յուրաքանչյուր 3x3 չափի հիմնական ենթամատրիցում (նկարում դրանք առնված են թավ գծերով շրաջանակների մեջ) 1-ից 9 թվերը հանդիպեն յուրաքանչյուրը ճիշտ մեկ անգամ։ Մուտքում սկզբում տրված է թեստերի T քանակը։ Յուրաքանչյուր թեստ իրենից ներկայացնում է 9 տող։ Ամեն տողու կա 9 թվանշան։ Պրոբելներ չկան։ Իրար հաջորդող թեստերի միջև դատարկ տող կա։\u003c/p\u003e\u003cp\u003eE. Time Limit Exceeded? Տրված են n ամբողջ թվեր։ Հարկավոր է հաշվել այն թվազույգերի քանակը, որոնց տարբերությունը բացարձակ արժեքով չի գերազանցում 32-ը։\u003c/p\u003e\u003cp\u003eՄուտքը Առաջին տողում տրված է T թեստերի քանակը։ Յուրաքանչյուր թեստի առաջին տողում տրված է n-ը (1 \u0026lt;\u003d n \u0026lt;\u003d 10000): Հաջորդ տողում տրված են n հատ V[i] ամբողջ թվեր (1 ≤ V[i] ≤ 10,000)։\u003c/p\u003e\u003cp\u003eԵլքը Յուրաքանչյուր թեստի համար առանձին տողոււմ պետք է տպել պահանջվող քանակը։\u003c/p\u003e\u003cp\u003eF. Palindrome Տողը կոչվում է պալինդրոմ, եթե աջից ձախ և ձախից աջ նույն կերպ է կարդացվում։ Տրված է անգլերեն փոքրատառերից և ? նշաններից կազմված տող։ Տրված են նաև m սահմանափակումներ։ Հարկավոր է հաշվել, թե քանի եղանակով է հնարավոր ? սիմվոլները փոխարինել անգլերեն փոքրատառերով այնպես, որ տողը լինի պալինդրոմ և բավարարի սահմանափակումներին։ Սահմանափակումներն իրենցից ներկայացնում են թվազույգեր։ Նշանակում է նշված տեղերում պետք է նույն տառերը լինեն։\u003c/p\u003e\u003cp\u003eՄուտքը Առաջին տողում տրված է թեստերի T քանակը։ Յուրաքանչյուր թեստի սկզբում տրված է տողի n երկարությունը և սահմանափակումների m քանակը։ Հաջորդ տողում տրված են n հատ սիմվոլներ։ Հաջորդ m տողերից յուրաքանչյուրում տրված է մեկ (x,y) թվազույգ (1 \u0026lt;\u003d x \u0026lt; y \u0026lt;\u003d n)։ Թեստերն իրարից անջատված են դատարկ տողով։\u003c/p\u003e\u003cp\u003eԵլքը Յուրաքանչյուր թեստի համար պետք է արտածել եղանակների քանակը 1,000,000,007 թվի վրա բաժանելուց ստացված մնացորդը։\u003c/p\u003e\u003cp\u003eG. Training Camp Մոնթասերը օլիմպիադայն պատրաստվելու համար նախատեսել է պարապել n թեմա n օրում՝ ամեն օր մեկ թեմա։ Բայց նա գիտի, որ կան թեմաներ, որ կախված են ուրիշ թեմաներից։ Դրա համար նա դիմել է իր մարզիչին, ով տվել է իրեն m սահմանափակումների հաջորդականություն, որտեղ նշված է, թե որ թեման որից պետք է առաջ լինի։ Մարզիչը նաև ասել է Մոնթասերին, որ եթե նա x թեման սովորի k-րդ օրը, ապա նրա մակարդակը կավելանա k*Wx-ով, որտեղ Wx-ը x թեմայի քաշն է և ցույց է տալիս թեմայի բարդությունը։ Տրված են թեմաների ցուցակը, նրանց կշիռները, սահմանափակումների ցուցակը։ Հարկավոր է գրել ծրագիր պարզելու համար, թե n օրվա ընթացքում Մոնթասերը առավելագույնը ինչ մակարդակի կարող է հասնել։\u003c/p\u003e\u003cp\u003eՄուտքը Առաջին տողում տրված է թեստերի T քանակը։ Յուրաքանչյուր թեստի առաջին տողում տրված են n և m ամբողջ թվերը։ Հաջորդ n տողերից յուրաքանչյուրը պարունակում է հերթական թեմայի անունը և կշիռը։ Հաջորդ m տողերից յուրաքանչյուրն ունի Թեմա1 --\u0026gt; Թեմա2 տեսք, ինչը նշանակում է, որ Թեմա1-ը պետք է Թեմա2-ից շուտ սովորել։ Թեմաների վերնագրերը պարունակում են միայն անգլերեն տառեր և պրոբելներ (ոչ ավելի, քան 40 սիմվոլ)։ Երկու հաջորդող թեստեր իրարից անջատված են մեկ դատարկ տողով։\u003c/p\u003e\u003cp\u003eԵլքը Յուրաքանչյուր թեստի համար առանձին տողում պետք է մեկ թիվ տպել՝ առավելագույն մակարդակը, որին կարող է հասնել Մոնթասերը։\u003c/p\u003e\u003cp\u003eH. Capital City Բայթլանդիայի նախագահը ցանկանում է լավացնել երկրի ճանապարհների ցանցը։ Եթե երկու քաղաք խիստ կապակցված են, մարդիկ կարող են օգտվել BFS (Bahosain\u0027s Fast Service) ծառայությունից և այդ քաղաքներից մեկից մյուսը գնալ առանց ժամանակ կորցնելու։ Հակառակ դեպքում նրանք պետք է գնան այդ քաղաքները միացնող կարճագույն ճանապարհներից մեկով, և, իհարկե, նրանք կարող են օգտվել BFS-ից երբ ցանկանան։ Երկու քաղաք կապակցված են, եթե այդ քաղաքներն իրար միացնող ճանապարհ գոյություն ունի։ Երկու քաղաք կոչվում են խիստ կապակցված, եթե ցանկացած կող հեռացնելու դեպքում նրանք մնում են կապակցված։ Երկրի նախագահը ցանկանում է, որ ցանկացած քաղաքից մայրաքաղաք տանող ճանապարհներից մաքսիմումը մինիմալ լինի։ Կարո՞ղ եք օգնել նախագահին մայրաքաղաքի ընտրության հարցում։\u003c/p\u003e\u003cp\u003eՄուտքը Առաջին տողում տրված է T թեստերի քանակը։ Յուրաքանչյուր թեստի առաջին տողում տրված են քաղաքների n քանակը և ճանապարհների m քանակը։ Հաջորդ m տողերից յուրաքանչյուրը պարունակում է երեք a, b, c թվեր։ Նշանակում է a և b քաղաքները միացված են c երկարության ճանապարհով։ Յուրաքանչյուր քաղաքից յուրաքանչյուր քաղաք տանող ճանապարհ կա։\u003c/p\u003e\u003cp\u003eԵլք Պետք է արտածել մայրաքաղաքի համարը և մյուս քաղաքներից մայրաքաղաք հասնելու մինիմալ ճանապարհներից մաքսիմալի երկարությունը։ Եթե մի քանի մայրաքաղաք կարող լինել, հարկավոր է արտածել նրանցից մինիմալի համարը։\u003c/p\u003e\u003c/div\u003e","tags":[]}}