{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1522910203,"rating":239,"authorHandle":"fcspartakm","modificationTimeSeconds":1522934757,"id":58737,"title":"\u003cp\u003eCodeforces and Polygon Improvements (February — April 2018)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces.\u003c/p\u003e\u003cp\u003eIn this post we want to talk about the Codeforces and Polygon improvements, which were implemented recently.\u003c/p\u003e\u003ch4\u003eBlogs (Codeforces)\u003c/h4\u003e\u003cp\u003ePreviously, Codeforces blog posts can either be published together with the translation, or both versions can be hidden in drafts. Now a blog post can be published or hidden in drafts separately from its translation. In case there is a published post, and its translation is hidden in drafts, or in the opposite case, you will see a corresponding warning about that. Also the logic of the Recent Actions was completely revised.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/7f/5b/7f5bf02ae1b37e260f7b30dbd9ffa90519d17a62.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch4\u003eTalks (Codeforces)\u003c/h4\u003e\u003cp\u003eAlso added a new functional in the Talks. For some users, it was inconvenient if a talk with one person contains a lot of messages. The page Dialogues has been implemented. It contains all the dialogs, sorted by the time of the last message. For each dialog, only one row with the last message is shown. When you click the message the talk with this person will open. When you open talk with the person, all messages sent to you by the corresponding person automatically become read. The old-style talks page is also fully preserved. \u003cbr /\u003e\u003c/p\u003e\u003ch4\u003eMathJax (Polygon + Codeforces)\u003c/h4\u003e\u003cp\u003eNow to render statements and tutorials in Codeforces MathJax can be used. To use it, enable the corresponding option in the tab Statements. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/c1/c2/c1c2c8527df3542ada30abe998a57de9c9935d6b.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eInformation MathJax usage stores in a problem package and Codeforces will show statements and tutorials according to this option.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/99/08/9908089bd70ae5fff336a8477cee164236df4b87.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eIf MathJax significantly improves the rendering of formulas in statements and tutorials, we will implement this way of rendering formulas in blogs/comments.\u003c/p\u003e\u003ch4\u003eAdd problems from contest and to contest (Polygon)\u003c/h4\u003e\u003cp\u003eIn Polygon was implemented the possibility of add a problem to the contest from the General Information page for the corresponding problem. To do this, specify the UID of the contest in which you want to add this problem.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/2d/c4/2dc41963832c0c9eb9473d0732230a24b96f5eb0.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eOn the contest problems page was implemented the option to add problems from this contest to other contest. \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/fe/6a/fe6a228457b7d09cac77738da5a8eb2de9b3cc44.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eTo do this, we need to choose which problems we want to add to another contest, and also specify the UID of this contest.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/fc/7c/fc7c6a4e9c5dd729f6dc6144f9e634aca79206f6.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch4\u003eOther (Polygon)\u003c/h4\u003e\u003cp\u003eIn addition to the described improvements, in Polygon was implemented other changes, such as:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eshow checker source code on Review page;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eadd Issues to the whole contest;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eadd to favorites not only problems, but also contest;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003enow you can assign all Issues to a certain user who is a Contest manager or who has access to the problem.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThank you for your attention, good luck!\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","polygon"]}}