{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1489391891,"rating":71,"authorHandle":"MiptLited","modificationTimeSeconds":1489992031,"id":50950,"title":"\u003cp\u003eMoscow Pre-Finals ACM ICPC Workshop in April, 2017 \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch2\u003eHello, Codeforces!\u003c/h2\u003e\u003ch1\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/3a/d2/3ad2836c903299687787e43fe4592fb207ef66f3.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/h1\u003e\u003cp\u003eIn the lead-up to the ACM-ICPC World Finals we invite everyone to participate in \u003cstrong\u003eMoscow Pre-Finals ACM ICPC Workshop\u003c/strong\u003e, that will be held \u003cstrong\u003e10-17 of April 2017\u003c/strong\u003e at the campus of the Moscow Institute of Physics and Technology ( MIPT). The event is organized by one of the leading Russian universities, MIPT and ITMO.\u003c/p\u003e\u003cp\u003eThe Moscow Pre-Finals ACM ICPC Workshop is the unique event in the world of competitive programming. Every year teams from 20 different countries from Europe, Asia and the USA meet at one platform. Many teams participated in this Workshop turn out to be the prize-winners and winners of the the ACM-ICPC World Finals. In 2016 8 out of 13 teams that were awarded medals at the Finals took part in the Moscow Pre-Finals Workshop ACM ICPC at MIPT. \u003c/p\u003e\u003cp\u003eThis year the organisators have made possible \u003cstrong\u003ethe remote participation\u003c/strong\u003e which includes: 2 consultations (1,5 hour each); access to the contests; access to the contest-analysis; electronic certificate for the team; the lower price: the cost for one teams is 1300$. If you want to participate remotely or you have any questions, write here: \u003ca href\u003d\"mailto:acm@phystech.edu\"\u003eacm@phystech.edu\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe Workshop is going to be held in accordance with the two divisions scheme. We invite finalists to participate in the first division (Div.A) and other teams who want to train before the next season in the second division (Div.B). The official language is English.\u003c/p\u003e\u003cp\u003eThe participation cost for one person is $590. The cost includes the full curriculum, food and accommodation at the MIPT campus, as well as the sports and sightseeing schedules on days-off. Registration is \u003ca href\u003d\"https://docs.google.com/forms/d/e/1FAIpQLSeIjM5SSLuzli2xCKXe39rCv2stV6i6o_bLBAwLKw150Y7oPQ/viewform\"\u003ehere\u003c/a\u003e\u003c/p\u003e\u003cp\u003eAlso, before the Workshops, we invite \u003cstrong\u003ethe teams of division B\u003c/strong\u003e to participate for free in the \u003ca href\u003d\"https://contest.yandex.ru/mipt17spring/contest/4164/enter/\"\u003econtest\u003c/a\u003e, which gives you \u003cstrong\u003ethe discount on participation\u003c/strong\u003e in Moscow Pre-Finals ACM ICPC Workshop! (1st place — 50% ; 2nd place — 30%; 3d place — 20%)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e Thanks to all the participants and our congratulations to the winners!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e1\u003c/strong\u003e Samara U 2 \u003c/p\u003e\u003cp\u003e\u003cstrong\u003e2\u003c/strong\u003e Lords of (the) Homeless \u003c/p\u003e\u003cp\u003e\u003cstrong\u003e3\u003c/strong\u003e Daddys \u003c/p\u003e\u003c/div\u003e","tags":["#contest","mipt","bootcamp","moscow"]}}