{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1466524761,"rating":154,"authorHandle":"unprost","modificationTimeSeconds":1466526494,"id":45580,"title":"\u003cp\u003eRating expectations and a little bit of statistics\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eRating subject is a quite popular one on the CodeForces, and the last few discussions I saw where about — if you can\u0027t go up to Div.1 after a year of competing here, you need to drop this occupation. \u003c/p\u003e\u003cp\u003eIn a year you can spend just about 10 hours on trainings, or even more than 800 hours, so measuring your results in this way is not a deal. That\u0027s why I want to suggest another shitty method of measuring the results — statistical expectation of your rating basing on the number of rated contests you competed. Calculations where made for Active users (last 6 months) and all the users ever competed here.\u003c/p\u003e\u003cp\u003eTable number one (blue line — contests, numbers — expected rating):\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/f2/3e/f23efbf2050d03829bec655cc043f55e963cf079.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eYou can mention, that active users have a higher value of expected rating. This can be caused by rating inflation, or by the fact, that active users have better results, and those who had worse ones just dropped this activity\u003c/p\u003e\u003cp\u003eTable number two (rating and number of contests, necessary to achieve it):\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/6c/cc/6cccb84065d69cc7640686c18f296a7867bf1dc6.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eSomewhere near 2000 rating points there is a tendency change, where number of contests is not playing a significant role anymore. I can confirm this from my own experience — it\u0027s about rating you can gain, mostly knowing nothing about algorithms, without regular solving problems archives — just competing and competing\u003c/p\u003e\u003cp\u003eTable number three (rating by number of contests):\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/3d/60/3d60223697fe1d178dba914e57e3f7b7cd96b3ec.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["rating","expectation","statistics","tag"]}}