{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1483283097,"rating":164,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1484245183,"id":49482,"title":"\u003cp\u003e8VC Venture Cup 2017 Announcement\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/8vc/8vc-venturecup-logo.png\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHello Codeforces!\u003c/p\u003e\u003cp\u003eI\u0027m pleased to announce the first championship hosted on the Codeforces platform. Welcome \u003cb\u003e8VC Venture Cup 2017\u003c/b\u003e!\u003c/p\u003e\u003cp\u003e8VC will be hosting a coding championship on Codeforces. The championship will begin on January 15 and take place in 2 rounds.\u003c/p\u003e\u003cp\u003eThe contest will occur in two rounds:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eThe Elimination Round is online and takes place on \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?day\u003d15\u0026amp;month\u003d1\u0026amp;year\u003d2017\u0026amp;hour\u003d20\u0026amp;min\u003d05\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003eJanuary 15, 17:05 (UTC)\u003c/a\u003e.  Elimination Round follows regular Codeforces rules and consists of 7-8 problems. For this round, the complexity  of the problems will be comparable to a regular Codeforces round. There are no eligibility restrictions to participate in the round.\u003c/li\u003e   \u003cli\u003eThe Final Round takes place on January 22, consists of 5-6 problems, and uses regular Codeforces rules. The complexity of the problems  is higher than a regular Codeforces round. We will invite the top local finishers in Elimination Round to Woodside, CA to compete in the Final Round.  In addition, we will invite the top 200 overall finishers to compete online.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eCool prizes are offered to winners and best participants.\u003c/p\u003e\u003ch5\u003ePRIZES\u003c/h5\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003eOverall 1st place — $2000\u003c/strong\u003e\u003c/li\u003e   \u003cli\u003eOverall 2nd place — $1000\u003c/li\u003e   \u003cli\u003eOverall 3rd-5th places — $500 each\u003c/li\u003e   \u003cli\u003eOverall 1-50th place — t-shirts with 8VC and company logos\u003c/li\u003e   \u003cli\u003eLocal Winner — Dinner with Joe Lonsdale (founder of Palantir, Addepar and 8VC) and other Silicon Valley technologists\u003c/li\u003e   \u003cli\u003eLocal top finishers — Opportunity to meet with leadership from 8VC portfolio companies\u003c/li\u003e \u003c/ul\u003e\u003ch5\u003eABOUT 8VC\u003c/h5\u003e\u003cp\u003e\u003ca href\u003d\"http://eight.vc/\"\u003e8VC\u003c/a\u003e, which consists of Joe Lonsdale (co-founder of Palantir) and his core team from Formation | 8, is a Silicon Valley venture capital firm that invests in industry-transforming technology companies. The team\u0027s investment portfolio includes companies such as the selected companies below, and a host of other top technology platforms that leverage modern algorithms and data science to power their core business processes.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e \u003c/p\u003e\u003ccenter\u003e \u003ca href\u003d\"//codeforces.com/8vc/apply\" style\u003d\"font-size: 20.0px;color: white;text-decoration: none;background-color: rgb(101,1,204);padding: 1.0em 1.5em;margin: 2.0em;\"\u003eConnect to 8VC\u003c/a\u003e \u003c/center\u003e \u003cbr /\u003e  \u003ch5\u003e8VC FEATURED COMPANIES WITH OPEN POSITIONS\u003c/h5\u003e\u003cp\u003e\u003ca href\u003d\"https://www.addepar.com/\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/8vc/addepar-y.png?y\" style\u003d\"width: 100.0px;float: left;margin: 6.0px 1.0em 0 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003c/p\u003e\u003cdiv style\u003d\"margin: 0 100.0px 30.0px 200.0px;\"\u003e \u003cspan style\u003d\"font-size: 13.0px;\"\u003e \u003ca href\u003d\"https://www.addepar.com/\"\u003eAddepar\u003c/a\u003e is building a technology platform to transform the global world of finance. Addepar automates the aggregation of diverse financial datasets, and is built on a distributed calculation engine that allows advisers to perform complex, on-the-fly calculations. A best-in-class ember-based front end makes it easy to analyze complex portfolios, and a sophisticated report builder and client portal allow advisers to provide unparalleled transparency to their clients. Addepar\u0027s platform is poised to transform the financial industry by creating new standards for efficiency and transparency in portfolio analysis. \u003c/span\u003e \u003c/div\u003e\u003cp\u003e\u003ca href\u003d\"https://www.zenreach.com/\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/8vc/zenreach-y.png?y\" style\u003d\"width: 100.0px;float: left;margin: 6.0px 1.0em 0 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003c/p\u003e\u003cdiv style\u003d\"margin: 0 100.0px 30.0px 200.0px;\"\u003e \u003cspan style\u003d\"font-size: 13.0px;\"\u003e \u003ca href\u003d\"https://www.zenreach.com/\"\u003eZenreach\u003c/a\u003e is the marketing platform for o\u0026#x1d;ine businesses. Zenreach works with the top restaurants, bars/nightclubs, arenas and retailers in every city across the US to seamlessly build their customer lists, run segmented and segmented automated marketing campaigns, and provide real insight into whether customers return after receiving a message — calculating what we call, a \u0027walk-through rate.\u0027 \u003c/span\u003e \u003c/div\u003e\u003cp\u003e\u003ca href\u003d\"https://www.buildzoom.com/\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/8vc/buildzoom-y.png?y\" style\u003d\"width: 100.0px;float: left;margin: 6.0px 1.0em 0 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003c/p\u003e\u003cdiv style\u003d\"margin: 0 100.0px 30.0px 200.0px;\"\u003e \u003cspan style\u003d\"font-size: 13.0px;\"\u003e \u003ca href\u003d\"https://www.buildzoom.com/\"\u003eBuildZoom\u003c/a\u003e helps you find the perfect contractor for your construction or remodeling project. For example, if you let us help with your kitchen remodeling project, our matching algorithm will analyze the licenses, consumer reviews, and prior experience of three million contractors to identify the ones most suited to work on your kitchen. Over a billion dollars in construction projects come through BuildZoom per year. \u003c/span\u003e \u003c/div\u003e\u003cp\u003e\u003ca href\u003d\"https://loaddocs.co/\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/8vc/loaddocs-y.png?y\" style\u003d\"width: 100.0px;float: left;margin: 6.0px 1.0em 0 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003c/p\u003e\u003cdiv style\u003d\"margin: 0 100.0px 30.0px 200.0px;\"\u003e \u003cspan style\u003d\"font-size: 13.0px;\"\u003e \u003ca href\u003d\"https://loaddocs.co/\"\u003eLoadDocs\u003c/a\u003e: Founded by early executives of Addepar including the former VP of Engineering and the former Director of Design, LoadDocs is building a modern operating system for an industry that has been long underserved by technology: trucking. We live in an on-demand world where just-in-time shipping is the norm and not the exception. In order to compete, logistics companies need a platform that provides them real-time visibility of their operations and can facilitate communication with their often remote and distributed workforce. \u003c/span\u003e \u003c/div\u003e\u003cp\u003e\u003ca href\u003d\"http://opengov.com/\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/8vc/opengov-y.png?y\" style\u003d\"width: 100.0px;float: left;margin: 6.0px 1.0em 0 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003c/p\u003e\u003cdiv style\u003d\"margin: 0 100.0px 30.0px 200.0px;\"\u003e \u003cspan style\u003d\"font-size: 13.0px;\"\u003e \u003ca href\u003d\"http://opengov.com/\"\u003eOpenGov\u003c/a\u003e transforms the way the world analyzes and allocates public money. With more than 1300 government customers in the rapidly expanding OpenGov Network™, OpenGov’s Smart Government Platform™ is the world’s first integrated cloud solution for public sector budgeting, reporting, and open data. The OpenGov platform transforms government financial data into intuitive, interactive visualizations for both internal government users and citizens. \u003c/span\u003e \u003c/div\u003e\u003cp\u003e\u003ca href\u003d\"https://www.qualia.com/\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/8vc/qualia-y.png?y\" style\u003d\"width: 100.0px;float: left;margin: 6.0px 1.0em 0 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003c/p\u003e\u003cdiv style\u003d\"margin: 0 100.0px 30.0px 200.0px;\"\u003e \u003cspan style\u003d\"font-size: 13.0px;\"\u003e \u003ca href\u003d\"https://www.qualia.com/\"\u003eQualia\u003c/a\u003e is a leading provider of software to the title insurance industry. Modern title and closing software to save you time and money.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/span\u003e \u003c/div\u003e\u003cp\u003e\u003ca href\u003d\"https://www.qualia.com/\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/8vc/illumio-y.png?y\" style\u003d\"width: 100.0px;float: left;margin: 6.0px 1.0em 0 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003c/p\u003e\u003cdiv style\u003d\"margin: 0 100.0px 30.0px 200.0px;\"\u003e \u003cspan style\u003d\"font-size: 13.0px;\"\u003e \u003ca href\u003d\"https://www.illumio.com/\"\u003eIllumio\u003c/a\u003e delivers adaptive security for every computing environment, protecting the 80 percent of data center and cloud tra\u0026#x1e;c missed by the perimeter. The company’s Adaptive Security Platform ™ visualizes application tra\u0026#x1e;c and delivers continuous, scalable, and dynamic policy and enforcement to every bare-metal server, VM, container, and VDI within data centers and public clouds. Using Illumio, enterprises such as Morgan Stanley, Plantronics, NTT, King Entertainment, NetSuite, and Creative Artists Agency have achieved secure application and cloud migration, environmental segmentation, compliance, and high-value application protection from breaches and threats with no changes to applications or infrastructure. \u003c/span\u003e \u003c/div\u003e\u003cp\u003e\u003ca href\u003d\"http://getshowroom.co/\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/8vc/showroom-y.png?y\" style\u003d\"width: 100.0px;float: left;margin: 6.0px 1.0em 0 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003c/p\u003e\u003cdiv style\u003d\"margin: 0 100.0px 30.0px 200.0px;\"\u003e \u003cspan style\u003d\"font-size: 13.0px;\"\u003e \u003ca href\u003d\"http://getshowroom.co/\"\u003eShowroom\u003c/a\u003e is the first truly modern furniture company, using best-in-class distribution software to super-charge the custom furniture business. In just 12 months since launch, we\u0027ve become the largest custom furniture maker in the world, solving bleeding edge problems in logistics, physical craftsmanship and software in the process. We\u0027re looking for curious engineers who are excited about reinventing one of the oldest industries on earth to join our team. \u003c/span\u003e \u003c/div\u003e\u003cp\u003eIf you’re interested in job opportunities with these companies or others in the 8VC portfolio, \u003cb\u003e\u003ca href\u003d\"//codeforces.com/8vc/apply\"\u003econtact us\u003c/a\u003e\u003c/b\u003e!\u003c/p\u003e\u003cp\u003eGood luck!\u003c/p\u003e\u003c/div\u003e","tags":["8vc","8vc venture cup","venture cup","2017"]}}