{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1413659377,"rating":5,"authorHandle":"kostya_by","modificationTimeSeconds":1413659407,"id":14334,"title":"\u003cp\u003eШестая неделя. Упражнения.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПо доброй традиции дублирую новое письмо здесь.\u003c/p\u003e \u003chr /\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eВчера была замечательная лекция по геометрии, а сегодня я скидываю вам список задач.\u003c/p\u003e\u003cp\u003eНо сперва я вам напомню, что полный список задач можно получить здесь: \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://docs.google.com/document/d/1cHQGm3TcsdnTsPWRLejr2oSWb7JMAm6TKQiSZNOi28g/edit\"\u003ehttps://docs.google.com/document/d/1cHQGm3TcsdnTsPWRLejr2oSWb7JMAm6TKQiSZNOi28g/edit\u003c/a\u003e\u003c/p\u003e\u003cp\u003eHidden-задача, которая была на прошлой неделе, уже находится в этом списке под своим настоящий именем — это \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/gym/100093\"\u003ehttp://codeforces.com/gym/100093\u003c/a\u003e, задача “Разреженные Таблицы”\u003c/p\u003e\u003cp\u003eНовые задачи(кроме очередных hidden) вы также сможете найти в этом полном списке задач.\u003c/p\u003e\u003cp\u003eИтак, новые задачи:\u003c/p\u003e\u003cp\u003eУпражнения:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e1. *hidden* \n2. *hidden*\n3. http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1444\n4. Республиканская олимпиада 2004, задача “Метеоритный дождь\u0026quot;\n5. http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1990\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eГробы:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e1. http://www.codechef.com/COOK48/problems/RRTREE2\n2. http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1447\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eЗадачу с республиканской олимпиады, как всегда, советую вам сдавать на dl.gsu.by(ибо это единственное место, где это можно сделать).\u003c/p\u003e\u003cp\u003eЯ очень рад, что в последние недели многие из вас включились в работу. Каждое ваше письмо прочитано, каждый ваш скриншот обработан, каждый ваш АС обрадовал. Да, может быть не все идет как по маслу, но я рад, что очень многие пытаются решать задачи, которые заставляют вас напрячься. Продолжайте работать, не останавливайтесь. Да, пусть вы сдадите только 10% из предложенных мной задач, но для вас это будет напряжное усилие и вы от этого получите много пользы.\u003c/p\u003e\u003cp\u003eКак всегда, меня можно спрашивать о чем угодно на лекциях по пятницам, можно писать мне письма с вопросами на почту(\u003ca\u003ekostya.sokol.by@gmail.com)\u003c/a\u003e, а еще можно добавиться в мой скайп(kostya-by) и спросить меня там. \u003c/p\u003e\u003cp\u003eУдачно порешать!\u003c/p\u003e\u003cp\u003ePS. \u003c/p\u003e\u003cp\u003eЯ тут слышал, что у вас в следующую пятницу визитки. Стоит ли мне приходить и проводить занятие? Напишите мне письмо и скажите мне, что вы думаете по этому поводу.\u003c/p\u003e\u003cp\u003eНикакого давления, выбор за вами. \u003c/p\u003e\u003cp\u003eДаже если вы пойдете на визитки вместо моего занятия, то вы ничего нового не упустите, ибо я скорее всего просто расскажу что-нибудь старое(если вообще такое занятие будет). Так что если хотите сходить на визитки — я не против, я даже за. Отдыхать тоже нужно, тем более визитки у вас будут всего два раза в жизни, а моих занятий — еще много. :)\u003c/p\u003e\u003cp\u003eКонстантин Сокол.\u003c/p\u003e\u003c/div\u003e","tags":["лицей бгу","упражнения"]}}