{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1465699924,"rating":10,"authorHandle":"PraveenDhinwa","modificationTimeSeconds":1465699924,"id":45375,"title":"\u003cp\u003eInvitation For CodeChef SnackDown 2016 Pre-Elimination Round B\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi All !!\u003c/p\u003e\u003cp\u003eCongratulations to all those who have cleared the \u003ca href\u003d\"https://www.codechef.com/SNCKPA16\"\u003eSnackDown 2016 Pre-Elimination Round A\u003c/a\u003e and advanced to the SnackDown Elimination. For those who couldn’t compete/clear Pre-Elimination Round A, here is your chance to make it to the Elimination Round through \u003ca href\u003d\"https://www.codechef.com/SNCKPB16\"\u003ePre-Elimination Round B\u003c/a\u003e. The ranking criteria for this contest will be \u003ca href\u003d\"https://www.codechef.com/rankings#ScoreBasedRanklist\"\u003escore based\u003c/a\u003e. And, top 1000 teams (other than top 1000, the teams solving problems same number of problems equal to 1000th team) will advance to the elimination round.\u003c/p\u003e\u003cp\u003eThe CodeChef \u003ca href\u003d\"https://www.codechef.com/SNCKPB16\"\u003eSnackDown 2016 Pre-Elimination Round B\u003c/a\u003e begins tomorrow i.e \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dSnackDown16+Online+Pre-Elimination+Round-B\u0026amp;iso\u003d20160612T21\u0026amp;p1\u003d44\"\u003eat 9 PM IST, 12th June\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eNote: Those who have already made it to the SnackDown Elimination will not be allowed to take part in this contest.\u003c/p\u003e\u003cp\u003eThe problems have been set and tested by \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/kevinsogo\" title\u003d\"International master kevinsogo\"\u003ekevinsogo\u003c/a\u003e (Kevin Charles Atienza), \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Antoniuk\" title\u003d\"Candidate Master Antoniuk\"\u003eAntoniuk\u003c/a\u003e (Vasya Antoniuk), \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Cherrytree\" title\u003d\"Master Cherrytree\"\u003eCherrytree\u003c/a\u003e (Sergey Kulik) and the translations are written by \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/huzecong\" title\u003d\"International master huzecong\"\u003ehuzecong\u003c/a\u003e (Hu Zecong), \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Antoniuk\" title\u003d\"Candidate Master Antoniuk\"\u003eAntoniuk\u003c/a\u003e (Vasya Antoniuk), VNOI Team, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Cherrytree\" title\u003d\"Master Cherrytree\"\u003eCherrytree\u003c/a\u003e (Sergey Kulik), with \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/PraveenDhinwa\" title\u003d\"Expert PraveenDhinwa\"\u003ePraveenDhinwa\u003c/a\u003e (Praveen Dhinwa) as contest admin. I hope you will enjoy solving the problems. Please feel free to give your feedback about the problems in comments below.\u003c/p\u003e \u003cul\u003e   \u003cli\u003eFurthermore, this year, \u003cstrong\u003eCodeChef will be inviting 52 team’s (top 25 global + top 25 Indian + all Girl team + Indian school team) for the onsite finals\u003c/strong\u003e. Of these 52 teams, 32 teams (top 15 each Global \u0026amp; Indian + Girl + Indian school team) will get an all expense paid trip to India, while the remaining 20 teams will be provided with accommodation and local travel in India. However, if any of these 20 teams win the competition, their travel fair will be reimbursed as well. It’s a win-win situation.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eAlong with the cash prizes for Global Winners, there are special prizes for Best School Team, Best Girls team and Best Indian Team (the total cash prizes are worth $22,500). \u003c/p\u003e \u003cul\u003e   \u003cli\u003eThe winning team shall win a whooping cash prize of $10,000.\u003c/li\u003e   \u003cli\u003eAlso, taking into consideration the previous discussions regarding the timing of online elimination round of the contest, the organizers have decided to reschedule the round.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eThe new timings for the SnackDown 2016 Elimination Round are:\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e   \u003cli\u003eTime: \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dSnackDown16+Online+Elimination\u0026amp;iso\u003d20160619T1930\u0026amp;p1\u003d44\u0026amp;ah\u003d5\"\u003e19th June 2016, 7:30 pm to 12:30 am 20th June 2016 IST\u003c/a\u003e.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIn order to accommodate the new timings, they have also rescheduled the \u003ca href\u003d\"https://www.codechef.com/COOK71\"\u003eJune Cook-Off 2016\u003c/a\u003e. And the new timings for the June Cook-Off are:\u003c/p\u003e\u003cp\u003eDate \u0026amp; Time: \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dCodeChef%3A+June+Cook-Off+2016\u0026amp;iso\u003d20160626T2130\u0026amp;p1\u003d44\u0026amp;ah\u003d2\u0026amp;am\u003d30\"\u003e26th June 2016, 21:30 Hrs IST to 00:00 Hrs IST\u003c/a\u003e\u003c/p\u003e\u003cp\u003eI hope you like the new timings and that will enjoy the contest till the very end. That will be all from my side for now. See you all at the contest.\u003c/p\u003e\u003cp\u003eRegards,\u003cbr /\u003ePraveen Dhinwa\u003c/p\u003e\u003c/div\u003e","tags":[]}}