{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1517819160,"rating":79,"authorHandle":"savinova","modificationTimeSeconds":1517820119,"id":57555,"title":"\u003cp\u003eОтчет о деятельности Botan Investments за январь. Снижение порога входа в спортивное программирование.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003eВ январе в грантовой программе фонда Виктора Шабурова \u003cstrong\u003eBotan Investments\u003c/strong\u003e приняли участие 14 вузов. Больше всего студентов — 19 человек — удалось привлечь к тренировкам в УрФУ (Екатеринбург). Больше всего тренировок провели в СибГУТИ (Новосибирск), МГУ (Саранск) и УрФУ (Екатеринбург).\u003c/p\u003e\u003cp\u003eВ этом месяце фонд выступил спонсором сборов в Петрозаводске, которые проходят с 30 января по 9 февраля, а также помог командам из Владивостока, Казани и Екатеринбурга с поездкой на сборы. Напоминаю также о \u003ca href\u003d\"//codeforces.com/blog/entry/56343\"\u003eновой грантовой программе\u003c/a\u003e от \u003cstrong\u003eBotan Investments\u003c/strong\u003e в области Machine Learning. Первые участники уже приступили к работе, прием заявок будет продолжаться до середины февраля.\u003c/p\u003e\u003cp\u003eВ \u003ca href\u003d\"https://vk.com/botaninvestments\"\u003eгруппе \u003cstrong\u003eBotan Investments\u003c/strong\u003e в ВК\u003c/a\u003e вышли новые посты Михаила \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik\" title\u003d\"Мастер MikhailRubinchik\"\u003eMikhailRubinchik\u003c/a\u003e Рубинчика о \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_289\"\u003eподготовке школьников\u003c/a\u003e и более подробно о \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_295\"\u003eподготовке школьников в Свердловской области\u003c/a\u003e, а также о \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_297\"\u003eкомпьютерном времени на контестах\u003c/a\u003e и \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_299\"\u003eиспользовании принтера для экономии времени\u003c/a\u003e. А сегодня Михаил подготовил пост о снижении порога входа в спортпрог и о создании третьего дивизиона на CF. \u003c/p\u003e\u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e В этом посте я \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_301\"\u003eпродолжаю\u003c/a\u003e разговор о том, что для новичков сложно найти задачи. Например, их нет здесь, на CF — самой крупной точке входа для новичков в спортивное программирование. \u003cbr /\u003e\u003cbr /\u003e Считается, что в первом дивизионе сложные задачи, а во втором простые. Но, на мой взгляд, это не так: в первом дивизионе задачи очень сложные, а во втором — просто сложные. В предыдущем посте я описывал, как проводил двухнедельные сборы для школьников, которые перед этим весь год целенаправленно готовились к олимпиадам: решали задачи, раз в неделю слушали лекции по алгоритмам и т.д. На одной из тренировок я дал им подборку из 20 задач Div2.A. И пошло очень тяжело, несмотря на то, что я сильных игроков распределил по разным командам. \u003cbr /\u003e\u003cbr /\u003e Наверное, можно подумать, что команды были слишком слабые, но это не так. В этом сезоне команда Первоуральск прошла на ВКОШП и решила 3 задачи. Эти же ребята обогнали 200 команд на отборах с УрКОП (уральский отбор на ВКОШП). Результат не суперкрутой, но всё-таки далеко не нулевой. И вот им было тяжеловато решать подборку из Div2.A \u003cbr /\u003e\u003cbr /\u003e Но если мы говорим о задачах из второго дивизиона, как о задачах для новичков, то они должны быть действительно простыми! Много людей приходит в олимпиады именно через CF. А раз CF — это парадный вход спортивного программирования, то наверное, стоит упростить этот вход и быть более дружелюбными к новичкам. \u003cbr /\u003e\u003cbr /\u003e Представьте, что на раунды второго дивизиона приходит человек, который недавно выучил язык программирования. И если каждый раз за 2,5 часа он решает только одну задачу (или вообще ничего не решает), то у него просто опустятся руки и он уйдет из олимпиад. \u003cbr /\u003e\u003cbr /\u003e Из этого у меня напрашивается следующий вывод: на CF должен быть более простой третий дивизион с раундами, которые состоят из нескольких задачах для новичков (с решением в один for без if или один if без for) и еще парой по уровню сложности как задачи А и B из второго дивизиона. Только тогда мы сможем говорить, что на CF есть формат тренировок, на которых школьник сможет решить что-то сам (без тренера, который стоит рядом), не разочаруется в своих силах и останется в спортивном программировании. \u003cbr /\u003e\u003c/p\u003e\u003cbr /\u003e \u003ccenter\u003e \u003cdiv style\u003d\"width: 80.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/2b/85/2b85ffe5da46a8439b27a12aad906efe5b43e08d.png\" style\u003d\"width: 80.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e \u003c/center\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e А если развивать мысль дальше, то можно сделать и 4 дивизион на детских обучающих языках программирования — например, как на \u003ca href\u003d\"https://studio.code.org/courses\"\u003ehttps://studio.code.org/courses\u003c/a\u003e. Тогда мы сможем преодолеть пропасть между обучением языку и обучением олимпиадам. Интересный опыт в этом плане есть у тренера Александра Кленина из Владивостока, который проводит среди школьников муниципальные соревнования на собственном игровом языке программирования. \u003ca href\u003d\"https://imcs.dvfu.ru/cats/junior/\"\u003eЗдесь\u003c/a\u003e можно посмотреть пример. Это обучающий язык, но при этом есть таблички с результатами, как на олимпиадах. А представляете, если будут взломы на таком языке? ;) Мы будем иметь дивизион, например, из трёх задач на обучающем языке программирования и двух задач уровня А+В на обычных языках. Это будет, с одной стороны, усиленно подталкивать к обучению основных языков программирования, с другой стороны, начинать с такого дивизиона будет легко даже первокласснику. \u003cbr /\u003e\u003cbr /\u003e Если перенять этот опыт и встроить его в CF, мы дадим возможность детям на старте изучать визуальные околоигровые языки программирования. А после этого они естественным образом будут переходить в следующий дивизион и решать задачи на программирование. \u003cbr /\u003e\u003cbr /\u003e Я думаю, что в этом заинтересован и сам CF, так как у портала будет огромными темпами расти база клиентов. Ну и, конечно, в этом заинтересовано все олимпиадное сообщество, ведь чем больше в него вовлечено людей, тем больше спонсоров, организаторов и популярности у самого движения. На мой взгляд, вопрос только в том, кто первым это сделает, CF или какая-то другая платформа :) \u003c/p\u003e\u003c/div\u003e","tags":["botan investments","виктор шабуров"]}}