{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1491227026,"rating":90,"authorHandle":"I_love_Hoang_Yen","modificationTimeSeconds":1491227186,"id":51400,"title":"\u003cp\u003eGiới thiệu group\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eNhư mình \u003ca href\u003d\"https://www.facebook.com/groups/163215593699283/permalink/1426641717356658/\"\u003eđã nói trong group FB VNOI\u003c/a\u003e, mục đích thành lập group là để sau này sẽ tổ chức các kỳ thi của VNOI trên Codeforces.\u003c/p\u003e\u003cp\u003eChắc các bạn đều biết trước giờ các kỳ thi của VNOI được tổ chức trên hệ thống SPOJ. Tuy nhiên hệ thống SPOJ đã cũ và việc sử dụng càng ngày càng có nhiều vấn đề, ví dụ:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eKhông dễ rejudge.\u003c/li\u003e   \u003cli\u003eBảng rank khó tạo (cả của từng contest và 1 bảng rank chung), không đơn giản bấm nút cái là ra như \u003ca href\u003d\"//codeforces.com/group/FLVn1Sc504/customrating/551\"\u003erank của group Codeforces\u003c/a\u003e.\u003c/li\u003e   \u003cli\u003eGiới hạn số lượng test.\u003c/li\u003e   \u003cli\u003e...\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eHiện tại đang trong giai đoạn hoạt động thử nghiệm, nên mình sẽ add thành viên dần dần. Về lâu dài thì tất cả mọi người đều sẽ có thể vui chơi và chém gió trong này. Dĩ nhiên bạn nào có thái độ lồi lõm như chơi bẩn trong kỳ thi sẽ bị ban ngay và ko bao giờ trở lại.\u003c/p\u003e\u003cp\u003eVì vậy mình quyết định chuyển dần từ SPOJ qua Codeforces. Như các bạn có thể thấy thì trong Contest mình đã add các bài của VNOI Marathon 2008 lên CF. Giới thiệu sơ qua về VNOI Marathon: VNOI Marathon (VM) là kỳ thi lớn nhất của VNOI, tổ chức hàng năm, lần đầu vào năm 2008. VM thường gồm những bài khó, để khi làm xong các bạn sẽ cảm thấy mình thông minh hơn, khủng hơn.. Như năm 2008 lần đầu mình thi VM gặp được những bài khó như bài MAKHOA của \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/ktuan\" title\u003d\"Candidate Master ktuan\"\u003ektuan\u003c/a\u003e, cảm thấy vô cùng sướng, trí tuệ mở mang, nhờ đó mới có được ngày hôm nay.\u003c/p\u003e\u003cp\u003eĐể add các bài từ SPOJ lên Codeforces rất vất vả và dễ phạm sai lầm. Mình đã phải tự viết tool để down bài từ SPOJ về và up lên Codeforces, tuy làm tự động nhưng vì máy tính ở thế kỉ này vẫn rất ngu nên chắc không tránh khỏi sai lầm. Vì vậy nếu phát hiện bài nào có vấn đề các bạn hãy hú lên cho mình biết ngay. Khi hú lên như vậy bạn đang góp phần đóng góp cho cộng đồng và các thế hệ sau.\u003c/p\u003e\u003c/div\u003e","tags":[]}}