{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1424323867,"rating":3,"authorHandle":"zamazan4ik","modificationTimeSeconds":1424323867,"id":16498,"title":"\u003cp\u003eЗадача Лыжные гонки\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДоброго времени суток. Есть такая задача — Лыжные гонки. \u003ca href\u003d\"http://informatics.mccme.ru/py-source/source/dir/16247\"\u003eYour text to link here...\u003c/a\u003e\u003c/p\u003e\u003cp\u003eВо время лыжных соревнований N спортсменов стартуют с интервалом в 1 минуту. Скорость каждого лыжника на дистанции постоянна: i-й лыжник преодолевает 1 км за wi минут. Длина трассы равна L км. Считается, что i-й лыжник обогнал j-го (совершил обгон), если он стартовал позже j-го, а пришёл к финишу раньше него. Подсчитайте суммарное число совершённых во время гонки обгонов.\u003c/p\u003e\u003cp\u003eВходные данные\u003c/p\u003e\u003cp\u003eПервая строка входного файла содержит два целых числа N и L. Во второй строке через пробел расположены N целых чисел wi.\u003c/p\u003e\u003cp\u003e1\u0026lt;\u003dN\u0026lt;\u003d500000, 1\u0026lt;\u003dL\u0026lt;\u003d10^9, 1\u0026lt;\u003dWi\u0026lt;\u003d10^9\u003c/p\u003e\u003cp\u003eВыходные данные\u003c/p\u003e\u003cp\u003eВыведите единственное число — суммарное количество обгонов.\u003c/p\u003e\u003cp\u003eОграничение по времени — 2 сек Ограничение по памяти — 128\\256 мб(не нашёл информации)\u003c/p\u003e\u003cp\u003eЧто я придумал по этой задаче : будем идти по порядку, увеличивая i. i лыжник обгонит j, если i\u0026gt;j и L*Wi \u0026lt; L*Wj-(i-j). Что из этого следует — будем хранить в каждой вершине дерева отрезков отсотрированный массив, который относится к этой части ДО (деревом Ропана это вроде зовётся). И потом на каждый запрос мы будем log(N)*log(n) отвечать на этот запрос, сколько есть таких чисел на отрезке [1;i-1]. И на каждой итерации мы будем отнимать единицу от отрезка предыдущего.\u003c/p\u003e\u003cp\u003eНо квадрат логарифма судя по всему не зайдет. А логарифм зайдет. Как я придумал, тут нужно писать каскадирование. Это нам по идее обеспечит нужную асимптотику.\u003c/p\u003e\u003cp\u003eВ чём вопрос : верна ли эта мысль? Если верна, то можете ли рассказать подробнее про это самое каскадирование и как его писать, если можно. Я ни разу его не писал и смутно представляю, как это сделать.\u003c/p\u003e\u003cp\u003eИ ещё — нет ли других решений данной задачи?\u003c/p\u003e\u003cp\u003eЗаранее спасибо.\u003c/p\u003e\u003c/div\u003e","tags":["дерево отрезков","каскадирование"]}}