{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1506843365,"rating":0,"authorHandle":"ZloyNegr","modificationTimeSeconds":1506843365,"id":54872,"title":"\u003cp\u003eРазбор тренировки группы А\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eB — k-Округление Заметим, что число x заканчивается хотя бы на k нулей, если максимальная степень 2, на которую делится число x, не менее k, и максимальная степень 5, на которую делится число, также не менее k. Тогда посчитаем максимальные степени 2 и 5, на которые делится заданное n. Если одна из степеней меньше чем k, домножим на нужное количество 2 и 5.\u003c/p\u003e\u003cp\u003eТак же можно заметить, что ответ это НОК(n, 10k).\u003c/p\u003e\u003cp\u003eD- Mahmoud and Ehab and the bipartiteness The tree itself is bipartite so we can run a dfs to partition the tree into the 2 sets (called bicoloring), We can\u0027t add an edge between any 2 nodes in the same set and we can add an edge between every 2 nodes in different sets, so let the number of nodes in the left set be l and the number of nodes in the right set be r, The maximum number of edges that can exist is l * r, but n - 1 edges already exist so the maximum number of edges to be added is l * r - (n - 1). Time complexity : O(n) . Solution link (me) : \u003ca href\u003d\"https://pastebin.com/w3bF7gKS\"\u003ehttps://pastebin.com/w3bF7gKS\u003c/a\u003e . Solution link (mahmoudbadawy) : \u003ca href\u003d\"https://pastebin.com/PMpte7nC\"\u003ehttps://pastebin.com/PMpte7nC\u003c/a\u003e .\u003c/p\u003e\u003cp\u003eE- Mahmoud and Ehab and the xor n \u003d 2, x \u003d 0 is the only case with answer \u0026quot;NO\u0026quot; . Let pw \u003d 217 . First print 1, 2, ..., n - 3 (The first n - 3 positive integers), Let their bitwise-xor sum be y, If x \u003d y You can add pw, pw * 2 and , Otherwise you can add 0, pw and , We handled the case x \u003d y in a different way because if we add 0, pw and in this case, Then it\u0027s like adding 0, pw and pw, pw appears twice so we\u0027ll get wrong answer. Handle n \u003d 1 (print x) and n \u003d 2 (print 0 and x) . Solution link (mahmoudbadawy) : \u003ca href\u003d\"https://pastebin.com/w67KUY5u\"\u003ehttps://pastebin.com/w67KUY5u\u003c/a\u003e .\u003c/p\u003e\u003c/div\u003e","tags":[]}}