{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1498747899,"rating":59,"authorHandle":"thocevar","modificationTimeSeconds":1500150178,"id":52986,"title":"\u003cp\u003eCEOI 2017 Online contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"https://ceoi2017.acm.si/\"\u003eCentral European Olympiad in Informatics 2017\u003c/a\u003e will this year take place in Ljubljana, Slovenia from July 10 to July 15. I would like to invite you to an online contest featuring the CEOI task which we\u0027ll organize after the conclusion of the on-site contest.\u003c/p\u003e\u003cp\u003eThe \u003ca href\u003d\"http://putka-ceoi.fri.uni-lj.si/\"\u003eonline contest\u003c/a\u003e will last 5 hours and feature 9 problems from the practice session and both competition days. It starts on \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dCEOI+2017+online+contest\u0026amp;iso\u003d20170715T14\u0026amp;p1\u003d736\u0026amp;ah\u003d5\"\u003eSaturday, 15 July at 14.00 CEST (UTC +2)\u003c/a\u003e. Registration will be enabled after the conclusion of the on-site contest on Friday.\u003c/p\u003e\u003cp\u003eThe contest will be suitable for a wide range of contestants with the typical divison of problems into subtasks. With a relatively narrow time frame of 5 hours it should present a challenge even to the best. We\u0027re looking forward to your participation.\u003c/p\u003e\u003cp\u003eUPDATE 1: The onsite contest has concluded. You can check the \u003ca href\u003d\"https://ceoi2017.acm.si/?file\u003dcompetition/results\"\u003eresults\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eUPDATE 2: Registration on the \u003ca href\u003d\"http://putka-ceoi.fri.uni-lj.si/\"\u003eonline judge\u003c/a\u003e is now open. Good luck tomorrow.\u003c/p\u003e\u003cp\u003eUPDATE 3: Congratulations to \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/demon1999\" title\u003d\"Международный мастер demon1999\"\u003edemon1999\u003c/a\u003e for winning the online contest and thanks to everyone who participated. We will upload the tasks, tests and solutions to the web page shortly.\u003c/p\u003e\u003c/div\u003e","tags":["ceoi","online","2017"]}}