{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1505158721,"rating":0,"authorHandle":"platypus179","modificationTimeSeconds":1505158721,"id":54474,"title":"\u003cp\u003eПопробуем ещё раз\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПервый контест на бинпоиск ещё не закончился, но, кажется, уже можно сказать, что не зашёл. Ничего страшного в этом нет, нужно лишь понять, в каком месте возник затык с бинпоиском и начать прокачивать его с этого места. Существует не очень много обязательных для прохода на заключительный этап умений, но умение видеть в задаче бинпоиск по ответу таки входит в их число.\u003c/p\u003e\u003cp\u003eЗавтра (почти уже сегодня) в полночь стартует следующий контест. Он сильно отличается от первого:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eВо первых, там нет ни халявы, ни гроба. Я вообще постеснялся хоть как-то оценивать абсолютную величину сложности этих задач.\u003c/li\u003e   \u003cli\u003eВо вторых, все задачи по неким объективным соображениям имеют одинаковую относительную сложность. В частности, \u003cstrong\u003eпорядок задач в этом контесте не означает ничего\u003c/strong\u003e. Нет, правда. На самом деле, они даны в том порядке, в котором они есть в архиве задач CF.\u003c/li\u003e   \u003cli\u003eВ третьих, содержательный код в моих посылках в каждой из задач занял строк 20. Ну, плюс-минус.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eКак и в прошлом контесте, абсолютно все задачи на бинпоиск по ответу. Будь осторожен при написании решений, я не могу гарантировать, что питон заходит хоть куда-то.\u003c/p\u003e\u003cp\u003eЯ понятия не имею заранее, составят ли эти задачи тебе хоть какую-то сложность. Спокойно может оказаться, что ты сдашь очень мало, или, наоборот, зарешаешь всё за пару дней. В любом (а особенно в последнем) случае помни, что тебе нужно полностью дорешать предыдущий контест. У тебя уже будет разбор и код моего решения. Я в тебя верю.\u003c/p\u003e\u003cp\u003eЕщё раз, вкратце:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eПорядок задач в новом контесте ничего не значит.\u003c/li\u003e   \u003cli\u003eВезде мало кода.\u003c/li\u003e   \u003cli\u003eВезде бинпоиск по ответу.\u003c/li\u003e   \u003cli\u003eНе забудь про дорешивание.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eУдачи!\u003c/p\u003e\u003c/div\u003e","tags":[]}}