{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1436977059,"rating":297,"authorHandle":"ilyakor","modificationTimeSeconds":1436977921,"id":19230,"title":"\u003cp\u003eСпортивное программирование и Решето\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eКак многие уже \u003ca href\u003d\"http://www.wired.com/2015/07/adobe-flash-player-die/\"\u003eслышали\u003c/a\u003e, за последнюю неделю были опубликованы три новые критические zero-day уязвимости в Adobe Flash Player: CVE-2015-5119, CVE-2015-5122 и CVE-2015-5123. Ключевое слово — \u0026quot;опубликованы\u0026quot;, найдены они были (и эксплуатировались) гораздо раньше. Но даже после публикации, все популярные exploit-паки включали в свой состав соответствующие эксплоиты в течение нескольких часов, в то время как Adobe выпускали тривиальные фиксы через несколько дней. Чтобы хоть как-то смягчить проблему, Mozilla даже \u003ca href\u003d\"http://money.cnn.com/2015/07/14/technology/flash-firefox-facebook/\"\u003eвременно заблокировала\u003c/a\u003e Flash в Firefox, чтобы не слишком технически продвинутые пользователи не наловили зоопарк вирусов.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/21/16/21168fa4f411d88c03809dcb7b523fd4f18d06be.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eТаким образом, все системы, на которых был включен Flash Player в какие-то моменты времени в течение последней недели, потенциально скомпрометированы. И надо менять все пароли, приватные ключи, etc. К счастью, большинство интернет-компаний не стремятся помогать хакерам расширять свои ботнеты, и поэтому Flash уже почти нигде не используется: Youtube и Facebook показывают видео при помощи HTML5, мобильные устройства вообще его не поддерживают (Стив Джобс давным-давно \u003ca href\u003d\"https://www.apple.com/hotnews/thoughts-on-flash/\"\u003eпризывал его убить\u003c/a\u003e), \u003ca href\u003d\"//codeforces.com/profile/ivan.popelyshev\"\u003eнормальные game-developer\u0027ы\u003c/a\u003e пишут браузерные игры на JS, даже Unity убрали поддержку этого плагина.\u003c/p\u003e\u003cp\u003eК величайшему сожалению, один из немногих сайтов в интернете, всё ещё использующий Flash, — это Codeforces. Реализовать взломы на JS должно быть очень просто, но администрация всё ещё надеется на ложное чувство безопасности, предоставляемое флешевым плагином (несмотря на все рациональные доводы — декомпилировать обфусцированный JS гораздо сложнее, чем флеш-плагин, который к тому же жутко глючный и не поддерживается по умолчанию в большинстве браузеров). Теперь к этим доводам добавился ещё один: никто не хочет держать у себя в браузере парадную дверь для хакеров. Очень надеюсь, что разработчики Codeforces прислушаются к этому доводу и исправят досадный недостаток своего в остально замечательного проекта.\u003c/p\u003e\u003c/div\u003e","tags":["flash","решето","codeforces","security","botnet","virus"]}}