{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1524096044,"rating":115,"authorHandle":"ICPCNews1","modificationTimeSeconds":1524096044,"id":58995,"title":"\u003cp\u003eHello from ACM ICPC World Finals!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eMore than 300,000 students competed worldwide in local and regional events with one aim — to participate in World Finals, this year hosted by Peking University in China. And today we will see who will become the world champion!\u003c/p\u003e\u003cp\u003eA total of 140 teams of three students will face about 12 difficult problems (we don\u0027t know the number until the problem set is released!). They will have 5 hours to solve the problems. \u003c/p\u003e\u003cp\u003eAlthough the contest itself takes 5 hours only, the whole event takes 5 days. So, what is going on during these days?\u003c/p\u003e\u003cp\u003eThrough the registration evening, each team was given different color shirt and their badges, as well as other goodies like a backpack and a cute stuffed panda bear. We took photos and videos of each team so we can share about them on various social media.\u003c/p\u003e\u003cp\u003eMonday began with JetBrains TechTrek Presentation and a really fun sponsor showcase with games and activities. Contestants could participate in many things — they could try writing Chinese characters, playing traditional Chinese games or instruments, try sports in VR and more... The day was ended with a stunning concert of both traditional and contemporary Chinese music from Peking University, including some original compositions.\u003c/p\u003e\u003cp\u003eOn Tuesday we were amazed by The Giant Wall of China. That day we become true men because the Chinese saying is that one is not fully human until he climbs the Great Wall. It was surprisingly steep. Hundreds of people from 6 continents climbed it and had amazing views of the mountains.\u003c/p\u003e\u003cp\u003eThe afternoon was all about the opening ceremony, which had speeches, awards for many wonderful people and a presentation of all the teams, interlaced with cultural performances. \u003c/p\u003e\u003cp\u003eWednesday was an important dress rehearsal. The program is similar to the competition day. It lets everyone find issues so the finals on Thursday can run as smoothly as possible. There are always some technical issues, problems with logging in, printers, etc., but they all got worked out. In the afternoon, contestants had a rest, enjoy a sponsors\u0027 ChillZone with games and do the last preparations for the tomorrow\u0027s contest.\u003c/p\u003e \u003chr /\u003e\u003cp\u003e140 teams participate in world finals. But there are many other people standing behind scenes — coaches, organizers, judges, ICPC teams (News, Services,...) and many other volunteers, totalling in about 1000 people!\u003c/p\u003e\u003cp\u003eThe ACM ICPC world finals aren\u0027t only about competing. It is also about meeting with great programmers from all around the world, encountering other cultures and sharing the joy of programming. For me, this event is truly awesome and fun to be part of!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/77/29/7729265bb463c6ddadbb6774087fa6fbeab215ad.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["icpc","acm","beijing, china","world finals"]}}