{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1522100038,"rating":56,"authorHandle":"MagicPotato","modificationTimeSeconds":1522101679,"id":58579,"title":"\u003cp\u003e[Video Tutorial] Segment Tree Beats\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces community,\u003c/p\u003e\u003cp\u003eI am so happy that I could finally understand segment tree beats good enough make a video tutorial on it. I tried to make it as simple as possible. Please do give me some feedback. positive or negative or ask if there is any ambiguity or query. \u003c/p\u003e\u003cp\u003eI had made a video on centroid decomposition(It\u0027s there in the same channel) which has received a lot of positive feedback, thank you all! I had planned to make more videos but I stopped because of busy school. I am now free from school for a few months now and would like to make more videos on hard topics, I may stop uploading if I get busy again. So, I request you all to suggest me some topics. :D I will try my best to make a video on them.\u003c/p\u003e\u003cp\u003eI really hope you all like it as it took me about 20 hours of direct and a week of indirect work to make this video with minimal equipment. If you finally understood this topic and commented, my goal would be accomplished. :D\u003c/p\u003e\u003cp\u003eThis video is intended to be contributed to my school club but the video is public so anyone can benefit from it.\u003c/p\u003e\u003cp\u003eThere might be unintended errors in whatever I have written and also the subtitles, please do notify me if you find anything like that. :D\u003c/p\u003e\u003cp\u003eAnd lastly, ignore if you can hear birds chirping and other background noises, I will try my best to improve the quality in my next videos. :)\u003c/p\u003e\u003cp\u003eLink: \u003ca href\u003d\"https://youtu.be/UJyBHCXa-1g\"\u003ehttps://youtu.be/UJyBHCXa-1g\u003c/a\u003e \u003cbr /\u003e Enjoy! :D\u003c/p\u003e\u003cp\u003eUPDATE: I am a minutephysics fan so I like his style and incorporated into my videos too. Do comment on that as well, will help me get a better view on which style is the best. :D\u003c/p\u003e\u003c/div\u003e","tags":[]}}