{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1433161066,"rating":21,"authorHandle":"RussianCodeCup","modificationTimeSeconds":1433171125,"id":18266,"title":"\u003cp\u003eRCC 2015 Qual 3 — Разбор задач\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch2\u003eЗадача A. Покупка велосипеда.\u003c/h2\u003e\u003cp\u003e\u003cb\u003eИдея:\u003c/b\u003e Виталий Аксёнов.\u003cbr /\u003e \u003cb\u003eРеализация:\u003c/b\u003e Дмитрий Филиппов.\u003cbr /\u003e \u003cb\u003eРазбор:\u003c/b\u003e Дмитрий Филиппов.\u003cbr /\u003e \u003c/p\u003e\u003cp\u003e  По условию задачи нужно сказать, можно ли по данным числам \u003ci\u003ea\u003c/i\u003e, \u003ci\u003eb\u003c/i\u003e, \u003ci\u003ec\u003c/i\u003e найти такие числа \u003ci\u003ea\u003csub\u003e1\u003c/sub\u003e\u003c/i\u003e, \u003ci\u003eb\u003csub\u003e1\u003c/sub\u003e\u003c/i\u003e,  что \u003ci\u003ea\u003csub\u003e1\u003c/sub\u003e\u003c/i\u003e  ≤  \u003ci\u003ea\u003c/i\u003e, \u003ci\u003eb\u003csub\u003e1\u003c/sub\u003e\u003c/i\u003e  ≤  \u003ci\u003eb\u003c/i\u003e и  \u003ci\u003ea\u003csub\u003e1\u003c/sub\u003e\u003c/i\u003e + 2 · \u003ci\u003eb\u003csub\u003e1\u003c/sub\u003e\u003c/i\u003e \u003d \u003ci\u003ec\u003c/i\u003e. \u003c/p\u003e \u003cp\u003e  Решение у этой задачи простое: почти всегда достаточно проверить, что суммарный номинал наших монет не меньше \u003ci\u003ec\u003c/i\u003e:  \u003ci\u003ea\u003c/i\u003e + 2 · \u003ci\u003eb\u003c/i\u003e  ≥  \u003ci\u003ec\u003c/i\u003e. Исключение — когда \u003ci\u003ec\u003c/i\u003e нечётное. Тогда ещё нужно проверить, что  \u003ci\u003ea\u003c/i\u003e  ≥  1. \u003c/p\u003e \u003ch2\u003eЗадача B. Цифровые корни.\u003c/h2\u003e \u003cb\u003eИдея:\u003c/b\u003e Григорий Шовкопляс.\u003cbr /\u003e \u003cb\u003eРеализация:\u003c/b\u003e Григорий Шовкопляс.\u003cbr /\u003e \u003cb\u003eРазбор:\u003c/b\u003e Григорий Шовкопляс.\u003cbr /\u003e \u003cp\u003e  В этой задаче нужно по числам \u003ci\u003ea\u003c/i\u003e и \u003ci\u003eb\u003c/i\u003e определить, какие из значений цифрового корня встретятся на этом отрезке наибольшее количество  раз.\u003c/p\u003e \u003cp\u003e  Заметим, что у цифрового всего девять значений, а также они циклически повторяются. Таким образом, нужно вычислить  только цифровые корни от \u003ci\u003ea\u003c/i\u003e и \u003ci\u003eb\u003c/i\u003e, а чаще всего встречаются цифры между значениями этих цифровых корней.  Единственное, что нужно было дополнительно учесть — это случай, когда цифровой корень \u003ci\u003ea\u003c/i\u003e  больше чем цифровой корень \u003ci\u003eb\u003c/i\u003e. Также нужно было не забыть, что ответ нужно выводить по возрастанию. \u003c/p\u003e \u003ch2\u003eЗадача C. Две улитки.\u003c/h2\u003e \u003cb\u003eИдея:\u003c/b\u003e Дмитрий Филиппов.\u003cbr /\u003e \u003cb\u003eРеализация:\u003c/b\u003e Николай Ведерников.\u003cbr /\u003e \u003cb\u003eРазбор:\u003c/b\u003e Николай Ведерников.\u003cbr /\u003e \u003cp\u003e  В этой задаче две улитки днём поднимаются на \u003ci\u003ea\u003csub\u003ei\u003c/sub\u003e\u003c/i\u003e, а ночью опускаются на \u003ci\u003eb\u003csub\u003ei\u003c/sub\u003e\u003c/i\u003e.  Требуется определить, сколько по времени первая улитка обгоняла вторую. \u003c/p\u003e \u003cp\u003e  Задача решается моделированием. Рассматриваем часы последовательно. Для начала узнаем сейчас день или ночь.  Посмотрим положение улиток до начала этого часа и после.  Если до начала часа одна была выше другой, а после окончания часа, также была выше, то обгона не было.  Тогда, если выше была первая, то к ответу добавим один час.  Если же в начале часа была выше, а потом ниже, следовательно одна обогнала другую.  Для того, чтобы узнать время, когда одна обгонит другую, надо посчитать расстояния между ними и поделить на разницу скоростей.  После этого добавить к ответу время, в когда первая улитка была выше второй в этот час. \u003c/p\u003e \u003ch2\u003eЗадача D. Игровые автоматы.\u003c/h2\u003e \u003cb\u003eИдея:\u003c/b\u003e Анна Малова.\u003cbr /\u003e \u003cb\u003eРеализация:\u003c/b\u003e Виталий Аксёнов.\u003cbr /\u003e \u003cb\u003eРазбор:\u003c/b\u003e Виталий Аксёнов.\u003cbr /\u003e \u003cp\u003e Нам даны кнопки, которые умеют выключать какой-то набор из лампочек, и кнопки, которые умеют включать какой-то набор лампочек. Задача: с помощью кнопок перевести лампочки из выключенного состояния в заданнное, или сообщить, что такое сделать нельзя. \u003c/p\u003e \u003cp\u003e Сначала, поймём, что дважды нажимать одну и ту же кнопку не имеет смысла, так как мы всегда можем оставить только последнее её нажатие, и конечное состояние не изменится. Далее, рассмотрим задачу с конца. У каждой лампочки будет три состояния: включена, выключена и неизвестно. Когда мы обращаем нажатие кнопки, помечаем все лампочки, за которые она отвечала, что их состояние неизвестно. \u003c/p\u003e \u003cp\u003e Мы могли нажимать кнопку, если: \u003c/p\u003e\u003cul\u003e \u003cli\u003eкнопка выключает лампочки, то состояния изменённых лампочек должны быть или выключены, или неизвестны;\u003c/li\u003e \u003cli\u003eкнопка включает лампочки, то состояния изменённых лампочек должны быть или включены, или неизвестны.\u003c/li\u003e \u003c/ul\u003e  \u003cp\u003e Смотрим на последнее состояние, и нажимаем кнопки, каждую по одному разу, если это возможно. Пусть ни одну кнопку нажать нельзя, то нужно проверить,  правда ли лампочки или выключены, или неизвестны, что соответствует стартовому состоянию. Если правда, мы можем последовательностью нажатий перейти в заданное состояние, иначе — нельзя. \u003c/p\u003e \u003ch2\u003eЗадача E. Интернетопровод.\u003c/h2\u003e\u003cp\u003e\u003cb\u003eИдея:\u003c/b\u003e Виталий Аксёнов.\u003cbr /\u003e \u003cb\u003eРеализация:\u003c/b\u003e Илья Збань.\u003cbr /\u003e \u003cb\u003eРазбор:\u003c/b\u003e Илья Збань.\u003cbr /\u003e \u003c/p\u003e\u003cp\u003e В задаче дано \u003ci\u003en\u003c/i\u003e точек, и нужно найти некоторую прямую \u003ci\u003el\u003c/i\u003e и расстояние \u003ci\u003ed\u003c/i\u003e такие, что количество точек, расположенных ровно на расстоянии \u003ci\u003ed\u003c/i\u003e от прямой \u003ci\u003el\u003c/i\u003e было максимально. \u003c/p\u003e \u003cp\u003e Любая прямая задается тройкой коэффициентов \u003ci\u003ea\u003c/i\u003e, \u003ci\u003eb\u003c/i\u003e и \u003ci\u003ec\u003c/i\u003e таких, что \u003ci\u003eax\u003c/i\u003e+\u003ci\u003eby\u003c/i\u003e+\u003ci\u003ec\u003c/i\u003e\u003d0. Две прямые (\u003ci\u003ea\u003c/i\u003e\u003csub\u003e1\u003c/sub\u003e, \u003ci\u003eb\u003c/i\u003e\u003csub\u003e1\u003c/sub\u003e, \u003ci\u003ec\u003c/i\u003e\u003csub\u003e1\u003c/sub\u003e) и (\u003ci\u003ea\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e, \u003ci\u003eb\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e, \u003ci\u003ec\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e) параллельны, если коллинеарны векторы (\u003ci\u003ea\u003c/i\u003e\u003csub\u003e1\u003c/sub\u003e, \u003ci\u003eb\u003c/i\u003e\u003csub\u003e1\u003c/sub\u003e) и (\u003ci\u003ea\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e, \u003ci\u003eb\u003c/i\u003e\u003csub\u003e2\u003c/sub\u003e). \u003c/p\u003e \u003cp\u003e Проведем прямые через все пары точек, и приведем их к нормальному виду: \u003ci\u003eGCD\u003c/i\u003e(\u003ci\u003ea\u003c/i\u003e, \u003ci\u003eb\u003c/i\u003e)\u003d1, и \u003ci\u003ea\u003c/i\u003e\u0026gt;0 или \u003ci\u003ea\u003c/i\u003e\u003d0 и \u003ci\u003eb\u003c/i\u003e\u0026gt;0. Такое представление единственно для любой прямой. Перебрав все прямые, проходящие через пару точек, мы получим все углы, под которыми есть смысл проводить прямую-ответ (в случае, когда ответ больше двух, какие-то две точки из ответа будут лежать на одной прямой). Зная угол, под которым проходит прямая-ответ, несложно указать оптимальное \u003ci\u003ed\u003c/i\u003e: для фиксированных \u003ci\u003ea\u003c/i\u003e, \u003ci\u003eb\u003c/i\u003e, задающих угол наклона прямой, нужно выбрать два самых часто встречаемых с этими значениями \u003ci\u003ea\u003c/i\u003e, \u003ci\u003eb\u003c/i\u003e значения \u003ci\u003ec\u003c/i\u003e, и мы получим две прямые, параллельные искомой, находящиеся от нее на расстоянии \u003ci\u003ed\u003c/i\u003e. В случае, если такое значение \u003ci\u003ec\u003c/i\u003e всего одно, то, если не все точки лежат на одной прямой, можно добавить к ответу еще одну точку. \u003c/p\u003e\u003c/div\u003e","tags":[]}}