{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1426514847,"rating":36,"authorHandle":"Seryi","modificationTimeSeconds":1427131025,"id":16978,"title":"\u003cp\u003eIX Открытая олимпиада ЮФУ по программированию\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПриглашаю всех участников Codeforces принять участие в IX Открытой олимпиаде ЮФУ по программированию в г. Таганроге.\u003c/p\u003e\u003cp\u003eВ программе Олимпиады ЮФУ три независимых турнира по спортивному программированию по правилам ACM ICPC: личный, личный для школьников и командный. Также будет проведен школьный турнир по программированию на языке Scratch.\u003c/p\u003e\u003cp\u003eКаждый из турниров включает:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eотборочный этап (онлайн, 20 марта 12:00 — 22 марта 18:00 на \u003ca href\u003d\"http://www.contester.tsure.ru\"\u003ewww.contester.tsure.ru\u003c/a\u003e)\u003c/li\u003e   \u003cli\u003eфинал (18-19 апреля 2015 г., Институт компьютерных технологий и информационной безопасности, ЮФУ, Таганрог).\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eК участию в Олимпиаде приглашаются все желающие. \u003c/p\u003e\u003cp\u003eUPD: В Командном турнире по спортивному программированию состав команды – 2-3 человека от организации (ВУЗа, колледжа/школы, компании и др.). Предполагается, что каждая команда представляет одну организацию (формально сборные команды не запрещаются, но во всех материалах и документах по Олимпиаде для каждой команды указывается название только одной организации).\u003c/p\u003e\u003cp\u003eДля участия в Олимпиаде необходимо не позднее 20 марта 2015 г. заполнить регистрационную форму на рабочем сайте Олимпиады \u003ca href\u003d\"http://www.contestsfedu.org\"\u003ewww.contestsfedu.org\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eОргвзнос за участие в Олимпиаде не предусмотрен!\u003c/p\u003e\u003cp\u003eВсе остальные подробности — на \u003ca href\u003d\"http://www.contestsfedu.org/2015\"\u003eстраничке олимпиады\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eUPD2: Отборочные этапы завершены. Обработанные результаты \u003ca href\u003d\"http://www.contestsfedu.org/2015\"\u003eна страничке олимпиады\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["таганрог","олимпиада юфу","юфу"]}}