{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1417353647,"rating":7,"authorHandle":"Enchom","modificationTimeSeconds":1442088368,"id":14943,"title":"\u003cp\u003eSome help in using Polygon\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eSo I recently decided to create some Gym contest (for my friends) using polygon. I have encountered a few problems and if someone could please help me out or link me to detailed polygon help, that would be fantastic.\u003c/p\u003e\u003cp\u003e1) Naming the actual problems. As stupid as it may sound I couldn\u0027t find how to name the problem. In the statement itself it appears with the name I\u0027ve chosen, but when you open the contest, this is what you get:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/fa/fb/fafbd369a5a90892127b4ead91de952c0155f0f9.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e2) Sample input/output tests. In the statement section I found how to add Input/Output descriptions, Notes descriptions and general statement description, but not how to add sample tests in statement. \u003cstrong\u003eSolved thanks to \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/EROR\" title\u003d\"Специалист EROR\"\u003eEROR\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e3) Changing an already created problem. When I upload the problem to codeforces contest and afterwards change it in the polygon system, I couldn\u0027t find a way to update the actual problem in codeforces. It changes fine in polygon system but it keeps the originally uploaded version in codeforces itself. \u003cstrong\u003eSolved thanks to \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/EROR\" title\u003d\"Специалист EROR\"\u003eEROR\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e4) Using pictures in statement and better fonts/bolding/etc. Writing the statement seems to allow only simple text and not even bolding the text. I see an option to add pictures as resource but I don\u0027t have clue how to actually use them afterwards, so some help with that would be amazing. \u003cstrong\u003eSolved thanks to \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/EROR\" title\u003d\"Специалист EROR\"\u003eEROR\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEdit 5) Is there a way to change the view to HTML view and not PDF view? I believe it looks better, but by default it opens PDF view when I click on the problem in cf. Also pictures don\u0027t seem to work in PDF.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNames of problems are still not showing up and pictures don\u0027t seem to work in PDF format, but I\u0027m unable to change the statements to show up in HTML format. Those 2 problems are still unresolved, so any help is welcome!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate 2\u003c/strong\u003e \u003cstrong\u003eThanks to \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/EROR\" title\u003d\"Специалист EROR\"\u003eEROR\u003c/a\u003e pictures in PDF now work, so blank problem names seems like the main problem.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eSorry if these questions sound dumb, but I couldn\u0027t find a good way to solve them.\u003c/p\u003e\u003cp\u003eThanks in advance! :)\u003c/p\u003e\u003c/div\u003e","tags":[]}}