{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399077584,"rating":-8,"authorHandle":"revenge5","modificationTimeSeconds":1399077584,"id":12092,"title":"\u003cp\u003eWharton was elected Finals MVP\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eover the 76ers win, Wharton was elected Finals MVP, Trail Blazers to a perfect fairy tale Writing a period ending.When \u0026quot;I never listen to the players talk about branch 76 finals in 1977,\u0026quot; Ramsey recalled that happened to say, \u0026quot;I just heard them far too difficult for most people to believe that we are not even wins four games away from the championship in their hands. \u0026quot;Recasting brilliant pioneerAfter a brilliant 1977, du\u003ca href\u003d\"http://www.maxsalesupras.com/nike-air-max-95-dyn-fw-c-26.html\"\u003enike air max 95 dyn fw cheap\u003c/a\u003e  e to injuries and other reasons the Blazers could not board the top of the league longer, but they have missed several close distance championship. This season, the Blazers played impressive basketball players play a role pillar of the team use to create a shooting opportunity pass and movement, to reproduce the Ramsay era art style.\u0026quot;This is a very good team, everyone has a clear division of labor, are able to play their role,\u0026quot; Ramsey evaluation now Zhezhi pioneers, \u0026quot;the first player to make due contributions to the bench Players also can stand out when needed, they have a chance to become a great team. then that support is very unselfish pioneers, now with this is also true pioneer. \u0026quot;Blazers currently in the first-round series has a total score of 3-1 \u0026quot;magic board\u0026quot; rocket, on the walls of the team coach Si Tuoci office, hung a painting that says Ramsey sentence, That marshal the sport of basketball but also the most concise summary of the most profound.\u0026quot;A real team, able to defeat those who would rely on superstar opponent! Yesterday Sainty under new coach Gao Hongbo led to Beijing tomorrow, the team will challenge the Yankees, this is the first time in the history of Sainty Beijing Ji coach led to the Worker combat is worth mentioning that the effectiveness of Gao Hongbo career longest team is the Yankees, but after he picked up the pointer, the game against national security record is also quite good, has been called \u0026quot;the country Anchorage Star coach,\u0026quot; said. overwhelmed Sainty can score \u003c/p\u003e\u003cp\u003epoints northward, and Gao Hongbo spot command formations and have a great relationship.Gao Hongbo is a national security \u0026quot;victims\u0026quot;If the league\u0027s top national security in China is no \u0026quot;victims\u0026quot; team only \u0026quot;victims\u0026quot; coach, then there is only one person, that is, from national security to come out of Gao Hongbo. 2006 season, Gao Hongbo led the newly promoted Super League Xiamen Blue Lions achieved eighth place, and a small negative ball away in the league, the home win over national security goals. Among them, the final round of league Xiamen Blue Lions defeated Guoan 2-0 game, and the latter from the league runner-up position to pull down.2007 season, Changchun Yatai coach Gao Hongbo became, then got the league title. Throughout the season, Changchun Yatai 1-0 defeat Yankees to win that game\u003ca href\u003d\"http://www.maxsalesupras.com/nike-air-max-lunar-c-36.html\"\u003enike air max lunar mens\u003c/a\u003e  called \u0026quot;Battle of King Mountain,\u0026quot; Yatai also by virtue of that victory, snatched from the hands of the national security champion; 2011, the outgoing national team After coach Gao Hongbo took home was still in Xi\u0027an, Shaanxi Chanba pointer, with a stoppage time goal long beach, the final round of the season, he led the team away 3-2 Yankees lore. Visible, Gao Hongbo face every victory achieved national security, have special significance.Coaching career, Gao Hongbo and national security are inextricably linked, the 2008 season, the National Security Yatai draw away and after that game Gao Hongbo retired from Yatai.\u0026quot;National Security was not always a good fight, I have to play a bad impression among the competition.\u0026quot; Gao Hongbo said, \u0026quot;As a professional team will certainly be concerned about the outcome, but as a coach with more attention to national security such as the Super League\u0027s top teams against learned a lot of things. nationa\u003c/p\u003e\u003cp\u003el security or to maintain the tradition of the past, players were more intelligent, still retains the characteristics of small fast spirit. \u0026quot;The most memorable FA Cup winDespite repeated and led the team to the national security game, but the majority of national security and \u0026quot;produced\u0026quot; players, Gao Hongbo also on the team has a deep affection. Gao Hongbo said he will never forget the national security in 1996 won the FA Cup. \u0026quot;This is the highest honor that we get playing career.\u0026quot; Gao Hongbo said, \u0026quot;as a player is concerned, so many fans in Beijing to get the recognition, the national security leadership was also very high regard for me, I am very grateful.\u0026quot;After the Chinese Football League start, Gao Hongbo\u003ca href\u003d\"http://www.maxsalesupras.com/nike-air-max-lunar-c-36.html\"\u003enike air max lunar for sale\u003c/a\u003e  in 1994 to flee Singapore, Tiong Bahru for the team. In 1995, upon his return to the national security and for two years, in 1997 Guangzhou Songri move. The face of national security, Gao Hongbo admits will be some obstacles, more or less psychologically a bit awkward, because when the players when he received many honors in the city.It is those two years, Gao Hongbo won everyone\u0027s approval, also won the Beijing fans. In Gao Hongbo seems that fans are not only cute, kind of CRAIC club also memorable. \u0026quot;Really want to face, or some different feelings, but from the perspective of professional ethics, when the coach had a serious and responsible in what club, which is a basic principle of life.\u0026quot;Honest people also suffered Beijing curseIt is because of led back to Beijing to obtain good results, coupled with the age of the players from the national \u003c/p\u003e\u003c/div\u003e","tags":[]}}