{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1521314845,"rating":98,"authorHandle":"kr_abhinav","modificationTimeSeconds":1522693824,"id":58423,"title":"\u003cp\u003eEuristica \u002718 Announcement\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"https://pclubiiti.github.io\"\u003e\u003cstrong\u003eProgramming Club, IIT Indore\u003c/strong\u003e\u003c/a\u003e is proud to announce \u003cstrong\u003eIIT Indore\u0027s\u003c/strong\u003e inaugural Programming Fest, \u003ca href\u003d\"https://euristica.in\"\u003e\u003cstrong\u003eEuristica \u002718\u003c/strong\u003e\u003c/a\u003e, sponsored by \u003cstrong\u003eArcesium\u003c/strong\u003e. The event was realised thanks to the amazing amounts of effort put in by our team across several weeks. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"Euristica Poster\" src\u003d\"/predownloaded/66/36/663608e8c6981490b10387498143afa8626d3ab7.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThe domain of events we will be organising spans across Competitive Programming, Application Development, Cyber Security and Machine Learning. Prizes netting ₹300K is up for grabs as well!\u003c/p\u003e\u003cp\u003eThe fest kicks off on \u003cstrong\u003eFriday, 23rd March 2018\u003c/strong\u003e, and will continue until \u003cstrong\u003eSunday, 8th April 2018\u003c/strong\u003e. We\u0027ve put lots of love and effort into making the problem statements of every contest, and we hope that you enjoy solving them as much as we enjoyed making them :)\u003c/p\u003e\u003cp\u003eThe events are planned as follows:-\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003eDivide By Zero 6.0\u003c/strong\u003e — Euristica\u0027s flagship short programming contest\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eHackathon\u003c/strong\u003e — A social coding event to build a new software under the to-be-announced broad themes. Each team can consist of a maximum of 4 people. (Platform — Hackerearth)\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eCapture the Flag\u003c/strong\u003e — A Capture the Flag Competition held by Byte Bandits, IIT Indore’s academic CTF team. The team size for the CTF should be a maximum 4 people.\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eMachine Learning Codesprint\u003c/strong\u003e — Participants will be given real world Machine Learning problems, and will have to train their computers to understand and model the data, and predict target outputs corresponding to unseen inputs. (Platform — Hackerearth)\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eCode Mélange IV\u003c/strong\u003e — A long algorithmic competitive programming contest which will test your logical, analytical and algorithmic skills. (Platform — Codechef)\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eCode Golf 4.0\u003c/strong\u003e — A coding contest in which, the shorter you code, the better you score. (Platform — Hackerrank)\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eSurprise Language IV\u003c/strong\u003e — A programming contest in which the language will be a secret, revealed only 15 minutes before the contest. We will be releasing a list of languages 3 days before the contest. (Platform — Hackerrank)\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eHack the Code\u003c/strong\u003e — A programming contest which tests your debugging skills by correcting/debugging the given code for the failing test case(s). (Platform — Hackerrank)\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eFool You!\u003c/strong\u003e — A unique programming contest, in which thinking for the solution might still be easier than understanding the problem ! (Platform — Hackerrank)\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eSOH CAH TOA\u003c/strong\u003e — A short-duration mathematical programming contest focusing on number theory, probability, combinatorics, modular arithmetic and other interesting math topics. (Platform — Codechef)\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eFor more details and link to previous year contests, please visit — \u003ca href\u003d\"https://www.euristica.in\"\u003e\u003cstrong\u003eEuristica.in\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSee you on the leaderboard!\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}