{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1484959228,"rating":33,"authorHandle":"snarknews","modificationTimeSeconds":1486140497,"id":49909,"title":"\u003cp\u003e\u0026quot;Итоги года — 2016\u0026quot; — второй тур\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПри подготовке и проведении второго тура на системе Яндекс.Контест возник вопрос: каким образом обеспечить хотя бы приблизительное соответствие количества голосующих и количества используемых логинов. В прошлом году было приняты следующие правила, остающиеся неизменными и на этот раз. \u003c/p\u003e\u003cp\u003eГолосование будет проведено на системе Яндекс.Контест и будет открытым, но при подсчёте будут учитываться только голоса:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eучастников известных организаторам очных соревнований, проводившихся на системе Яндекс.Контест без использования предварительно сгенерированных (\u0026quot;внутренних\u0026quot;) логинов;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eзарегистрированных на отборочные раунды Яндекс.Алгоритма 2013-2016 годов (как в качестве жюри, так и в качестве участников); \u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eучастников SnarkNews Winter и Summer series, сдавших хотя бы одну задачу в раундах до второго раунда SNWS-2017 включительно;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eкоординаторов секторов Открытого Кубка; \u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003eучастников, не входящих ни в один из этих списков и пославших запрос от своего логина на Codeforces (с указанными в профайле реальным именем, фамилией и организацией)\u003c/strong\u003e пользователю \u003ca class\u003d\"rated-user user-black\" href\u003d\"/profile/snarknews\" title\u003d\"Не в рейтинге, snarknews\"\u003esnarknews\u003c/a\u003e личным сообщением; в запросе должен быть указан соответствующий логин на Яндекс.Контесте. \u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eВ последнем случае идентифицированы будут или те, кто принимал участие не менее чем в 10 официальных раундах (при этом, если участник вышел в Division 1, он должен провести там не менее одного раунда), или тренеры/организаторы/руководители, известные в сообществе спортивных программистов и участвовавшие в каких-либо дискуссиях в блогах. Организаторы голосования оставляют за собой право отказать в идентификации в случае обоснованных подозрений во \u0026quot;вторичности\u0026quot; указанного логина после консультации с администрацией Codeforces.\u003c/p\u003e\u003cp\u003eВторой тур голосования \u003cstrong\u003eоткрылся\u003c/strong\u003e 21 января 2017 года в 3:00 и продлится до 12:00 26 января 2017 года. \u003c/p\u003e\u003cp\u003eUpdate: \u003ca href\u003d\"http://snarknews.info/poll2016final.html\"\u003eПолные результаты второго раунда голосования\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e3 февраля на сборах в Петрозаводске прошло награждение победителей голосования \u0026quot;Итоги года\u0026quot;. Поздравляем победителей!\u003c/p\u003e\u003c/div\u003e","tags":["итоги года-2016","snarknews"]}}