{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1493213722,"rating":3,"authorHandle":"Unlimited_Time","modificationTimeSeconds":1493302968,"id":51736,"title":"\u003cp\u003eSolutions to Codeforces Beta Round #39, A, B, E(Combinatorial Mathematics)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eA. Find Color\u003c/p\u003e\u003cp\u003eAs the problem has stressed that all the points locating at the border of any areas are considered to be black, if x\u003d\u003d0 or y\u003d\u003d0, the answer will be black. For the other points, we should find out a radius r which satisfies that \u003c/p\u003e\u003cp\u003e(r-1)^2 \u0026lt; x^2+y^2 \u0026lt;\u003d r^2\u003c/p\u003e\u003cp\u003eThen, if x^2+y^2 \u003d\u003d r^2, the answer is black as well. For x^2+y^2 \u0026lt; r^2, we can consider the following two cases:\u003c/p\u003e\u003cp\u003e1) r%2\u003d\u003d0, if x*y\u0026gt;0, the answer is white; otherwise is black;\u003c/p\u003e\u003cp\u003e2) r%2\u003d\u003d1, if x*y\u0026gt;0, the answer is black; otherwise is white.\u003c/p\u003e\u003cp\u003eB. Repaintings\u003c/p\u003e\u003cp\u003eBy some careful induction, we will find that the original problem is equivalent to the following one:\u003c/p\u003e\u003cp\u003eFor a chessboard with a\u003dn-(x-1)*2 rows and b\u003dm-(x-1)*2 columns, how many black squares are there on the four edges, given that the square at the left upper corner is black?\u003c/p\u003e\u003cp\u003eThe solution can be divided into the following steps:\u003c/p\u003e\u003cp\u003e1) Count the number of black squares in the first row. It is straightforward to find that the number is (b+1)/2. \u003c/p\u003e\u003cp\u003e2) Count the number of black squares in the last row. The number turns out to be (b+1)/2-(a+1)%2. \u003c/p\u003e\u003cp\u003e3) Count the number of black squares in the first column, which should be (a+1)/2.\u003c/p\u003e\u003cp\u003e4) Count the number of black squares in the last column, which is (a+1)/2-(b+1)%2.\u003c/p\u003e\u003cp\u003e5) Count the number of black squares at the four corners, if they have been repeatedly counted. Left upper corner: 1; Left bottom corner: a%2; Right upper corner: b%2; Right bottom corner: (b%2+a%2-1).\u003c/p\u003e\u003cp\u003eTherefore, the answer should be (b+1)/2+(b+1)/2-(a+1)%2+(a+1)/2+(a+1)/2-(b+1)%2-1-a%2-b%2-(b%2+a%2-1). However, a special case where a\u003db\u003d1 is not included in the above formula, and also note that if a\u0026lt;\u003d0 or b\u0026lt;\u003d0, the answer is 0 as well.\u003c/p\u003e\u003cp\u003eE. Number Table\u003c/p\u003e\u003cp\u003eAn interesting problem!! \u003c/p\u003e\u003cp\u003eThe hint  k \u0026lt; max(n, m) might shed some light on how to think about the solution. Suppose that the table has been filled with +1 and -1, and met the requirement as well. Then, we try to multiply all the +1 and -1 together. At first, we implement this operation column by column to obtain (-1)^m, and similarly repeating it row by row will give (-1)^n. Thus, (-1)^m\u003d(-1)^n, and this means that (m+n)%2\u003d0 must be satisfied, and it serves as a necessary condition. \u003c/p\u003e\u003cp\u003eWe will first deal with the case n\u0026lt;m. As  k \u0026lt; max(n, m), it implies that there must be at least one column in which no cells are preserved, while for the other columns, some or even all of the cells have been filled with some +1 and -1. An intuitive idea is to first fill the columns except for the one in which absolutely no cells are preserved (there may exist multiple such columns, but it is sufficient to consider only one of them). It is obvious that these m-1 columns can always meet the requirement, and then we try to fill the special column. It is obvious again that all the n rows can meet the requirement. The only question to ask is that whether the special column can meet the requirement or not. In fact, the answer is YES, and the proof is as follows:\u003c/p\u003e\u003cp\u003eProof: We use A[i][j] to denote the value in the i-th row and j-th column. According to our operations, it has been guaranteed that A[1][j]*A[2][j]*A[3][j]*...*A[n][j]\u003d-1 holds for all the columns except for the special one. Without loss of generality, we denote the special column as A[ ][s]. Furthermore, we also have A[i][1]*A[i][2]*A[i][3]*...*A[i][m]\u003d-1. Therefore, we multiply all the values row by row and will obtain \u003c/p\u003e\u003cp\u003eA[1][1]*A[1][2]*A[1][3]*...*A[1][m]*\u003c/p\u003e\u003cp\u003eA[2][1]*A[2][2]*A[2][3]*...*A[2][m]*\u003c/p\u003e\u003cp\u003e...\u003c/p\u003e\u003cp\u003eA[n][1]*A[n][2]*A[n][3]*...*A[n][m]\u003d(-1)^n\u003c/p\u003e\u003cp\u003eIf we combine them column by column, we have (-1)^(m-1)*A[1][s]*A[2][s]*A[3][s]*...*A[n][s]\u003d(-1)^n, and thus A[1][s]*A[2][s]*A[3][s]*...*A[n][s]\u003d(-1)^(n+m-1)\u003d(-1)^(n+m)*(-1)\u003d-1.\u003c/p\u003e\u003cp\u003eAccording to the above arguments, the problem can be solved by the following steps:\u003c/p\u003e\u003cp\u003e1) check if (n+m)%2\u003d0 holds or not;\u003c/p\u003e\u003cp\u003e2) fill the preserved cells with the corresponding values, and if for some column, all the cells are preserved, we should check whether the column meet the requirement or not;\u003c/p\u003e\u003cp\u003e3) calculate the number of feasible combination of +1 and -1 for all the columns except for the special one, and multiply the results together.\u003c/p\u003e\u003cp\u003eFinally, we have to deal with another two small problems. The first one is that if n\u0026gt;m, we can swap the value of n and m, but be careful that we should swap the values of a and b as well. The second problem is that for some column possibly filled with +1 or -1 in some preserved cells, how to calculate the number of different methods to fill the left cells. Suppose that we have N cells to fill with +1 or -1. The number can be calculated according to the following two cases, where C(x,y) means the number of feasible combination by choosing y elements from the total x ones.\u003c/p\u003e\u003cp\u003e1) an even number of -1 should be filled, which gives S1\u003dC(N,1)+C(N,3)+...C(N,2k-1)+...;\u003c/p\u003e\u003cp\u003e2) an odd number of -1 should be filled, which leads to S2\u003dC(N,2)+C(N,4)+...C(N,2k)+...;\u003c/p\u003e\u003cp\u003eNow we are going to prove that both S1 and S2 are equal to 2^(N-1).\u003c/p\u003e\u003cp\u003eProof: we first consider (1+1)^N\u003dsum{C(N,i)(1)^i(1)(N-i)}\u003dC(N,1)+C(N,3)+...C(N,2k-1)+...+C(N,2)+C(N,4)+...C(N,2k)+...\u003dS1+S2\u003d2^N. Then, we consider (1-1)^N\u003dsum{C(N,i)(-1)^i(1)(N-i)}\u003dS2-S1\u003d0. Therefore, S1\u003dS2\u003d2^N/2\u003d2^(N-1).\u003c/p\u003e\u003c/div\u003e","tags":[]}}