{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1458991828,"rating":62,"authorHandle":"darkshadows","modificationTimeSeconds":1458994722,"id":44005,"title":"\u003cp\u003eScience of training and collaboration in competitive programming(now with animated gifs)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eRecently someone asked me a question on Quora about how groups can help in competitive programming and I was reminded of \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/I_love_Hoang_Yen\" title\u003d\"Grandmaster I_love_Hoang_Yen\"\u003eI_love_Hoang_Yen\u003c/a\u003e\u0027s modelling of competitive programming as an obstacle jumping game and I went ahead to write \u003ca href\u003d\"https://www.quora.com/Do-groups-help-in-improving-competitive-coding-skills-If-so-are-there-any-who-would-like-to-colaborate-with-me-for-learning-these-skills/answer/Lalit-Kundu\"\u003ethis\u003c/a\u003e answer. I\u0027d also like to share the text here.\u003c/p\u003e\u003cp\u003eThere is a great post by \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/I_love_Hoang_Yen\" title\u003d\"Grandmaster I_love_Hoang_Yen\"\u003eI_love_Hoang_Yen\u003c/a\u003e where he tries to model competitive programming as an obstacle jumping game. I\u0027d like to use same analogy here to help you. I have used some excerpts from his post, which I\u0027ve italicized. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe \u0027science\u0027 of problem solving\u003c/strong\u003e\u003cbr /\u003e\u003cem\u003eFor each problem, in order to solve it, you must jump over a gap or an obstacle. It can be either a difficult implementation, or some hard-to-see observation, difficult algorithm, etc.\u003c/em\u003e \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"img\" src\u003d\"/predownloaded/37/4f/374f3eb5168de0d96903eab72332b68a260d9fef.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eFor me, some problems are very easy (e.g. Codeforces div 2 A, B..), because those gaps seem so small to me, and passing through them feel just like casual walking.\u003c/em\u003e \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"img\" src\u003d\"/predownloaded/8a/ac/8aacbfa941859d48ba85a8b37cb491f198e916f8.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eSome problems are very hard. The gap is just too huge, or there are many many gaps, and you can get stuck in the middle because you\u0027re too tired after maybe first gap.\u003c/em\u003e \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"img\" src\u003d\"/predownloaded/d1/b9/d1b9c34e166a98fabf125251b542c4134da30fed.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eOr maybe there is some trick/concept that you don\u0027t know yet! Here you are, applying brute force or greedy technique to a DP problem; of course, you won\u0027t succeed. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"img\" src\u003d\"/predownloaded/13/49/13498334ac1d8b6fcc39a38fff7b5f12b8787629.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eBut now comes your experienced friend, who has been doing competitive programming for a few months, knows how to do complexity analysis, so she knows brute force won\u0027t succeed, with some more convincing she proves to you why greedy is wrong and this is where working in groups is helpful.\u003cbr /\u003eNow, you\u0027ll easily cross the obstacle with some guidance. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"img\" src\u003d\"/predownloaded/85/9a/859a63a3fb630af8b15c5983167725beb156fbed.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eIf you have read Thanh Trung Nguyen\u0027s \u003ca href\u003d\"//codeforces.com/blog/entry/17842\"\u003epost\u003c/a\u003e you\u0027ll know what to do to improve yourself individually. You just need to keep learning new tricks and concepts, at the same time you need to make sure you aren\u0027t making same mistakes again. Occasionally, when are stuck, you can ask your friends for help. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWhere to find these friends\u003c/strong\u003e\u003cbr /\u003eYou are looking for people who are doing competitive programming and a good community where people help each other to make the game more interesting; what can be a bigger community than Codeforces! If you are facing some difficulties you can always put up a blog post asking for help.\u003cbr /\u003eHowever, as I\u0027ve noticed, some people might find online collaboration a little ineffective when compared with physical presence. Some abstractions might be difficult to understand when they are just written down, instead of someone explaining to you in front of you on a board or paper. If you are school or college student, best way is to look around you, you\u0027ll find plenty of people doing these contests and willing to discuss and share their knowledge with you. If there aren\u0027t any such people, you can form a programming club in your institution and inspire other people too to join you. \u003c/p\u003e\u003cp\u003eGood luck!\u003c/p\u003e\u003cp\u003eFoot note: All gifs made using \u003ca href\u003d\"https://play.google.com/store/apps/details?id\u003dcom.nekki.vector\u0026amp;hl\u003den\"\u003eVector — Android Apps on Google Play\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["science","contest","collaboration","tagsareboring"]}}