{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1527634458,"rating":124,"authorHandle":"Miyukine","modificationTimeSeconds":1527634528,"id":59751,"title":"\u003cp\u003eMy personal opinion on round #485 and making rounds (un)rated.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eDisclaimer: this post contains my thoughts and suggestions. Feel free to discuss the topics in the comments\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e[TL;DR] Cool problems, issues, why not semi-rated.\u003c/p\u003e\u003cp\u003eFirst of all, I\u0027d like to congratulate \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Um_nik\" title\u003d\"Legendary grandmaster Um_nik\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eU\u003c/span\u003em_nik\u003c/a\u003e for making the simultanously best and worst round I\u0027ve seen in a while :) On a more serious note, I\u0027ve really enjoyed solving your problems, in contrary to some yet-another-segment-tree-problems. Especially B was quite unusual when it comes to CF.\u003c/p\u003e\u003cp\u003eHowever, there are some issues brought up by \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/geniucos\" title\u003d\"International Grandmaster geniucos\"\u003egeniucos\u003c/a\u003e \u003ca href\u003d\"//codeforces.com/blog/entry/59720?#comment-434232\"\u003ehere\u003c/a\u003e which I completely agree with. Memory limit issues are really rare, and you usually realize that when you get MLE1 after submitting. Unfortunately, it was not possible today, so some participants were affected quite much (hello \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Swistakk\" title\u003d\"International Grandmaster Swistakk\"\u003eSwistakk\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eMoreover, it wasn\u0027t only a case of MLE. \u0026quot;Incorrectly\u0026quot; solved problem B required using random generators. And now the standard CF feature — RAND_MAX is 32767. I\u0027ve tested my solution locally and was quite shocked to see WA10 after the long queue ended. Looking at my submission: oh, RAND_MAX. Let\u0027s fix it. Wait. The round has ended 3 hours ago \u003d) Of course you can say this should fail. But the problem is that such solutions passed. Look at \u003ca href\u003d\"/contest/986/submission/38734837\" title\u003d\"Submission 38734837 by radoslav11\"\u003e38734837\u003c/a\u003e or \u003ca href\u003d\"/contest/986/submission/38747568\" title\u003d\"Submission 38747568 by zml\"\u003e38747568\u003c/a\u003e. Especially no tests with N \u003d 1000 and answer Um_nik — seem quite weak.\u003c/p\u003e\u003cp\u003eAnd well... the queue. 30 mins is in no circumstances a \u0026quot;very end of the contest\u0026quot;. Even in an OI-style contest it\u0027s quite a lot of time. Of course, participants who didn\u0027t submit anything during this time were not affected at all. Usually submits during this time belong to most important problems — or at least the hardest we could solve. So it is imho the most important period of time. Some participants passed systests without any problems, some got FST and some got errors on pretest1. My C submission fortunately passed pretests with 3950ms (with TL \u003d 4 seconds). Of course, everyone would realize his implementation is not efficient enough after getting such verdict. \u003c/p\u003e\u003cp\u003eNow, the most important part. There were some other options used in the past other than binary rated. If semi-rated didn\u0027t sound like a good idea, then maybe you could at least allow participants who were severly affected by the long queue to be excluded from the official ranklist, just like cheaters are (but no bans please)? I\u0027d be very grateful an for official response. Attention tag. \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/KAN\" title\u003d\"Grandmaster KAN\"\u003eKAN\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eMy apologies for everyone who had to read this boring wall of text. Cheers :D \u003c/p\u003e\u003c/div\u003e","tags":[]}}