{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1403114878,"rating":160,"authorHandle":"phantom11","modificationTimeSeconds":1406212002,"id":12727,"title":"\u003cp\u003eCodeforces Country Wise Standings\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eUPDATE : Version 2.0\u003c/strong\u003e\u003cbr /\u003e Rewrote whole code (frontend + parser) from scratch. Here are the changes made(in order of importance in my view) :\u003cbr /\u003e - Fixed bugs in parser.\u003cbr /\u003e - Div 2 Rounds Unofficial find their place in the standings. (\u003ca href\u003d\"http://phantom11.in/codeforces/index.php?contestId\u003d448\u0026amp;country\u003dIndia\"\u003ethis\u003c/a\u003e and \u003ca href\u003d\"http://phantom11.in/codeforces/index.php?contestId\u003d441\u0026amp;country\u003dIndia\"\u003ethis\u003c/a\u003e. You can now see Div 2 standings of \u003cem\u003eONLY Officials\u003c/em\u003e, \u003cem\u003eONLY UnOfficals\u003c/em\u003e, as well as both.\u003cbr /\u003e - Added some internal securities\u003cbr /\u003e - Now have a \u003ca href\u003d\"http://phantom11.in/codeforces/about.html\"\u003eabout us\u003c/a\u003e page too. :) \u003cbr /\u003e - Much neater and a modular code. \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eVery often we are interested in knowing our position in our country for a contest. Unfortunately, Codeforces does not provide this feature. An ugly way to do it is to make friends with all your country people. But ofcourse that is ugly, and programmers are supposed to be smart.\u003c/p\u003e\u003cp\u003eSo I decided to write a scraper and do it on my own. When I graduated this year, and had some time in my pocket, \u003ca class\u003d\"rated-user user-green\" href\u003d\"/profile/franky\" title\u003d\"Pupil franky\"\u003efranky\u003c/a\u003e and I made this feature. Now that the script is ready, you can find all the contest\u0027s \u003ca href\u003d\"http://www.phantom11.in/codeforces/index.php\"\u003ecountry wise standings here\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEDIT:\u003c/strong\u003e I forgot to mention that those who have not filled in their countries here on codeforces, come under \u0026quot;Alien\u0026quot; in the country-wise standings. I request these people to fill in their correct nationality. \u003c/p\u003e\u003c/div\u003e","tags":["codeforces","standings","country-wise"]}}