{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1472146605,"rating":97,"authorHandle":"RodionGork","modificationTimeSeconds":1472146605,"id":46774,"title":"\u003cp\u003eE-Maxx in English update (automation / revival attempt)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi Friends!\u003c/p\u003e\u003cp\u003eBriefly: \u003cstrong\u003eE-Maxx in English\u003c/strong\u003e project is now semi-automated so it would be far easier (I hope) to contribute.\u003c/p\u003e\u003cp\u003eUpdated web-site is \u003ca href\u003d\"http://e-maxx-eng.appspot.com\"\u003ehttp://e-maxx-eng.appspot.com\u003c/a\u003e. It grabs source texts from github and converts them from markdown. So now if you want to add an article, you can do this just in your browser, in github\u0027s interface. No more need to kick with local PHP installation etc.\u003c/p\u003e\u003cp\u003eYou can read details in \u003ca href\u003d\"http://e-maxx-eng.appspot.com/contrib.html\"\u003eContributors Manual\u003c/a\u003e or watch this \u003ca href\u003d\"https://www.youtube.com/watch?v\u003dTrBBw4J9X30\"\u003edemo video\u003c/a\u003e.\u003c/p\u003e \u003chr /\u003e\u003cp\u003eIn details:\u003c/p\u003e\u003cp\u003eI\u0027ve started E-Maxx-Eng project two years ago, as described in \u003ca href\u003d\"//codeforces.com/blog/entry/13198\"\u003ethis post\u003c/a\u003e.\u003c/p\u003e \u003cul\u003e   \u003cli\u003ethe first part of idea was that people would be able to add or update texts via GitHub fork / pull-request functionality;\u003c/li\u003e   \u003cli\u003ethe second part was to convert markdown article sources into html with PHP script on local computer and then upload result to github pages.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe second part was total crap, as it appeared. I myself felt it is difficult to update the site in such manner so the site soon become forsaken as I got more involved in my personal projects. I\u0027m sorry for this.\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/I_love_Hoang_Yen\" title\u003d\"Grandmaster I_love_Hoang_Yen\"\u003eI_love_Hoang_Yen\u003c/a\u003e provided much help with reviewing and merging recent pull-requests, however I\u0027m afraid it seemed far from comfortable for him either. Thanks a lot to him!\u003c/p\u003e\u003cp\u003eRecently \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Nickolas\" title\u003d\"Expert Nickolas\"\u003eNickolas\u003c/a\u003e wrote to me with the question whether anything could be improved. As I admire and love her greatly, I felt quite ashamed that the project is neglected. So big thanks too! And thanks to everyone who tried to contribute, to help or simply wrote some kind words.\u003c/p\u003e\u003cp\u003eSo I composed my brain and tried to make appengine project which can:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eautomatically grab new pages from github project as they are merged;\u003c/li\u003e   \u003cli\u003eprovide live preview for the text you are going to add;\u003c/li\u003e   \u003cli\u003eand render all these page, so becoming a new e-maxx-eng site.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIt seems to work now. Though perhaps you will be able to point some bugs or suggest improvements. Please sorry again for it take that long, but honestly speaking 2 years ago I have no clear idea of how this could be done. We all learn new things by and by.\u003c/p\u003e\u003cp\u003eP.S. I hope we\u0027ll be able to add few more \u0026quot;admins\u0026quot; to the github e-maxx-eng organization by and by who have the power to accept pull-requests and also to provide technical advice to contributors (e.g. with github, markdown etc).\u003c/p\u003e\u003c/div\u003e","tags":["e-maxx","english"]}}