{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1407754134,"rating":-149,"authorHandle":"beatoriche","modificationTimeSeconds":1407819392,"id":13360,"title":"\u003cp\u003eIslam and CF ratings\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eWhen I was a child, I believed that programmers have to have rational thinking, because um, it is neccessary. A day ago, many people who didn\u0027t like my claim that Islam is one of many factors which drives country development down instead criticized my persona. Strangely, no one asked why I thought that. Some liked to pick single data points which supported their opinion, without looking at picture as whole.\u003c/p\u003e\u003cp\u003eFirst figure: Y-axis: weighted rating (courtesy of CF) X-axis: N registered participants from a country (Sorry, the picture disappears sometimes. if it does: \u003ca href\u003d\"https://www.dropbox.com/s/jgjon8ve3m27ghu/islam-corr.png\"\u003ehttps://www.dropbox.com/s/jgjon8ve3m27ghu/islam-corr.png\u003c/a\u003e)\u003c/p\u003e\u003cp\u003eHow do we know that correlation on the first figure is indeed causal? There is correlation between amount of exposure to Islam a country had (recent minus year when it converted to Islam), and its performance. Note that Indonesia and Malaysia are also are in unfomfortable timezone for CF.\u003c/p\u003e\u003cp\u003eNote that countries that converted to Islam during life of Mohammad are not present in the table — there is no data for them. Probably because the competitions aren\u0027t for their people, they are busy pouring boiling water on Asian maids.\u003c/p\u003e\u003cp\u003ebottom line: programmers don\u0027t have more rational thinking than general population. Apparently here, on CF, finding facts to support claims is a bad thing.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/5c/2a/5c2ab0e4e013a65ebb07013b85c775c7fcf1a3be.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}