{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1489834404,"rating":63,"authorHandle":"dalex","modificationTimeSeconds":1489834404,"id":51058,"title":"\u003cp\u003eДаты отбора на чемпионат Урала 2017\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЯ совсем чуть-чуть заинтересованное лицо, но вроде бы стоит поднять немного шума, так как поведение организаторов чемпионата Урала выглядит так, будто им на все плевать.\u003c/p\u003e\u003cp\u003eСобственно, дело в том, что примерно неделю на этой страничке: \u003ca href\u003d\"http://acm.urfu.ru/chu/2017/\"\u003ehttp://acm.urfu.ru/chu/2017/\u003c/a\u003e была информация, что отбор пройдет на опенкапе 2 апреля, но недавно ее поменяли, и на самом деле он пройдет 26 марта. Никому не кажется, что переносить дату отбора \u003cem\u003eна неделю назад за неделю до начала\u003c/em\u003e — это очень подлый и неприемлемый поступок? Видя одну дату, люди начинают планировать свои дела, а спустя некоторое время все планы рушатся. Давайте может на завтра тогда перенесем? Там как раз какой-то контест от сборов МФТИ намечается. Вроде норм, да?\u003c/p\u003e\u003cp\u003eНапример, у нас возникло пересечение с нашим ежегодным контестом (\u003ca href\u003d\"//codeforces.com/gym/100030\"\u003e2012\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/gym/100187\"\u003e2013\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/gym/100460\"\u003e2014\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/gym/100694\"\u003e2015\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/gym/100971\"\u003e2016\u003c/a\u003e). Дата 26 марта довольно долго была свободна, но потом появляется опенкап, а затем на этот опенкап ставят отбор на чемпионат Урала. \u003cem\u003eЕсли у вас крупное мероприятие — просто анонсируйте его заранее, чтобы организаторы мелких мероприятий могли подогнать даты.\u003c/em\u003e На самом деле я не верю, что команда из Самары прошла бы этот отбор, но, кажется, такие коллизии могут возникать где угодно и у кого угодно, и они не ограничиваются олимпиадами по программированию.\u003c/p\u003e\u003c/div\u003e","tags":["чемпионат урала"]}}