{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1523685053,"rating":31,"authorHandle":"adityaramesh","modificationTimeSeconds":1523685266,"id":58922,"title":"\u003cp\u003eCode Faster — A Sublime Text 3 Plug-In for Codeforces\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello CodeForces!\u003c/p\u003e\u003cp\u003eFor educational reasons, I\u0027ve been working on a passion project over the last few days, and the inspiration for this came from my interest in competitive programming, and my newfound love toward the text editor — Sublime Text, (and if I\u0027m being completely honest, my laziness was also a factor).\u003c/p\u003e\u003cp\u003eIntroducing — \u003ca href\u003d\"https://github.com/RameshAditya/code-faster\"\u003eCode Faster — https://github.com/RameshAditya/code-faster\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u0026quot;Code Faster\u0026quot; is a Sublime Text 3 Plug-in I developed, that loads problem statements from CodeForces directly inside Sublime Text\u0027s editor window, at the click of a button.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe plug-in allows the user to select the level of problem statement they want to retrieve (A, B, C, D, or E) and uses the CodeForces API to obtains the most recent contest number, uses that as an upper limit, and accordingly pulls a problem statement from a previous contest, for the user to directly start solving.\u003c/p\u003e\u003cp\u003eIt\u0027s worth mentioning that an added advantage of the current implementation of this plug-in, is that it \u003cstrong\u003ecan be modified to pull an ongoing contest\u0027s problem statements into the text editor too\u003c/strong\u003e, as long as the user has registered for the contest — by changing a single line, in the implementation. (Explicitly mentioned, in my GitHub repo)\u003c/p\u003e\u003cp\u003eThe menu for pulling a problem statement looks like this - \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/e6/3f/e63f9b1516daf277ffc748aa9511ac3a7335cec8.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eAnd the pulled problem statement would look like this - \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/a8/aa/a8aa4aad7e32436772467d2cac413a008f6e397b.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThe goal of this project was to cater to speed and convenience, and I hope you all like the end result.\u003c/p\u003e\u003cp\u003eThis project is open source, and I encourage you all to use it, give me feedback and help make it better. :)\u003c/p\u003e\u003cp\u003eThe GitHub Repository link is available over \u003ca href\u003d\"https://github.com/RameshAditya/code-faster\"\u003ehere — https://github.com/RameshAditya/code-faster\u003c/a\u003e, and I\u0027ve detailed the set-up instructions in the Readme file.\u003c/p\u003e\u003cp\u003eAnd if you liked the idea, it would absolutely make my day if you gave the repository a star and/or submitted a pull request helping me make it better for the community.\u003c/p\u003e\u003cp\u003eThanks,\u003c/p\u003e\u003cp\u003eAditya\u003c/p\u003e\u003c/div\u003e","tags":["#codeforces","sublime text","#python","plugin"]}}