{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1415889974,"rating":105,"authorHandle":"marat.snowbear","modificationTimeSeconds":1415890065,"id":14698,"title":"\u003cp\u003eA job for the red one\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi guys!\u003c/p\u003e\u003cp\u003eI\u0027m currently unemployed, looking for a job and would like to make some survey here, basically the topic would be \u0026quot;the interesting job\u0026quot;. To give you a quick introduction: I was working as a .Net developer for around 7 years in different but more or less similar outsourcing companies, I\u0027ve started participating in competitive programming 1.5 years ago and eventually this ruined my career in regular outsourcing cause the tasks there most of the time are more boring and less brain-teasing than what you have in CP. \u003c/p\u003e\u003cp\u003eTo be clear, what I want here is to have as much opinions as possible, I would appreciate any ideas, consider this topic to be a brainstorming platform. I just want to broaden my understanding of what is there outside of the companies where I was working before. I\u0027m interested to hear about your companies (I won\u0027t blame you if you decide to advertise your company in this blog post), or maybe you won\u0027t give out the company name but will share what do you do there, whether you find it interesting or not, anything. \u003c/p\u003e\u003cp\u003eI\u0027m interested to hear about different areas you are working in, I\u0027m not even restricting it to be a programming job, maybe something CS-related (but still supposed to be interesting for a programmer), maybe you\u0027re working in CS-research centres, maybe in some educational centre, maybe you\u0027re winning a lot of monthly/yearly contests and selling the T-shirts you get there and that\u0027s basically your salary. \u003c/p\u003e\u003cp\u003eGood example of what I\u0027d like to see here is \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/gojira\" title\u003d\"International master gojira\"\u003egojira\u003c/a\u003e\u0027s Rockethon introduction blog post where he was introducing Rocket Fuel, what do they do there, why is it interesting to work there, what might be the challenging task there and what does it have to do with competitive programming. \u003c/p\u003e\u003c/div\u003e","tags":["job","wont-code-php-for-food"]}}