{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1415436301,"rating":0,"authorHandle":"burakcetin","modificationTimeSeconds":1415619643,"id":14636,"title":"\u003cp\u003eUSACO 2014 March Contest, Silver: MoooMoo\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eProblem: \u003ca href\u003d\"http://usaco.org/index.php?page\u003dviewproblem2\u0026amp;cpid\u003d417\"\u003ehttp://usaco.org/index.php?page\u003dviewproblem2\u0026amp;cpid\u003d417\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTerezi\u0027nin Tebesirleri\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eTebesirlerin tadini cok seven Terezi sehirindeki N\u0026lt;\u003d100 adet kirtasiyeyi sirayla gezecektir. Terezi bir kirtasiyeye girdiginde kesinlikle ordaki tum tebesirleri satin almaktadir ve her kirtasiyeden ciktiginda defterine o anda kac tebesiri oldugunu not alir. Buna ek olarak iki kirtasiye arasindaki yol yeterince uzun oldugu icin eger elinde bulunuyorsa yolda giderken bir adet tebesiri bitirmektedir. Tum kirtasiyelerde tebesirler kapasiteleri farkli paketler halinde satilmaktadir. B\u0026lt;\u003d20 farkli paket turu vardir ve bunlarin her biri b_i adet tebesir icermek zorundadir. Bunlara ek olarak hicbir kirtasiyenin 100000 taneden fazla tebesir bulundurmadigi bilinmektedir. Terezi butun yolculugunu bitirdikten sonra toplam kac paket tebesir almis oldugunu unutmustur. Size farkli paketlerin kapasiteleri (b_i\u0026lt;\u003d100) ve Terezi\u0027nin defterindeki notlar (n_i) verildiginde Terezi\u0027nin en az kac paket tebesir satin almis olabilecegini bulmaniz. Girdi bicimi: N B (Kirtasiye ve Paket turu sayisi) B tane sayi (b_i yani farkli paketlerin kapasiteleri) N tane sayi (n_i yani Terezi\u0027nin notlari)\u003c/p\u003e\u003cp\u003eOrnek girdi:\u003c/p\u003e\u003cp\u003e5 2\u003c/p\u003e\u003cp\u003e5 7\u003c/p\u003e\u003cp\u003e0 17 16 20 19\u003c/p\u003e\u003cp\u003eGirdi detayi:\u003c/p\u003e\u003cp\u003e5 kirtasiye var ve Terezi\u0027nin notlari sirayla 0,17,16,20,19 2 tur paket var ve kapasiteleri sirasiyla 5,7\u003c/p\u003e\u003cp\u003eCikti bicimi:\u003c/p\u003e\u003cp\u003eTek bir satirda Terezi\u0027nin satin almis olabilecegi minimum paket sayisi. (Eger paket kapasiteleri ile notlarin uyusma olasiligi yok ise -1 yazdirin.)\u003c/p\u003e\u003cp\u003eOrnek cikti:\u003c/p\u003e\u003cp\u003e4\u003c/p\u003e\u003cp\u003eCikti detayi:\u003c/p\u003e\u003cp\u003eEn azindan 2. kirtasiyede 2 adet 5\u0027lik ve 1 adet 7\u0027lik paket ve 4. kirtasiyede 1 adet 5\u0027lik paket almis olmalidir.\u003c/p\u003e\u003cp\u003eBenim Kodum: \u003ca href\u003d\"http://ideone.com/UAnxOy\"\u003ehttp://ideone.com/UAnxOy\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSorunun konusu kodun ilk satirinda ve cozumun kisa bir aciklamasi ise kodun sonunda bulunmaktadir. H3 H3 H3 \u0026gt;:]\u003c/p\u003e\u003c/div\u003e","tags":["zorluk4"]}}