{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399077608,"rating":0,"authorHandle":"revenge5","modificationTimeSeconds":1399077608,"id":12093,"title":"\u003cp\u003esecurity transfer Guangzhou\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003esecurity transfer Guangzhou Songri, Gao Hongbo appeared in almost every national security arena will be greeted by the enthusiasm of the fans — Beijing curse. \u0026quot;Maybe the transfer has not been so common, coupled with poor communication and concerned me, so I left Beijing fans may have misunderstood it.\u0026quot; Especially in the 2007 season, leading the\u003ca href\u003d\"http://www.maxsalesupras.com/nike-air-max-tn-c-39.html\"\u003enike air max tn online\u003c/a\u003e  National Security Yatai away win in the race, the mood Guoan fans excited cursed Gao Hongbo, the Yatai bus trapped in the stadium, but Gao Hongbo won the title King of the mountain still look calm.For national security hot balls City, Gao Hongbo also have their own views. \u0026quot;Guoan heritage is very good, any team can have so many spectators cheering, allowing the team to enhance the combat effectiveness of 30 percent. Guoan club organization is very good, the team is very enthusiastic to admire . \u0026quot;However, many players left the national security, while visiting Beijing Guoan match with the fans always brought boos, Gao Hongbo is no exception.When talking about the former Guoan coach Jin Zhiyang said a word of this phenomenon: \u0026quot; Gao Hongbo even honest people back to work so there are people who criticize the body, you can retain Who said Beijing\u0026quot; Jinling Evening News reporter in an interview after the former Sainty team leader Yang Chen, the same national security out from this, he also remembered. \u0026quot;I was scolded, high conductivity have been scolded, this is normal.\u0026quot; Of course, not all Beijing curse sometimes greet Gao Hongbo will be banners and slogans, \u0026quot;Gao Hongbo welcome home\u0026quot; like that. \u0026quot;I was more forgiving fans, I think they really treat me as their own children Beijingers Brazil talents, in the selection of the 23-man squad, the Selecao coach Luiz Felipe Scolari necessarily cost a lot of brains, However, according to \u0026quot;Sky Sports\u0026quot; news, in an interview, Big Phil revealed the final 23-man squad has set up 21 of them.Final 23-man squad for Brazil is alway\u003c/p\u003e\u003cp\u003es the focus of media attention, in an interview with Global TV interview, talked about this issue Scolari, Big Phil said, \u0026quot;We need to choose 23 players, so far, I Only two places have not been finalized, we have been in the process of inspection, one of the young players, one is an experienced veteran, the other one may be easier to feel\u003ca href\u003d\"http://www.maxsalesupras.com/supra-society-c-53.html\"\u003esupra society online\u003c/a\u003e  the pressure. \u0026quot;Scolari did not disclose the final two places for the competition specific circumstances, but does not rule out Kaka is Scolari veteran population, which means that Milan star\u0027s World Cup door has not been completely blocked.When it comes to the question whether someone irreplaceable, Scolari gives denies answer, \u0026quot;No one, if the person does not work, we have another one.\u0026quot;As the host, with Croatia, Brazil, Cameroon and Mexico points in the Group A, June 12, Selecao will face Croatia in the opener, talking about prospects for the Brazilian team in the World Cup, Scolari confident. \u0026quot; championship is ours, we have all the conditions to become a champion, playing at home is an advantage for us, it\u0027s like we have 24 people as well. \u0026quot;football history of a country is its modern history and the evolution of the history of the National Spiritual Growth . So, is not it a bit tooThe Someone must be despicable. I do some country football history, nothing more than the United Kingdom, Germany, Spain, the Netherlands, and of course Brazil. In fact, there is not much patience to basic football years deep among others, have experienced some of the historical moment, little knowledge of the state is not so bad. Summer \u003c/p\u003e\u003cp\u003eapproaching, that\u0027s Brazil World Cup ah. Brazil, how far-reaching football bearer, half a century before this one was round. Unfortunately, Brazil is too far, we\u0027ve only been once. Maracana too, take a moment to get lost.All who knew about the Brazilians are basically sound, and sometimes actually some inexplicable inner sense of superiority, as long as we show is so ahead of GDP. Brazilians say scattered inefficient Perhaps, but when I walked into the temple-like Maracana stadium, an exquisite green on the stand in the path of a small white sign marked attracted me . \u0026quot;1950-2014 return to Maracana\u0026quot;, one year later, a small green mark in my mind, it makes me admiration for the Brazilians, inefficient but not numb, along with the National Football fortunate drip evolution, blending a sense of is so strong.Say \u0026quot;five-star Brazil\u0026quot;, the last two are the things we coronation era. The first three of these are old, short, churning once every four years, several classic goal engraved in my memory. World Cup to return to Brazil, the only one who dares to boast \u0026quot;soccer kingdom\u0026quot;\u003ca href\u003d\"http://www.maxsalesupras.com/nike-lunar-force-1-fuse-c-43.html\"\u003enike lunar force 1 sale\u003c/a\u003e  where there is the power of Scolari won only one mission — Adds a star. Brazilian internationals like scattered puzzle world generally with various combinations, but more and more strange names for them, only to let them become a Gold Cup hero generation, otherwise it can only deal with mediocrity. Before the start, the news from Brazil are mostly construction workers as well as the duration of the delay casualties, nothing fresh, Brazilians turned a blind eye, and finally a second species must be able to achieve extraordinary. Now, it is imperative to re-learn the universal history of Brazil\u0027s World Cup campaign, the public attitude right, but also do not worry brave soldiers do By Brazilian ponder history, we can learn two very new term — Brazilian style \u0026quot;Hiroshima nuclear explosion\u0026quot; and the Brazilian-style \u0026quot;moon\u0026quot;, the former corresponds \u003c/p\u003e\u003c/div\u003e","tags":[]}}