{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1433357472,"rating":251,"authorHandle":"popoffka","modificationTimeSeconds":1433357472,"id":18308,"title":"\u003cp\u003eIOI 2015: changes in rules and syllabus\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch2\u003eRules\u003c/h2\u003e\u003cp\u003eThe draft for this year\u0027s rules is available on the \u003ca href\u003d\"http://ioi2015.kz/content/view/1/264\"\u003ecompetition website\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAs it is highlighted, there are two important changes. First of all, it is officially confirmed that Java is among the languages that can be used at IOI 2015. Secondly, since the JVM uses threads \u0026quot;under the hood\u0026quot;, threads are now allowed for submissions in \u003cstrong\u003eany\u003c/strong\u003e programming language, but the runtime of a solution is counted as the sum of the runtime of all threads.\u003c/p\u003e\u003cp\u003eI don\u0027t think that these changes are really significant to any participants not using Java, because there is no point in using threads if the runtime for each thread is counted separately.\u003c/p\u003e\u003cp\u003eThe rules promise \u0026quot;generous time limits\u0026quot;, which is interesting, because experience shows that Java solutions tend to be slower even when simple wall time is considered, but counting all the JVM threads separately could result in an even more significant slowdown (compared to other languages).\u003c/p\u003e\u003cp\u003eI\u0027m a little bit concerned that this might mean that we\u0027re going to see 20s time limits again (and, consequently, long testing queues, just like during IOI 2013). This happened at the Baltic Olympiad in Informatics this year, where the jury had \u0026quot;optimal\u0026quot; Java solutions working for ~10-15s on maxtests, while C/Pascal solutions spent less than 0.5s, and the TLs were nevertheless set at around 20s (which did make feedback unavailable for a short period of time during the contest, but the jury dealt with it quickly).\u003c/p\u003e\u003cp\u003eAnother change in rules which surprised me a bit is that the graders are \u003cstrong\u003enot\u003c/strong\u003e guaranteed to use the same hardware as contestants\u0027 machines. But then again, with full feedback on 100 submissions per task, perhaps this is not a very serious issue.\u003c/p\u003e\u003ch2\u003eSyllabus\u003c/h2\u003e\u003cp\u003eThe IOI syllabus is a document describing topics (most importantly, algorithms) which IOI participants are expected to know, as well as those that must not be necessary to solve an IOI task.\u003c/p\u003e\u003cp\u003eThe new version of the IOI syllabus is already \u003ca href\u003d\"http://people.ksp.sk/~misof/ioi-syllabus/ioi-syllabus.pdf\"\u003eavailable\u003c/a\u003e, and a list of changes should be available soon on \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/misof\" title\u003d\"Candidate Master misof\"\u003emisof\u003c/a\u003e\u0027s \u003ca href\u003d\"http://people.ksp.sk/~misof/ioi-syllabus/\"\u003eIOI Syllabus page\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eMeanwhile, most of the changes in the syllabus appear to consist of moving stuff from \u0026quot;Explicitly excluded\u0026quot; to other parts of it, most often \u0026quot;Excluded, but open to discussion\u0026quot;. I understand this new category as \u0026quot;these are still excluded, but we should consider including them in IOI 2016 or later\u0026quot;, although one should be cautious with this, since the syllabus is not binding for the task authors anyway, so, if someone comes up with a really cool task concerning an excluded topic, it could theoretically be allowed, especially if the topic is \u0026quot;open for discussion\u0026quot;.\u003c/p\u003e\u003cp\u003eAnother interesting change is that \u003cstrong\u003eplanar graphs\u003c/strong\u003e were moved from \u0026quot;explicitly excluded\u0026quot; to \u0026quot;included, not for task description\u0026quot;, although planarity testing is still excluded. \u003cstrong\u003eBipartite matching\u003c/strong\u003e was also moved from \u0026quot;explicitly excluded\u0026quot; to \u0026quot;included, not for task description\u0026quot;, and maxflows and strongly connected components are now \u0026quot;excluded, open for discussion\u0026quot;. \u003cstrong\u003eBalanced binary search trees\u003c/strong\u003e are now included, and string hashing is \u0026quot;excluded, but considering inclusion\u0026quot;.\u003c/p\u003e\u003cp\u003eI hope that this overview of the changes will be useful to other IOI participants (or teachers, or spectators), and I\u0027m looking forward to hearing more information from the organizers.\u003c/p\u003e\u003cp\u003eThe changes in the syllabus seem to reflect the fact that with every year, more and more algorithms are becoming \u0026quot;widely known\u0026quot;, and the olympiad organizers are trying to reflect this, which means that the olympiad is getting harder over time. Perhaps the organizers have decided that now is the right time to formalise this by including more advanced algorithms in the syllabus (as hinted by the results of the participant surveys in \u003ca href\u003d\"http://ioinformatics.org/files/IOI2013_Survey.pdf\"\u003e2013\u003c/a\u003e and \u003ca href\u003d\"http://ioinformatics.org/files/IOI2014_Survey.pdf\"\u003e2014\u003c/a\u003e). However, at this particular moment, most of the changes seem to be in the \u0026quot;excluded, but open for the discussion\u0026quot; category, and it is certain that many discussions will be held on this topic, both at IOI and outside. Perhaps a part of this discussion might happen right here, on Codeforces.\u003c/p\u003e\u003c/div\u003e","tags":[]}}