{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1439574500,"rating":68,"authorHandle":"I_love_Tanya_Romanova","modificationTimeSeconds":1439705159,"id":19786,"title":"\u003cp\u003eAugust Clash 2015\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003eI want to invite you to participate in \u003ca href\u003d\"https://www.hackerearth.com/august-clash-15/\"\u003eAugust Clash\u003c/a\u003e at \u003ca href\u003d\"https://www.hackerearth.com/\"\u003eHackerEarth\u003c/a\u003e. Contest is scheduled on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dAugust%20Clash%20%2715\u0026amp;iso\u003d2015-08-15T01:30:00\u0026amp;p1\u003d64\"\u003eAugust, 15\u003c/a\u003e. Contest duration is 24 hours, so there should be some comfortable time for every timezone :)\u003c/p\u003e\u003cp\u003eThere will be six tasks in a problemset. Five of them are standard algorithmic problems with partial solutions allowed — you get points for every test that your solution passed. And the last task is an approximate problem — your score for this task depends on how good your solution is comparing to current best solution.\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/PrinceOfPersia\" title\u003d\"Master PrinceOfPersia\"\u003ePrinceOfPersia\u003c/a\u003e is author of this problemset. Check his blog to get a taste of problems authored by him — he already prepared a lot of different interesting contests. Right now \u003ca href\u003d\"//codeforces.com/blog/entry/19571\"\u003eHunger Games\u003c/a\u003e are running :)\u003c/p\u003e\u003cp\u003eI was working on this contest as a tester. I would like to say that I find this problemset interesting, I hope that several problems will be not too hard for beginners (don\u0027t give up and show your best with partial scoring) and some tasks are challenging enough to make this contest interesting for more experienced contestants. \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/shef_2318\" title\u003d\"Master shef_2318\"\u003eshef_2318\u003c/a\u003e worked on this contest as translator — you will be provided with statements in Russian also. Also I want to thank to \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/belowthebelt\" title\u003d\"Expert belowthebelt\"\u003ebelowthebelt\u003c/a\u003e for technical help and doing his best on fixing all issues, processing all our feedback and improving HackerEarth platform.\u003c/p\u003e\u003cp\u003eAs usual, here is one more reason for you to participate in this contest:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTop5 of leaderboard will also receive some nice prizes:\u003c/strong\u003e\u003c/p\u003e \u003col\u003e   \u003cli\u003e$100 Amazon gift card + HackerEarth T-shirt\u003c/li\u003e   \u003cli\u003e$80 Amazon gift card + HackerEarth T-shirt\u003c/li\u003e   \u003cli\u003e$50 Amazon gift card + HackerEarth T-shirt\u003c/li\u003e   \u003cli\u003eHackerEarth T-shirt\u003c/li\u003e   \u003cli\u003eHackerEarth T-shirt\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eGood luck to everybody — I hope to see you at the scoreboard :) \u003c/p\u003e\u003cp\u003eUpd. Almost 10 hours passed from the start, congratulations to \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/anta\" title\u003d\"International Grandmaster anta\"\u003eanta\u003c/a\u003e on being first to reach full score on classic part of problemset! All of you still have more than 14 hours to reach a top spot by getting 500 on classic part of problemset and beating everybody on approximate problem :)\u003c/p\u003e\u003cp\u003e\u003cem\u003eUpd2. Less than 30 minutes left till the end. We have a close matchup between \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/enot.1.10\" title\u003d\"International Grandmaster enot.1.10\"\u003eenot.1.10\u003c/a\u003e and \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/anta\" title\u003d\"International Grandmaster anta\"\u003eanta\u003c/a\u003e; and \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/FatalEagle\" title\u003d\"International master FatalEagle\"\u003eFatalEagle\u003c/a\u003e is third person with full score on classic part of problemset.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e","tags":["hackerearth","announcement","august","clash","contest","prizes"]}}