{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1520333713,"rating":13,"authorHandle":"DPR-pavlin","modificationTimeSeconds":1520368561,"id":58201,"title":"\u003cp\u003eMIPT Problem Challenge 2018\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем добрый день!\u003c/p\u003e\u003cp\u003eМеня зовут Филипп Рухович, и я являюсь членом жюри \u003ca href\u003d\"https://it-edu.mipt.ru/ru/mipt_problems_challenge2018\"\u003eMIPT Problems Challenge 2018\u003c/a\u003e — II конкурса задач по программированию, проводимого \u003ca href\u003d\"https://it-edu.mipt.ru/\"\u003eЦентром Развития IT-образования МФТИ\u003c/a\u003e. В этом посте я хочу рассказать о том, что это за конкурс, что требуется сделать, чтобы поучаствовать в конкурсе, и какими качествами стоит наделить задачу, чтобы она могла претендовать на победу.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eЧто есть MIPT Problems Challenge 2018?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eЭто конкурс, в котором соревнуются не \u0026quot;решатели\u0026quot; задач, а их авторы. Победителем конкурса станет тот, кто подготовит лучшую задачу формата ACM ICPC.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eКто может участвовать в конкурсе?\u003c/strong\u003e В конкурсе могут принять участие все желающие — никаких возрастных ограничений нет.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eЧто нужно, чтобы принять участие в конкурсе?\u003c/strong\u003e Если вкратце, то необходимо придумать и полностью подготовить задачу формата ACM ICPC в системе \u003ca href\u003d\"https://polygon.codeforces.com/\"\u003ePolygon\u003c/a\u003e. Более полные требования можно найти на \u003ca href\u003d\"https://it-edu.mipt.ru/ru/mipt_problems_challenge2018\"\u003eстраничке конкурса\u003c/a\u003e; там же можно найти и информацию о том, каким образом можно поучаствовать в конкурсе, каковы дедлайны и т.п.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eЕсть ли какие-либо призы?\u003c/strong\u003e Да, три лучшие задачи конкурса будут награждены призами (подробности — на все той же \u003ca href\u003d\"https://it-edu.mipt.ru/ru/mipt_problems_challenge2018\"\u003eстраничке конкурса\u003c/a\u003e). Помимо этого, авторы других задач также могут выиграть денежное вознаграждение (об этом ниже).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eБудут ли задачи даны в каком-то из контестов?\u003c/strong\u003e Да, три задачи-победителя конкурса, а также, возможно, некоторые другие задачи-участники (на усмотрение жюри) будут даны в личном туре MosCode Festival 2018, который пройдет 31 марта.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eКакие задачи имеют шансы на успех?\u003c/strong\u003e В первую очередь, задача должна быть \u003cem\u003eновой\u003c/em\u003e. Задачи, которые уже встречались на других соревнованиях, не могут претендовать на победу. Как следствие, задача не должна быть известна никому, кроме ее автора/группы авторов. Во-вторых, важным критерием является \u003cem\u003eинтересность\u003c/em\u003e задачи. А именно, хорошие шансы имеют задачи, для решения которых необходимо \u003cem\u003eпридумать\u003c/em\u003e и реализовать какие-то нестандартные, незаезженные идеи и ходы. Третьим важным критерием является красота задачи. Конечно, понятие красоты субъективно (равно как и интересность), но на жюри обязательно произведет впечатление задача, процесс решения которой принесет эстетическое удовольствие :))).\u003c/p\u003e\u003cp\u003eТакже хочется обратить внимание на то обстоятельство, что для победы задача не обязана быть сложной. Скорее наоборот, относительно несложная задача с красивой неожиданной идеей имеет больше шансов на победу, нежели сложное упражнение на известные сложные и не очень алгоритмы. Конечно, в решении задачи может использоваться стандартный алгоритм; но при этом в задаче должна быть и какая-то свежая, интересная идея. Более того, так как задачи могут быть использованы в личном туре, то чем больше разных задач, тем лучше)))\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eМожно ли подготовить для конкурса несколько задач?\u003c/strong\u003e Да; более того, в этом случае каждая задача участвует в конкурсе независимо, и любое количество задач одного автора может войти в контест.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eКаковы авторски-правовые особенности работы с задачами?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e1) Задачи, присланные автором для участия в конкурсе, могут быть использованы в личном туре MosCode Festival; как следствие,\u003cbr /\u003eавтор, прислав задачу, автоматически дает свое согласие на иcпользование задачи в MosCode Festival;\u003c/p\u003e\u003cp\u003e2) Задача может войти в личный тур MosCode Festival, не ставши призером конкурса. В этом случае, автору полагается денежное вознаграждение.\u003c/p\u003e\u003cp\u003e3) Если хотя бы одна задача вошла в личный тур MosCode Festival, то ее автор лишается права участия в этом контесте (но не в командном туре!), если такое право у автора было.\u003c/p\u003e\u003cp\u003e4) Если задача не вошла в личный тур MosCode Festival, то задача и все права на нее возвращаются автору. Жюри гарантирует неразглашение задачи, в силу чего задача может быть использована на других состязаниях (однако если задача, скажем, войдет в раунд на codeforces, то настоятельно просим предупредить об это жюри, чтобы его члены не участвовали в раунде))) ).\u003c/p\u003e\u003cp\u003e5) Если автор имеет право участвовать в MosCode Festival, и ни одна из задач автора не вошла в личный тур MosCode Festival, то автор \u003cem\u003eимеет\u003c/em\u003e право поучаствовать в личном тур MosCode Festival.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eЕсли мою задачу не взяли в контест, значит ли это, что задача проиграла в борьбе за лучшую задачу всем задачам, вошедшим в контест?\u003c/strong\u003e Не совсем — это означает лишь, что задача уступила в борьбе за призовые места; в контест же задача могла не войти и по иным причинам, типа баланса сложности, перекрытия по темам и т.п.; в частности, по подобным причинам в прошлом году в контест не попала задача, которая, по-видимому, заняла бы в конкурсе четвертое место, если бы такое было)))\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eКаковы дедлайны?\u003c/strong\u003e Задачу нужно прислать не позднее \u003cstrong\u003e17 марта 2018, 23:59\u003c/strong\u003e. Победители конкурса будут объявлены не позднее 24 марта. Тогда же авторы получат сообщения о том, какие их задачи вошли/не вошли в контест и выиграли призы.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eВ Фестивале примут участие сильные ребята, уровня победителей/призеров ACM ICPC, NEERC и т.п. Значит ли это, что автором задач может стать лишь такой же по силе спортивный программист?\u003c/strong\u003e Ни в коем случае! Конечно, опыт в олимпиадах может помочь; однако как показывает практика, даже относительный новичок в спортивном программировании, не имеющий больших успехов в ACM ICPC и/или высоких CF/TC/atcoder/csacademy/...-рейтингов, может придумывать задачки, над которыми с удовольствием поломают голову сильнейшие спортивные программисты мира. Попробуйте свои силы в придумывании задач — и тогда вы, возможно, станете автором задачи, которая определит новое направление в теории СП (в 2000 году, например, такой была задача \u0026quot;Симпатичные узоры\u0026quot; (ВКОШП 2000, задача Е), которая теперь является одной из базовых задач по теме \u0026quot;Динамическое программирование по профилю\u0026quot;), или автором задачи с простой идеей, до которой почему-то не додумалось подавляющее большинство участников, или автором задачи, над которой ваш друг и/или один из известнейших олимпиадников страны надолго зависнет, посылая 25 неверных решений одно за одним)))\u003c/p\u003e\u003cp\u003eЕсли есть еще какие-то вопросы по Конкурсу, то их можно задать в комментариях к посту либо напрямую мне, Филиппу Руховичу, в ВК: \u003ca href\u003d\"https://vk.com/dprpavlin\"\u003ehttps://vk.com/dprpavlin\u003c/a\u003e .\u003c/p\u003e\u003cp\u003eВсем удачи!\u003c/p\u003e\u003c/div\u003e","tags":[]}}