{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1504972640,"rating":15,"authorHandle":"codelegend","modificationTimeSeconds":1505034780,"id":54431,"title":"\u003cp\u003eIntra-college Programming Contest Series\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi all,\u003cbr /\u003eThe Programming Club will be conducting a series of programming contests, regularly. The contests will be of varying difficulty, for different target audience. The main purpose is to get everyone to do contests at the college level, and so that we can host sessions/discussions for various topics/problems.\u003c/p\u003e\u003cp\u003eThe first contest will be held on Sunday, 10/09/2017, from 20:30 to 23:30. It will be a three hour round, and will have around 5-6 problems. The primary target contestants are UG2/UG3/PG1/PG2 who have a good knowledge of programming basics, and basics of algorithms, and wish to test their skills. We will also discuss the problems once the contest is over.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTo participate:\u003c/strong\u003e \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003e\u003cem\u003eJoining the group:\u003c/em\u003e\u003c/p\u003e   \u003cul\u003e     \u003cli\u003eRequest to join this group, as a \u003cem\u003eparticipant\u003c/em\u003e.\u003c/li\u003e     \u003cli\u003eOnly profiles which mention \u003ca href\u003d\"//codeforces.com/ratings/organization/227\"\u003eIIIT Hyderabad\u003c/a\u003e as the institution will be accepted. (Please ensure that you pick the correct IIIT Hyderabad, there are multiple entries)\u003c/li\u003e   \u003c/ul\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003cem\u003eRegistering for the contest:\u003c/em\u003e \u003c/p\u003e   \u003cul\u003e     \u003cli\u003eThe registration will begin 6 hours before the contest starts.\u003c/li\u003e     \u003cli\u003eGo to the \u003ca href\u003d\"//codeforces.com/group/yny9prUF8z/contests\"\u003econtests tab\u003c/a\u003e (next to the blog tab), and click on \u003cstrong\u003eregister\u003c/strong\u003e\u003c/li\u003e     \u003cli\u003eYou HAVE to register for the contest, if you wish to participate.\u003c/li\u003e   \u003c/ul\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe first contest is being hosted by \u003cem\u003eAakash\u003c/em\u003e (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/FundamentalEq\" title\u003d\"Candidate Master FundamentalEq\"\u003eFundamentalEq\u003c/a\u003e). Hoping to see an enthusiastic participation!\u003c/p\u003e\u003cp\u003eIf you have any queries, please ask below.\u003c/p\u003e\u003c/div\u003e","tags":["contest","intermediate"]}}