{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1403609336,"rating":244,"authorHandle":"MikhailRubinchik.ru","modificationTimeSeconds":1403615011,"id":12816,"title":"\u003cp\u003eICPC WF : Deadly dull\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eRegards to cf-community!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"http://cdn.joxi.ru/uploads/prod/2014/06/24/ef4/c5c/42ac0fcea70731cc99d0083ff392003242ae9fae.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eImagine that you are a fan on one of ACM ICPC. Teams are in one large hall. The contest is about to start, organizers pronounce ceremonial speeches followed by pretentious music. You anticipate something enormous. Here it is! The contest has started. You search for the link to results. And cannot find it. Organizers are acting slowly … and you find your team, count the number of balloons they and their main competitors have, assess the places they can take. Not too convenient, isn’t it? And just think about spectators coming to ICPC WF. Of course they have a link to the results. But it means almost nothing for a usual spectator. To eliminate this a broadcast (or ICPC Live) appeared several years ago. ACM ICPC is becoming a show. This year we are responsible for ICPC Live and we have tried to do our best :) So, what interesting you can see?\u003c/p\u003e\u003cp\u003eI do not want to write long stories, just give you some interesting facts.\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eFor the first time in ICPC history the broadcast will be in Russian (and of course, in English :) )\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eBroadcaster is Panorama. This company was founded 3 years ago to broadcast Sochi 2014 (before that there was no broadcaster of such level in Russia). They came back not long ago with a unique experience. By the way, they have already broadcast Ural Championship 2013.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe anchor is Roman Elizarov. Everybody knows him as a leader of the team preparing problems for NEERC and as local director of ICPC WF 2013.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eYou will see fascinating videos prepares specially for ACM ICPC 2014. \u003ca href\u003d\"http://www.youtube.com/watch?v\u003ds0Qh-gy7ktA\"\u003eHere\u003c/a\u003e is an example :) \u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAround 100 people prepared this broadcast involving over 40 guests. 10 kilometers of cables, long-focus lenses and a lot of other things have been used to prepare a broadcast :)\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eTomorrow follow \u003ca href\u003d\"http://icpc2014.ru\"\u003ethe link\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAs the broadcast is not on yet, you can read news about preparation to ACM ICPC and ACM ICPC 2014 itself at our \u003ca href\u003d\"http://www.icpc2014.ru/en/about/news\"\u003eweb-site\u003c/a\u003e\u003c/p\u003e\u003cp\u003eP.S.And Russian – speaking community may see our \u003ca href\u003d\"http://habrahabr.ru/company/skbkontur/blog/227385/\"\u003eannouncement\u003c/a\u003e on habrahabr.\u003c/p\u003e\u003c/div\u003e","tags":["acm icpc wf","icpc live"]}}