{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1420286752,"rating":0,"authorHandle":"alv-r-","modificationTimeSeconds":1420286752,"id":15565,"title":"\u003cp\u003eHelp needed on problem E — New Year Domino — from Goodbye 2014 Contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, I\u0027m trying to solve \u003ca href\u003d\"//codeforces.com/contest/500/problem/E\"\u003eE — New Year Domino\u003c/a\u003e from last contest, following the \u003ca href\u003d\"//codeforces.com/blog/entry/15488\"\u003etutorial #1\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe tutorial mentions that you can calculate R[i] \u0026quot;using a segment tree or using a stack\u0026quot;. My first approach was to try using a stack to see how it could be done, but I\u0027m getting TLE on test 12: Here\u0027s my code/submission: \u003ca href\u003d\"//codeforces.com/contest/500/submission/9349751\"\u003ehttp://codeforces.com/contest/500/submission/9349751\u003c/a\u003e Is there something wrong with the way I\u0027m using the stack to do it?\u003c/p\u003e\u003cp\u003eI also tried to do it with a segment tree then, but I\u0027m getting \u0026quot;WA on test 7\u0026quot; with this approach. Code: \u003ca href\u003d\"//codeforces.com/contest/500/submission/9352369\"\u003ehttp://codeforces.com/contest/500/submission/9352369\u003c/a\u003e (the segment tree code is from the book Competitive Programming — 3rd edition). It\u0027s essentialy the same approach as before, but using the segtree instead of a stack. Printing the contents of U and R for the small test cases is giving me the correct values, so I was unable to find the error. Can someone please help?\u003c/p\u003e\u003cp\u003ePS: in the code:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003epos[i] and len[i] are the x-position and length of the i-th domino\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eR[i] is the maximum x position covered when you drop the i-th domino\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eU[i][j] has the 2^jth \u0026quot;uncovered\u0026quot; piece index when you drop domino i (the 2^jth piece to \u0027break the interval\u0027), as described in the tutorial\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eS[i][j] has the value needed to cover from i to U[i][j].\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":["contest","goodbye2014","segment tree"]}}