{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1417505406,"rating":10,"authorHandle":"kostya_by","modificationTimeSeconds":1417505427,"id":14961,"title":"\u003cp\u003eВКОШП 2014\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cem\u003eПисьмо является копией того, что получил каждый дипломант ВКОШПа.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eСовсем недавно закончился очередной ВКОШП, в котором вы все приняли непосредственное участие.\u003c/p\u003e\u003cp\u003eДля начала, очень хочется утешить безотрадного Юру: я читал задачи и полной уверенностью могу сказать, что это бы совершенно АСМный контест, в котором все ключевые задачи были довольно неприятные и трудовые. Чего стоит одна задача про обобщенного коня, медали выиграли те, кто просто аккуратнее и без лишних нервов сдали то, что сдавалось. \u003c/p\u003e\u003cp\u003eТак что это просто был не ваш контест, не расстраивайте. :)\u003c/p\u003e\u003cp\u003eТем более, что расстраиваться нет никаких поводов. \u003c/p\u003e\u003cp\u003eЛицей БГУ №1 на последнем часу все-таки собрались и сдали это противную задачу Е, тем самым показав, что способны бороться и сохранять работоспособность до самого конца, что является очень хорошим качеством в принципе. Да, вам не удалось выиграть столь желанную медаль, но не всегда получается то, чего ты так хочешь. Нужно просто поставить себе новую цель и идти к ней, когда-нибудь у вас обязательно получится добиться того, чего вы пожелали.\u003c/p\u003e\u003cp\u003eВторой команде в последний час пришлось еще более непросто: было очевидно, что пяти задач на диплом никак не будет хватать — и в таких условиях ребята приняли решение писать С(как я понимаю, с нуля, не занимаясь ей раньше) и преуспели, сдав ее с плюса. Замечательно же! Я уверен, что вы получили очень много удовольствия от такого АС и это значительно подняло ваш боевой дух.\u003c/p\u003e\u003cp\u003eТретья команда меня вообще очень радовала на протяжении почти всего контеста: уйти на заморозку на 13ом месте, по-моему, очень круто. Конечно, меня немного не радует факт, что за последние два часа у вас не было ни одного сабмита, но полагаю, что на то были причины. В любом случае, довольно чисто порешали шесть задач и заняли замечательное место, с чем я вас поздравляю!\u003c/p\u003e\u003cp\u003eИтог: три диплома из трех возможных. Я надеюсь, что вы рады такому результату, ведь радоваться есть чему. Я со своего первого ВКОШПа уехал вообще без ничего, так что новички этого года уже меня превзошли по этому критерию. ;) Более того, опыт участия в таких крупномасштабных мероприятиях, как ВКОШП, бесценен. Поэтому, в любом случае, вы увезли из Питер намного больше, чем просто по диплому: вы увезли заново обретенную уверенность в собственных силах; вы увезли много положительных эмоций о Питере и поездке в целом; вы побывали на соревновании, где было много умных ребят, но вы показали, что способны с ними соперничать и побеждать.\u003c/p\u003e\u003cp\u003eНа этих выходных уже я поеду в Питер соперничать с умными ребятами и их побеждать, так что в пятницу меня не будет. :) Однако, приходить к четырем часа все-таки стоит. Дело в том, у вас начинается IOI сезон, где очень многое отличается от ACM. Так что я подготовил вам замечательную видео-лекцию от Егора Суворова, который год назад рассказывал питерским школьникам как себя следует вести на личных контестах. Она не длинная, всего полтора часа, но думаю посмотреть ее централизовано имеет смысл, так что приходите. Также, я подготовил вам личный контест из четырех задач на субботу, так что тоже приходите.\u003c/p\u003e\u003cp\u003eНу, это все, что я хотел вам сказать. Еще раз поздравляю вас с успешным окончанием АСМного сезона и добро пожаловать в сезон IOI!\u003c/p\u003e\u003cp\u003eСокол Константин. \u003ca href\u003d\"mailto:kostya.sokol.by@gmail.com\"\u003ekostya.sokol.by@gmail.com\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["лицей бгу","вкошп 2014"]}}