{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1520174588,"rating":237,"authorHandle":"BledDest","modificationTimeSeconds":1520372579,"id":58155,"title":"\u003cp\u003eEducational Codeforces Round 39 [Rated for Div.2]\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces!\u003c/p\u003e\u003cp\u003eOn \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?day\u003d6\u0026amp;month\u003d3\u0026amp;year\u003d2018\u0026amp;hour\u003d18\u0026amp;min\u003d5\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003eMarch 06, 18:05 MSK\u003c/a\u003e Educational Codeforces Round 39 will start. \u003c/p\u003e\u003cp\u003eSeries of Educational Rounds continue being held as \u003ca href\u003d\"https://harbour.space/\"\u003eHarbour.Space University\u003c/a\u003e initiative! You can read the details about the cooperation between \u003ca href\u003d\"https://harbour.space/\"\u003eHarbour.Space University\u003c/a\u003e and Codeforces in the \u003ca href\u003d\"//codeforces.com/blog/entry/51208\"\u003eblog post\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/ad/b8/adb8b3d736a646c597cae50cf2e86afe5b013fff.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThis is a special Educational Round — \u003cstrong\u003eTop three contestants among those who are eligible for participating in ACM ICPC\u003c/strong\u003e will be invited to attend the \u003ca href\u003d\"http://in.harbour.space/icpc/acm-icpc-hello-india-bootcamp-spring-2018/?utm_source\u003dCodeforces\"\u003eHello India x Russia Programming boot camp\u003c/a\u003e under the Codeforces + SDV banners, on a full team sponsorship. \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://sdventures.com/\"\u003eSocial Discovery Ventures (SDV)\u003c/a\u003e creates, develops and funds Internet projects specialising in communication platforms that enable people across the world to get closer and expand their social networks. \u003c/p\u003e\u003cp\u003eThe winners will be fully sponsored with their boot camp participation fees, accomodation, and meals for the India location!\u003c/p\u003e\u003cp\u003eThis round also has a special regional prize — the company Phaze Ventures, a platform founded to transform the region by unlocking the untapped potential of our youth, startups and corporates, will be sponsoring the \u003cstrong\u003etop 3 participants of this round from Oman (also among those who are eligible for ACM ICPC)\u003c/strong\u003e — further sharing the importance of supporting talented programmers and sending them to these types of events throughout the world.\u003c/p\u003e\u003cp\u003eThe round will be \u003cstrong\u003erated for Div. 2\u003c/strong\u003e. It will be held on extented ACM ICPC rules. After the end of the contest you will have one day to hack any solution you want. You will have access to copy any solution and test it locally.\u003c/p\u003e\u003cp\u003eYou will be given \u003cstrong\u003e7 problems\u003c/strong\u003e and \u003cstrong\u003e2 hours\u003c/strong\u003e to solve them. Problem authors are \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/PikMike\" title\u003d\"Candidate Master PikMike\"\u003ePikMike\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Vovuh\" title\u003d\"Candidate Master Vovuh\"\u003eVovuh\u003c/a\u003e and me.\u003c/p\u003e\u003cp\u003eGood luck to the participants! Hope you will enjoy the contest.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e The \u003ca href\u003d\"/blog/entry/58210\"\u003etutorial\u003c/a\u003e has been published.\u003c/p\u003e\u003c/div\u003e","tags":["educational round","codeforces"]}}