{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1462975312,"rating":172,"authorHandle":"gKseni","modificationTimeSeconds":1462995968,"id":44813,"title":"\u003cp\u003e50K РУБ для \u0026quot;Гроссмейстеров\u0026quot; с Codeforces: Удачи, Эдвард!\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/1e/3d/1e3dade31f273b745ab62964e3a30bf13c623dfe.png\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eПомните программу \u003ca href\u003d\"http://botaninvestment.com/codeforces/\"\u003e50K РУБ для “Гроссмейстеров” с Codeforces\u003c/a\u003e от фонда \u003ca href\u003d\"http://botaninvestment.com/\"\u003eBotan Investment\u003c/a\u003e и его президента Виктора Шабурова?\u003c/p\u003e\u003cp\u003eЭдвард \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Edvard\" title\u003d\"Grandmaster Edvard\"\u003eEdvard\u003c/a\u003e Давтян сейчас в Сочи и сегодня в 19:35 будет писать \u003ca href\u003d\"//codeforces.com/contests/671,672\"\u003eCodeforces Round #352\u003c/a\u003e, чтобы подтвердить свой уровень. Если решит хотя бы одну задачу и останется красным, то будет первым в истории, получившим этот грант.\u003c/p\u003e\u003cp\u003eЭдвард — бессменный координатор учебных раундов Codeforces, имел двухлетний перерыв в участиях в соревнованиях по программированию из-за службы в армии. Через неделю он в составе команды Саратовского университета совместно с \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/kuviman\" title\u003d\"Master kuviman\"\u003ekuviman\u003c/a\u003e и \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/dans\" title\u003d\"Grandmaster dans\"\u003edans\u003c/a\u003e примет участие в финале чемпионата мира ACM-ICPC.\u003c/p\u003e\u003cp\u003eУдачи, Эдвард! :)\u003c/p\u003e\u003cp\u003eP.S.: У фонда есть и \u003ca href\u003d\"//codeforces.com/blog/entry/21840\"\u003eдругие\u003c/a\u003e программы. Найдете что-то для себя?\u003c/p\u003e\u003cp\u003eP.P.S.: Спросила комментарий по поводу программы у представителя фонда Александра Машрабова, обновлю заметку, когда он ответит.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD1\u003c/strong\u003e: Александр говорит: \u0026quot;Нам очень важно поддерживать сообщество спортивных программистов. АСМ движение в России — не только Москва и Санкт-Петербург — мы рады способствовать развитию образования в регионах. Наш грант — стимул для ребят развиваться, решать новые задачи и изучать новые алгоритмы. Почти все ИТ компании пытаются нанимать гроссмейстеров и мы не исключение :)\u0026quot;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2\u003c/strong\u003e: Эдвард, это была хорошая попытка. Насладись ночным Сочи, мы с тобой ;)\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news"]}}