{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1475487026,"rating":46,"authorHandle":"savinova","modificationTimeSeconds":1475488649,"id":47504,"title":"\u003cp\u003eBotan Investments: отчет о деятельности фонда за сентябрь.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003eПосле летних каникул уже почти во всех вузах-участниках \u003ca href\u003d\"//codeforces.com/blog/entry/46900\"\u003eгрантовой программы фонда\u003c/a\u003e возобновились тренировки. Наиболее активные вузы в сентябре — Саратовский ГУ и Мордовский ГУ, а больше всего студентов (50 человек!) удалось привлечь к тренировкам по олимпиадному программированию в УрФУ. В этом месяце к нам также присоединились Волгоград (ВолгГТУ), Хабаровск (ДВГУПС), Краснодар (КубГТУ) и Красноярск (СФУ), рады видеть новых участников в нашей программе! \u003c/p\u003e\u003cp\u003eВ сентябре фонд Botan Investments впервые организовал сборы по программированию с участием чемпиона ACM ICPC-2015 Артема \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/VArtem\" title\u003d\"International Grandmaster VArtem\"\u003eVArtem\u003c/a\u003e Васильева и Николая \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Niko\" title\u003d\"Master Niko\"\u003eNiko\u003c/a\u003e Ведерникова в \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_33%2Fall\"\u003eРостове-на-Дону\u003c/a\u003e и в \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_36%2Fall\"\u003eСамаре\u003c/a\u003e. В Ростове-на-Дону в сборах приняли участие четыре команды ЮФУ, в Самаре — восемь команд (Самарский университет, ПГУТИ, УлГТУ). В течение недели студенты каждый день писали контесты, слушали лекции и разборы. Желаем всем участникам сборов хорошо выступить на четвертьфинале в Саратове!\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e \u003c/p\u003e\u003cdiv style\u003d\"width: 100.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/3c/a4/3ca44d339b73a46cc6ace7727faa264bcc8f40d1.jpg\" style\u003d\"width: 49.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg src\u003d\"/predownloaded/8a/b0/8ab0a012dbdce288c483100e7fb7561e10e72769.jpg\" style\u003d\"width: 49.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e\u003cp\u003eМы попросили Михаила \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e Мирзаянова, который тоже участвует в программе Botan Investments для преподавателей, дать советы преподавателям и студентам по подготовке к грядущему четвертьфиналу:\u003c/p\u003e\u003cp\u003e\u003cem\u003e1) Обязательно напишите командой несколько пятичасовых тренировок. Хорошо, бы чтобы они были согласованы с предполагаемой сложностью четвертьфинала. Например, публичные тренировки на Codeforces по средам я стараюсь подбирать именно такими. Очень важно, чтобы в ранклисте были не только вы (и ваш университет), а это был богатый представительный ранклист как на ЧФ.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e2) Старайтесь писать эти тренировки сосредоточенно и напряженно все 5 часов.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e3) Не используйте шаблон, электронные переводчики и прочее. Короче, создайте себе условия максимально похожие на то, что будет на ЧФ. Например, используйте OS как на ЧФ, такие же среды и компиляторы\u003c/em\u003e\u003c/p\u003e\u003cp\u003eТакже напоминаю, что в нашей \u003ca href\u003d\"https://vk.com/botaninvestments\"\u003eгруппе ВК\u003c/a\u003e уже вышло несколько постов Михаила \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik\" title\u003d\"Master MikhailRubinchik\"\u003eMikhailRubinchik\u003c/a\u003e Рубинчика, посвященных \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_22/all\"\u003eсайтам для подготовки к соревнованиям\u003c/a\u003e, \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_29/all\"\u003eархивам задач\u003c/a\u003e и \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_35/all\"\u003eорганизационной помощи асмщикам\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["botan investments","виктор шабуров","четвертьфинал"]}}