{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1502895961,"rating":100,"authorHandle":"DEGwer","modificationTimeSeconds":1502895961,"id":53901,"title":"\u003cp\u003eCompletely meaningless article\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eToday I want to write a completely meaningless article. First, I must mention, reading this post will produce nothing. Reading it is, definitely, just a waste of time.\u003c/p\u003e\u003cp\u003eAre you ready to do the most useless thing of the world? OK. Let\u0027s start!\u003c/p\u003e\u003cp\u003eSome of you may think \u0026quot;Is it really meaningless?\u0026quot; or \u0026quot;Won\u0027t it be an interesting article, although there are no means?\u0026quot;, but neither is true. I do not post this article for any other people, and I do not post this article for myself. Let me repeat. This article contains truly no meaning.\u003c/p\u003e\u003cp\u003eSome of you may think \u0026quot;Isn\u0027t it some experiment to verify the rumor \u0026quot;Red will get upvote, regardless of what the post say while if some Gray said the same thing he is downvoted\u0026quot;, or more suspicious way, \u0026quot;You want upvote but you didn\u0027t came up with the idea, so you are posting such an article\u0026quot;, but both are wrong. Even I do not know why I wrote such a useless article, and if I want upvote, I could write about a bit more useful things.\u003c/p\u003e\u003cp\u003eThis article is completely meaningless, as I mentioned, but on the other hand, completely harmless. So if I got downvoted, I would say \u0026quot;Why downvoted???\u0026quot;, or \u0026quot;I think you don\u0027t understand what I said\u0026quot;, like some people often says. And if I got upvoted, I should say \u0026quot;Why upvoted?\u0026quot;, or \u0026quot;I don\u0027t think you didn\u0027t understand what I say, as I wrote nothing, but you must be crazy\u0026quot;, in the same reason.\u003c/p\u003e\u003cp\u003eHow are you feeling about wasting time? Write the comment, if you want to waste even more time. I do not recommend, since time is precious.\u003c/p\u003e\u003cp\u003eThank you and despise you for reading this article till the last. See you!\u003c/p\u003e\u003c/div\u003e","tags":["joke","nothing"]}}