{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1473704422,"rating":10,"authorHandle":"likecs","modificationTimeSeconds":1473704630,"id":47078,"title":"\u003cp\u003eSome Doubts\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello All,\u003c/p\u003e\u003cp\u003eI have some questions as doubts:\u003c/p\u003e\u003cp\u003e1) How can we solve problem E (The secret code) in \u003ca href\u003d\"//codeforces.com/gym/100371\"\u003ehttp://codeforces.com/gym/100371\u003c/a\u003e Any hints?\u003c/p\u003e\u003cp\u003e2) I am given an sorted array of 1000 elements, where each element can be in the range [0, 20000]. We need to consider all subsequences on the array. For every subsequence, it\u0027s power is defined as the sum of all the elements in it. We are given 1000 queries of the form \u0026quot;x\u0026quot; where i need to print the xth smallest value of the power of any subsequence of the array. Here \u0026quot;x\u0026quot; is in the range of [1, min(2^n, 10000)].\u003c/p\u003e\u003cp\u003eFor example: Let the array be [1, 2, 100]. Then the power of subsequences sorted order are [0, 1, 2, 3, 100, 101, 102, 103]. If the query is x \u003d 3, I need to print 2.\u003c/p\u003e\u003cp\u003e3) How can we solve this problem \u003ca href\u003d\"https://icpcarchive.ecs.baylor.edu/index.php?option\u003donlinejudge\u0026amp;page\u003dshow_problem\u0026amp;problem\u003d2334\"\u003ehttps://icpcarchive.ecs.baylor.edu/index.php?option\u003donlinejudge\u0026amp;page\u003dshow_problem\u0026amp;problem\u003d2334\u003c/a\u003e\u003c/p\u003e\u003cp\u003eMy approach to this problem- First of all if the graph contains a directed cycle, then the answer is 0, as a trivial case. Otherwise, consider all the cases where we can partition the groups into 2 equal halves. For this I use of mask (till 2^(2m)) and if it contains number of set bits as \u0026quot;m\u0026quot; I continue the loop. Then I consider the partition if it is valid or not i.e. if in partition 1 or 2, whether there exits a person \u0026quot;i\u0026quot; who has a dependency on person \u0026quot;j\u0026quot; but is not present in the same set. In such a case, I just add nothing. In rest of the cases, I try to find the number of topological sorts on graph in set 1 and 2 and multiply their results and finally add it to the final result. (For number of topological sorts, I used this method \u003ca href\u003d\"http://cs.stackexchange.com/questions/12713/find-the-number-of-topological-sorts-in-a-tree\"\u003ehttp://cs.stackexchange.com/questions/12713/find-the-number-of-topological-sorts-in-a-tree\u003c/a\u003e )\u003c/p\u003e\u003cp\u003eHere is a link to my code according to the above implementation \u003ca href\u003d\"https://textb.org/r/doubt-likecs/\"\u003ehttps://textb.org/r/doubt-likecs/\u003c/a\u003e\u003c/p\u003e\u003cp\u003e4) How can we efficiently find the points of intersection of a line and polygon, where the polygon is not necessarily convex polygon (but the polygon is simple)?\u003c/p\u003e\u003cp\u003ePlease help in the above problems. If possible please post the code as well.\u003c/p\u003e\u003cp\u003eThanks in advance.\u003c/p\u003e\u003c/div\u003e","tags":["doubts","maths","computational geometry","probability","graphs"]}}