{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1491544611,"rating":24,"authorHandle":"I_love_Hoang_Yen","modificationTimeSeconds":1492355550,"id":51468,"title":"\u003cp\u003eVNOI Marathon 2008 — Thông báo\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eNhư các bạn đã có thể thấy trong phần Contests, mình đã thêm VNOI Marathon 2008 — div1 + div2.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD 2\u003c/strong\u003e: Kỳ thi đã kết thúc. Các bạn có thể trao đổi \u003ca href\u003d\"https://www.facebook.com/groups/163215593699283/permalink/1444474055573424/\"\u003etrong group VNOI\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e: Các bài đều được chấm kiểu ACM (đúng hết test mới được điểm). Khi thêm bài lên CF, những đề thi QG sẽ được chấm theo kiểu OI, còn các bài khác sẽ chấm kiểu ACM để dễ dàng thêm test và rejudge.\u003c/p\u003e\u003cp\u003e2008 là năm đầu tiên tổ chức VNOI Marathon. Vì cách đây gần 10 năm, nên có thể sẽ có những bài giờ đã trở thành cổ điển, tuy nhiên mình chắc chắn các bạn vẫn sẽ tìm được những bài trí tuệ và sáng tạo.\u003c/p\u003e\u003cp\u003eMình để conest kéo dài 1 tuần. Để học được nhiều nhất có thể, các bạn hãy thử làm tất cả các bài và dành nhiều thời gian suy nghĩ. Việc suy nghĩ còn quan trọng hơn rất nhiều so với việc có làm được bài hay không. Như Khúc Anh Tuấn ngày xưa có những bài phải suy nghĩ nhiều năm mới giải được, do đó mới có thể trở thành huyền thoại của lập trình thi đấu Việt Nam (các bạn có thể đọc thêm về Khúc Tuấn \u003ca href\u003d\"http://vnoi.info/wiki/algo/data-structures/lca\"\u003eở đầu bài này\u003c/a\u003e).\u003c/p\u003e\u003cp\u003eĐề VM 2008 được ra bởi những admin cũ của VNOI: Ngô Minh Đức — \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Duc\" title\u003d\"Candidate Master Duc\"\u003eDuc\u003c/a\u003e, Khúc Anh Tuấn — \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/ktuan\" title\u003d\"Candidate Master ktuan\"\u003ektuan\u003c/a\u003e, Lê Đôn Khuê — \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/beo_chay_so\" title\u003d\"Expert beo_chay_so\"\u003ebeo_chay_so\u003c/a\u003e, Nguyễn Trần Nam Khánh, Nguyễn Minh Hiếu. VM 2008 chia thành 2 div:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eDiv 2 cho các bạn mới học.\u003c/li\u003e   \u003cli\u003eDiv 1 cho các bạn khủng.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eKhi add bài từ SPOJ qua Codeforces có thể có sai sót. Nếu thấy vấn đề gì các bạn hãy hú lên cho mình biết.\u003c/p\u003e\u003c/div\u003e","tags":[]}}