{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1433439108,"rating":505,"authorHandle":"kuviman","modificationTimeSeconds":1433873204,"id":18327,"title":"\u003cp\u003eCodeforces Updates (April-May, 2015)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello!\u003c/p\u003e\u003cp\u003eCodeforces never sleeps, and I am going to tell you about our recent updates which weren\u0027t announced yet.\u003c/p\u003e\u003ch3\u003eTestlib\u003c/h3\u003e \u003cul\u003e   \u003cli\u003etestlib moved to \u003ca href\u003d\"https://github.com/mikemirzayanov/testlib\"\u003eGitHub\u003c/a\u003e, and the version 0.9.9 with C++11 support has been released.\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003ePolygon\u003c/h3\u003e \u003cul\u003e   \u003cli\u003eAdded basic support for test groups. Now you can specify group for each test, run invocations by test groups, and you can view summary for each group on the invocation page. If group is specified for a test, it will be added to the problem descriptor (i. e. \u003ccode\u003e\u0026lt;test cmd\u003d\u0026quot;gen 1 2\u0026quot; group\u003d\u0026quot;testGroup\u0026quot; method\u003d\u0026quot;generated\u0026quot;/\u0026gt;\u003c/code\u003e).\u003c/li\u003e   \u003cli\u003eYou can now view problem statements and validator for a problem/contest on the same page. This makes finding mistakes in translations and in validator much easier (before you had to open them on separate tabs and switch between them, which is not comfortable). On the problem statements page the \u0026quot;Review\u0026quot; link has been added: \u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/e5/ba/e5ba715c74bd261b1d8448e257417b241c158397.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e On the contest page the corresponding link appears in the sidebar: \u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/6d/53/6d53c899b54aed8d1114482f0c72f3a8651e6c27.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003eCodeforces\u003c/h3\u003e \u003cul\u003e   \u003cli\u003eMissing an announcement during contest is now even harder — messages additionally are showed using Notification API.\u003c/li\u003e   \u003cli\u003eFixed a bug in API: in \u003ccode\u003econtest.hacks\u003c/code\u003e method \u003ccode\u003edefender\u003c/code\u003e and \u003ccode\u003ehacker\u003c/code\u003e were confused.\u003c/li\u003e   \u003cli\u003eFixed a bug about status filter reset. This was happening sometimes when request went to another Codeforces server.\u003c/li\u003e   \u003cli\u003eFixed a bug about local storage overflow. If you had a problem with local storage overflow, you had to run \u003ccode\u003elocalStorage.clear();\u003c/code\u003e in browser console. Now Codeforces uses local storage more carefully.\u003c/li\u003e   \u003cli\u003eSyntax is now highlighted when you are hacking: \u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/04/1f/041f08a21872d11cfab0a87bb985cdbdfb75c947.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/li\u003e   \u003cli\u003eInvisible characters are now shown when you view a submission. Before it was confusing why you get WA:\u003c/li\u003e \u003c/ul\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eBefore\u003c/th\u003e       \u003cth\u003eNow\u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/e9/06/e906e034fcaaee82e0f82033baec4f93f312dd01.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/td\u003e       \u003ctd\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/fe/a7/fea76cb05e44c858882b3171141d1c4c24123c90.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e \u003cul\u003e   \u003cli\u003eYou don\u0027t have to upload images to a third-party site anymore, you can do it while editing a topic. Right under the topic content you can select one or more images, for each of them there will be a link generated which you can use to insert it into the text: \u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/54/ff/54ffd8f699b46b9fff4e1dbf1c8a89691f716b0a.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/li\u003e   \u003cli\u003eImproved topic categorization, for example soon you will not have to search for Codeforces important materials (documentation, rules, etc.) in blogs, they will be structured and available on a special page.\u003c/li\u003e   \u003cli\u003eImplemented a feature to add rights to edit the topic to a list of users. For now this opportunity will be available for reputable users, who will be able to edit topics with documentation, tutorials and similar materials themselves.\u003c/li\u003e   \u003cli\u003eImproved testing for determinism of generators: we remind you that generators have to be written so that they produce the same input each time, this is tested more reliably now. Do not initialize random number generators with current time!\u003c/li\u003e   \u003cli\u003eImplemented a feature to view revision history for a topic. History may be available either to all users or only to the editors. By default new topics will have history available to everyone. If you enable viewing history, then you will be able to publish auto comment when you have edited the topic, which will have links to the previous version, new version and the link to compare them.\u003c/li\u003e   \u003cli\u003eNow users which didn\u0027t take part in rated events for more than 6 months \u003cem\u003eare hidden\u003c/em\u003e in the ratings pages. Also they do not affect a country/city/organization ratings.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eAnd this is not all! Expect more improvements soon, for example we work on rating inflation problem and lots of other things.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","improvements","features","updates","testlib","polygon"]}}