{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1458473549,"rating":2,"authorHandle":"mrsweetps11v","modificationTimeSeconds":1458473549,"id":43900,"title":"\u003cp\u003eSmall assistance with problem set 1A in ProblemSet\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003e\u003cstrong\u003eKnowing the Problem set\u003c/strong\u003e\u003c/h1\u003e\u003cp\u003eThis tutorial is to teach you some pointers in terms of how to solve this problem-set this is about the learning curve that you need to know. \u003c/p\u003e\u003cp\u003eFirst off the problem explains hows to find a way to fit the flagstones\u003ccode\u003e(a x a )\u003c/code\u003e in to the square\u003ccode\u003e( n x m)\u003c/code\u003e in \u003cstrong\u003eremoved1\u0027s\u003c/strong\u003e tutorial he has made know some of the ideas how to solve this all you need to do is put it in programming form.\u003c/p\u003e \u003cul\u003e   \u003cli\u003eRef-Problemset: \u003ca href\u003d\"//codeforces.com/problemset/problem/1/A\"\u003ehttp://codeforces.com/problemset/problem/1/A\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eRef-removed1-tutorial:\u003ca href\u003d\"//codeforces.com/blog/entry/85\"\u003e http://codeforces.com/blog/entry/85\u003c/a\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIn his tuts he provides a very useful notation of X and Y axes segregation here is what he proposed: \u003ccode\u003e(m+a-1)/a) * (n+a-1)/a)\u003c/code\u003e in this formula he has defined the \u003ccode\u003eY \u003d (m+a-1)/a  And X \u003d (n+a-1)/a\u003c/code\u003e\u003c/p\u003e\u003cp\u003eNow you have the what you started with which was (m x n) same as Y * X\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eTip01: learn the memory space that each datatype uses  in C++ Know the size that an int, double , float, string can hold\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eTip02: if the calculation goes beyond the memory space required for a datatype  you will have problems in memory so use spacial libraries to help limit  the size or value of digits shown.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eTip03: Dont make it too complicated if you can reuse code then use it but dont  duplicate your work. use things like functions or Global Variables to help  make things accessible in different ways.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eAs you can see the Y and X equation have similar forms so you dont need to have a function for both of them just one is enough but use a different parameter when passing the values. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eC++ code sample:\u003c/strong\u003e\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e\u003cbr /\u003e  fxreturn_type fx01(valtype c_, valuetype b_){\n\t\t\treturn ((c_ - b_) * c_)\n  }\n  \n  //calling for Y\n  fx01( m, a);\n  \n  //callinf for X \n  fx01( n, a);\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eENDOf Sample:\u003c/p\u003e\u003cp\u003eSomething along the lines of that but be creative and remember the few lines the more cooler your code will be so try ways to make your code eligent and nice.\u003c/p\u003e\u003cp\u003eI hope this will help those that are facing some problems think around this problem. Note that i am a C++ programmer and would love to hook up with C++ fans for a nice Chat. Pop me a Message.\u003c/p\u003e\u003c/div\u003e","tags":["1a","mrwseetps11v","tips"]}}