{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399082973,"rating":-29,"authorHandle":"ciples89","modificationTimeSeconds":1399082973,"id":12111,"title":"\u003cp\u003ethe filing will be submitted to the\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003ethe filing will be submitted to the Executive authority commutation, parole law proposals and other materials to the public notice.\u0026quot; And clear \u0026quot;publicity for a period of 25.\u0026quot; In addition, the \u0026quot;Regulations\u0026quot; Article 19 is clear: \u0026quot;commutation, parole order shall be in accordance with law to the public via the Internet.\u0026quot;Cases pending introduction of the \u0026quot;people\u0027s assessors\u0026quot; systemPenal Code Section 79 and Section 82 provides that the People\u0027s Court shall form a collegial panel hearing the law commutation, parole cases, \u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-95-c-32.html\"\u003enike air max 95 españa\u003c/a\u003e  but how the provisions of the collegial panel composed. The introduction of the \u0026quot;Regulations\u0026quot; Section 4 states: \u0026quot;People\u0027s Court commutation, parole cases, it shall be carried out by judges or by a collegial panel composed of judges and people\u0027s assessors.\u0026quot;Sun military said that this provision clearly a collegial panel may be invited to participate in the people\u0027s jury trial. \u0026quot;The introduction of the commutation, parole case hearing people\u0027s jury system is conducive to the public on behalf of the people of the jury to better understand and participate in the commutation, parole hearing cases, broadening public participation channels to ensure commutation, parole proceedings in cases more open and transparent. \u0026quot;Six commutation, parole hearing the case must\u0026quot;Regulations\u0026quot; Article 6 pointed out that the six categories of commutation, parole cases, the trial shall be: (1) because the offender has major meritorious submitted commutation; 2 start time submitted commutation intervals or commutation of magnitude does not comply with the judicial interpretation. 3 different views received during the public notice;; general provisions. 4 People\u0027s Procuratorate have objections;. 5 is reported to commutation, parole \u003c/p\u003e\u003cp\u003edepartment offender crimes criminal organization (leadership, participate, protecting and conniving) Mafia crime offenders undermine the financial management order and financial fraud and other criminal offenders have a significant impact or a high degree of social concern in the community; 6 People\u0027s Court that the trial should be the other.SoundCommutation parole for crimes committed more stringent requirementsSupreme People\u0027s Court for trial supervision Ming Palace yesterday in response to the President, \u0026quot;\u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-2014-c-45.html\"\u003enike air max 2014 hombre\u003c/a\u003e  officials commutation, parole would be any different,\u0026quot; said the problem, from the entity concerned, in accordance with the requirements of the political commissar of the opinion, for the crimes of criminals commutation, parole adopt more stringent standards.Gong Ming pointed out that \u0026quot;commutation questions about crimes of criminals, in 2012 commutation, parole judicial interpretation on the basis of the views put forward in the political commissar further requirements. Example of such crimes if the offender is sentenced to life imprisonment, he must be less than three years\u0027 imprisonment for two years or more, two years or less in prison, pay attention here talking about \u0027be commuted,\u0027 not that he necessarily commuted to three years. reduced to imprisonment after once commuted to imprisonment not exceeding one year, the interval between the two should be commuted more than two years, which is further requirements on the entity. \u0026quot;The new judicial interpretations and opinions of the political commissar of the crimes o\u003c/p\u003e\u003cp\u003ef criminals are on the commutation, parole conditions were further restricted. Gong Ming For example, say there finds major meritorious service, where there is one \u0026quot;major technological inventions or innovations,\u0026quot; identified as major meritorious service to this major technological inventions or innovations must be independent during the criminals in prison completed, and by the national authorities to determine the patents, but does not include utility model patents and design patents. If required by law, \u0026quot;the state and other major contributions to society,\u0026quot; identified as major meritorious service, and this must be a major contribution to the offender during the prison and independently confirmed by the national authorities of the fruits of labor.In addition, he stressed that the use of unfair means during the serving personal influence and social relations attempt to have his sentence\u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-90-em-c-29.html\"\u003enike air max 90 em venta\u003c/a\u003e  reduced, the chance of parole, the offender is not identified repent, that this is not a plus in the assessment of the factors is the need to reduce Factors points. The publicity out of the walls outside the community-oriented approach, for the crimes of criminals strictly regulate commutation, parole supervision can have a huge effect.BackgroundCentral Political and Law Commission promulgated the effective anti-corruption in the judiciary viewsSupreme Court spokesman Sun military introduced, in order to prevent the commutation, parole field of judicial corruption, effectively enhance the credibility of the judiciary, under the guidance of the Supreme Court, some of the local court trial hearing or trial mode to take handle commutation, parole cases. February 8, 2010, the supreme law made it clear that for commutation, parole hearings and th\u003c/p\u003e\u003c/div\u003e","tags":[]}}