{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1464260569,"rating":75,"authorHandle":"gKseni","modificationTimeSeconds":1464290382,"id":45067,"title":"\u003cp\u003eКод победителей: о жизни и бизнесе программистов-олимпиадников\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eМнение изданий о программистах, мнение программистов об изданиях.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://www.forbes.ru/tekhnologii/internet-i-svyaz/282531-kod-pobeditelei-kak-programmisty-iz-rossii-poluchili-mirovoe-pri\"\u003eИздание Forbes пообщалось\u003c/a\u003e с участниками первой команды разработчиков «ВКонтакте», которая состояла из победителей международных олимпиад: о работе над первым кодом соцсети, о том, как изменилась их жизнь после успешного запуска сервиса, и о том, чем они занимаются сейчас.\u003c/p\u003e\u003cp\u003eБывший технический директор «ВКонтакте» Николай Дуров \u003ca href\u003d\"https://vc.ru/p/genius-programmers\"\u003eрассказал ЦП\u003c/a\u003e об ошибках, которые, по его мнению, допустили журналисты издания в публикации.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eСтатья Forbes:\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eАвтомобиль вырвался с улиц Орландо (штат Флорида, США) и помчался по шоссе в сторону побережья. Новоиспеченные чемпионы мира по программированию Николай Дуров, Андрей Лопатин и Олег Етеревский праздновали победу. В 2000 году Россия впервые выиграла престижный чемпионат АСМ ICPC (Assoсiation for Computing Machinary International Collegiate Programming Contest), который проводится с 1977 года. «Мы взяли машину напрокат и поехали к океану. Все были в восторге от этой идеи», — вспоминает один из тренеров команды Максим Шафиров. Второкурсники математико-механического факультета СПбГУ получили в качестве призов новенькие ноутбуки. В университете их чествовали как героев.\u003c/p\u003e\u003cp\u003eС тех пор российские команды часто оказывались в числе призеров. Программисты из Петербурга — чаще других. Студентов СПбГУ до сих пор тренирует Андрей Лопатин, студентов ИТМО (Санкт-Петербургского университета информационных технологий, механики и оптики) — Андрей Станкевич, который в 2000 году тоже участвовал в чемпионате мира, но проиграл команде Дурова.\u003c/p\u003e\u003cp\u003eХедхантеры технологических гигантов пристально следят за такими соревнованиями. IBM, которая вслед за Apple, AT\u0026amp;T и Microsoft стала генеральным спонсором мирового чемпионата по программированию, приглашает всех финалистов на стажировку. «Когда Facebook и Google активно росли, они тоже там завлекали программистов. Теперь проводят собственные соревнования», — говорит Андрей Станкевич. По тому же пути пошли и российские компании — «Яндекс» раз в год устраивает турнир «Яндекс.Алгоритм», Mail.ru Group — Russian Code Cup.\u003c/p\u003e \u003cpre\u003e«Чемпионам открыт путь в любую компанию. Но собеседования проходят не все. Не из-за профессиональных, а из-за личных качеств. Многие программисты глубокие интроверты», — говорит Роман Елизаров, первым из россиян получивший в 1996 году приглашение на международный чемпионат по программированию.\u003c/pre\u003e\u003cp\u003eКак талантливые программисты встраиваются в бизнес-среду?\u003c/p\u003e\u003ch4\u003eThe Bro Code\u003c/h4\u003e\u003cp\u003eНиколай Дуров, Андрей Лопатин и Олег Етеревский первый раз обратили на себя внимание как программисты, будучи старшеклассниками физико-математического лицея. «Они взломали сеть организаторов Олимпиады по программированию и, чтобы похвастать, начали рассылать сообщения всем участникам. Мы дисквалифицировали команду», — вспоминает Елизаров, в то время студент ИТМО, помогавший проводить турниры для школьников. «Мы потом долго извинялись. Молодые были. Но это был вызов — они сказали, что закрыли все дырки», — улыбается Андрей Лопатин, дающий интервью Forbes в аудитории, где занимается с одаренными студентами СПбГУ. Уже на первом курсе Николаю Дурову предложили место в сборной университета по программированию, но без друзей он участвовать отказался. Когда через год амбициозное трио поехало во Флориду, тренеры понимали, что в десятку команда выйдет точно. «Достаточно было видеть, как слаженно работает команда, как Коля мыслит», — вспоминает еще один их тренер Наталия Вояковская, бывший преподаватель СПбГУ и сотрудник компании «Ланит-Терком», спонсировавшей сборную. Дуров был безусловным лидером команды. «Это как-то сразу чувствовалось. Он, конечно, весь в себе. Но если его разговорить, что непросто, получаешь много удовольствия. Интеллект Коли Дурова — мощная вещь», — добавляет Вояковская. \u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/c9/2b/c92b11b76fcbf1863f5440d63166d9793bcc2a61.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003e Фото Евгения Петрушанского для Forbes\u003c/small\u003e \u003c/center\u003e\u003cp\u003eСпустя шесть лет после защиты кандидатской диссертации Николаю Дурову снова пришлось взять на себя функции лидера команды. Младший брат Павел попросил его помочь с разработкой кода для социальной сети «ВКонтакте». Николай первым делом пригласил Лопатина (с Етеревским они разошлись еще в университете, он работает сейчас в российском офисе Google). Тот сразу согласился: «Потому что работать со знакомыми людьми». Сначала код писали вдвоем. Постепенно стали подтягивать своих учеников.\u003c/p\u003e\u003cp\u003e«Они хотели чем-то интересным заниматься — почему бы не дать такую возможность», — говорит Лопатин. Николай Дуров не стал общаться с Forbes.\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/a8/d9/a8d9dd0446a888d446f6a33983d1bc42a7233979.png\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eКоманда Дурова оптимизировала распределение нагрузки на серверы, что ускорило работу соцсети. Для «ВКонтакте» был даже создан собственный вариант языка программирования PHP, который назвали KPHP. Многие опции для пользователей российская сеть вводила раньше, чем послужившая ей примером Facebook, например внутреннюю валюту. «ВКонтакте» — это качественный программный продукт. Вещь, за которую не стыдно ни разу», — отмечает Максим Шафиров, который давно не общается с бывшими подопечными.\u003c/p\u003e\u003cp\u003eМихаил Левин, руководитель службы анализа больших данных «Яндекса» (призер двух чемпионатов ACM ICPC), отмечает, что «чемпионатники» очень умные, но часто пишут «макароны» — плохо читаемый код, непонятный другим разработчикам. Помогая Лопатину готовить студентов к соревнованиям, Дуров как раз обращал их внимание на легкость реализации кода: придумывали, как сократить код сложных алгоритмов с 20 Кб до 1 Кб. Навыки «олимпиадников» в работе помогают, но их адаптация к работе над коммерческим продуктом, по словам Лопатина, проходит всегда непросто. «Чем ближе компания к стартапу, тем быстрее этот процесс происходит. А «ВКонтакте» долго жила именно в такой атмосфере», — замечает он. При подготовке студентов к чемпионатам Лопатин старался учитывать не только талант, но и человеческий фактор — кто с кем сработается, что происходит в команде, как успокоиться перед финалом. Перед финалом в Пекине, например, Лопатин повел программистов в караоке — видео, где он зажигательно исполняет битловскую песню Obladi Oblada, набрало больше тысячи просмотров на YouTube.\u003c/p\u003e\u003cp\u003e\u003ciframe allowfullscreen\u003d\"\" frameborder\u003d\"0\" height\u003d\"315\" src\u003d\"https://www.youtube.com/embed/JpxxqFeF-G0\" width\u003d\"420\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003cp\u003eДва десятка программистов «ВКонтакте» размещались в знаменитом Доме Зингера, но не изменили своим привычкам, даже когда компания стала «золотой жилой».\u003c/p\u003e \u003cpre\u003eВ то время как основатель сети Павел Дуров разбрасывал из окна штаб-квартиры пятитысячные купюры и возил топ-менеджеров на выходные в Дубай на арендованном самолете, Николая Дурова легко можно было встретить с книжкой в метро.\u003c/pre\u003e\u003cp\u003e«Дуров — он почти Перельман», — говорит Елизаров. \u003c/p\u003e\u003cp\u003eАтмосфера изменилась в 2013 году, когда вокруг соцсети возник корпоративный конфликт. В сентябре 2014 года Mail.ru Group, подконтрольная богатейшему россиянину \u003ca href\u003d\"http://www.forbes.ru/profile/alisher-usmanov\"\u003eАлишеру Усманову\u003c/a\u003e(№3 в рейтинге Forbes «Богатейшие бизнесмены России» на момент написания статьи — прим. Codeforces::News), полностью консолидировала «ВКонтакте», выкупив 48% у фонда UCP за $1,47 млрд. Двенадцать программистов вслед за Павлом Дуровым покинули Россию и работают над мессенджером Telegram. Но «ВКонтакте» по-прежнему привлекательна для звездных кодеров. По словам Лопатина, сейчас в команде два победителя последнего чемпионата мира, которые перешли в компанию из «Яндекса».\u003c/p\u003e\u003cp\u003eСам он из проекта вышел, но вслед за Дуровым не поехал. «Они разошлись, Лопатин уже не работает над Telegram», — уверяет его знакомый. Лопатин про Telegram говорить не хочет, но подтверждает, что сосредоточился на преподавании. Предложения по работе есть, но пока он ничего не выбрал. «Мне важно делать вещи, которые будут полезными. Вкладывать в завтрашнее поколение», — говорит программист.\u003c/p\u003e\u003ch4\u003eБизнес на своих\u003c/h4\u003e\u003cp\u003eРоман Елизаров, проводивший школьные турниры для программистов, в 2002 году основал с партнерами компанию Devexperts, разрабатывающую софт для финансового сектора. Он делит программистов на тех, кто готов работать по шаблонам, и тех, кто любит искать решения для уникальных задач. Последние более востребованы, но и гораздо более требовательны к работодателям. Пока технологические компании не начали бурно расти и «пылесосить» рынок кадров, единственной альтернативой для недовольных работой было создание собственного бизнеса. «Сейчас возможностей больше, — признает он. — А в начале 2000-х многим приходилось становиться предпринимателями». В конце 1999 года в пражском офисе российско-немецкой компании TogetherSoft назрел бунт. Программист Сергей Дмитриев подговорил своих коллег Евгения Беляева и Валентина Кипяткова открыть свое дело. Он зажег их идеей создать удобный продукт для программистов. «Существующие на тот момент IDE нас не устраивали, и мы не могли понять, почему в них нет многих столь очевидно нужных функций, которые вполне можно реализовать на современных компьютерах. Мы обсудили это втроем и поняли, что у нас много мыслей по этому поводу и наверняка такая IDE нужна не только нам троим», — говорит Кипятков. \u003c/p\u003e\u003cp\u003eВ феврале 2000 года уволившиеся из TogetherSoft программисты открыли фирму JetBrains в съемной квартире в Праге. Вскоре появился второй офис, в родном для них Санкт-Петербурге.\u003c/p\u003e \u003cpre\u003eОснователи отлично разбирались в программировании и людей набирали таких же.\u003c/pre\u003e\u003cp\u003eВ 2002 году десятым членом команды стал Максим Шафиров, бывший тренер команды Дурова (пришел простым программистом, с 2012 года возглавляет российский офис).\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/1f/5e/1f5e51e2c16e8a8cade989ffc27b212b8eda70c1.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eМаксим Шафиров. Фото издания \u003ca href\u003d\"http://paperpaper.ru/jetbrains-lab/\"\u003e«Бумага»\u003c/a\u003e\u003c/small\u003e \u003c/center\u003e\u003cp\u003eКомпания специализируется на софте для программистов. Первый и до сих пор основной продукт JetBrains — интегрированная среда разработки IntelliJ IDEA. «Есть магазин строительных товаров — там строители покупают топоры, пилы, молотки. Вот мы то же самое делаем, но для программистов», — объясняет Шафиров. Недостатка в клиентах не было — разработчики советовали друг другу новинку. Первым крупным клиентом стала Goldman Sachs. С первого года JetBrains получала прибыль. Но в 2003 году, когда компания уже открыла офис в Бостоне, рост остановился: программисты начали массово переходить на бесплатный продукт Eclipse, спонсором которого была IBM. JetBrains оставалось лишь улучшать свой IntelliJ IDEA. «Найдутся те, кто будет отстаивать преимущество Eclipse, но большинство сейчас пользуется продуктом JetBrains», — отмечает Михаил Левин из «Яндекса».\u003c/p\u003e\u003cp\u003eЭтот вызов побудил компанию диверсифицировать бизнес. IntelliJ IDEA была предназначена только для платформы Java, которую атаковал Microsoft со своей DotNet. «Мы стали делать плагин ReShaper, который дополняет функциональность этой платформы», — говорит Шафиров. Новый продукт вышел в середине 2004 года и, по словам Шафирова, выстрелил сразу. Число клиентов выросло до 25 000, а штат — до 80 человек. Откуда разработчики?\u003c/p\u003e \u003cpre\u003e«Я тогда еще преподавал в СПбГУ, половина моих студентов оказывалась в компании», — признается Шафиров.\u003c/pre\u003e\u003cp\u003eСейчас у JetBrains около 20 продуктов. В конце 2010 года открыли офис в Мюнхене — чтобы удержать талантливых сотрудников, стремившихся уехать за границу. В первые два года желающих оказалось слишком много, пришлось ввести ограничение на переезд — не больше 12 человек в год. Сейчас в мюнхенском офисе работают около 100 человек, в петербургском — более 300. \u003c/p\u003e\u003cp\u003eВ июне 2013 года вся петербургская команда JetBrains переехала в новое семиэтажное здание. «После этого переезда я стал ощущать JetBrains солидной компанией», — рассказывает Кипятков. В 2014 году выручка превысила $110 млн: последние три года рост был почти 40%. При этом около 40% выручки приходится на США.\u003c/p\u003e \u003cpre\u003eОснователи отошли от оперативного управления, передав полномочия двум генеральным директорам в России и в Германии.\u003c/pre\u003e\u003cp\u003eДмитриев увлекся биоинформатикой и проблемой старения, живет в Мюнхене, как и Евгений Беляев. Валентин Кипятков остался в Санкт-Петербурге и по-прежнему много программирует сам. «Ему это нравится», — говорит Шафиров.\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/58/9a/589a0c303c9ea8de7e418b5afa35048b882acbd3.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch4\u003eКурсовая работа\u003c/h4\u003e\u003cp\u003eНад тазом с жидким азотом клубится пар. Термометр показывает –192,9 градуса по Цельсию. В емкость бросают модуль оперативной памяти, вытаскивают его плоскогубцами и вставляют в слот компьютера. На мониторе появляются буквы и цифры — ключ к зашифрованным данным. Чем ниже температура, тем дольше сохраняются данные — в этом смысл «атаки холодной загрузки». За этим фокусом внимательно следят школьники и студенты, участвующие в конкурсе по кибербезопасности NeoQuest. Уже третий год его проводит питерская компания «Необит», созданная Петром Зегждой, заведующим кафедрой информационной безопасности компьютерных систем Санкт-Петербургского политехнического университета, и его сыном Дмитрием, профессором той же кафедры.\u003c/p\u003e\u003cp\u003eКомпания, в которой работает около сотни студентов и преподавателей, разрабатывает системы защиты информации (еще в 1990-х годах при вузе по инициативе ФАПСИ был создан Специализированный центр защиты информации — СЦЗИ). Фактически это частный научно-исследовательский институт, уточняет Дмитрий Зегжда. \u003c/p\u003e\u003cp\u003eБольшая часть разработок «Необита» связана с госзаказами. Одна из самых амбициозных разработок — проект «Фебос»: операционная система, управляющая работой виртуальных машин, на которых установлены другие ОС, такие как Linux, Windows со всеми приложениями. «Фебос» используется и в наработках компании по защите видеоконференцсвязи. Среди перспективных направлений, над которыми работают сотрудники «Необита», — облачные технологии и анализ безопасности потребительских устройств, так называемого «интернета вещей»: бытовой техники, «умных» домов.\u003c/p\u003e \u003cpre\u003eОфис «Необита» при этом совершенно не похож на секретный объект. По коридору, заваленному строительными материалами (начался ремонт), снуют молодые сотрудники в джинсах и майках.\u003c/pre\u003e\u003cp\u003eСтуденты приходят в компанию на 2–3-м курсе в качестве стажеров. «Такой «метод погружения» — индивидуальная работа — самый эффективный метод освоения знаний», — замечает Дмитрий Зегжда. Особо продвинутых берут на работу на полставки. \u003c/p\u003e\u003cp\u003eПравда, не всем такой подход нравится. Один из бывших сотрудников жалуется, что «Необит» просто использует студентов как недорогую рабочую силу, некоторые работают «за зачет». «Это смешно. Как вы себе представляете выполнение важных проектов с госзаказчиками, где вы будете зависеть от того, сделает вам чего-то студент на зачет или не сделает?» — говорит Зегжда-младший. Единственное ограничение — сотрудникам запрещено работать на удаленке.\u003c/p\u003e\u003cp\u003eПо данным системы СПАРК, за пять лет с момента основания выручка выросла в 10 раз, до 78 млн рублей (2012 год). Свежих финансовых показателей владельцы не раскрывают.\u003c/p\u003e\u003cp\u003eЧем привлекательна такая работа для студентов? Илья Медведовский, гендиректор компании Digital Security, учился у Зегжды и несколько лет работал аналитиком СЦЗИ под его руководством. Он вспоминает, как тестировал локальную сеть Novell NetWare 3.12, которую планировали использовать в госучреждениях. «Я был сетевым хакером, мне было это жутко интересно, и я ее в итоге сломал», — вспоминает Медведовский. Он считает, что Зегжда создал одну из самых сильных в стране школ по информационной безопасности, и охотно берет на работу выпускников. \u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/8a/77/8a774959ecbadba9ac2c78a6485b788016ef24c5.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003e Дмитрий и Петр Зегжда (справа) Фото Татьяны Плотниковой для Forbes\u003c/small\u003e \u003c/center\u003e\u003ch3\u003e\u003cstrong\u003eКомментарий Николая Дурова:\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eНемного обидно, что в этой статье снова распространяется миф о том, что вовсе не Павел написал и запустил первую версию «ВКонтакте», а также единолично разрабатывал и поддерживал её примерно год после этого, или что не он всё последующее время работы во «ВКонтакте» руководил веб-разработкой и веб-дизайном, а также принимал все принципиальные решения о направлении развития проекта.\u003c/p\u003e\u003cp\u003eЯ же на начальном этапе развития проекта разве что помогал общими советами и был кем-то вроде первого системного администратора компании. Года через полтора после запуска понадобилось разрабатывать специализированные системы хранения данных, в дополнение к стандартным инструментам вроде MySQL, и PHP-коду, написанному Павлом и другими PHP-разработчиками, и вот тогда-то подключились мы с Андреем Лопатиным, а затем и другие олимпиадники. Ну а конструкции про «в то время как ... разбрасывал купюры и летал в Дубай» пусть останутся на совести того, кто это написал.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/d1/0f/d10f3bbb6660baa25c32bb83e3ed818055a53365.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eНиколай Дуров. Фото Михаила Петрова\u003c/small\u003e \u003c/center\u003e\u003c/div\u003e","tags":["codeforces::news"]}}