{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1458856087,"rating":11,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1458856087,"id":43975,"title":"\u003cp\u003eТехнокубок 2016 — Ознакомительный Раунд 2\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"http://timeanddate.com/worldclock/fixedtime.html?day\u003d24\u0026amp;month\u003d3\u0026amp;year\u003d2016\u0026amp;hour\u003d09\u0026amp;min\u003d0\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003e24-го марта в 09:00 (московское время)\u003c/a\u003e стартовал \u003ca href\u003d\"//codeforces.com/contests/647\"\u003eОзнакомительный Раунд 2\u003c/a\u003e. Его продолжительность составит двое суток, его результаты не будут как-либо влиять на прохождение в следующие этапы. Его единственная цель — дать вам возможность ознакомиться с платформой Codeforces и её тестирующей системой. Приглашаем вас принять в нём участие! Для участия перейдите по ссылке \u003ca href\u003d\"//codeforces.com/contests/646\"\u003e\u003c/a\u003e\u003ca\u003ehttp://codeforces.com/contests/647\u003c/a\u003e. Раунд будет содержать несколько несложных ознакомительных задач и будет открыт для официальных участников Технокубка.\u003c/p\u003e\u003cp\u003eРаунд продлится 48 часов, такая продолжительность выбрана для того, чтобы все нашли себе удобное время для участия. Ознакомительный раунд, как и все предстоящие раунды, требует отдельной регистрации, она будет открыта на протяжении всего раунда.\u003c/p\u003e\u003cp\u003eВо время ознакомительного раунда задачи тестируются системой только на претестах, а системное тестирование состоится после окончания раунда. Обратите внимание, что претесты не покрывают все возможные случаи входных данных, поэтому тщательно тестируйте свои программы! Взломов, падения стоимости задач во время ознакомительного раунда не будет. Время сдачи задач не будет учитываться, однако будут учитываться штрафные попытки.\u003c/p\u003e \u003cp\u003e Напоминаем, что еще открыта регистрация на олимпиаду для школьников \u003ca href\u003d\"//codeforces.com/blog/entry/43553\"\u003eТехнокубок\u003c/a\u003e. Mail.Ru Group совместно с МФТИ, МГТУ им. Н. Э. Баумана и Codeforces в этом году впервые проводит Технокубок — первую совместную олимпиаду по программированию для школьников. На кону — дополнительные баллы при поступлении в престижные технические вузы России и ценные призы. \u003c/p\u003e \u003cp style\u003d\"text-align: center;font-size: 20.0px;\"\u003e \u003ca href\u003d\"https://it.mail.ru/technocup/\"\u003eЗарегистрироваться на олимпиаду!\u003c/a\u003e \u003c/p\u003e \u003cp\u003eВ финал соревнования будут приглашены лучшие 150 участников каждого из отборочных раундов (но не более 45% от общего числа участников раунда).\u003cbr /\u003eПервый отборочный раунд уже состоялся, а второй начнется \u003ca href\u003d\"http://timeanddate.com/worldclock/fixedtime.html?day\u003d26\u0026amp;month\u003d3\u0026amp;year\u003d2016\u0026amp;hour\u003d10\u0026amp;min\u003d0\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003e26 марта (суббота) в 10:00\u003c/a\u003e. \u003c/p\u003e \u003cp\u003e Желаем удачи на олимпиаде, \u003cbr /\u003e MikeMirzayanov и команда Технокубка \u003c/p\u003e\u003c/div\u003e","tags":["технокубок"]}}