{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1506801710,"rating":0,"authorHandle":"acmASCIS","modificationTimeSeconds":1507064602,"id":54865,"title":"\u003cp\u003eWeek01 — Binary Search\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/cc/92/cc9233b5c97e489f6ad57cd9d41e6c51c9c9753d.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eBinary search is an efficient algorithm to find a value in a sorted sequence\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eSo what is Binary search?\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eBinary search is like looking up a phone number or a word in the dictionary\u003c/p\u003e \u003col\u003e   \u003cli\u003eStart in middle of book\u003c/li\u003e   \u003cli\u003eIf the name you\u0027re looking for, comes before names on the page, search in the first half\u003c/li\u003e   \u003cli\u003eOtherwise, look into the second half\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eIt works by repeatedly dividing in half the portion of the list that could contain the item, until you\u0027ve narrowed down the possible locations to just one\u003c/p\u003e\u003cp\u003eOne of the most common ways to use binary search is to find an item in a list\u003c/p\u003e\u003cp\u003eFor example, the Tycho-2 star catalog contains about the brightest 2,539,913 stars in our galaxy. Suppose that you want to search the catalog for a particular star, based on the star\u0027s name. If the program examined every star in the star catalog in order starting with the first, an algorithm called linear search, the computer might have to examine all 2,539,913 stars to find the star you were looking for, in the worst case. If the catalog were sorted alphabetically by star names, binary search would *not have to examine more than 22 stars, even in the worst case.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eWhich problem can be solved using Binary search?\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003etry to break the problem in a yes or no question. If the problem follows the structure below, then binary search can be used\u003c/p\u003e\u003cp\u003eIf you answered yes for some potential solution, x means that you’d also get a yes answer for any element after x. Similarly, if you got no, you’d get a no answer for any element before x. As a consequence, if you were to ask the question for each element in the search space (in order), you would get a series of no answers followed by a series of yes answers.\u003c/p\u003e\u003cp\u003eBinary search usage isn’t limited only to list searching only. We can solve a wide variety of simple equations — logarithmic, exponential, and polynomial alike.\u003c/p\u003e\u003cp\u003eAs the real number line is nothing but a sorted list, then every equation solving problem can be considered a search problem. And so binary search can solve these kinds of problems\u003c/p\u003e\u003cp\u003eAs explained on the above photo, binary search is much faster algorithm than all the ordinary search techniques as it splits the search space into half in every step checking if the mid element of the range is the target element or not, if not then it compares it to the target as if it\u0027s greater than it then the target element on the left range and if it\u0027s smaller than it then the target element on the right range. \u003c/p\u003e\u003ch4\u003e\u003cstrong\u003e\u003ca href\u003d\"https://www.youtube.com/watch?v\u003dP3YID7liBug\"\u003e((( Youtube Tutorial )))\u003c/a\u003e\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eAdditional References:\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.topcoder.com/community/data-science/data-science-tutorials/binary-search/\"\u003ehttps://www.topcoder.com/community/data-science/data-science-tutorials/binary-search/\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://cs-study.blogspot.com.eg/2012/12/binary-search.html\"\u003ehttp://cs-study.blogspot.com.eg/2012/12/binary-search.html\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.khanacademy.org/computing/computer-science/algorithms/binary-search/a/binary-search\"\u003ehttps://www.khanacademy.org/computing/computer-science/algorithms/binary-search/a/binary-search\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.codementor.io/rishabhdaal/solving-problems-binary-search-interview-questions-du1089cq6\"\u003ehttps://www.codementor.io/rishabhdaal/solving-problems-binary-search-interview-questions-du1089cq6\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.codementor.io/abhaychaturvedi/binary-search-solving-mathematic-equations-512znyhkr\"\u003ehttps://www.codementor.io/abhaychaturvedi/binary-search-solving-mathematic-equations-512znyhkr\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}