{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1520870889,"rating":41,"authorHandle":"andrewzta","modificationTimeSeconds":1521530217,"id":58328,"title":"\u003cp\u003eИОИП 2018 — Регистрация финалистов\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD Мы продлили регистрацию до 20 марта, так что сегодня последний шанс зарегистрироваться!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eВ этом году финал личной номинации \u0026quot;Олимпиады школьников по информатике и программированию\u0026quot;, известный также как ИОИП, пройдет 25 марта. \u003c/p\u003e\u003cp\u003eОлимпиада в перечень олимпиад Российского совета олимпиад школьников под номером 62 и имеет 1 уровень. Таким образом, диплом этой олимпиады может давать льготы при поступлении в вуз. \u003c/p\u003e\u003cp\u003eНа заключительный этап без дополнительного отбора приглашаются все участники заключительного этапа ВКОШП-2017, вне зависимости от города выступления. Также на заключительный этап без дополнительного отбора приглашаются все участники муниципального этапа ВсОШ в Санкт-Петербурге, обучающиеся в 11 классе, которые набрали на муниципальном этапе хотя бы 250 баллов. Наконец, на заключительный этап приглашаются участники, успешно выступившие хотя бы в одном из двух отборочных туров.\u003c/p\u003e\u003cp\u003eПодробная информация про ИОИП, список допущенных до финала, контактная информация точек проведения и возможность подать заявку на участие в финале ИОИП для тех, кто к нему допущен — на сайте олимпиады \u003ca href\u003d\"http://neerc.ifmo.ru/school/ioip\"\u003ehttp://neerc.ifmo.ru/school/ioip\u003c/a\u003e\u003c/p\u003e\u003cp\u003eТочки проведения организованы в Санкт-Петербурге, Мытищах, Екатеринбурге, Мозыре, Ижевске, Челябинске, Самаре, Ханты-Мансийске, Ставрополе, Новосибирске, Витебске, Иннополисе, Могилеве, Бишкеке, Кременчуге, Москве, Хабаровске. \u003c/p\u003e\u003cp\u003eУдачи всем и до встречи в финале!\u003c/p\u003e\u003c/div\u003e","tags":[]}}