{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1432931428,"rating":148,"authorHandle":"Optimist","modificationTimeSeconds":1432932728,"id":18217,"title":"\u003cp\u003e\u0026quot;Паралимпиада\u0026quot; Типичного Программиста\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДве недели назад завершилась уже вторая олимпиада от паблика \u0026quot;Типичный программист\u0026quot;. Две недели назад мы приняли решение написать этот пост, но решили подождать (чего — читайте ниже).\u003c/p\u003e\u003cp\u003eИ вот сейчас, когда температура стульев вновь повысилась, мы с чистой совестью приступили к выполнению обещания.\u003c/p\u003e\u003cp\u003eДля желающих есть ссылки на \u003ca href\u003d\"http://files.torbad.ru/problems.pdf\"\u003eусловия задач\u003c/a\u003e и \u003ca href\u003d\"http://ejudge.tproger.ru/docs/answers.pdf\"\u003eразбор\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eРазумеется, от этой олимпиады мы вряд ли ждали многого, как и от многих других олимпиад по программированию, в сообществе которых не видно знакомых лиц и не слышно знакомых слов. Опасаться стоило прежде всего некачественных задач и нетрадиционных способов проверки решений. Однако те, кому повезло участвовать в прошлом году, хоть были не очень довольны организацией контеста в целом, но об условиях задач отзывались более-менее положительно. В качестве тестирующей системы использовался ejudge.\u003c/p\u003e\u003cp\u003eПочему же всё-таки в этом хотелось поучаствовать? Наверное, во многом из-за желания посмотреть, как может выглядеть большая олимпиада, организованная без помощи специализированной платформы (будь то Codeforces, Яндекс.Контест или другие) и обслуживающих эту платформу людей. Кроме того, обещали призы и подарки. Наконец, учитывая предполагаемую аудиторию мероприятия, не хотелось терять шанс показать \u0026quot;обычным программистам\u0026quot; (которых в последние годы часто рассматривают почти как антагонистов \u0026quot;спортивных программистов\u0026quot;), каково это — находиться на нашем \u0026quot;поле боя\u0026quot;.\u003c/p\u003e\u003cp\u003eСразу следует сказать, что у олимпиады были сильные стороны — прежде всего это набор задач про Brainfuck, в одной из которых требовалось написать интерпретатор этого языка, а в нескольких других — простые программы на нём. Решение первой задачи можно было дебужить решениями других задач, и это было очень интересно и здорово. Было видно, что жюри по мере своих сил старается решать возникающие технические проблемы, информировать о состоянии дел через паблик.\u003c/p\u003e\u003cp\u003eНо, всё-таки, чем же нам действительно запомнится это соревнование?\u003c/p\u003e\u003cp\u003e1) Да, разумеется, ПРОСТОЯМИ. В течение первого дня олимпиады ожидание вердикта по решениям могло занимать более часа, размер очереди проверяемых посылок мог достигать шести сотен.\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u0026gt; лол, в прошлом году очередь была около 1400 в свои лучшие времена, интересно, в этом так получится?)\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e- Андрей из скайпа\u003c/em\u003e\u003c/p\u003e\u003cp\u003eК ночи серверы таки ускорили, но неповторимый осадок остался. Резонный вопрос — можно ли было организовать какое-то подобие пробного тура и заранее узнать, что серверы не потянут? Тем более, что опыт прошлого года также подводил к этому решению.\u003c/p\u003e\u003cp\u003e2) Сразу после простоев идёт специфичная система ранжирования: при одинаковом количестве баллов и попыток выше находится тот участник, который имеет меньшее время между первым и последним решением. Казалось бы, в свете первого пункта такая система вообще не жизнеспособна. Осторожный участник, не уверенный до конца в своём решении, в течение первого дня был вынужден ждать вердикта, накапливая таким образом временной штраф. В таких условиях, наверное, больше подошла бы система оценки времени наподобие ICPC. Окей, всё же можно допустить, что авторы не предполагали такой беды с серверами, а исправлять метрику ранжирования на ходу не было возможности. Но…\u003c/p\u003e\u003cp\u003e3) В итоге контест выигрывает человек с разницей в 3 секунды между посылками. Разумеется, вполне можно было решить всё заранее и потом отослать решения по всем задачам вместе; вряд ли кто-то сможет обвинить топовых участников в том, что они использовали какую-то другую стратегию. Но, тем не менее, нельзя отрицать, что первые два пункта в совокупности породили отличное поле для недобросовестного поведения участников. В погоне за призами, особенно ближе к концу соревнования, количество новых участников, внезапно сдающих всё за минуты с первой попытки (при наличии в проблемсете минимум двух сложных задач с “подводными камнями”, где можно было получить неполный балл), росло темпами, несовместимыми со здравым смыслом. В итоговой таблице было более сотни полных решений, десятки — одним-двумя брёвнами по всем 14 задачам.\u003c/p\u003e\u003cp\u003e4) Наконец, пункт, из-за которого этот пост появился на свет только сейчас, так как надежда ещё теплилась. Обещания проверки решений на плагиат. Очевидно, что в сложившейся ситуации она была очень и очень важна. Ближе к концу соревнования организаторы стали запугивать недобросовестных участников страшными карами и предлагать сдаться с повинной, дабы сохранить часть баллов (что, вообще говоря, само по себе странно, так как за неспортивное поведение в приличных домах банят). В турнирной таблице даже появились пометки читерских попыток, правда, все они красовались на одном-единственном участнике до самого конца контеста. В итоге, к сожалению, ощутимых изменений от пристальной проверки решений, занявшей две дополнительных недели (ДВЕ НЕДЕЛИ, КАРЛ), так и не оказалось (по словам организаторов, дисквалифицирован был один участник). \u003ca href\u003d\"http://ejudge.tproger.ru/results.html\"\u003eТоп турнирной таблицы\u003c/a\u003e сохранил своё неповторимое великолепие.\u003c/p\u003e\u003cp\u003eEt cetera. Надо бы упомянуть несколько мелких, но запомнившихся особенностей, как то: \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eнерасторопность жюри в ответах на клары (наверное, из-за того, что клар было много),\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eнедочёты в интерпретаторе брейнфака, вылившиеся в ночной реджадж (получается, весь день минимум 3 задачи могли получать неполное количество баллов, что в дальнейшем повлекло ещё большую путаницу в результатах),\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eобщее качество задач, которое на удивление соответствовало ожидаемому:\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cem\u003eТимур, а вот интересно, кто-нибудь перед отправкой хоть немного тестил, или все просто понимали \u0026quot;ага, ну очевидно, что в этой задаче невероятно слабые тесты, поэтому отправлю-ка я треш\u0026quot;? :)\u003c/em\u003e \u003c/p\u003e\u003cp\u003e\u003cem\u003e- \u003ca href\u003d\"https://vk.com/tproger_olymp?w\u003dwall-67845382_4562\"\u003ehttps://vk.com/tproger_olymp?w\u003dwall-67845382_4562\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003eNuff said.\u003c/p\u003e\u003cp\u003eЧто же остаётся в итоге? При всех недостатках, мы не можем забывать про важность таких олимпиад для популяризации олимпиадного программирования. И организаторы, и спонсоры проделали большую работу. Но было бы ещё лучше, если бы недостатки со временем исправлялись, метрики улучшались, задачи дорабатывались напильником. В текущей же ситуации получилось так, что из-за упомянутых багов у многих участников сложилось скорее негативное представление об олимпиадном программировании, а это наверняка совсем не то, к чему стремились организаторы.\u003c/p\u003e\u003cp\u003eВидимо, сам этот пост — наше средство создать обсуждение олимпиады, оставить напоминание её создателям, что их работу видят в большом олимпиадном сообществе.\u003c/p\u003e\u003cp\u003eУчаствовали ли в этой олимпиаде вы? Чем она вам запомнилась? Что вы можете про неё рассказать?\u003c/p\u003e\u003cp\u003eВсегда ваши, синие да зелёные из Ульяновска. Писали все вместе, правда.\u003c/p\u003e\u003c/div\u003e","tags":["типичный программист","олимпиада","бугурт"]}}