{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1483145716,"rating":1405,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1483157537,"id":49425,"title":"\u003cp\u003eCodeforces: summing up 2016 year\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/Happy-New-Year-HD-Wallpapers.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eSomehow it turns out that for me, each coming the New Year means more and more. This is an excellent opportunity to take stock, to breathe fresh air and to go through a kind of catharsis. This is a rare opportunity to be with the family, dress up in Santa Claus and just have fun.\u003c/p\u003e\u003cp\u003eHolidays give me a clear criterion that I do the right things. If during the holidays, I begin to think about it, to recall some deferred ideas, eager to implement something new. So I’m doing right things. My things. And now exactly the same as in several recent years: during New Year holidays I write code for Codeforces, trying new technology or simply I’m making minor changes in testlib. It is necessary to me: at this moment are no deadlines, do not press the obligation. Just now, at 3 am, I can not break away from being able to do something new. I would like to take a moment and realize that spun in my head the whole year.\u003c/p\u003e\u003cp\u003eI\u0027m insanely happy to huge number (9144!) of registrations on Good Bye 2016. Your desire to grow, to learn new things, solve problems and invent, improve skills and compete, all this things give me strength and desire to develop the platform.\u003c/p\u003e\u003cp\u003eI wish you not to lose the fire in eyes, when you meet an interesting problem. I wish to continue to find pleasure in each contest or round. I wish to find, to solve more and more complicated and interesting problems. Victories and achievements! Wish you to solve all things which you didn’t solve in 2016!\u003c/p\u003e\u003cp\u003eHappy New Year!\u003c/p\u003e\u003cp\u003eBut you, please read this post entirely. It is important to me. It draws the symbolic line to me and the whole Codeforces team. And, of course, below it is written about change handles gift and a colorful masquerade of ranks. Go! \u003cbr /\u003e\u003c/p\u003e\u003ch2\u003eMagic Gifts and Where to Find Them\u003c/h2\u003e\u003ch4\u003eChange handle feature\u003c/h4\u003e\u003cp\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/ny-gift.jpg\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHurry! Only until the 10th of January, you can change your handle (\u003cb\u003ebut only once\u003c/b\u003e)! Note that it will be possible to roll back the changes or change the handle again only \u003cem\u003eafter a year\u003c/em\u003e. Be careful what you wish for.\u003c/p\u003e\u003cp\u003eYou can change your handle to the new one which wasn\u0027t used before by anybody or which was used by you before. The links to a profile page with old handle would automatically redirect to the actual profile.\u003c/p\u003e\u003cp\u003eThis year we have an improvement. If you took part in at least 10 rounds you can request handle of an \u003cem\u003einactive\u003c/em\u003e participant. It means that the participant should have a period of activity on Codeforces of at most 30 days, this period should be in 2012 or earlier. The inactive participant can’t have posted comments, messages and so on. It can’t take part in more than 2 contests. It will be automatically renamed and informed by email. If you can’t change handle to others, it means that some requirement doesn’t meet. Please do not ask me to do something with it. I’m not Santa Claus.\u003c/p\u003e\u003cp\u003eTalking about handles I always reminisce the following story. Once a user wrote me the message: \u0026quot;Please change my handle from I_love_Valya to I_love_Sveta, as I no longer love Valya ...\u0026quot;\u003c/p\u003e\u003ch4\u003eNew Year\u0027s masquerade of colors and ranks\u003c/h4\u003e\u003cp\u003eTraditional magical tab has appeared in the profile setting. Happy New Year!\u003c/p\u003e\u003ch2\u003ePartners, customers and sponsored events\u003c/h2\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/vkcup2016-small.jpg\" style\u003d\"margin: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eWe are always pleased when companies pay attention to the programming contest whether in order to find the brightest talent (yes, you are!) candidates, whether it is to support our community and just show themselves to you. Very pleased that this year the list of our partners long and varied. Many come again, and it’s inspiring. Here is a list of companies with whom or for whom we hosted competitions: VK, Mail.Ru, CROC, AIM Tech, 8VC, Wunder Fund, VeeRoute, Intel, Diagram, MyTona. In this list, I did not consider the company to whom we just hosted a mirror of their main event (hello, Microsoft).\u003c/p\u003e\u003cp\u003eHere is a list of sponsorship and championship rounds:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eChampionship VK Cup 2016 (together with VK)\u003c/li\u003e   \u003cli\u003eChampionship CROC 2016 (together with КРОК)\u003c/li\u003e   \u003cli\u003eMini-championship 8VC Venture Cup 2016 (together with 8VC)\u003c/li\u003e   \u003cli\u003eSponsored round Wunder Fund Round 2016 (together with Wunder Fund)\u003c/li\u003e   \u003cli\u003eSponsored rounds AIM Tech Round 2 and 3 (together with AIM Tech)\u003c/li\u003e   \u003cli\u003eExperimental marathon round (together with VeeRoute)\u003c/li\u003e   \u003cli\u003eChampionship Technocup 2016 (together with Mail.Ru, MIPT and Bauman MSTU)\u003c/li\u003e   \u003cli\u003eMini-championship Intel Code Challenge (together with Intel)\u003c/li\u003e   \u003cli\u003eSponsored round Canada Cup 2016 (together with Diagram)\u003c/li\u003e   \u003cli\u003eRussian AI Cup 2016 (separate from the Codeforces platform, together with Mail.Ru)\u003c/li\u003e \u003c/ul\u003e\u003ch2\u003eProgress\u003c/h2\u003e\u003cp\u003eThe development does not stand still. Me, \u003ca class\u003d\"rated-user user-black\" href\u003d\"/profile/SladeThe\" title\u003d\"Unrated, SladeThe\"\u003eSladeThe\u003c/a\u003e, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/kuviman\" title\u003d\"Master kuviman\"\u003ekuviman\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/fcspartakm\" title\u003d\"Candidate Master fcspartakm\"\u003efcspartakm\u003c/a\u003e design features, write code, debug, do profiling, read logs, test. In short, we have a fun live. The system load become higher, large number of improvements have been made in the backend of the system, this changes are not explicitly visible to you. I reviewed the list of commits and made a selection on the progress in 2016 (probably lost something):\u003c/p\u003e \u003cdiv style\u003d\"float: right;margin: 2.0em;\"\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/santa-computer-lighted-desk.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eIt is me during the New Year holidays\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003c/div\u003e \u003cul\u003e   \u003cli\u003eadd contests entirely from Polygon, instead of problem-by-problem (for admins)\u003c/li\u003e   \u003cli\u003efixed possibility to register on a contest twice\u003c/li\u003e   \u003cli\u003emigrated to Ace as a code editor on the submit form\u003c/li\u003e   \u003cli\u003ein Contest Wizard (for Gym) supported problems with answers not produced by solutions, use checkbox “Incompatible answer format”\u003c/li\u003e   \u003cli\u003efixed authentication using VK\u003c/li\u003e   \u003cli\u003emultiple performance improvements\u003c/li\u003e   \u003cli\u003ebetter protection against bots and spam\u003c/li\u003e   \u003cli\u003espoilers in blogs and comments\u003c/li\u003e   \u003cli\u003esave drafts into localStorage\u003c/li\u003e   \u003cli\u003eextended API with methods: user.friends, user.blogEntries, blogEntry.view, blogEntry.comments and other\u003c/li\u003e   \u003cli\u003eimproved support of marathon problems\u003c/li\u003e   \u003cli\u003ejoint view of questions in rounds for divisions (for managers)\u003c/li\u003e   \u003cli\u003ewebsite mobile view\u003c/li\u003e   \u003cli\u003eimproved support of user lists\u003c/li\u003e   \u003cli\u003eextended registration to the rounds\u003c/li\u003e   \u003cli\u003efixes in the rating system\u003c/li\u003e   \u003cli\u003eCodeforces::News (in Russian)\u003c/li\u003e   \u003cli\u003ePolygon experienced the Black Day, reconfigured backups and replication system\u003c/li\u003e   \u003cli\u003efeature to filter hack by problems\u003c/li\u003e   \u003cli\u003ebetter form to choose t-shirt\u003c/li\u003e   \u003cli\u003ecomments preview during edit process\u003c/li\u003e   \u003cli\u003einstructions how to write delivery address\u003c/li\u003e   \u003cli\u003eshow tutorials directly from Polygon (in blog posts)\u003c/li\u003e   \u003cli\u003efixed possibility to submit a solution twice\u003c/li\u003e   \u003cli\u003ebetter syntax highlighting\u003c/li\u003e   \u003cli\u003efeature to register again on a virtual contest\u003c/li\u003e   \u003cli\u003etaps instead of double click in the mobile view\u003c/li\u003e   \u003cli\u003emultiple files/solutions upload in Polygon\u003c/li\u003e   \u003cli\u003emany improvements in the Polygon API\u003c/li\u003e \u003c/ul\u003e\u003ch2\u003eStatistics\u003c/h2\u003e\u003cp\u003eI reluctantly started to collect statistics and to prepare pictures. According to past experience, it is laborious and tedious. But it was not there! I liked it!\u003c/p\u003e\u003cp\u003eThis year, statistics surprised me! Every year I prepare myself mentally to the fact that we are close to reaching all the interested audience, that in the next year we will not have time to do as many as done in the previous year. But just look at this beauty!\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2016/2016-registered-users-by-months.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eGrowth of registrations. We are close to 0.5 million registered users!\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2016/2016-active-users.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eCounted only participated in rated events in period July-December. Beautifully grow!\u003cbr /\u003e\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2016/2016-submissions.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eSubmitted solutions: you become more and more active! Keep up the good work!\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2016/2016-blog-posts.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003e Blog posts with positive score, having at least +5 votes, having at least +20 votes, having at least +100 votes. The total number of posts is not interesting, because a lot of trash/spam, which immediately disappears and the result much depends on how we protect against bots and inadequate. \u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2016/2016-comments.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eAll positive scored comments, having at least +5 votes, having at least +20 votes. The growth is small, but it exists.\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2016/2016-countries.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eIndia, Bangladesh, South Korea became strongly in 2016!\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2016/2016-pageviews-ga.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003ePageviews, about +25% in 2016!\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2016/2016-visits-ga.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eVisits, more than +20% in 2016!\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/statistics-2016/2016-visitors-ga.png?v\u003d1\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003ci\u003eVisitors, more than +20% in 2016!\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e\u003c/div\u003e","tags":["happy new year","new year","2017","codeforces","statistics"]}}