{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1410549058,"rating":15,"authorHandle":"kostya_by","modificationTimeSeconds":1410549101,"id":13759,"title":"\u003cp\u003eПервая неделя. Упражнения.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВыслал всем на почту письмо с упражнениями. На всякий случай продублирую его здесь.\u003c/p\u003e \u003chr /\u003e\u003cp\u003eВсем привет. Сегодня вы отслушали лекцию про деревья отрезков. Но, как известно, без практики теория очень быстро забывается. Так что кидаю вам список задач, которые помогут вам отточить свои новые навыки.\u003c/p\u003e\u003cp\u003eУпражнения:\u003c/p\u003e\u003cp\u003e1) USACO 2011 January Silver Contest, задача Profits\u003cbr /\u003e 2) \u003ca\u003ehttp://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1846\u003cbr /\u003e\u003c/a\u003e 3) \u003ca\u003ehttp://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1890\u003cbr /\u003e\u003c/a\u003e 4) USACO 2008 February Gold Contest, задача Hotel\u003cbr /\u003e 5) \u003ca href\u003d\"//codeforces.com/contest/446/problem/C\"\u003ehttp://codeforces.com/contest/446/problem/C\u003c/a\u003e — можно посмотреть мой код по ней, он довольно красивый и понятный( \u003ca href\u003d\"//codeforces.com/contest/446/submission/7085627\"\u003ehttp://codeforces.com/contest/446/submission/7085627\u003c/a\u003e )\u003cbr /\u003e 6) USACO 2008 November Gold Contest, задача Switching Lights \u003cbr /\u003e 7) \u003ca href\u003d\"http://www.spoj.com/problems/GSS1/\"\u003ehttp://www.spoj.com/problems/GSS1/\u003c/a\u003e\u003c/p\u003e\u003cp\u003eНемного комментариев:\u003c/p\u003e\u003cp\u003eПервая задача — небольшое упражнение на префиксные суммы. Вторая и третья — обычное дерево отрезков. Четвертая, пятая и шестая — на механизм отложенного спроса. Седьмая — на ту клевую фишку, которую рассказывал в конце.\u003c/p\u003e\u003cp\u003eЕсли написано, что задача с USACO, то вы сами можете выбирать где ее сдать. Как вариант — dl.gsu.by . Да, там не очень быстрые машины, но все три задачи у меня там сданы, а значит получить по ним АС там можно. \u003d)\u003c/p\u003e\u003cp\u003eУпражнения можно делать как угодно, советоваться, читать чужие исходники, спрашивать меня. В общем, делать все, чтобы разобраться.\u003c/p\u003e\u003cp\u003eА теперь гробы. Напоминаю: вам нужно подумать. Т.е. они несут именно идейную ценность, призваны развить мышление. Можете объединяться в группы, обмениваться мнениями, думать сами(как больше нравится), но никаких поисков в гугл или чтения разборов. Поверьте, так будет лучше.\u003c/p\u003e\u003cp\u003eИтак:\u003c/p\u003e\u003cp\u003e1) \u003ca\u003ehttps://code.google.com/codejam/contest/3024486/dashboard#s\u003dp1\u003cbr /\u003e\u003c/a\u003e 2) \u003ca\u003ehttp://main.edu.pl/en/archive/amppz/2011/jas\u003cbr /\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eГробы в этот раз не очень сложные(ибо много упражнений), так что это возможно ваш первый и последний шанс сдать гроб на первой неделе. Дерзайте! ;)\u003c/p\u003e\u003cp\u003eЕсли какие-то вопросы, то пишите в скайп или на этот адрес почты. \u003c/p\u003e\u003cp\u003eВ конце недели(т.е. в следующую пятницу) расскажете мне перед занятием о своих успехах. Также, чтобы я поставил вам плюсик напротив сданной задачи, вам необходимо прислать скриншот того, что вы действительно получили АС по данной задаче. Присылать их лучше на этот почтовый адрес. Срока сдачи задач нет. Т.е. можете мне под новый год прислать скриншот с АС задачи Switching Lights — я все равно поставлю вам плюсик. \u003d)\u003c/p\u003e\u003cp\u003eВроде все. Удачной прорешки!\u003c/p\u003e\u003cp\u003eСокол Константин.\u003c/p\u003e\u003c/div\u003e","tags":["упражнения","лицей бгу"]}}