{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1471269417,"rating":79,"authorHandle":"_wts_","modificationTimeSeconds":1471894238,"id":46577,"title":"\u003cp\u003eThat statement in every contest announcement\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eEveryone contest writer writes \u0026quot;thanks to \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e for great Codeforces and Polygon platforms\u0026quot; in the contest announcement blog. At the onset it might look like \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e runs a tight ship and people have to kiss his ass to continue writing contests! But as one spends more time on the platform, they will start appreciating the differencing factors of Codeforces.\u003c/p\u003e\u003cp\u003eThough I don\u0027t know much about Polygon, I wanted to thank \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e for Codeforces platform and thought I\u0027ll take some time to write why. In my opinion, here are the key things which makes Codeforces platform exceptional. \u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eAbility to filter all the successful submissions for a problem (during and outside of contest) and ability to sort it by \u0027execution time\u0027 or \u0027submission time\u0027. Sorting it by execution time helps analyze optimization techniques and sorting it by submission time helps to see what are the approach of quick solvers.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAbility to access contest details and tutorials from the contest dashboard page and from the problem to which the contest belongs. This is a blessing while solving the problem to quickly access its editorials. Some times the contest preparers does not use this functionality e.g. \u003ca href\u003d\"//codeforces.com/contest/704\"\u003ehttp://codeforces.com/contest/704\u003c/a\u003e. So we have to rely on Google search to get to the tutorials :(.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe standings page is awesome! I can quickly access all the solutions from all coders (especially top coders). IT ALSO SHOWS SUBMISSIONS OUTSIDE OF CONTEST!!! How cool is that!\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAbility to add favorite coders as friends and track their solutions during the contest and outside of it. I generally like to filter solution of certain coders. So \u003ccode\u003efriends standings\u003c/code\u003e page helps to do just that.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAbility to filter problem set by tags helps to target specific type of problems to solve.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eProblem statistics on the contest dashboard page and problemset page gives a good idea on the complexity of the problem.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAbility to hack during the contest. The hacker gets the points and the hacked can know the issue in their solution before the contest ends and has a chance to fix it and resubmit. Everybody wins!\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eSimple text based pages. There are not many fancy buttons, images and animations on the web page. Considering the coding platforms are for technical developers and not for general (non technical) users, it makes sense not to burden it with flashy content and animations.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eLast but not the least, the good set of contest writers and testers. I have not seen many instances where the problem statement is not clear or substandard solutions pass due to weak tests. I should say at this point the problem statement can be bit lengthy than required most of the times. Especially when you want the Div 2 problem A out of your way and you see full page statement you go REALLY!\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eSo, thanks \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e and your team for great Codeforces platform.\u003c/p\u003e\u003cp\u003eIf you like any feature that I missed, please leave a comment.\u003c/p\u003e\u003cp\u003eEdit: The statement that begins with \u0026quot;At the onset\u0026quot; is a badly written joke. When I read it now, it sounds like a serious statement!\u003c/p\u003e\u003cp\u003eEdit 2: New additions\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eAbility to send messages to users.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAbility to set favorite contests, problems and submissions. I recently discovered that I can set favorite on a submission. This is awesome! If I like an implementation, I can track it permanently.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003c/div\u003e","tags":["all","hail","the","king"]}}