{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1420820628,"rating":6,"authorHandle":"Eran","modificationTimeSeconds":1429163363,"id":15679,"title":"\u003cp\u003eДобавлены новые тренировки\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e: кружок завтра 30 марта отменяется, не забывайте с любыми вопросами не стесняйтесь пишите на почту!\u003c/p\u003e\u003cp\u003eДо регионального этапа осталось меньше месяца. А потому всем тем, кто собирается достигнуть определенных результатов, стоит начать подготовку по крайней мере сейчас.\u003c/p\u003e\u003cp\u003eЯ добавил в раздел \u0026quot;Соревнования\u0026quot; ещё две тренировки по материалам регионального этапа олимпиады школьников 2012-2013гг. И настоятельно рекомендую прорешать их. Будете вы это делать в режиме реального времени или нет — дело ваше.\u003c/p\u003e\u003cp\u003eТакже замечу, что ранее уже выкладывались ещё две тренировки по материалам регионов прошлых лет. Так что советую всем также обратить внимание и на них.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD++\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eНа всякий случай я добавил два тура прошлого года, даже если вы участвовали, то всё равно имеет смысл ознакомиться, вспомнить, порешать, перерешать.\u003c/p\u003e\u003cp\u003eТакже обратите внимание на эту ссылку, тут у некоторых есть разбор \u003ca href\u003d\"http://informatics.mccme.ru//course/view.php?id\u003d46\"\u003ehttp://informatics.mccme.ru//course/view.php?id\u003d46\u003c/a\u003e, также возможно что-то можно просто погуглить. В общем решайте все что можете, готовьтесь, пишите на почту, задавайте любые вопросы.\u003c/p\u003e\u003cp\u003eПавел Холкин\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD++\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eПоскольку саратовские школьники никогда особо не отличались способностью решать геометрию, я решил добавить ещё одну тренировку. \u003c/p\u003e\u003cp\u003eВ том году нам повезло, потому как на регионе не было подобных задач, но я более чем уверен, что в этом году они появятся. \u003c/p\u003e\u003cp\u003eВ тренировке вам предлагается решить 20 простых задач на геометрию. Более того, если у вас хватит знаний сделать это, то вы без проблем сможете решить задачу на геометрию и на регионе. \u003c/p\u003e\u003cp\u003eНа днях мы с Пашей расскажем вам о некоторых базовых вещах, а пока вы можете посмотреть на эти задачи. Ну а особо заинтересованные люди даже могут попробовать решить их. Так что дерзайте, потому как без умения решать такие задачи попасть на следующий этап будет весьма и весьма проблематично!\u003c/p\u003e\u003cp\u003eАнтон Ермилов\u003c/p\u003e\u003c/div\u003e","tags":["тренировки","региональный этап"]}}