{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1464043610,"rating":190,"authorHandle":"gKseni","modificationTimeSeconds":1464098730,"id":45024,"title":"\u003cp\u003eМнение: «Печальная карьера — это когда они идут работать в Facebook или в “Яндекс”»\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/39/67/3967212e48785b69db64f7595ab0b9d0981d577c.jpeg\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eРунет пестрит репостами беседы со спонсором десяти российских и украинских команд-финалистов Виктором Шабуровым. Подобные интервью встречаются нечасто. \u003c/p\u003e\u003cp\u003eПо \u003ca href\u003d\"https://medium.com/@peterchernyshov/%D0%BF%D0%B5%D1%87%D0%B0%D0%BB%D1%8C%D0%BD%D0%B0%D1%8F-%D0%BA%D0%B0%D1%80%D1%8C%D0%B5%D1%80%D0%B0-%D1%8D%D1%82%D0%BE-%D0%BA%D0%BE%D0%B3%D0%B4%D0%B0-%D0%BE%D0%BD%D0%B8-%D0%B8%D0%B4%D1%83%D1%82-%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%D1%82%D1%8C-%D0%B2-facebook-%D0%B8%D0%BB%D0%B8-%D0%B2-%D1%8F%D0%BD%D0%B4%D0%B5%D0%BA%D1%81-55fd2e8e46f9#.7zqswsvea\"\u003eматериалам medium.com\u003c/a\u003e:\u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eВ чем заключалась ваша помощь командам\u003c/strong\u003e \u003c/p\u003e\u003cp\u003e– Мы помогали золоту (СПбГУ), серебру (Уральский университет) и Запорожскому университету с Украины. Также поддержку оказали команде Львовского университета, Киевского университета имени Тараса Шевченко, Иннополису и другим университетам — всего десяти командам (сумму спонсорской помощи Виктор не разглашает. — Slon). \u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eРасскажите свою историю причастности к этим олимпиадам. Когда и как вы начали этим заниматься?\u003c/strong\u003e \u003c/p\u003e\u003cp\u003e– В школе и университете выигрывал математические олимпиады. Потом повезло поучаствовать в создании компании SPb Software вместе с замечательным человеком Василием Филипповым — одним из первых российских финалистов по программированию. Позже компанию купил «Яндекс». Вторая компания называлась Handster, ее купила Opera (сумма сделки с «Яндексом» составила $38 млн, с Opera — $10 млн.). Три года назад начал работать с украинской командой из Одессы. Они не выиграли чемпионат, но достаточно хорошо выступили. Вместе с этими ребятами мы основали компанию Looksery. Как видите, получилось очень успешно. Все три компании были созданы олимпиадниками, все три стали мировыми лидерами и были куплены. \u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eКогда и как вы начали спонсировать олимпиады по программированию?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– Где-то четыре года назад. Причем сначала я был сфокусирован на Украине — мы проводили олимпиады по программированию. Тогда Юрий Монастыршин, «отец» Looksery, как раз выиграл чемпионат два раза подряд. И после этого мы решили, что надо с ним попробовать раскрутить какую-то компанию. Долго обсуждали, три месяца, и пришли к идее Looksery.\u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eТо есть ваша помощь олимпиадам может потом к вам вернуться в виде талантливых ребят, вместе с которыми можно создавать бизнес?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– Да, конечно. Это в принципе и есть бизнес-модель. – \u003cstrong\u003eЯ читал, как проходит сама олимпиада: три участника в команде, тринадцать заданий, побеждает тот, кто решит больше и быстрее. Какого рода задачи приходится решать? Явно не на знание готовых решений?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– Конечно. Там исследовательские задачи. Эти ребята привыкли решать практически нерешаемые задачи. И это очень важное качество, из-за которого я с ними работаю. Они ничего не боятся. Когда мы запускали Looksery, нам нужно было сделать трекинг изменений лица в реальном времени. И специалисты в этой области говорят: «Это сейчас пока невозможно». А эти ребята не знают, что это невозможно. Перед ними поставили задачу, и они думают: «Опа, интересная задачка, давайте-ка мы попробуем ее решить». И решили.\u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eКакими навыками должен обладать программист, чтобы хорошо решать задачи по спортивному программированию?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– Прежде всего важны математика и алгоритмы. Тонкости языков программирования они обычно все хорошо знают, но профессиональные программисты знают их, может быть, даже лучше. Но здесь очень важна именно математика и алгоритмы.\u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eКак команды готовятся к олимпиаде?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– Они участвуют в куче региональных туров, готовятся к ним, решают задания с олимпиад предыдущих лет. Крутые тренеры, такие как Андрей Лопатин (тренер команды СПбГУ. — Slon), обычно имеют несколько командных составов. Они их комбинируют и ищут тот состав, который решает задачи лучше остальных. Это похоже на спорт, например на бейсбол, когда нужно подобрать того, кто лучше всех отбивает, того, кто лучше всех бегает, и получается команда.\u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eС 2006 года российские студенты выигрывали мировые олимпиады семь раз. В этом году пять из лучших десяти команд — российские. Почему так получается, в чем секрет? Есть такой стереотип о хорошей математической подготовке в крупных постсоветских вузах. Это действительно работает?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– Я бы не сказал, что у нас хорошее общее образование. Но математическое — сильное, вполне на уровне. Мне понравилось, как кто-то в фейсбуке написал: весь бюджет на образование в России меньше, чем бюджет одного Гарварда. Однако Гарвард они обыграли!\u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eА почему так получается, что лучшие в мире программы по компьютерной науке читают в MIT и Стэнфорде, а на олимпиадах расклад сил совсем другой? Может, у них другие приоритеты и там не уделяют так много времени и сил тренировке программистов для этих олимпиад?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– В MIT хорошие программисты. Когда мы нанимаем их на работу, мы видим, что у ребят хорошая подготовка. Но подготовка олимпиадников санкт-петербургского вуза примерно на таком же уровне. Я думаю, в MIT недостаточно сильно развита математика. В MIT и прочих американских вузах больше практики, потому что больше компаний вокруг — Google, Facebook.\u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eЧем занимаются олимпиадники после того, как оканчивают учебу?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– По-разному. Лично я помогаю им создавать стартапы. У них может быть печальная карьера — это когда они идут работать в Facebook или в «Яндекс». Это печальная карьера, потому что они идут на зарплату и их съедает корпоративная среда, они растворяются в ней. Иногда им удается бросить Facebook, и тогда у них что-то получается. Парень, который основал Quora — Адам Ди Энджело, тоже победил на олимпиаде в свое время. Он попал в Facebook, растворился в нем, но в последний момент сумел оторваться, вышел, основал Quora и создал миллиардную компанию.\u003c/p\u003e\u003cp\u003eЯ помогаю финалистам тем, что даю им возможность самим что-то создать крутое. И это работает. Это в трех компаниях уже сработало, последняя — Looksery. Там у нас было 60 процентов олимпиадников, и все они стали финансово успешными людьми (по некоторым данным, суммы компенсаций для членов команды Looksery составили от $1,5 млн. — Slon). Вот это хороший кейс, а плохой кейс — это сейчас пойти в Facebook или Google.\u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eПрограммисты часто говорят, что олимпиадные задачи — это чистая теория, в реальных условиях редко приходится решать задачи, подобные олимпиадным. Это правда?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– Абсолютно верно. И это основная причина, почему они в корпоративной среде пропадают. Потому что им приходится там делать какую-то рутинную работу, и они погибают от этого. Но они круто решают нерешенные задачи. И я именно этим и занимаюсь — ставлю перед ними задачу, которую никто никогда еще не решил. И создаю им подходящую среду: нанимаю команду iOS-, Android- и backend-разработчиков, создаю пиар, маркетинг. Им не нужно думать о документах, не нужно думать ни о чем. Вокруг них строится команда с профессиональными программистами, которая позволяет им сконцентрироваться только на главном: решить нерешаемую задачу. А это они умеют делать круто. Стать обычным Android- или iOS-разработчиком они не могут, а вот решить что-то нерешенное они могут очень хорошо.\u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eНужно ли учить программирование всем подряд и может ли оно спасти экономику?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– В 80-х годах все были hardware-инженерами. А потом рынок консолидировался вокруг Apple и IBM, все маленькие компании сдохли и hardware-инженеры перестали быть крутой профессией. Software сейчас пока что в расцвете и продолжает цвести. У всех профессий бывает момент насыщения, но в ближайшие пять лет я не вижу никакого насыщения в этой области.\u003c/p\u003e\u003cp\u003eВ ближайшие пять лет я не вижу никакого насыщения в этой области\u003cbr /\u003eЕсли смотреть не на программирование, а на все остальное, то как раз все остальное под большим вопросом. Технологии, и в частности программирование, machine learning, computer vision, self-driving cars убьют кучу профессий, целые индустрии. Поэтому, конечно, лучше, чтобы больше людей изучали программирование. Это более перспективно, чем большинство других профессий.\u003c/p\u003e\u003cp\u003e–** Если посмотреть на российских участников этого финального этапа только этого года, там десятки российских вузов. В России сотни, если даже не тысячи таких программистов высшего класса. Как вы думаете, многие из них уедут за границу? И это хорошо или плохо?**\u003c/p\u003e\u003cp\u003e– На самом деле не так много уезжает, как кажется, — процентов 30, то есть 70 процентов остаются. Ничего плохого в том, что они уезжают, я не вижу. Конечно, если человек уезжает работать в Facebook, это потеря для государства. Но если человек открывает свой стартап, то, во-первых, он еще несколько лет работает в своей стране, на Украине или в России, получает деньги из-за границы и тем самым поднимает экономику. Во-вторых, он становится богатым до переезда. Обычно ребята начинают покупать дома, машины, покупают что-то родителям. Они большую часть денег оставляют в стране. Ничего плохого я в этом не вижу. Некоторые, я думаю, через четыре года даже вернутся.\u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eНужно ли удерживать таких специалистов в стране, если смотреть со стратегической точки зрения? Как это можно сделать?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– А зачем их удерживать? Вообще звучит немного странно, когда государству нужно кого-то удерживать. Я против этого. Государству неплохо было бы создавать айтишные фонды, инвестировать в них. Потому что если они повышают текучесть денег в стране, то соответственно больше стартапов откроется, значит, больше людей останется. Это, наверное, самый правильный ответ. Есть ряд частных фондов, в которые государство может соинвестировать. Увеличив количество денег в отрасли, они оставят больше топовых людей в стране.\u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eКак сейчас идут дела у команды Looksery?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– Дела идут просто фантастически. Хиллари Клинтон использует наши линзы, чтобы троллить Трампа. Их постоянно показывают на всех вечерних шоу. Ким Кардашьян, Ариана Гранде и многие другие знаменитости используют наши линзы каждый день. Барак Обама на встрече с журналистами тоже их использовал. В Америке это мейнстрим.\u003c/p\u003e\u003cp\u003e– \u003cstrong\u003eТо есть вы популярнее MSQRD?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e– По статистике, AppAnnie Snapchat находится в топ-10 самых популярных приложений в 120 странах. Это хороший показатель. MSQRD в топ-10 сегодня только в одной стране.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news"]}}