{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1403815432,"rating":135,"authorHandle":"Michael","modificationTimeSeconds":1404034949,"id":12859,"title":"\u003cp\u003eFAQ про факультет компьютерных наук в ВШЭ\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПроведя много встреч и личных бесед с абитуриентами, преподавателями, родителями, мы поняли, что часто отвечаем на одни и те же вопросы про новый факультет, и хорошо бы донести эти ответы до всех.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eВажные апдейты\u003c/strong\u003e 1. Принимать окончательное решение о своем выборе можно вплоть до конца июля, так что есть еще месяц на раздумья. 2. Если к нам подадут заявления люди, имеющие право на поступление без экзаменов в количестве большем, чем изначальное количество бюджетных мест, то нам расширят набор, увеличат количество бюджетных мест, и мы возьмем всех этих людей, т.к. мы просто обязаны это сделать.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ1. Чем программа обучения будет отличаться от ВМК?\u003c/strong\u003e \u003c/p\u003e\u003cp\u003eA1. В первую очередь, можете посмотреть саму программу \u003ca href\u003d\"http://cs.hse.ru/ami/about\"\u003eздесь\u003c/a\u003e и почитать о \u003ca href\u003d\"http://cs.hse.ru/ami/faculty\"\u003eпреподавателях\u003c/a\u003e. Программа будет отличаться и организационно, и содержательно. Организационно, не будет стандартных сессий, к которым нужно все заботать за несколько дней, ничего не делая весь предыдущий семестр. Будут постоянные домашние задания с дедлайнами, контрольные, баллы за которые напрямую будут влиять на итоговую оценку, и даже сильнее, чем экзамен — то есть работать придется весь семестр, а благодаря модульной системе сессии будут не такие концентрированные. По всем предметам будут и лекции, и семинары, и домашние задания, чтобы предмет был освоен глубоко и на практике. Содержательно — добавится с 1-го же курса проектная работа под руководством менторов — опытных разработчиков. Мы привлекли к менторству уже по 5 человек из Яндекса и московского Гугла, а также других практиков, например, академии наук. Это 3 семестровых индивидуальных проекта и 3 семестровых командных проекта. Программа по математике будет меньше по объему (например, вместо 3 семестров диффуров и уравнений в частных производных будет 1 семестр, т.к. computer scientist\u0027ам они нужны в меньшем объеме и в более прикладном виде, чем математикам), но она переработана таким образом, чтобы студенты действительно знали те предметы, которые пройдут, и могли решать задачи, применять методы в новых ситуациях (например, программа по теории вероятностей и мат. статистике — больное место многих программ: студенты не владеют статистическим аппаратом, не умеют проверять гипотезы, оценивать параметры распределений и т.п.). Будет математический практикум, где студенты будут решать задачи \u0026quot;по листочкам\u0026quot; и сдавать их преподавателям, как учат во многих хороших мат. школах. Полностью переработана программа по информатике: студент, закончивший обязательную программу первых двух лет, будет в состоянии реализовать полноценный современный программный проект, работающий на нескольких серверах, взаимодействующих по сети, базу данных, имеющий фронтенд, использующий адекватные алгоритмы и структуры данных. Затем он сможет углубиться в одной из многих специализаций: машинное обучение, распределенные системы, теоретическая инофрматика и др. Будут факультативы повышенной сложности по математике и информатике для сильных студентов. Например, Виталик Гольдштейн уже согласился вести годовой факультатив по продвинутым алгоритмам на 1-м курсе.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ2. У вас будет халява!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eA2. Во-первых, см. выше. Дополню, что вместо 2-х длиннющих сессий будет 4 короткие сессии в год. Система баллов: в итоговой оценке по предмету учитываются домашние задания, контрольные, промежуточный экзамен и основной экзамен. Необходимо будет сдать все выбранные курсы и факультативы, нельзя будет переметнуться и сдать халявный курс. Будет специальный человек, который будет общаться со студентами, выяснять их проблемы, помогать их решать, а также пинать их, чтобы они успевали все к дедлайнам, отслеживать прогресс по проектной работе. Ну и наконец, мы ставим себе целью закрыть все возможности для халявы, про которые мы знаем в других программах. А те, кто учился в ШАДе, хорошо знают, как мы умеем жестко соблюдать дедлайны и отчислять тех, кто ничего не делает.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ3. У вас будет бардак!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eA3. Факультет создается не с нуля, а на основе двух существующих отделений. У всего нового руководства большой опыт преподавания, организации мероприятий и успешного управления образовательным процессом. Мы делали ШАД, среди нас преподаватели мехмата, ВМК, руководители в Яндексе, поэтому для большинства это не новое, а привычное дело. В ВШЭ детально прописаны большинство управляющих процедур, есть набор информационных систем поддержки организационных и учебных процессов, которые облегчают многие орг. вопросы. Для некоторых новых процессов, таких как проектная работа, мы будем использовать привычные в IT проектах инструменты (issue tracker). Нам в помощь есть опытная учебная часть, которая переходит от существующих отделений, она составляет расписание, решает орг. вопросы со студентами. У нас есть и будет большая орг. поддержка от Яндекса.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ4. Чем вы отличаетесь от ФИВТа?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eA4. См. для начала отличия от ВМК. Кроме них, есть следующие важные отличия. Во-первых, бОльший упор на самостоятельную работу. В нашей программе меньше курсов идет одновременно, но мы будем вас больше загружать домашними заданиями и проектами, чтобы вы на практике осваивали предметы и инструменты, решали задачи. Во-вторых, мы поборемся с известными нам проблемами ФИВТа. Например, программа изначально продуманная и целостная: все преподаватели не только общаются друг с другом, но и составляют программы курсов с оглядкой на предыдущие и будущие курсы, сразу же прописываются prerequisites курсов и требования к предыдущим курсам, ожидаемые знания и навыки студентов к моменту окончания курса, с обоснованиями того, почему именно этому мы хотим научить. Другой пример — глубина знания предметов, особенно математики. Многие преподаватели самого ФИВТа жалуются на поверхностные знания студентов по математическим предметам. Мы действуем по принципу меньше, но лучше. Все будут решать много задач, причем не только типовых бессмысленных задач, как это часто происходит, но и задач, которые отходят в сторону, требуют использования нетривиальных идей, применения теорем и методов в нетривиальных ситуациях.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ5. Что с гуманитарными курсами?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eA5. Во-первых, вас будут хорошо учить английскому языку, причем именно тому, который затем понадобится вам в работе и/или занятиях наукой. Будут не только учить, но и проверять: на 3-м и 4-м курсах нужно будет обязательно взять по крайней мере один предмет, который будет читаться полностью на английском языке, а также предзащита бакалаврской диссертации будет проходить на английском языке (защищаться можно на русском). Знание технического английского позволяет читать статьи и документацию, что совершенно необходимо для любой интересной работы computer scientist\u0027а, а также вам пригодится умение общаться с коллегами и представлять свои результаты на английском (при работе в международных компаниях, при выступлениях на международных конференциях). В остальном, гуманитарных курсов немного, всего 4 за 4 года — история, экономика, философия и психология. Причем в ВШЭ хороши соответствующие факультеты, эти курсы будут читаться интересно, и мы выберем для вас действительно интересные программы из возможных по этим направлениям. Физкультура...она есть, но по факту все происходит по желанию.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ6. Да у вас энтузиазм пройдет, и вы бросите дело посередине\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eA6. Мы ждали этой возможности кто несколько лет, кто все десять или больше. Мы уже сделали ШАД, и занимаемся им уже 7 лет, и продолжаем его развивать. Наш декан ради этого проекта уволился с мехмата МГУ. Мы понимаем, что это наш шанс сделать что-то огромное и очень важное, такой шанс, который выпадает раз в жизни.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ7. Вы притащите интересных людей из Яндекса, которые красиво говорят, но никогда не преподавали\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eA7. Посмотрите на \u003ca href\u003d\"http://cs.hse.ru/ami/faculty\"\u003eстраницу преподавателей\u003c/a\u003e. Почти все имеют опыт преподавания более 5 лет. Большинство \u0026quot;проверены\u0026quot; придирчивыми и голосующими ногами студентами ШАД. Есть преподаватели, которые вели занятия на мехмате, ВМК, ФИВТе, в том числе и на младших курсах.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ8. Будет ли какое-то взаимодействие с иностранными ВУЗами?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eA8. Давно существуют совместные программы с некоторыми европейскими ВУЗами: магистры ВШЭ могут часть времени обучения, порядка года, отучиться в одном из этих ВУЗов, а остальное время — в ВШЭ. Академическим аспирантам будут оплачиваться стажировки в научных группах, с которыми есть связи у групп на ФКН, а среди них есть группы в MIT, Ecole Normal Superior, Zurich ETH, Microsoft Research Cambridge и другие. Кроме того, мы давно взаимодействуем с \u003ca href\u003d\"http://www.epfl.ch/\"\u003eEPFL\u003c/a\u003e и рассчитываем привозить оттуда лекторов по определенным темам, которые не так хорошо представлены в России.\u003c/p\u003e\u003c/div\u003e","tags":["факультеты","поступление","образование"]}}