{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1464097796,"rating":168,"authorHandle":"gKseni","modificationTimeSeconds":1464098860,"id":45033,"title":"\u003cp\u003eАндрей Лопатин — о российских программистах, выигравших чемпионат мира\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЖурнал \u003ca href\u003d\"http://secretmag.ru/longread/2016/05/23/lopatin/?utm_source\u003dsffb\u0026amp;utm_medium\u003dsocial\u0026amp;utm_campaign\u003dkomanda-studentov-spbgu-vyigrala-chempion\"\u003e«Секрет Фирмы» поговорил\u003c/a\u003e с тренером Андреем Лопатиным, который год готовил студентов к олимпиаде.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/1e/d0/1ed04b4f438bac4032523226f769419a8195b25d.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eТренер команды СПбГУ по программированию объясняет, почему русские кодеры сильнее китайских\u003c/small\u003e \u003c/center\u003e\u003cp\u003e\u003cstrong\u003e— Что всё-таки сильнее — СПбГУ или ИТМО?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Это вечный вопрос. Зависит от того, у кого спрашивать. СПбГУ четыре раза выигрывал, ИТМО — шесть.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Расскажите немного о себе. Читала, что вы закончили легендарный лицей №239 в Санкт-Петербурге, где учились многие известные люди от Григория Перельмана до Бориса Гребенщикова и познакомились там с Николаем Дуровым (сооснователь «ВКонтакте» и Telegram. — Прим. «Секрета»).\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Да, было дело. Лицей №239 — один из лучших в Санкт-Петербурге. Там много известных людей училось, в одно время с нами, например, Инна Друзь. Но я его не закончил, с 8-го по 10-й класс там учился, а закончил 11-й класс в языковой школе №238. С нашим набором проводили эксперимент: мы учили английский, французский, латынь, древнегреческий и другие языки, проходили философию, востоковедение, античную культуру.\u003c/p\u003e\u003cp\u003eМои родители — преподаватели. Мать преподавала математику в школе, а отец — военный преподаватель, он командовал ротой в АСО (аварийно-спасательный отряд).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Когда вы увлеклись программированием?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Началось с того, что мне в руки попала книжка про язык Basic, я её прочитал, но никакого практического применения найти не смог. С компьютерами я познакомился в начале 90-х, нам привезли их в языковую школу, и я попытался по памяти воспроизвести какие-то программы из книги. С удивлением узнал, что в Basic есть множество разных диалектов и то, что я знаю про язык из этой книжки, плохо работает на компьютерах. Я начал изучать разные языки программирования, а в алгоритмы серьёзно погрузился в девятом классе.\u003c/p\u003e\u003cp\u003eВ восьмом классе я писал какие-то программы, в основном на Assembler — сейчас это звучит довольно дико, это самый низкоуровневый машинный язык, но тогда вариантов особо не было. Например, писал компилятор языка Forth — программу, которая записывала звук с магнитофона. \u003cstrong\u003e— Вы хотели заниматься научной работой, связанной с программированием и математикой?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Ещё в школе я был участником сборной России по информатике и ездил на международные олимпиады для школьников. Потом поступил в СПбГУ, там нам много рассказывали про алгоритмы, я уже серьёзно ими занимался.\u003c/p\u003e\u003cp\u003eВ науке я успел поработать, но не очень долго, после университета я больше занимался практическими вещами. Например, тренерством команды по программированию, работал над «ВКонтакте» и Telegram, занимался проектом в сфере транспортной логистики Veeroute. Во «ВКонтакте» я работал с 2008 года, когда перестала справляться стандартная архитектура, пришлось сделать свою, мы вместе с Николаем её создавали.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— В каких олимпиадах вы выигрывали?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Студенческий финал чемпионата мира 2000 и 2001 года, мы в компании с Николаем Дуровым, в 2009 году я выиграл марафон Topcoder. Тогда это были очень важные мероприятия, а сейчас как-то уменьшили влияние.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— У них же там и Facebook, IBM и другие компании в партнёрах.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Facebook сейчас проводит свои соревнования. Возможно, они немного их поддерживают, я не вдаюсь в тонкости взаимоотношений Topcoder и Facebook, ну работает — и хорошо. Ребята участвуют активно в Topcoder, я тоже иногда вспоминаю былое, мне полезно участвовать, просто не всегда хватает времени. Цифры говорят за себя: раньше они приглашали 72 человека только по алгоритмам на финал, а сейчас всего 8-12. Может, конкуренции не выдержали.\u003c/p\u003e\u003cp\u003eУ нас в России есть сильный проект Code Forces, который, на мой взгляд, стал популярнее в мире, чем Topcoder, его делает Миша Мирзаянов из Саратовского университета. Это хороший кейс — как человек из алгоритмического программирования создал ведущий мировой проект в своей сфере. Там в каждом раунде участвует тысяч пять программистов.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Вы готовите студентов в первую очередь к международной студенческой олимпиаде? Это самая важная олимпиада в мире?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Да, в первую очередь это чемпионат мира ACM ICPC. За последние 16 лет команды из Питера девять раз занимали первое место — либо мы, либо ИТМО. Этот чемпионат считается самым престижным. Там соревнуются университеты со всего мира, по три человека в команде. Допускаются аспиранты, потому что по-английски это называется Ph.D. Но есть ограничения по возрасту и количеству попыток: в полуфинальных и четвертьфинальных соревнованиях можно не больше пяти раз участвовать, в финальных — не более двух.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Видела, что Саратовский университет тоже побеждал.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Да, Саратовский университет выигрывал как раз с тренером Мишей Мирзаяновым.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— А до 2000 года очень много американских университетов, тогда в России никого не было?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Раньше это было такое локальное мероприятие, а потом пришёл IBM со спонсорством, они развернули очень активную кампанию по привлечению людей. Российские команды начали участвовать с 1995 года.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Какие у нас основные конкуренты? Китайцы?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Зависит от года, но обычно поляки, китайцы, студенты MIT. У поляков очень сильная школа в Варшаве. Они несколько раз выигрывали, и в этом году в фаворитах (интервью проходило до чемпионата, команда Варшавского университета заняла пятое место. — Прим. «Секрета»).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— У программистов есть денежная мотивация для участия в олимпиадах или это скорее желание решить какую-то задачу и доказать себе, что смог это сделать?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Денежная мотивация тоже присутствует. Плюс участие в олимпиаде помогает строить карьеру. Сразу начинают сыпаться приглашения от разных фирм.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Но есть теоретические программисты, а есть те, кто решает прикладные задачи?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— В командах встречаются люди, которые занимаются теоретической математикой и тем, что называется computer science, но часто и в компаниях нужны такие математики. В бизнесе тоже приходится и интегральчик посчитать или что-нибудь такое, задачи по оптимизации иначе не решаются. Теория важна, но люди чаще хотят решать практические задачи.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Как повлиял технологический бум на профессию программиста? Сейчас спрос вырос?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Эта профессия всегда была престижной, были уже всякие бумы доткомов и прочее. Уже в конце 90-х за программирование в России получали очень хорошие деньги в долларах. Некоторые уезжали на Запад — например, мой школьный тренер уехал по приглашению Microsoft в США ещё в 1997 году. Когда я был в старших классах, многие думали о карьере программиста, чтобы иметь хороший заработок, но мне просто было интересно. Сейчас компьютер и мобильная техника прочно вошли в нашу жизнь, программисты нужны везде, и сейчас, как и тогда, люди получают хорошие зарплаты.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Сейчас больше людей уезжает?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Мне кажется, примерно столько же. Одно время, по ощущениям, меньше уезжало — это период с 2004 по 2012 год. Помню, как в 2005-м Google проводил мероприятие и сразу приглашал финалистов олимпиад [на работу], и мы считали с ребятами, сколько от зарплаты останется после вычета налогов, затрат на жизнь. Выходило, что особого смысла ехать ради денег нет. Сейчас из-за курса доллара уезжать стали, наверное, чаще.\u003c/p\u003e\u003cp\u003eЯ бы сказал, что уезжают 30-50% [олимпиадников]. Некоторые хотят заниматься наукой, они уезжают в американские, канадские, немецкие университеты, некоторые потом возвращаются.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Как часто проходят тренировки?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Командные — три раза в неделю по пять часов, плюс сборы несколько раз в год. Есть ещё всякие соревнования — уже упомянутые TopCoder, Codeforces, конкурсы Facebook, Google, «ВКонтакте», «Яндекса», — всего и не упомнишь. Ребята в них участвуют, чтобы не терять форму. Это уже спортивное мероприятие, где нужно не только, чтобы голова работала. Вот есть шахматы: кто-то говорит, что это помогает планировать, просчитывать ходы людей — я сам занимался шахматами, мне кажется, что мне это помогло участвовать в других соревнованиях, потому что у меня уже был опыт соревнования. Хотя программирование — гораздо более приближённый к реальности интеллектуальный вид спорта.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Где обычно проходят сборы?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Иногда собираемся в Петрозаводске, в начале апреля ездили на сборы в МФТИ, наша команда выиграла, хотя там были и участники из Шанхая. Не было, к сожалению, команды из Варшавы, которая нас обыграла на предыдущих сборах в Петрозаводске. Было бы интересно снова встретиться и посмотреть, как мы прокачались. В 2007 году у них была очень сильная команда. Она обыгрывала всех на голову и выиграла чемпионат мира. В 2008 году эта команда прыгнула на недосягаемую высоту по результатам всех сборов, тренировок, даже не было мысли, что кто-то другой может выиграть. И вот в прошлом году у этой команды с одной задачей не заладилось в финале и они не получили ни одной медалей, хотя медали даются 12 лучшим командам — четыре золота, четыре серебра и четыре бронзы.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Драйв и адреналин как в большом спорте?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Нагрузка очень высокая, участников вырубает на долгое время, хотя, когда я стал тренером, я понял: быть участником — это ещё не самое страшное. Участник хотя бы может что-то сделать, а тренера просто изолируют и он ничего не может, когда хочет подсказать. Это очень нервно.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Потом эти люди, как правило, устраиваются в крупные компании?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Часто. Помню, когда команда в 2010 году взяла серебряную медаль, их устроили работать во «ВКонтакте». Мне кажется, это было для них полезно, потому что они узнали, что такое ответственность, когда работаешь на большую компанию и большую задачу. Это помогло им в финале чувствовать себя более уверенными, они получили золотую медаль и стали чемпионами Европы в 2011 году. Сейчас люди из той команды работают во «ВКонтакте» и Telegram.\u003c/p\u003e\u003cp\u003eБольшие компании постоянно предлагают работу и ребятам, и мне. Не так давно мне пришло письмо от Google примерно в такой форме: скажите, пожалуйста, в каком офисе бы вы хотели работать? В Лондоне или в Цюрихе? Я как-то участвовал в году 2003 в Олимпиаде, которую Samsung спонсировал, они до сих пор периодически присылают письма: может быть, вы всё-таки хотите?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Вы вообще такие варианты не рассматриваете?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Совершенно непонятно, зачем мне это. Как правило, в крупных компаниях гораздо меньше возможности что-то пробовать.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Есть ощущение, что программисты — это такое закрытое сообщество людей, которым комфортно друг с другом и не всегда с окружающим миром. Есть такое?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Программисты могут быть замкнутыми в силу того, что у них немного специфичный способ мышления, поэтому про них придумывают всякие анекдоты вроде «намылить, смыть, повторить» и так далее. Но есть, наоборот, открытые ребята. Кстати, говорят, что ребята из команды, с которой я ездил в 2008–2009 годах, регулярно играли в тарелку, в мяч и звали играть с ними команды со всего мира и так задавали тренд. В российских компьютерных школах, как мне кажется, большое внимание уделяются тому, чтобы человек вырос хороший. Такая среда, которая может быть сложилась ещё с советских времён, — песни под гитару, самодеятельность, всё такое. Общественная деятельность какая-то ведётся, например спектакль можно поставить.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— А вы замечаете, что происходит омоложение профессии? 20-летние программисты выигрывают конкурсы и устраиваются в крупные компании.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Талантливая молодёжь всегда есть, периодически появляются люди, которые в раннем возврате показывают очень хорошие результаты. Например, когда я учился в 11-м классе, семиклассник Петя Митричев из 57-й школы чуть было не помешал мне пройти на международную олимпиаду школьников. После Пети Митричева был Гена Короткевич, которому в пятом классе не хватило несколько баллов до золотой медали на той же международной олимпиаде.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Но всё-таки есть какая-то ценность в тех, кто писал код 30 лет назад? Или им пора на покой?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Опыт помогает какие-то спецэффекты исправлять быстрее, он играет роль, но дело в том, что языки, на которых пишут программисты, меняются очень быстро. Знание современных технологий и умение адаптироваться играет большую роль.\u003c/p\u003e\u003cp\u003eЕсли скорость развития технологий будет всё время расти, то да, возможно, старожилам придётся уходить на покой. Я постараюсь адаптироваться. Сейчас модно говорить про технологическую сингулярность, возможно, если скорость будет расти экспоненциально, взрослым программистам будет сложно успевать за молодыми.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Чем компания может привлечь программиста кроме решения интересных задач и зарплаты?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Мне кажется, компаниям стоит быть более открытыми и участвовать в конкурсах и олимпиадах. Нужно, чтобы люди из компаний постоянно встречались и общались с программистами. Ведь что такое олимпиада? Это один из путей становления программистов. Олимпиады многие критикуют, будто они оторваны от реальности. Это не так, задачи, которые решаются на соревнованиях, — часть каких-то больших задач.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e— Вы замечаете среди программистов людей с предпринимательским мышлением, людей, которые хотят открыть своё дело?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e— Среди моего окружения такого мало, хотя тема интересная. Не знаю, почему-то об этом не принято задумываться. Может быть, нужно подумать о том, как переломить эту тенденцию.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news"]}}