{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1493113791,"rating":112,"authorHandle":"zloyplace35","modificationTimeSeconds":1493199409,"id":51706,"title":"\u003cp\u003eКаким должен быть идеальный раунд?\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch5\u003eВсем привет!\u003c/h5\u003e\u003cp\u003eПоследнее время все больше недовольства у участников раундов по поводу их организации или задач. Встречаются проблемы с условиями, слабыми претестами, неправильным распределением сложностей и т.п.\u003c/p\u003e\u003cp\u003eЯ предлагаю здесь обсудить, каким должен быть идеальный раунд с точки зрения как авторов, так и участников.\u003c/p\u003e\u003cp\u003eСам я участвовал в разработке задач как для кфа, и не только. Поэтому в посте приведу немного своих мыслей, возникающих по ходу подготовки контеста. Само собой, этот список нуждается в дополнении, поэтому я бы очень хотел увидеть ваши идеи в комментариях.\u003c/p\u003e\u003ch4\u003e\u003cdiv style\u003d\"text-align: right;\"\u003e\u003cspan style\u003d\"text-decoration: underline;\"\u003eУсловие\u003c/span\u003e\u003c/div\u003e\u003c/h4\u003e\u003cp\u003eПрежде всего условие должно \u003cstrong\u003eясно\u003c/strong\u003e объяснить участнику, в чем, собственно, суть задачи. Отсюда появляются следующие соображения:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003eУсловие должно быть коротким\u003c/strong\u003e\u003cbr /\u003e Нужно стараться умещать мысль как можно емко и грамотно. Задача участника — написать правильный код и сдать его, а не читать полторы страницы воды. К этому же пункту можно отнести и легенду. Да, действительно, куда приятней решать задачу про персонажей. Однако история в данном случае — лишь украшение, и не должна преобладать над сутью.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003eУсловие должно быть понятным\u003c/strong\u003e\u003cbr /\u003e Все введенные термины и примеры должны быть объяснены в разделе \u003cem\u003eПримечания\u003c/em\u003e. Не нужно загромождать определением само условие и разъяснять общеизвестные понятия, но, если у участника появился вопрос насчет толкования какого-то примера или термина, ответ на него он должен найти после семплов.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003eУсловие должно быть однозначным\u003c/strong\u003e\u003cbr /\u003e В идеале, уже после первого беглого прочтения задачи, должно быть понятно, что требуется, какие есть нюансы и тонкости. В случае, если какая-то фраза является ключевой, ее нужно выделать изменением шрифта или начертания. \u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003eУсловие должно быть структурированным\u003c/strong\u003e\u003cbr /\u003e Под структурой я имею ввиду четкое разделение на части \u003cem\u003eСобственно условие\u003c/em\u003e, \u003cem\u003eФормат входных данных\u003c/em\u003e, \u003cem\u003eФормат выходных данных\u003c/em\u003e, \u003cem\u003eПримеры\u003c/em\u003e, \u003cem\u003eПримечания\u003c/em\u003e. На codeforces с этим проблем не бывает. Однако очень часто на локальных олимпиадах я встречал ограничения для переменных прям в самом условии, что дико напрягало.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003ch4\u003e\u003cdiv style\u003d\"text-align: right;\"\u003e\u003cspan style\u003d\"text-decoration: underline;\"\u003eОграничения\u003c/span\u003e\u003c/div\u003e\u003c/h4\u003e\u003cp\u003eПравильно подобраные ограничения сильно помогают решить задачу. Поэтому из них должна быть понятна требуемая от участников асимптотика. За эти годы сложились традиционные константы, и я не вижу причин не использовать их без особого повода: \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003eO(\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e\u003c/span\u003e)\u003c/strong\u003e — \u003cspan class\u003d\"tex-span\"\u003e10\u003csup class\u003d\"upper-index\"\u003e7\u003c/sup\u003e\u003c/span\u003e\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eO(\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e\u003csup class\u003d\"upper-index\"\u003e2\u003c/sup\u003e\u003c/span\u003e)\u003c/strong\u003e — \u003cspan class\u003d\"tex-span\"\u003e5000\u003c/span\u003e\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eO(\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e\u003csup class\u003d\"upper-index\"\u003e3\u003c/sup\u003e\u003c/span\u003e)\u003c/strong\u003e — \u003cspan class\u003d\"tex-span\"\u003e500\u003c/span\u003e\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eO(\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003enlogn\u003c/i\u003e\u003c/span\u003e)\u003c/strong\u003e- \u003cspan class\u003d\"tex-span\"\u003e2·10\u003csup class\u003d\"upper-index\"\u003e5\u003c/sup\u003e\u003c/span\u003e\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003e\u003cspan class\u003d\"tex-span\"\u003e2\u003csup class\u003d\"upper-index\"\u003e\u003ci\u003en\u003c/i\u003e\u003c/sup\u003e\u003c/span\u003e\u003c/strong\u003e — \u003cspan class\u003d\"tex-span\"\u003e23\u003c/span\u003e\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003emod\u003c/strong\u003e — \u003cspan class\u003d\"tex-span\"\u003e10\u003csup class\u003d\"upper-index\"\u003e9\u003c/sup\u003e + 7\u003c/span\u003e\u003c/li\u003e   \u003cli\u003eи т. д.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e \u003cem\u003eКак правильно указали в комментариях, несовсем корректно стандартизировать для всех задач константы размеров входа из-за различия в \u0026quot;весе\u0026quot; операций. Видимо, главный принцип здесь — участники не должны гадать, зайдет ли решение той или иной сложности, требуемая асимптотика должна быть более-менее очевидной.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eОтдельно стоит упомянуть объем вводимых данных. Он должен быть доступным для считывания через потоки \u003cem\u003ecin/cout\u003c/em\u003e. \u003c/p\u003e\u003ch4\u003e\u003cdiv style\u003d\"text-align: right;\"\u003e\u003cspan style\u003d\"text-decoration: underline;\"\u003eСемплы\u003c/span\u003e\u003c/div\u003e\u003c/h4\u003e\u003cp\u003eИх должно быть не меньше двух. К каждому нужно объяснение в разделе \u0026quot;Примечания\u0026quot;.\u003c/p\u003e\u003cp\u003eКаждый семпл должен быть максимально информативным. Графы на одной-двух вершинах вряд ли помогут лучше понять условие и протестировать свои идеи.\u003c/p\u003e\u003cp\u003eЕсли по условию задачи ответ предполагает вывод строковых констант (\u0026quot;YES\u0026quot;, \u0026quot;NO\u0026quot;, и т.п) или варианта с невозможностью ответа (-1, или что-то подобное), необходимо предоставлять по одному на каждый из вариантов.\u003c/p\u003e\u003cp\u003eЗдорово, когда в этих тестах есть простейшие вырожденные случаи (прямоугольники нулевой площади, отрицательные целые, несколько компонент связности).\u003c/p\u003e\u003cp\u003eЕсли при прочтении условия приходит в голову какое-то неправильное жадное решение, хорошо бы иметь семпл, который его ломает. Так неопытные участники не побегут писать код и сэкономят нервы. Но тут, конечно, уже на усмотрение авторов.\u003c/p\u003e\u003cp\u003eЛично мне еще нравится практика, когда есть семпл с относительно большим входом и ответом, который случайно не получишь. \u003c/p\u003e\u003ch4\u003e\u003cdiv style\u003d\"text-align: right;\"\u003e\u003cspan style\u003d\"text-decoration: underline;\"\u003eПретесты и взломы\u003c/span\u003e\u003c/div\u003e\u003c/h4\u003e\u003cp\u003eПожалуй, по созданию впечатления от всего контеста, стоят на втором месте, после идей задач. Мы с моими знакомыми много раз обсуждали эту тему, и пришли к выводу, что взломы не должны иметь решающее значение в таблице результатов, а должны быть скорее \u0026quot;спасательным кругом\u0026quot; для тех, что получил много штрафа. \u003c/p\u003e\u003cp\u003eПри этом, на сложных задачах они должны быть достаточно сильными(согласитесь, не очень приятно, когда полконтеста пишешь геому и получаешь WA в финальном тестировании на каком-то одном неочевидном вырожденном случае), а на слабых достаточно короткими, чтобы не создавать большую очередь в самом начале раунда. В моем понимании, решение, прошедшее претесты должно иметь как минимум правильную асимптотику и корректную работу на крайних значениях.\u003c/p\u003e\u003cp\u003eВ целом, получается, что очень трудно подобрать правильный баланс претестов, и легче уж вообще делать их максимально полными(что, впрочем, является самым безопасным выходом). \u003c/p\u003e\u003ch4\u003e\u003cdiv style\u003d\"text-align: right;\"\u003e\u003cspan style\u003d\"text-decoration: underline;\"\u003eСложность задач\u003c/span\u003e\u003c/div\u003e\u003c/h4\u003e\u003cp\u003eТут все вроде как просто. Во-первых, если в анонсе раунда написано, что задачи расположены по увеличению сложности, то они \u003cem\u003eдействительно\u003c/em\u003e должны быть расположены по увеличению сложности. Чтобы не ошибиться с распределением, достаточно прогнать раунд на тестовой выборке участников из разных уровней.\u003c/p\u003e\u003cp\u003eВ идеале, количество участников, решивших задачу должно быть пропорционально объявленной до начала разбалловке.\u003c/p\u003e\u003cp\u003eТак же не стоит \u003cem\u003eпереграбливать\u003c/em\u003e контест. В моем понимании, \u0026quot;зеленые\u0026quot; должны спокойно решать A, B из div2, \u0026quot;синие\u0026quot; — A, B, C div2, \u0026quot;фиолетовые\u0026quot; — A, B div1, \u0026quot;желтые\u0026quot; — A, B, C div1, \u0026quot;красные\u0026quot; — A, B, C, D div1. В общем и целом, должна быть примерная корреляция между рейтингом среднестатистического участника и количеством решенных им задач.\u003c/p\u003e\u003ch4\u003e\u003cdiv style\u003d\"text-align: right;\"\u003e\u003cspan style\u003d\"text-decoration: underline;\"\u003eЗадача С\u003c/span\u003e\u003c/div\u003e\u003c/h4\u003e\u003cp\u003eЗадача Сdiv2/Adiv1 — ключевая задача раунда. По ней строится впечатление основной массы участников. Почему? На это есть несколько причин. \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003eВо-первых\u003c/strong\u003e, эта задача отделяет \u0026quot;слабых\u0026quot; участников от \u0026quot;средних\u0026quot; во втором дивизионе. Если эта задача слишком сложная, увеличивается разрыв между уровнем решивших и не решивших, что не круто.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003eВо-вторых\u003c/strong\u003e, она определяет количество участников, пишущих 1 дивизион. Это первая задача, и, если она сложная, то бОльшая часть участников не решит ее в первые полчаса (ну и понятно, что в рейтинговых раундах, если участник ничего не решил в первые 30-40 минут, ему нет смысла что-то посылать вообще). Другими словами, недостаточно сильные участники первого дивизиона не имеют возможности написать раунд и получить плюс вообще.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eТаким образом, Cdiv2/Adiv1 — это своеобразное `лицо\u0027 контеста и наибольшее внимание при подготовке нужно уделять ей.\u003c/p\u003e\u003ch4\u003e\u003cdiv style\u003d\"text-align: right;\"\u003e\u003cspan style\u003d\"text-decoration: underline;\"\u003eТематика задач\u003c/span\u003e\u003c/div\u003e\u003c/h4\u003e\u003cp\u003eЗадачи должны быть на \u003cem\u003eпрограммирование\u003c/em\u003e. Да, математика очень тесно связана с программированием, однако не стоит уходить в крайность и давать задачу на вывод формулы. В качестве антипримера могу привести \u003ca href\u003d\"//codeforces.com/contest/707/problem/C\"\u003eсвою задачу\u003c/a\u003e, которую, хоть и можно было решить алгоритмом, многие участники сдавали именно формулой.\u003c/p\u003e\u003cp\u003eОтдельной дискуссии заслуживает геометрия. Уж не знаю почему, но задачи на нее чаще всего встречают очень холодно. Интересно было бы узнать ваше мнение о том, стоит ли давать ее на раундах и почему же ее никто не любит.\u003c/p\u003e\u003cp\u003eТакже, нужно понимать, что тема должна соответствовать уровню участников, на которых направлена конкретная задача, и не давать, к примеру, графы в Adiv2 или ретроанализ в Cdiv2/Adiv1.\u003c/p\u003e\u003ch4\u003e\u003cdiv style\u003d\"text-align: right;\"\u003e\u003cspan style\u003d\"text-decoration: underline;\"\u003eРазбор\u003c/span\u003e\u003c/div\u003e\u003c/h4\u003e\u003cp\u003eДумаю, не нужно говорить о необходимости хорошего разбора:D\u003c/p\u003e\u003cp\u003eОн должен \u003cstrong\u003eпростыми словами\u003c/strong\u003e на понятном даже \u003cstrong\u003eне продвинутым в математике\u003c/strong\u003e людям языке объяснять решения задач. К каждой задаче должен быть приложен пример кода с комментариями. \u003c/p\u003e\u003cp\u003eЕще, приятно, когда разбор появляется сразу после раунда, а не через несколько дней.\u003c/p\u003e\u003cp\u003eЖелательно читать комментарии к разбору, отвечать, если кому-то непонятен разбор (часто объяснение другими словами хорошо помогает разобраться).\u003c/p\u003e\u003cp\u003eПример хорошего разбора \u003ca href\u003d\"//codeforces.com/blog/entry/50996\"\u003eна русском\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/blog/entry/48871\"\u003eна английском\u003c/a\u003e.\u003c/p\u003e\u003ch4\u003e\u003cdiv style\u003d\"text-align: center;\"\u003e\u003cspan style\u003d\"\"\u003e--МЕСТО ДЛЯ ВАШИХ ПРЕДЛОЖЕНИЙ--\u003c/span\u003e\u003c/div\u003e\u003c/h4\u003e\u003cp\u003eНу, из основого, что сейчас у меня на уме, вроде все.\u003c/p\u003e\u003cp\u003eЕще раз повторяю, что паста выше — это мое \u003cstrong\u003eсубъективное\u003c/strong\u003e видение. Оно может (и должно!) отличаться от вашего. Я создаю этот пост для того, чтобы в одном месте собрать какие-то соображения для будущих авторов(в том числе и для себя:)).\u003c/p\u003e\u003c/div\u003e","tags":["раунд","идеи","контест"]}}