{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1419878677,"rating":46,"authorHandle":"enot110","modificationTimeSeconds":1419879767,"id":15466,"title":"\u003cp\u003eИщу шустрый текстовый редактор, чтобы писать контесты из линукса\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет! Я всю жизнь использовал windows и far manager для написания кода. Он очень шустрый, позволяет сразу делать много вещей, быстро смотреть/изменять input/output файлы, чекать консоль и многое-многое другое. Но, недавно созрела мысль \u0026quot;хочу полностью перейти на линукс\u0026quot;, и то, что меня в этом больше всего останавливает -- я не знаю как в нем писать контесты так же удобно, как в винде. Полных аналогов фара под линуксом нету. (если есть, то можете мне о них рассказать, если это не Midnight Commander)\u003c/p\u003e\u003cp\u003eПоэтому, ищу текстовый редактор, который будет подходить под максимальное число требований:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eмаксимально-шустрый (я к этому очень чувствителен, если будет задержка в лишние 0,1 сек между переключениями вкладок, я ее замечу)\u003c/li\u003e   \u003cli\u003eвозможность рассплитить экран на несколько частей (хочу слева писать код, справа-сверху входной файл, справа-снизу выходной)\u003c/li\u003e   \u003cli\u003eкурсор может свободно находиться за пределами конца строки (в far-е это называется cursor beyond end of line)\u003c/li\u003e   \u003cli\u003eс интуитивно-понятным и удобным-стандартным интерфейсом (vim не предлагать)\u003c/li\u003e   \u003cli\u003eконечно же, должна быть подсветка синтаксиса\u003c/li\u003e   \u003cli\u003eжелательно, хотя бы базовое автодополнение, но это не обязательно\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eПожелания:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eесли легко будут настраиваться макросы (нажал F7, у тебя все скомпилировалось), это будет плюсом\u003c/li\u003e   \u003cli\u003eлегко настраиваемый -- например, можно легко поменять colorscheme или шрифт, если не нравится\u003c/li\u003e   \u003cli\u003eможно сделать курсор \u0026quot;горизонтальным\u0026quot;\u003c/li\u003e   \u003cli\u003eподсветка столбца, в котором находится курсор (в фаре эта опция называется cross, чтобы ее включить нужно прожмякать f9-o-u-c и поставить галочку)\u003c/li\u003e   \u003cli\u003eможно включить автоматический перевод всех tab-ов в пробелы, но это не обязательно\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eЧто используют линуксойды, чтобы писать контесты? В первую очередь, хочется услышать мнения тех, кто использовал far для контестов и знают, насколько он удобен.\u003c/p\u003e\u003cp\u003eP. S. Требования \u0026quot;нужно то, что можно юзать на финале\u0026quot; нету.\u003c/p\u003e\u003c/div\u003e","tags":["#farmanager","#coolest_ide_ever","#linux"]}}