{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1485490533,"rating":58,"authorHandle":"zorro_","modificationTimeSeconds":1485490533,"id":50040,"title":"\u003cp\u003eCodeAgon 2017 Interesting Submissions\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eWhile scrolling down through the leader board of CodeAgon 2017, I found these top 10 performers to be extraordinary.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eSubmission time of 4th and 6th problem \u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/bd/0d/bd0d08b4c790ba92d5d8dc4fc6e9795609c7d3ba.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eSubmission time of 5th and 6th problem\u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/af/e5/afe59a80c7c432ebeab9dbfbe89114a1d486ab96.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eSubmission time of 4th and 5th problem \u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/37/d6/37d65af3bc6023b0b4abccc34d76c4782e0577e5.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eThere is a possibility that they might have written the code but couldn\u0027t submit because of poor internet connection and later submitted both codes together or they had solved the exact same problem before and had prewritten code.\u003c/p\u003e\u003cp\u003eThe first scenario is very rare and 3 performers from top 10 on the leaderboard will suffer the same in the same contest is just indigestible and even if someone had solved the exact same problem before, it would take some time to read and recognise that they have solved it already and it will take few more seconds to search their old codes. But I think codeAgon problems were unique, or even if it wasn\u0027t then the author will make at least the problem statement or input-output formats different which makes it difficult to solve within few seconds.\u003c/p\u003e\u003cp\u003eBut still, I can\u0027t say that they solved it in groups and are cheaters because there might be some other possibilities which I am not able to think.So I request them (I guess you have recognised yourself) to please explain how they did it. :) \u003cbr /\u003e \u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}