{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1464361229,"rating":50,"authorHandle":"gustokashin","modificationTimeSeconds":1464438635,"id":45082,"title":"\u003cp\u003eЛетний Machine Learning для школьников\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eС 14 по 28 августа 2016 года факультет компьютерных наук ВШЭ совместно с центром дополнительного образования “Стратегия” проводит летнюю школу по компьютерным наукам, на которой школьники 8-10 классов смогут освоить алгоритмы для решения олимпиадных задач (здесь преподавать будут \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/GlebsHP\" title\u003d\"Grandmaster GlebsHP\"\u003eGlebsHP\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/pshevchuk\" title\u003d\"Candidate Master pshevchuk\"\u003epshevchuk\u003c/a\u003e, я и Инесса Шуйкова), а также научатся применять машинное обучение.\u003c/p\u003e\u003cp\u003eМашинное обучение — область компьютерных наук, которая изучает методы поиска скрытых зависимостей в массивах данных. Эти методы всё активнее используются как в различных областях науки (в физике, экономике, журналистике, социальных науках и т.д.), так и во многих индустриальных областях. Обнаружение спама, распознавание людей на фотографии, персонализованные рекомендации музыки в социальных сетях или товаров в онлайн-магазинах, определение лучшего хода в игре Го, предсказание эффекта от лекарства с определённой химической формулой — это лишь немногие примеры важных и интересных задач, которые невозможно решить с помощью классических алгоритмов. Тем не менее, все эти задачи могут быть решены с помощью стандартных методов машинного обучения. Потребность в специалистах по машинному обучению растёт с каждым годом, они высоко ценятся и имеют одни из самых высоких зарплат в IT-сфере. Более того, сейчас активно набирают популярность соревнования по машинному обучению (\u003ca href\u003d\"https://www.kaggle.com/\"\u003ekaggle.com\u003c/a\u003e, \u003ca href\u003d\"https://www.drivendata.org/\"\u003edrivendata.org\u003c/a\u003e), которые во многом схожи с олимпиадами по программированию. Они позволяют получать очень ценный опыт в этой области, а размеры призов на них достигают миллионов рублей.\u003c/p\u003e\u003cp\u003eВ курсе параллели ML мы расскажем участникам о базовых алгоритмах машинного обучения, научим основным инструментам, решим много прикладных задач и потренируемся участвовать в соревнованиях по машинному обучению. Преподаватели параллели — Евгений Соколов, Михаил Хальман и Тимур Гарипов (\u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/timgaripov\" title\u003d\"Expert timgaripov\"\u003etimgaripov\u003c/a\u003e) — имеют большой практический опыт применения методов машинного обучения, а также принимают участие в научных исследованиях по этой тематике. Евгений ведёт курсы по машинному обучению на ФКН ВШЭ и ВМК МГУ и является автором нескольких курсов на Coursera. Возможно, вы уже слушали его выступление на Всероссийской олимпиаде по информатике, где речь шла о предсказании оценок студентов по их результатам на олимпиадах с помощью методов машинного обучения.\u003c/p\u003e\u003cp\u003eЧтобы поступить в летнюю школу, необходимо заполнить анкету и решить задачи отборочного этапа. Сегодня мы предлагаем еще один способ попасть на параллель ML — решить задачу, посвященную подготовке данных к дальнейшему анализу. В этой задаче фамилии, имена и отчества даны в случайном порядке и нужно записать их в стандартном порядке (фамилия, имя, отчество). Чем больше правильных ответов — тем выше балл. \u003ca href\u003d\"https://contest.yandex.ru/contest/2518\"\u003eВход в тур\u003c/a\u003e. Тур пройдет с 18:00 27 мая (пятница) до 23:59:59 29 мая (воскресенье) по московскому времени.\u003c/p\u003e\u003cp\u003eПо итогам блиц-тура как минимум один из официальных участников будет приглашен принять участие в обучении в параллели ML летней школы. Официальными участниками считаются школьники, заполнившие анкету на \u003ca href\u003d\"https://cs.hse.ru/csss2016\"\u003eсайте школы\u003c/a\u003e (там же можно прочитать о школе подробнее). Все остальные могут решить задачу just for fun!\u003c/p\u003e\u003cp\u003eСтоимость участия в школе — 23 000 рублей, но победители и призеры Всероссийских олимпиад по информатике, математике и физике могут принять участие в школе бесплатно. Мы очень хотим провести школу хорошо, чтобы в следующем году спонсоры дали нам столько денег, чтобы мы могли еще и доплатить всем участникам :)\u003c/p\u003e\u003cp\u003eupdate: Теперь можно посылать решение 100 раз и оценивается лучшая посылка, а не последняя.\u003c/p\u003e\u003c/div\u003e","tags":[]}}