{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1464275334,"rating":0,"authorHandle":"denisx9.0c","modificationTimeSeconds":1464275457,"id":45069,"title":"\u003cp\u003eПрибавление на отрезке и проверка на наличие числа на отрезке\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЕсть задача \u003ca href\u003d\"https://www.e-olymp.com/ru/problems/3507\"\u003ehttps://www.e-olymp.com/ru/problems/3507\u003c/a\u003e. Она уже обсуждалась на codeforces но, я так и не нашел ответа на нее. Простая идея в виде реализации обычного прибавления на отрезке и поиска числа на отрезке в виде получения каждого значения числа на отрезке l..r даёт 54% ответов. Есть вторая идея, которая основана частично на ответе одного из пользователей в пред теме по этой задаче и моих догадках. В каждой вершине хранится хеш-сет m, содержащий значения на отрезке, величина add, которую надо прибавить и первый first и последний last элементы на отрезке. Когда надо прибавить на отрезке, мы проверяем, если это текущий отрезок совпадает (или можно здесь проверять, лежит ли он полностью) с интервалом прибавления, то увеличиваем add на нужное число, если нет, то идем рекурсивно в потомков, а после этого first \u003d first_левого_потомка + add_левого_потомка, last \u003d last_правого_потомка + add_правого_потомка, чистим m и записываем туда модифицированные значения из потомков. Когда мы проверяем, то смотрим — если интервал для поиска лежит полностью в текущем отрезке, то проверяем есть ли в нем искомое число-add, если интервал не совпадает, то сравниваем первый элемент левого потомка + его add с первым элементом текущего отрезка + его add. Если не равны, то прибавляем к add потомка add предка. Тоже самое и для правого, только сравниваем последние элементы. После запускаем рекурсию в потомков. Такое решение, увы, дает лишь 17% ответов, большая часть по времени не укладывается, а несколько дают неверный ответ) Просьба подсказать/помочь с этой задачей.\u003c/p\u003e\u003c/div\u003e","tags":["дерево отрезков","проблема с задачей"]}}