{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1504290282,"rating":-23,"authorHandle":"EnigmaWasp","modificationTimeSeconds":1504290282,"id":54238,"title":"\u003cp\u003eВнутреннее ПО: зачем строить внутреннее программное обеспечение?\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eМнение о том, что программное обеспечение в скором времени будет доминировать и радикально изменить каждый аспект жизни каждого человека, стало настолько обычным явлением и повторялось так часто, что те из нас, кто работает в этой отрасли, рассматривают это как факт. Менее известный, но более конкретный факт заключается в том, что большая часть прироста производительности, ожидаемого от внедрения компьютерных технологий, не была реализована.\u003c/p\u003e\u003cp\u003eКак объясняет Тайлер Коуэн, «с начала 2005 года производительность труда растет в среднем на 1,3 процента ежегодно, по сравнению с 2,8 процента в год за предыдущие 10 лет». Его статьи желательны к прочтению всем, кто интересуется программной инженерией и компьютерной области в целом.\u003c/p\u003e\u003cp\u003eПрограммное обеспечение повысило производительность по всем направлениям для некоторых отраслей, таких как производство, но для многих других отраслей только определенные компании смогли сделать выгоду. Исследование, проведенное в 2003 году, показало, что в то время как Wal-Mart и Kmart инвестировали в ИТ, Wal-Mart лучше справлялся с изменением остальной части своего бизнеса на работу с технологией, и, следовательно, добился более высокого уровня производительности..\u003c/p\u003e\u003cp\u003eПО не является инертным капиталовложением. Компания не может просто сбрасывать Microsoft Excel на свои ноутбуки и ожидать, что дополнительные деньги придут в прибыль. Ей необходимо нанять или же обучить сотрудников, которые хорошо разбираются в Excel, и изменить свои процессы, чтобы в полной мере использовать программу. Фактически, любой достаточно опытный пользователь программы Excel будет выполнять работу, очень похожую на разработчика программного обеспечения: создание внутреннего программного обеспечения (хотя и в сильно ограниченной среде). Компания, которая видит прирост производительности от использования Excel, уже наняла инженеров квази-программного обеспечения, но в названии должности, которую они занимают, с большей вероятностью будет содержать слово «аналитик», чем «инженер».\u003c/p\u003e\u003cp\u003eExcel и подобные программы — мощные части общего программного обеспечения. Квалифицированные пользователи могут создавать с их помощью мощное программное обеспечение, ориентированное на бизнес. Проблема в том, что для любого достаточно сложного бизнес-приложения Excel далеко не лучший инструмент для его создания. Образ, который приходит на ум, это кто-то, делающий стол с помощью швейцарского армейского ножа — это возможно, но потратить слишком много времени, и результат будет неудовлетворительным. Говоря о трате времени, чтобы доказать, что это возможно, Том Вильден Хайн построил машину Тьюринга с помощью Powerpoint. Эти общие программные приложения по своей природе ограничивают возможности создания внутреннего программного обеспечения, а также заставляют пользователей решать и даже определять свои проблемы на условиях, установленных этими самыми ограничениями. PowerPoint является самым известным “преступником” в этом отношении, он взорвал Колумбийский космический корабль и представляет собой экзистенциальную угрозу для американских военных.\u003c/p\u003e\u003cp\u003eПредприятия также будут инвестировать в корпоративное программное обеспечение, которое построено с учетом более конкретных целей, чем Excel и ему подобное. Эти цели охватывают такие функции, как финансы и бухгалтерский учет, управление запасами, проектами и многие другие. Внешние эксперты часто нанимаются для установки этих систем, и постоянная поддержка имеет важное значение для настройки инструментов для конкретных потребностей бизнеса. Однако, эти настройки пока заходят так далеко, что пользователи в конечном итоге связаны с видением поставщика ПО о том, как должен работать конкретный процесс. Это может быть хорошо для учёта, когда отраслевое соответствие приносит пользу бизнесу (например, для аудита), но более проблематично для управления запасами, где уникальный процесс может быть конкурентным преимуществом.\u003c/p\u003e\u003cp\u003eКажется очевидным, что для повышения производительности с помощью компьютеров требуется какое-то внутреннее программное обеспечение. Это объясняется тем, насколько высокорентабельные консалтинговые фирмы используют Excel и PowerPoint и сколько компаний будут платить за установку и обслуживание корпоративных систем. \u003c/p\u003e\u003cp\u003eПочему же тогда так важно внутреннее программное обеспечение? Истинное внутреннее программное обеспечение может быть свободно определено как приложение, созданное с нуля для решения проблем конкретного бизнеса.\u003c/p\u003e\u003cp\u003eЭтот вид программного обеспечения имеет много преимуществ по сравнению с инструментами вроде Excel и ему подобных. Навскидку: контроль подлинности данных, целевые пользовательские интерфейсы, отсутствие ограничений на данные. Нет ограничений количества одновременных пользователей. Индивидуальное внутреннее программное обеспечение также имеет много преимуществ перед корпоративным программным обеспечением, в том числе: менее дорогостоящее, более гибкое к изменяющимся ситуациям, обусловленными конкретными потребностями бизнеса.Также внутреннее ПО обладает огромным потенциальным конкурентным преимуществом.\u003c/p\u003e\u003cp\u003eРазрушительный разрыв в производительности между ожиданиями и реальностью широко распространенного использования компьютеров может быть сужен, если компании будут более склонны разрабатывать собственное внутреннее программное обеспечение,которые будет отвечать их конкретным потребностям и решать заданные проблемы.\u003c/p\u003e\u003cp\u003eВнутренние разработчики программного обеспечения должны стать такими же распространенными во всех сферах бизнеса, как когда-то были машинисты на железной дороге. Наличие правильных инструментов важно для любого успешного бизнеса, и вы можете быть уверены, что они являются правильными, если вы их создаете.\u003c/p\u003e\u003c/div\u003e","tags":[]}}