{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1411287409,"rating":18,"authorHandle":"adzen","modificationTimeSeconds":1411288144,"id":13897,"title":"\u003cp\u003eHow to scale up the jury system to hold more contestants?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI\u0027m a little curious about CF\u0027s back-end for each contest.\u003c/p\u003e\u003cp\u003eIn my country, Taiwan, there is an \u0026quot;educational\u0026quot; certification for average-level and low-level students who may not talented in programming called \u003ca href\u003d\"http://cpe.cse.nsysu.edu.tw/\"\u003eCPE (Collegiate Programming Examination)\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThey hold 4 times every year. There are about 1500 students, partitioned into about 50 exam rooms, connected through Internet, to participate this contest at the same time.\u003c/p\u003e\u003cp\u003eEven I haven\u0027t participated in CPE yet, but in my experience in ACM-ICPC regional, the \u003ca href\u003d\"http://www.ecs.csus.edu/pc2/\"\u003ePC^2\u003c/a\u003e system are somehow slow to wait for my verdict if there is a lot of submissions in a short time.\u003c/p\u003e\u003cp\u003eI know there are some well-known jury systems like \u003ca href\u003d\"http://www.domjudge.org/\"\u003eDOMjudge\u003c/a\u003e, \u003ca href\u003d\"http://cms-dev.github.io/\"\u003eCMS (recently used by IOI)\u003c/a\u003e, etc.\u003c/p\u003e\u003cp\u003eRecently, some students participated in CPE argue that the judge process is slow, and the CPE system is modified from the DOMjudge.\u003c/p\u003e\u003cp\u003eI\u0027m wondering is there an efficient jury system to meet such heavy load.\u003c/p\u003e\u003cp\u003eWell, I know the contest rule in CF is different from the one in ACM-ICPC (the CPE rule is same as ACM-ICPC), also different from the Google Code Jam.\u003c/p\u003e\u003cp\u003eIs there a jury system using ACM-ICPC rule and can hold maybe up to 5000 even 10000 contestants? \u003c/p\u003e\u003cp\u003eMaybe the most important factor is hardware issue (how many computers to absorb the submissions) not just software (jury system). \u003c/p\u003e\u003cp\u003eIt seems the Cloud Computing is the trend in recent years. So how to scale up the jury system to hold more contestants?\u003c/p\u003e\u003cp\u003eThis is very interesting.\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eThe UVa online judge seems to renew their website (but I don\u0027t know their current progress), I\u0027m looking forward to see it!\u003c/p\u003e \u003c/blockquote\u003e\u003c/div\u003e","tags":["jury system"]}}