{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1414486437,"rating":26,"authorHandle":"Xephy","modificationTimeSeconds":1414486437,"id":14474,"title":"\u003cp\u003e474B — Worms. Test cases are too weak\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch4\u003eWARNING!\u003c/h4\u003e\u003ch4\u003eThe following blog contains a lot of whining and absolutely useless information. Be cautious, as you may lose your faith in humanity after reading this post. Apologies in advance. TL;DR at the bottom of the entry.\u003c/h4\u003e\u003cp\u003eHello everyone. As a person that extremely enjoys competition, and thus enjoys Codeforces Rounds I really want to adress this issue. Everybody likes hacking other people\u0027s solutions and people that GET hacked are either upset about it or are happy (because you know, more room for improvement). But sometimes when people don\u0027t hack your solution AND you certainly know that there is a test case that your solution fails at, you quickly look for a bug in code, fix it and re-send it. You see, I got this issue once. But the test case that my solution was failing at was not present in system test cases.\u003c/p\u003e\u003cp\u003eMy submissions:\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"/contest/474/submission/8111607\" title\u003d\"Submission 8111607 by Xephy\"\u003e8111607\u003c/a\u003e — Initial Submission\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"/contest/474/submission/8120543\" title\u003d\"Submission 8120543 by Xephy\"\u003e8120543\u003c/a\u003e — Fixed Submission\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"/contest/474/submission/8244051\" title\u003d\"Submission 8244051 by Xephy\"\u003e8244051\u003c/a\u003e — Initial Submission resubmitted after the contest\u003c/p\u003e\u003cp\u003eGuess what? My initial submission passed system tests but couldn\u0027t pass my own tests.\u003c/p\u003e\u003cp\u003eExample:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eInput:\n2\n10 15\n1\n5\nOutput:\n1\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eHowever my solution doesn\u0027t print out ANYTHING. And yet, it passed system tests. I would understand if it only pretests were that weak (you kno\u0027. to farm hacks) but system tests are not supposed to be that weak.\u003c/p\u003e\u003cp\u003eTL;DR System tests are weak, I\u0027m butthurt and I\u0027ve been holding in for 3 weeks.\u003c/p\u003e\u003c/div\u003e","tags":["271","codeforces","round"]}}