{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1522604275,"rating":77,"authorHandle":"Nickolas","modificationTimeSeconds":1522605641,"id":58681,"title":"\u003cp\u003eApril Fools Day Contest 2018: editorial\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/952/problem/A\" title\u003d\"April Fools Contest 2018\"\u003e952A - Quirky Quantifiers\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eJAPE riddle generator is a program which can produce question-answer puns. This problem has been inspired by one of the witticisms produced by it:\u003c/p\u003e\u003cp\u003eWhat do you call a quirky quantifier? An odd number.\u003c/p\u003e\u003cp\u003eAll you had to do was to check whether the given \u0026quot;quantifier\u0026quot; was \u0026quot;quirky\u0026quot;.\u003c/p\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/952/problem/B\" title\u003d\"April Fools Contest 2018\"\u003e952B - A Map of the Cat\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eThis problem was inspired by the awesome book \u0026quot;Surely You\u0027re Joking, Mr. Feynman!\u0026quot; In one of his stories Feynman asks a librarian to fetch him a map of a cat, having a zoological chart in mind. Of course, such a serious interpretation was unsuitable for my purposes :-)\u003c/p\u003e\u003cp\u003eThis was a perfectly straightforward problem: just pet the cat! If the reaction you get is \u0026quot;no\u0026quot;, try a different spot, otherwise you can figure out what kind of a cat this is right away. Just make sure you\u0027re not carried away: both kinds of cats get bored after 7th attempt to pet them and send you away without letting you guess their kind.\u003c/p\u003e\u003cp\u003eOne thing I didn\u0027t take into account was that interactive problems are very rare on Codeforces, so this problem turned out to be much harder than the next one.\u003c/p\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/952/problem/C\" title\u003d\"April Fools Contest 2018\"\u003e952C - Ravioli Sort\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eLet\u0027s call the row of stacks \u0026quot;stable\u0026quot; if each adjacent pair of stacks in it differs in height by at most one (so no ravioli are going to slide to a different stack). It is easy to show that if a row is stable, then after removal of the tallest stack the resulting row is also stable. Indeed, after removing stack \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e\u003c/sub\u003e\u003c/span\u003e the only new pair of adjacent stacks is \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e - 1\u003c/sub\u003e\u003c/span\u003e and \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e + 1\u003c/sub\u003e\u003c/span\u003e. The row was stable, so \u003cspan class\u003d\"tex-span\"\u003e|\u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e\u003c/sub\u003e - \u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e - 1\u003c/sub\u003e| ≤ 1\u003c/span\u003e and \u003cspan class\u003d\"tex-span\"\u003e|\u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e\u003c/sub\u003e - \u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e + 1\u003c/sub\u003e| ≤ 1\u003c/span\u003e. But \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e\u003c/sub\u003e\u003c/span\u003e was the tallest stack, so \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e\u003c/sub\u003e - 1 ≤ \u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e - 1\u003c/sub\u003e, \u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e + 1\u003c/sub\u003e ≤ \u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e\u003c/sub\u003e\u003c/span\u003e. Thus the difference in height between \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e - 1\u003c/sub\u003e\u003c/span\u003e and \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e + 1\u003c/sub\u003e\u003c/span\u003e is at most 1, and the resulting row is also stable.\u003c/p\u003e\u003cp\u003eThis means that the output will be correct if and only if the original array was stable (obviously, if the original array was not stable, at least one of the stacks would change even before the first tallest stack is chosen, and once some stacks change it\u0027s impossible to fix all of them).\u003c/p\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/952/problem/D\" title\u003d\"April Fools Contest 2018\"\u003e952D - I\u0027m Feeling Lucky!\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eDo you know how an actual roulette works? Each time you play, the winning number is different (even if you bet on the same number). It was exactly the same in this problem: each time the solution runs, it needs to guess a different winning number. There were two tests, so you have to make a winning bet twice.\u003c/p\u003e\u003cp\u003eThis problem required a little exploration and out-of-the-box thinking. It is really hard to win betting on a number or even on two numbers (although I\u0027ve seen a submission which got 26 on both tests). But you don\u0027t need to win big, you need just to win — so why not try bets with higher probability of winning, like \u0026quot;red\u0026quot; or \u0026quot;even\u0026quot;? The checker supported a variety of bets as was shown on the picture, so you just had to explore a little.\u003c/p\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/952/problem/E\" title\u003d\"April Fools Contest 2018\"\u003e952E - Cheese Board\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eThis problem was inspired by the first line of Wikipedia article \u003ca href\u003d\"https://en.wikipedia.org/wiki/Chessboard\"\u003eChessboard\u003c/a\u003e: \u0026quot;Not to be confused with cheese board\u0026quot;. Indeed, cheese board, chess board, what\u0027s the difference really? :-)\u003c/p\u003e\u003cp\u003eThe image in the statement showed a bunch of cheeses (from the first example) arranged in a chessboard pattern, with soft cheeses representing one \u0026quot;color\u0026quot; of the squares and hard cheeses representing the other. The task was to find out the smallest size of a square \u0026quot;chessboard\u0026quot; on which the given cheeses could be arranged in such a way that soft and hard cheeses would alternate, and cheeses of the same type would never occupy adjacent squares.\u003c/p\u003e\u003cp\u003eOnce you\u0027ve figured out the task, the solution is very straightforward. First, count the numbers of soft and hard cheeses. Iterate through the sizes of the chessboard, starting with 1, and for each size count the number of black and white cells on it. If the number of black cells is greater than or equal to the number of hard cheeses and the number of white cells is greater than or equal to the number of soft cheeses or vice versa, return this size of the board.\u003c/p\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/952/problem/F\" title\u003d\"April Fools Contest 2018\"\u003e952F - 2 + 2 !\u003d 4\u003c/a\u003e\u003c/h4\u003e\u003cp\u003eThis problem is based on a real bug in the checker for problem \u003ca href\u003d\"/contest/784/problem/G\" title\u003d\"April Fools Contest 2017\"\u003e784G - BF Calculator\u003c/a\u003e. Fortunately, we caught it before the contest, which is why I can laugh about it today :-) \u003c/p\u003e\u003cp\u003eThe checker successfully iterated through the characters of the expression and accumulated them into a \u0026quot;current number\u0026quot; variable to add it to the result or to subtract it from the result. But due to a missing check in current number accumulation plus and minus characters were also counted as digits of the number. In \u0026quot;2+2\u0026quot; example, the first number was correctly interpreted as 2, but for the second one the first digit was (\u0027+\u0027-\u00270\u0027) \u003d -5, and so the second number was interpreted as (-5)*10 + 2 \u003d -48. Minus sign would be interpreted as an extra leading (\u0027-\u0027-\u00270\u0027) \u003d -3 \u0026quot;digit\u0026quot;.\u003c/p\u003e\u003cp\u003eThe solution follows:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003elong long result \u003d 0, cur \u003d 0;\nexpr +\u003d \u0026quot;+\u0026quot;;\nint sign \u003d +1;\nfor (char c : expr) {\n    if (c \u003d\u003d \u0027+\u0027 || c \u003d\u003d \u0027-\u0027) {\n        result +\u003d sign * cur;\n        cur \u003d 0;\n    }\n    if (c \u003d\u003d \u0027-\u0027)\n        sign \u003d -1;\n    if (c \u003d\u003d \u0027+\u0027)\n        sign \u003d +1;\n    // bug: + and - signs are accumulated into the number\n    cur \u003d cur * 10 + (c - \u00270\u0027);\n}\n\u003c/code\u003e\u003c/pre\u003e\u003ch4\u003e\u003ca href\u003d\"/contest/952/problem/G\" title\u003d\"April Fools Contest 2018\"\u003e952G - Puzzling Language\u003c/a\u003e\u003c/h4\u003e\u003cp\u003e\u0026quot;Puzzling language\u0026quot; featured in this problem is Orthogonal Puzzlang (a less studied variant of \u003ca href\u003d\"https://esolangs.org/wiki/Puzzlang\"\u003ePuzzlang\u003c/a\u003e).\u003c/p\u003e\u003cp\u003eThere are multiple ways to approach code generation in this language. \u003c/p\u003e\u003cp\u003eThe method shown in the example was not the easiest possible, and was chosen quite deliberately :-) But it is possible to develop it further — use triangular blocks of Xs to increment value in a cell and then carefully navigate to the right cell and print its contents. This requires a lot of care when dealing with multiple symbols, increments which are not square numbers (a triangular block of Xs corresponds to an increment by a square number, and yes, \\$ sign in the example with ASCII code 36 was not a random choice) and so on.\u003c/p\u003e\u003cp\u003eMy reference solution used a much easier approach. The simplest command to generate in Puzzlang is decrement — it is just a standalone \u0027X\u0027. And due to the fact that memory cells in Brainfuck wrap around, you can get any value in a memory cell starting with any other value and decrementing it the right number of times. The generated program can have only 2 columns, with \u0027-\u0027 (decrement) instruction implemented as \u0026quot;..\u0026quot; — newline — \u0026quot;X.\u0026quot; and \u0027.\u0027 (print) instruction implemented as \u0026quot;X.\u0026quot;.\u003c/p\u003e\u003cp\u003eThis approach can be optimized further without adding too much complexity: my actual reference solution still generated 2-column programs but encoded both decrement and print instructions as either \u0026quot;.X\u0026quot; or \u0026quot;X.\u0026quot; depending on the previous instruction, so that decrement \u0027X\u0027s formed a chessboard pattern, and print \u0027X\u0027s were right below the \u0027X\u0027s of previous instructions. This reduced the size of the program by a factor of 2.\u003c/p\u003e\u003cp\u003eAnother solution I implemented didn\u0027t use wrap around of memory cells, but instead relied on torus topology of the program. I used a program with 2 columns again, with the same implementation of decrement and print instructions as in the previous approach. A sequence of 2*N increment instructions could be represented as a block of N+1 \u0026quot;XX\u0026quot; lines. The first line of the block would be interpreted as \u0026quot;,,\u0026quot;, but the interpreter is permissive enough to just ignore these instructions. Every line of the block after that is interpreted as \u0026quot;++\u0026quot;. This approach typically generates shorter programs but requires a bit more care when implementing it — I got it quite right only on the fourth try :-)\u003c/p\u003e\u003c/div\u003e","tags":["april 1st"]}}