{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1434382107,"rating":4,"authorHandle":"mochow","modificationTimeSeconds":1437754560,"id":18592,"title":"\u003cp\u003eAgain ICL2015Finals : Problem on Number Theory\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eSo again I am writing a post about ICL2015 Finals. My \u003ca href\u003d\"//codeforces.com/blog/entry/18542\"\u003elast post\u003c/a\u003e was about a DP problem which was not that much hard. But now I am really stuck by a tough \u003ca href\u003d\"//codeforces.com/gym/100637/problem/D\"\u003eproblem\u003c/a\u003e (I am mentioning this one as tough because number of people who solved it was really low).\u003c/p\u003e\u003cp\u003eWhat I did for this one? Well, whatever I did to solve this problem was based on \u003ca href\u003d\"http://discuss.codechef.com/questions/3869/best-known-algos-for-calculating-ncr-m\"\u003ethis\u003c/a\u003e tutorial from CodeChef. You can check that out.\u003c/p\u003e\u003cp\u003eIn short the problem is:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eGiven n,k,m where n,k\u0026lt;\u003d10^18, m\u0026lt;\u003d10^6, we need to find C(n,k)%m where C(n,k) means number of ways to choose k objects from n objects.\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eSo, the question is: \u003cstrong\u003eWhat did I do to solve this problem?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFollowing the tutorial, I prime factorized \u003ccode\u003em\u003c/code\u003e. Eventually, I got some prime numbers as factors. Then I applied \u003cstrong\u003eLucas\u0027 Theorem\u003c/strong\u003e for each of this prime. After calculating answers for each of this prime, I had to solve some equations of the form \u003ccode\u003eX \u003d A[i] (mod M[i]).\u003c/code\u003e \u003c/p\u003e\u003cp\u003eAnd these equations can be solved by \u003ca href\u003d\"https://www.youtube.com/watch?v\u003dru7mWZJlRQg\"\u003eChinese Remainder Theorem.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eNow, where did I get stuck? I did all these things mentioned above. But when we are given an \u003ccode\u003em\u003c/code\u003e when \u003cstrong\u003em has prime powers in its factorized form\u003c/strong\u003e, I could not find a solution to calculate the required result.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLet me give a quick example.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eImagine, \u003ccode\u003en\u003d10, k\u003d5, m\u003d12341.\u003c/code\u003e To find \u003ccode\u003eX\u003dC(10,5)%12341\u003c/code\u003e, I first prime factorized \u003ccode\u003e12341.\u003c/code\u003e So \u003ccode\u003e12341\u003d7*41*43.\u003c/code\u003e\u003c/p\u003e\u003cp\u003eI applied \u003cstrong\u003eLucas\u0027 Theorem\u003c/strong\u003e for each of the prime factors. What I got is:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eX \u003d 0 (mod 7);\nX \u003d 6 (mod 41);\nX \u003d 37 (mod 43);\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eNow my task was to combine this equations to find our \u003ccode\u003eX\u003c/code\u003e. I applied \u003cstrong\u003eCRT\u003c/strong\u003e for this and got the required answer \u003ccode\u003e252\u003c/code\u003e. \u003cstrong\u003eYahooo!\u003c/strong\u003e \u003cstrong\u003e:D\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eBut wait, when \u003ccode\u003em\u003d1000\u003c/code\u003e (or \u003cstrong\u003esome number with prime powers\u003c/strong\u003e), it didn\u0027t work. \u003cstrong\u003e:(\u003c/strong\u003e \u003c/p\u003e\u003cp\u003eThis is where I need a solution. I actually need to calculate \u003ccode\u003eC(n,r)%m\u003c/code\u003e where \u003ccode\u003em\u003c/code\u003e is of the form \u003ccode\u003ep^a where p is a prime.\u003c/code\u003e\u003c/p\u003e\u003cp\u003eAs you can realize, I am not quite good. It will be too much helpful if you share your ideas on how to solve the above mentioned problem and give instructions to code it in detail, step by step. And I will be really grateful to you. :)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePS1:\u003c/strong\u003e I found few ideas on how to get around this problem online. But I could not understand and of course could not code anything.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePS2:\u003c/strong\u003e Really sorry for the long post.\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eCheers and thanks in advance!\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e","tags":["icl","number theory","modular arithmetic"]}}