{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1511429832,"rating":35,"authorHandle":"Huawei_Codecraft","modificationTimeSeconds":1511522147,"id":55958,"title":"\u003cp\u003eHuawei Labs Rus: Marathon match 1. Spatial Image Alignment\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIf you are 14+ and want your ideas to be implemented in new technologies and products, which being used by 1/3 of global population, participate in our Marathon started recently \u003ca href\u003d\"https://it-edu.mipt.ru/en/huawei-codecraft-marathon\"\u003ehttps://it-edu.mipt.ru/en/huawei-codecraft-marathon\u003c/a\u003e\u003c/p\u003e\u003cp\u003eTask can be downloaded after registration, see links below: John has a digital camera. He usually takes two photos, first photo is bad quality and blurred, second has good quality, but his hands shaked, and the second photo has moved compared to the first one. Help John to restore first(blurred) photo position, considering that the movement was in the same plane.\u003c/p\u003e\u003cp\u003eSolution: We highly encourage participants to use neural network based approaches for solving this task. You can download 30 samples from checker in txt format. Data generation for neural network training is one of the main point in our task. Converter from/to graphic format is also part of this task.\u003c/p\u003e\u003cp\u003eRegistration can be done by captain. The team can consist from 1 to 3 team members: \u003ca href\u003d\"https://it-edu.mipt.ru/el/mod/apply/view.php?id\u003d60\"\u003ehttps://it-edu.mipt.ru/el/mod/apply/view.php?id\u003d60\u003c/a\u003e Checker \u003ca href\u003d\"http://huawei.it-edu.mipt.ru/marathon1\"\u003ehttp://huawei.it-edu.mipt.ru/marathon1\u003c/a\u003e Rules \u003ca href\u003d\"https://it-edu.mipt.ru/en/huawei-codecraft-marathon/rules\"\u003ehttps://it-edu.mipt.ru/en/huawei-codecraft-marathon/rules\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSubmission deadline is 2017 December 1, 23:59:59 Moscow time. Results will be announced on December 3 during the closing ceremony of 1/2 NEERC ACM ICPC 2017 at ITMO.\u003c/p\u003e\u003cp\u003e@stake are 9 internship certificates, 9 smartphones, several tours to HQ\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/7f/9a/7f9aee1546241c97ee2164790ea8c187d32517ac.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}