{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1501163902,"rating":-16,"authorHandle":"Secret.Codes","modificationTimeSeconds":1501163902,"id":53507,"title":"\u003cp\u003eHow to solve this problem?? please help and discuss.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e1268 — Unlucky Strings  PDF (English) Statistics Forum Time Limit: 2 second(s) Memory Limit: 32 MB\u003c/p\u003e\u003cp\u003eMr. \u0027Jotishi\u0027 is a superstitious man. Before doing anything he usually draws some strange figures, and decides what to do next.\u003c/p\u003e\u003cp\u003eOne day he declared that the names that contain a string S as substring is unlucky. For example, let S be \u0027ab\u0027, then \u0027abc\u0027, \u0027cabe\u0027, \u0027pqqab\u0027, \u0027ab\u0027 etc are unlucky but \u0027ba\u0027, \u0027baa\u0027 etc are not.\u003c/p\u003e\u003cp\u003eSo, he gives you the string S and asks you to find the number of names of length n, which are lucky, that means you have to find the number of strings that don\u0027t contain S as substring. Input\u003c/p\u003e\u003cp\u003eInput starts with an integer T (≤ 100), denoting the number of test cases.\u003c/p\u003e\u003cp\u003eEach case starts with a line containing an integer n (1 ≤ n ≤ 109). The next line contains the allowed characters for a name. This non-empty line contains lowercase characters only and in ascending order. The next line contains a string S (1 ≤ length(S) ≤ 50), and S contains characters from the allowed characters only. Output\u003c/p\u003e\u003cp\u003eFor each case, print the case number and the total number of names that don\u0027t contain S as substring. As the number can be very large, print the number modulo 232. Sample Input\u003c/p\u003e\u003cp\u003eOutput for Sample Input\u003c/p\u003e\u003cp\u003e3\u003c/p\u003e\u003cp\u003e3\u003c/p\u003e\u003cp\u003eab\u003c/p\u003e\u003cp\u003eab\u003c/p\u003e\u003cp\u003e4\u003c/p\u003e\u003cp\u003eacd\u003c/p\u003e\u003cp\u003eca\u003c/p\u003e\u003cp\u003e5\u003c/p\u003e\u003cp\u003eab\u003c/p\u003e\u003cp\u003eaaa\u003c/p\u003e\u003cp\u003eCase 1: 4\u003c/p\u003e\u003cp\u003eCase 2: 55\u003c/p\u003e\u003cp\u003eCase 3: 24\u003c/p\u003e\u003c/div\u003e","tags":[]}}