{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1528846152,"rating":59,"authorHandle":"Professor.Kek","modificationTimeSeconds":1528847754,"id":59991,"title":"\u003cp\u003eОлимпиадное программирование и выбор вуза\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eDisclaimer:  я понимаю, что codeforces не самое лучшее место для такого поста. Что всем более интересны соревнования и прикольные задачки. Просто мне интересно мнение именно сообщества Codeforces по этому поводу. \u003c/p\u003e\u003cp\u003eя понимаю, что таким спорным постом солью вклад, поэтому пишу с левого аккаунта. \u003c/p\u003e\u003cp\u003eЯ понимаю, что таким образом в некотором смысле проявляю неуважение к сообществу, поэтому заранее прошу у вас прощения.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cem\u003eОсторожно! многабукаф\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eСтало интересно: почему там много крутых олимпиадных программистов выбирают не самые топовые вузы для дальнейшего образования? Почему так мало олимпиадников идёт куда нибудь в MIT, Stanford, Harvard и в другие подобные места? Если сопоставить места, где учаться спортивные программисты и фавориты рейтингов\u003c/p\u003e\u003cp\u003e1) \u003ca href\u003d\"https://www.topuniversities.com/university-rankings/university-subject-rankings/2018/computer-science-information-systems\"\u003ehttps://www.topuniversities.com/university-rankings/university-subject-rankings/2018/computer-science-information-systems\u003c/a\u003e QS University Ranking (Computer Science) 2) \u003ca href\u003d\"https://www.timeshighereducation.com/world-university-rankings/2018/subject-ranking/computer-science#!/page/0/length/25/sort_by/rank/sort_order/asc/cols/stats\"\u003ehttps://www.timeshighereducation.com/world-university-rankings/2018/subject-ranking/computer-science#!/page/0/length/25/sort_by/rank/sort_order/asc/cols/stats\u003c/a\u003e\u003c/p\u003e\u003cp\u003eто можно увидеть, что корелляция невелика. Конечно, некоторые университеты в которых развито олимпиадное программирование присутсвуют в рейтинге, но не на самых топовых позициях.\u003c/p\u003e\u003cp\u003eНеужели эти рейтинги настолько мусорны (в целом, не самый невероятный вариант развития событий. СМИ любят перевирать факты :( )? \u003c/p\u003e\u003cp\u003eНо даже если принять, что все эти рейтинги бесполезны, вопрос остается открытым. Возьмем, к примеру, ВУЗы России. Сильные олимпиадные программисты оседают в региональных вузах (такие есть даже среди Легендарных гроссмейстеров (некоторые, конечно, потом перебираются в столичные вузы, но факт осаётся фактом)), которые, очевидно, значительно проигрывают столичным в качестве и престижности образования. Понятно, что не все решают заниматься наукой, а роль университета в формирование IT специалиста, вероятно, невелика. Но не может же она быть настолько мала?\u003c/p\u003e\u003cp\u003eДа и вообще, почему люди, выигравшие IOI остаются в региональных вузов, когда, по идее, их могут взять почти в любой университет мира? У меня было несколько вариантов, но ни один из них не кажется мне прямо очень состоятельным (может остановить некотрых, но не всех) (и никаких идей, зачем оставаться в региональном вузе (во всяком случае в отличном от СГУ и УРФУ точно)):\u003c/p\u003e \u003col\u003e   \u003cli\u003eЗападные вузы дорогие — есть шанс подать заявление на грант и получить его, да и в конце концов, в некоторых местах есть такая штука как need-blind admission...\u003c/li\u003e   \u003cli\u003eНезнание языка — ну это вообще как то глупо. В наше время есть большое количество возможностей выучить английский язык на неплохом уровне, да и в провинции репетиторы, которые позволят набрать вам практику говорения стоят не очень дорого (раза в два меньше, чем можно без труда нафрилансить за время занятия).\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eПонятно, что олимпиадное программирование это в первую очередь про решение прикольных и интересных задач на скорость. Да, этим стоит заниматься в основном, потому что это прикольно. Но хотелось бы услышать интересные аргументы про выбор вуза от всех предствителей сообщества Codeforces, в особенности от таких крутых участников как:\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Um_nik\" title\u003d\"Легендарный гроссмейстер Um_nik\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eU\u003c/span\u003em_nik\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Umqra\" title\u003d\"Гроссмейстер Umqra\"\u003eUmqra\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/KAN\" title\u003d\"Гроссмейстер KAN\"\u003eKAN\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Sert\" title\u003d\"Гроссмейстер Sert\"\u003eSert\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/HellKitsune\" title\u003d\"Международный гроссмейстер HellKitsune\"\u003eHellKitsune\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/al13n\" title\u003d\"Международный гроссмейстер al13n\"\u003eal13n\u003c/a\u003e, в каком-то роде \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Xellos\" title\u003d\"Международный мастер Xellos\"\u003eXellos\u003c/a\u003e про региональные вузы;\u003c/p\u003e\u003cp\u003eЯ слышал, что \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/yeputons\" title\u003d\"Международный гроссмейстер yeputons\"\u003eyeputons\u003c/a\u003e пытался поступать в MIT, но не срослось. Хотелось бы тоже услышать про подводные камни, почему не стал подавать документы в другие места за рубежом?\u003c/p\u003e\u003cp\u003eХотелось бы услышать историю бурундучков про их проблемы с СПБГУ, призываю \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/burunduk2\" title\u003d\"Эксперт burunduk2\"\u003eburunduk2\u003c/a\u003e, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/burunduk3\" title\u003d\"Международный мастер burunduk3\"\u003eburunduk3\u003c/a\u003e в тред.\u003c/p\u003e\u003cp\u003eС другой стороны, хотелось бы услышать мнение \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/ilyaraz\" title\u003d\"Эксперт ilyaraz\"\u003eilyaraz\u003c/a\u003e по этому вопросу, хоть он и нечасто заходит на cf. Почему немного людей делает даже P. H. D. за рубежом?\u003c/p\u003e\u003c/div\u003e","tags":["тлен","выбор вуза"]}}