{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1476373276,"rating":0,"authorHandle":"shahidul_brur","modificationTimeSeconds":1495780347,"id":47720,"title":"\u003cp\u003eFeature Request: Browsing Blog Posts through pages\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eCodeforces contains so many nice blog posts about data structure, algorithm, problem solving techniques, brilliant idea, own experience, knowledge sharing, good materials, links, tutorials etc. Besides, sometimes many post asking for help on any algorithm, data structure or any specific problem, where many replies and give brilliant idea or hints, by which many people get help and learn many new things and get many new idea or techniques.\u003c/p\u003e\u003cp\u003eBut we always miss many of them, since we can only see some posts in the \u0026quot;Recent actions\u0026quot; and we can\u0027t browse or see any old post directly.\u003c/p\u003e\u003cp\u003eSo, we will be benefited if codeforces provide us a new feature:  \u0026quot;Browsing blog posts by pages\u0026quot; For example, we can browse contests by this link: \u003ca href\u003d\"//codeforces.com/contests\"\u003ehttp://codeforces.com/contests\u003c/a\u003e and go through all the pages by \u003ca href\u003d\"//codeforces.com/contests/page/2\"\u003ehttp://codeforces.com/contests/page/2\u003c/a\u003e , \u003ca href\u003d\"//codeforces.com/contests/page/3\"\u003ehttp://codeforces.com/contests/page/3\u003c/a\u003e, and so on.\u003c/p\u003e\u003cp\u003eSimilarly, we can browse problem pages by this link: \u003ca href\u003d\"//codeforces.com/problemset\"\u003ehttp://codeforces.com/problemset\u003c/a\u003e And go through all the pages by \u003ca href\u003d\"//codeforces.com/problemset/page/2\"\u003ehttp://codeforces.com/problemset/page/2\u003c/a\u003e , \u003ca href\u003d\"//codeforces.com/problemset/page/3\"\u003ehttp://codeforces.com/problemset/page/3\u003c/a\u003e, and so on.\u003c/p\u003e\u003cp\u003eSimilarly, if we would be able to browse all the blog pages, something like \u003ca href\u003d\"//codeforces.com/blogs\"\u003ehttp://codeforces.com/blogs\u003c/a\u003e and go through all the pages by \u003ca href\u003d\"//codeforces.com/blogs/page/2\"\u003ehttp://codeforces.com/blogs/page/2\u003c/a\u003e , \u003ca href\u003d\"//codeforces.com/blogs/page/3\"\u003ehttp://codeforces.com/blogs/page/3\u003c/a\u003e and so on, then, we never miss any good blog post on codeforces and we all will be benefited by the posts.\u003c/p\u003e\u003cp\u003eSo, I request to codeforces authority to think about this feature and add this feature in codeforces. Please consider it ... Thanks in advance.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces features","feature request","new features","blogs","old posts"]}}