{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1465580606,"rating":32,"authorHandle":"shef_2318","modificationTimeSeconds":1465581360,"id":45352,"title":"\u003cp\u003eInvitation to June Clash 2016\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi everyone!\u003c/p\u003e\u003cp\u003eI\u0027d like to invite you to participate in \u003ca href\u003d\"https://www.hackerearth.com/june-clash-16/\"\u003eJune Clash\u003c/a\u003e on \u003ca href\u003d\"https://www.hackerearth.com/\"\u003eHackerEarth\u003c/a\u003e. Contest is scheduled on June, 11. Contest duration is 24 hours, so we hope it will be possible to find comfortable time for everyone in any timezone :) Check your \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?utm_campaign\u003duser-activity-email\u0026amp;p1\u003d64\u0026amp;iso\u003d2016-06-11T01%3A30%3A00\u0026amp;msg\u003dJune+Clash+%2716\u0026amp;utm_medium\u003demail\u0026amp;utm_source\u003duser-subscribed\"\u003etime\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThere will be six tasks in a problemset. Five of them are standard algorithmic problems with partial solutions allowed — you get points for every test that your solution passed. And the last task is an approximate problem — your score for this task depends on how good your solution is comparing to current best solution.\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/amd\" title\u003d\"International master amd\"\u003eamd\u003c/a\u003e has kindly prepared this problemset. Check out his previous Clash contests on HackerEarth and rounds on CodeForces to make sure that it\u0027s likely that you will enjoy the problems :)\u003c/p\u003e\u003cp\u003eI worked on this contest as a tester. In our opinion several tasks will be not too hard for beginners (at least one:) ) (show your best with partial scoring — even very naive solution may give you some points; and 24 hours should be enough for you to read all problems and find some tasks which you can solve). \u003c/p\u003e\u003cp\u003eWe hope some tasks will be decent challenges for experienced contestants too. But if you think that classic part of problemset is easy — the approximate problem is waiting for you :) \u003c/p\u003e\u003cp\u003eThanks to \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/belowthebelt\" title\u003d\"Expert belowthebelt\"\u003ebelowthebelt\u003c/a\u003e for handling all technical aspects of contest preparation. \u003c/p\u003e\u003cp\u003eThe problem statements will be provided in English and Russian. \u003c/p\u003e\u003cp\u003eAs usual, here is one more reason for you to participate in this contest:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTop5 of leaderboard will grab some nice prizes:\u003c/strong\u003e\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003e$100 Amazon gift card + HackerEarth T-shirt\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e$75 Amazon gift card + HackerEarth T-shirt\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e$50 Amazon gift card + HackerEarth T-shirt\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eHackerEarth T-shirt\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eHackerEarth T-shirt\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eGood luck to everybody and let\u0027s have fun :)\u003c/p\u003e\u003c/div\u003e","tags":["june clash","hackerearth"]}}