{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1496496298,"rating":140,"authorHandle":"Michael","modificationTimeSeconds":1497603477,"id":52358,"title":"\u003cp\u003eНовости Факультета Компьютерных Наук ВШЭ\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ этом году первый набор \u003ca href\u003d\"http://bit.ly/25msmZi\"\u003eФакультета Компьютерных Наук\u003c/a\u003e заканчивает третий курс, у них прошел первый год специализаций (предыдущие посты про новости ФКН: \u003ca href\u003d\"//codeforces.com/blog/entry/45054\"\u003e1\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/blog/entry/18801\"\u003e2\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/blog/entry/17195\"\u003e3\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/blog/entry/12859\"\u003e4\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/blog/entry/11918\"\u003e5\u003c/a\u003e).\u003c/p\u003e\u003cp\u003eВсе студенты 3-го года обучения прошли курс по машинному обучению от \u003ca href\u003d\"https://www.hse.ru/staff/esokolov\"\u003eЕвгения Соколова\u003c/a\u003e (автора известной \u003ca href\u003d\"https://goo.gl/1nf8KS\"\u003eспециализации на Coursera\u003c/a\u003e и руководителя отдела машинного обучения сервиса \u003ca href\u003d\"https://goo.gl/Pnzp7S\"\u003eЯндекс.Дзен\u003c/a\u003e). Если вы еще учитесь в школе, то вы можете послушать Евгения в \u003ca href\u003d\"https://goo.gl/0Ztkqf\"\u003eлетней школе ФКН\u003c/a\u003e; также он отвечает за преподавание машинного обучения в \u003ca href\u003d\"http://lksh.ru/sis/2017/parallel-a.shtml\"\u003eавгустовской параллели A-ML ЛКШ\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eТакже общим был курс методов оптимизации, состоявший из непрерывной части и курса по комбинаторной оптимизации от \u003ca href\u003d\"https://www.hse.ru/org/persons/7103512\"\u003eМаксима Бабенко\u003c/a\u003e, руководителя отдела технологий распределенных вычислений в Яндексе, в прошлом вице-чемпиона ACM ICPC. Среди семинаристов курса также хорошо известный вам \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Zlobober\" title\u003d\"Legendary grandmaster Zlobober\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eZ\u003c/span\u003elobober\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eСтуденты 3-го курса учились на специализациях \u003ca href\u003d\"https://www.hse.ru/ba/ami/mla\"\u003eмашинное обучение\u003c/a\u003e, \u003ca href\u003d\"https://www.hse.ru/ba/ami/ds\"\u003eраспределенные системы\u003c/a\u003e, \u003ca href\u003d\"https://www.hse.ru/ba/ami/dais\"\u003eанализ данных и интеллектуальные системы\u003c/a\u003e, \u003ca href\u003d\"https://www.hse.ru/ba/ami/adm\"\u003eанализ и принятие решений\u003c/a\u003e. В этом году второкурсники также смогли выбрать \u003ca href\u003d\"https://www.hse.ru/ba/ami/ti\"\u003eспециализацию по теоретической информатике\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eРадует, что уровень поступающих к нам каждый год растёт. Это ясно и из отзывов преподавателей, и из результатов поступивших к нам абитуриентов на школьных олимпиадах. Каждый год мы заметно повышаем требования для поступления по олимпиадам, и несмотря на это, каждый год у нас происходит перенабор из-за поступающих олимпиадников. Кстати, у нас ежегодно проходят встречи в Яндексе с победителями всероссийских олимпиад, и вот видео последних двух встреч: \u003ca href\u003d\"https://youtu.be/fzCodASHfZw\"\u003e1\u003c/a\u003e, \u003ca href\u003d\"https://youtu.be/JIpCOT5Jl4s\"\u003e2\u003c/a\u003e. Далее я расскажу про новости по направлениям: наука, работа в индустрии и проекты с компаниями, магистратура, онлайн-образование. А если вам понравится, информацию о поступлении на факультет вы можете найти в конце поста.\u003c/p\u003e\u003ch1\u003eНаука\u003c/h1\u003e\u003cp\u003eОдним из главных направлений нашего факультета является машинное обучение. Две главные ежегодные конференции в мире по машинному обучению — это \u003ca href\u003d\"http://nips.cc\"\u003eNIPS\u003c/a\u003e и \u003ca href\u003d\"http://icml.cc\"\u003eICML\u003c/a\u003e. Это конференции уровня высшего уровня A*, куда попасть со статьей или постером сложнее всего, и где публикуют главные прорывы года в машинном обучении. В 2016-2017 году 6 статей сотрудников и студентов ФКН попали на NIPS и 3 — на ICML (частично в основной трек конференций, частично — на воркшопы). Кстати, немаловажную роль в этом \u003ca href\u003d\"https://cs.hse.ru/en/bayesgroup/main_publications\"\u003eсыграла\u003c/a\u003e анонсированная ранее \u003ca href\u003d\"https://cs.hse.ru/en/big-data/bayeslab/\"\u003eмеждународная лаборатория байесовских методов в глубинном обучении\u003c/a\u003e под руководством \u003ca href\u003d\"https://www.hse.ru/staff/dvetrov\"\u003eДмитрия Ветрова\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eВ этом году один сотрудник ФКН стал академиком РАН (\u003ca href\u003d\"https://www.hse.ru/org/persons/80974798\"\u003eЮрий Попков\u003c/a\u003e) и двое — членами-корреспондентами (\u003ca href\u003d\"https://www.hse.ru/org/persons/202722706\"\u003eЮрий Аветисян\u003c/a\u003e и \u003ca href\u003d\"https://www.hse.ru/org/persons/168072715\"\u003eВладимир Протасов\u003c/a\u003e). В марте три заявки факультета были поддержаны грантами РНФ, и победившие научные группы обеспечены финансированием на 2017-2019 гг. с возможностью продления еще на два года.\u003c/p\u003e\u003cp\u003eКроме того, мы радуемся успехам наших молодых студентов, которые только начинают прикасаться к науке. В этом году шестеро студентов бакалавриата ФКН, все — из новых наборов, 2 и 3 курс,— прошли на научные стажировки в \u003ca href\u003d\"https://www.epfl.ch/index.en.html\"\u003eEcole Polytechnique Federale de Lausanne\u003c/a\u003e — один из лучших университетов Европы, \u003ca href\u003d\"https://www.topuniversities.com/universities/ecole-polytechnique-fédérale-de-lausanne-epfl\"\u003eномер 14\u003c/a\u003e в мировом рейтинге. Стажировки в Яндексе, Google, Facebook и др., о которых я напишу ниже, уже стали обычным делом для наших студентов, многие на них ездят даже после первого курса, а вот научные стажировки — это новое и не менее значимое для нас направление. Из России традиционно мало людей ездят на такие стажировки, но это очень важно для развития науки и для появления ученых международного уровня. Только благодаря научному руководителю и связям в научном мире можно разобраться, какие направления и проблемы актуальны во всем мире, а в России, к сожалению, исчезающе мало научных руководителей в области компьютерных наук, которые могут с этим помочь. Мы прикладываем усилия к тому, чтобы таких людей становилось больше, причем, из молодых активных исследователей. К примеру, с сентября на ФКН выходит работать \u003ca href\u003d\"https://scholar.google.com/citations?user\u003dR9MXY8wAAAAJ\u0026amp;hl\u003dru\"\u003eАнтон Осокин\u003c/a\u003e. Также у нас работают международные специалисты \u003ca href\u003d\"https://www.hse.ru/org/persons/133709471\"\u003eКентан Пари\u003c/a\u003e (Франция, с 2014), \u003ca href\u003d\"https://www.hse.ru/staff/gdecrouez\"\u003eЖофри Декруэ\u003c/a\u003e (Франция-Австралия, с 2014), \u003ca href\u003d\"https://www.hse.ru/staff/akerteszfarkas\"\u003eАттила Кертес-Фаркаш\u003c/a\u003e (Венгрия-США, c 2015), \u003ca href\u003d\"https://www.hse.ru/org/persons/160550073\"\u003eБруно Баувенс\u003c/a\u003e (Бельгия-Франция, с 2015). Антон Осокин будет читать лекции по глубинному обучению, а Кентан Пари и Бруно Баувенс — по теории статистического обучения.\u003c/p\u003e\u003cp\u003eРегулярно проходят \u003ca href\u003d\"https://cs.hse.ru/colloquium\"\u003eнаучный коллоквиум ФКН\u003c/a\u003e и \u003ca href\u003d\"https://cs.hse.ru/lab\"\u003eлабораторная ФКН\u003c/a\u003e по широкому спектру тем. На факультете прошли мини-курсы \u003ca href\u003d\"https://www.hse.ru/org/persons/150293981\"\u003eЮрия Нестерова\u003c/a\u003e (известнейший ученый в области методов оптимизации, Nesterov\u0027s accelerated gradient descent упоминается в огромном количестве публикаций по нейросетям и другим направлениям в машинном обучении), \u003ca href\u003d\"http://pub.ist.ac.at/~chl/\"\u003eКристофа Ламперта\u003c/a\u003e (IST Austria), \u003ca href\u003d\"http://rutcor.rutgers.edu/~gurvich/\"\u003eВладимира Гурвича\u003c/a\u003e (Rutgers University), \u003ca href\u003d\"http://ttic.uchicago.edu/~yury/\"\u003eЮрия Макарычева\u003c/a\u003e (University of Chicago), \u003ca href\u003d\"https://www.microsoft.com/en-us/research/people/yekhanin/\"\u003eСергея Еханина\u003c/a\u003e (Microsoft Research), \u003ca href\u003d\"http://users.sussex.ac.uk/~nq28/\"\u003eНови Квадрианто\u003c/a\u003e (University of Sussex), \u003ca href\u003d\"https://brunoloff.wordpress.com\"\u003eБруно Лоффа\u003c/a\u003e (University of Porto), \u003ca href\u003d\"https://cse.sc.edu/~fenner/\"\u003eСтивена Феннера\u003c/a\u003e (The University of South Carolina). Также у нас регулярно проходят конференции по теоретической информатике (\u003ca href\u003d\"https://cs.hse.ru/big-data/problems_tcs2015/\"\u003e1\u003c/a\u003e, \u003ca href\u003d\"https://cs.hse.ru/big-data/tcs-lab/tcs2016\"\u003e2\u003c/a\u003e, \u003ca href\u003d\"https://cs.hse.ru/big-data/tcs-lab/ptcs2016/\"\u003e3\u003c/a\u003e, \u003ca href\u003d\"https://cs.hse.ru/big-data/tcs-lab/cccdp/\"\u003e4\u003c/a\u003e), на которых уже выступали двое из девяти лауреатов \u003ca href\u003d\"https://ru.wikipedia.org/wiki/Премия_Неванлинны\"\u003eпремии Неванлинны\u003c/a\u003e.\u003c/p\u003e\u003ch1\u003eИндустрия и проекты с компаниями\u003c/h1\u003e\u003cp\u003eТ.к. ФКН ВШЭ — факультет, создаваемый совместно Яндексом и ВШЭ, естественно, что многие студенты факультета работают или стажируются в Яндексе. Так, на данный момент в Яндексе когда-либо работало около 100 студентов ФКН, из них более 25 человек — студенты новых наборов, т.е. не выше 3-го курса. Могу добавить от себя, что когда я в очередной раз набирал людей в Yandex Data Factory, одну из самых крутых команд в Яндексе, занимающихся машинным обучением, и к нам подало заявки несколько 3-курсников ФКН, только что прошедших курс Евгения Соколова по машинному обучению, то оказалось, что все они значительно сильнее типичных кандидатов на эту позицию. Кое-кто даже получил от нас предложение о работе вместе с предупреждением, что лучше бы им все же так рано не начинать работать, а хорошо доучиться на ФКН, после чего за ними будут бегать работодатели, а их потолок возможностей значительно вырастет, и студенты вняли нашим призывам, решили пока продолжить обучение без совмещения с работой.\u003c/p\u003e\u003cp\u003eНаши студенты регулярно стажируются также и в \u003ca href\u003d\"https://www.hse.ru/news/edu/163159024.html\"\u003eFacebook\u003c/a\u003e, \u003ca href\u003d\"https://www.hse.ru/news/edu/194993974.html\"\u003eGoogle\u003c/a\u003e и \u003ca href\u003d\"https://www.hse.ru/news/keywords/23408954/\"\u003eдругих\u003c/a\u003e международных компаниях и университетах.\u003c/p\u003e\u003cp\u003eНа факультете регулярно проходит IT-лекторий — выступления представителей компаний, и в этом году были представители Яндекса, Google Research, Samsung, Parallels, Opera, Банка Открытие и др.\u003c/p\u003e\u003cp\u003eЧто особенно приятно, коммерческие компании заказывают нам научно-исследовательскую работу (НИР) по своей тематике с целью получения прорывных результатов. Например, для Сбербанка проводятся исследования по моделям кредитного скоринга и приложениям обучения с подкреплением (Reinforcement Learning), для Шлюмберже — аналитика продуктивности нефтяных скважин, для Самсунга — исследования глубоких нейронных сетей для встроенного в устройства искусственного интеллекта. Это показывает значительно более высокий уровень, чем просто работа студентов факультета в этих компаниях, т.к. в рамках НИР они гарантированно работают на переднем крае науки и индустрии.\u003c/p\u003e\u003cp\u003eКроме того, мы предоставляем возможность части студентов попробовать себя в рамках учебы в настоящих \u003ca href\u003d\"http://wiki.cs.hse.ru/Категория:Командная_проектная_работа/По_семестрам/Осень_2016\"\u003eкомандных проектах\u003c/a\u003e для компаний уже на третьем курсе. В этом году в таких проектах поучаствовало около 50 3-курсников ФКН, реальные проекты предлагали компании Yandex Data Factory, SAP, Тинькофф, КРОК, Рамблер, OpenDev, Open TRM, Iponweb, TeleNotify, Smartan. Компании непосредственно заинтересованы в результатах проектов и выделяют на каждый проект ментора — сотрудника компании, под руководством которого команда студентов выполняет заказанный проект.\u003c/p\u003e\u003ch1\u003eМагистратура\u003c/h1\u003e\u003cp\u003eВ этом учебном году на факультете стартовала магистерская программа \u003ca href\u003d\"http://bit.ly/1TzOiKU\"\u003e«Анализ данных в биологии и медицине»\u003c/a\u003e под руководством \u003ca href\u003d\"https://ru.wikipedia.org/wiki/%D0%93%D0%B5%D0%BB%D1%8C%D1%84%D0%B0%D0%BD%D0%B4,_%D0%9C%D0%B8%D1%85%D0%B0%D0%B8%D0%BB_%D0%A1%D0%B5%D1%80%D0%B3%D0%B5%D0%B5%D0%B2%D0%B8%D1%87\"\u003eМихаила Гельфанда\u003c/a\u003e, одного из главных специалистов в России в области биоинформатики. А в следующем году мы расширяемся и в область финансов: на ФКН открывается магистратура \u003ca href\u003d\"https://www.hse.ru/news/admission/206134196.html\"\u003e«Финансовые технологии и анализ данных»\u003c/a\u003e совместно со Сбербанком. Также в 2017-м году будет первый набор на совместную магистратуру ФКН ВШЭ и Сколтеха \u003ca href\u003d\"https://www.hse.ru/news/admission/198915199.html\"\u003e«Статистическая теория обучения»\u003c/a\u003e. На программе ПИ открывается магистратура \u003ca href\u003d\"https://www.hse.ru/news/edu/205958772.html\"\u003e«Системное программирование»\u003c/a\u003e.\u003c/p\u003e\u003ch1\u003eОнлайн-образование\u003c/h1\u003e\u003cp\u003eВозможно, вы уже \u003ca href\u003d\"//codeforces.com/blog/entry/44924\"\u003eчитали\u003c/a\u003e, что в прошлом году полностью запустилась совместная \u003ca href\u003d\"https://goo.gl/oOX215\"\u003eспециализация по алгоритмам\u003c/a\u003e от ФКН ВШЭ и University of California, San Diego. В декабре прошлого года мы выиграли конкурс Coursera по подготовке еще двух специализаций — Introduction to Discrete Math for Computer Science и Advanced Machine Learning. В подготовке первой из них участвуем мы с Сашей Куликовым, т.к. эта специализация подготавливает слушателей к нашей специализации по алгоритмам. Вторую — advanced machine learning — готовит широкий коллектив авторов, включая часть авторов специализации \u003ca href\u003d\"https://goo.gl/1nf8KS\"\u003e\u0026quot;Машинное обучение и анализ данных\u0026quot;\u003c/a\u003e, многих сотрудников Яндекса, нескольких человек из самого топа мирового рейтинга \u003ca href\u003d\"https://www.kaggle.com\"\u003eKaggle\u003c/a\u003e, включая недавнего чемпиона мира Станислава Семёнова, а также сотрудников лаборатории \u003ca href\u003d\"https://cs.hse.ru/lambda/\"\u003eLAMBDA\u003c/a\u003e на ФКН, много лет сотрудничающих с физиками из Церна, где установлен Большой Адронный Коллайдер. Эта новая специализация значительно глубже всех существующих онлайн-курсов по машинному обучению и сопоставима с несколькими курсами ШАД. В специализации будут курсы по глубоким нейросетям, по тому как выигрывать соревнования на Kaggle, по байесовским методам, по компьютерному зрению, обработке естественных языков и по применению машинного обучения для анализа данных Большого Адронного Коллайдера. В конце каждого курса специализации слушателей ждет увлекательный проект, выполняя который они смогут применить свои знания в актуальных задачах. Кстати, если вам интересно машинное обучение в физике высоких энергий, обратите внимание на нашу ежегодную \u003ca href\u003d\"https://cs.hse.ru/lambda/news/204930592.html\"\u003eмеждународную летнюю школу\u003c/a\u003e по этому направлению, в этом году она пройдет в Англии.\u003c/p\u003e\u003cp\u003eВ июле стартует специализация \u003ca href\u003d\"https://www.coursera.org/learn/mobile-interaction-design\"\u003eMobile Interaction Design\u003c/a\u003e, созданная силами программы \u003ca href\u003d\"https://www.hse.ru/ba/se/\"\u003eПрограммной Инженерии ФКН\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eКроме продвинутых специализаций мы создаем курсы, которые могут помочь школьникам и студентам младших курсов изучить язык программирования или подтянуть свой уровень. Уже давно на платформе \u003ca href\u003d\"http://welcome.stepik.org/ru\"\u003eStepik\u003c/a\u003e есть \u003ca href\u003d\"https://goo.gl/fu1z2z\"\u003eкурс Михаила Густокашина по C++\u003c/a\u003e, а недавно вышел его же \u003ca href\u003d\"https://goo.gl/6DfnbD\"\u003eкурс по Python\u003c/a\u003e. Михаил читает в 1-м модуле 1-го курса ФКН курс по программированию на Python.\u003c/p\u003e\u003ch1\u003eПоступление\u003c/h1\u003e\u003cp\u003eДля тех, кому интересно поступление на наш факультет, отмечу, что с этого учебного года льготы для победителей олимпиад публикуются значительно раньше, осенью, и вот \u003ca href\u003d\"https://goo.gl/jm969S\"\u003eльготы\u003c/a\u003e этого года для всех образовательных программ, отдельно про \u003ca href\u003d\"https://goo.gl/5RqwBD\"\u003eвсероссийскую олимпиаду\u003c/a\u003e, \u003ca href\u003d\"https://ba.hse.ru/entr2017\"\u003eсхема поступления\u003c/a\u003e, ежегодно эта информация появляется на \u003ca href\u003d\"https://ba.hse.ru\"\u003ehttps://ba.hse.ru\u003c/a\u003e. Если есть вопросы — пишите в комментариях или личным сообщением.\u003c/p\u003e\u003c/div\u003e","tags":["фкн","вшэ","machine learning","факультеты","куда поступать","поступление","информатика","биоинформатика","машинное обучение","онлайн-обучение","coursera"]}}