{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1517344459,"rating":103,"authorHandle":"andrewzta","modificationTimeSeconds":1517480286,"id":57449,"title":"\u003cp\u003eСириус — мартовская смена\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eВ марте центре Сириус пройдет смена по олимпиадной информатике. Информация о смене выложена на сайте центра: \u003ca href\u003d\"https://sochisirius.ru/obuchenie/nauka/smena145/620\"\u003ehttps://sochisirius.ru/obuchenie/nauka/smena145/620\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЭта смена будет ориентирована на начинающих школьников, впервые попавших на Всерос или не становившихся ранее призерами. Точные критерии опубликованы на сайте: от тех регионов, которые в прошлом году были представлены 10 или более школьниками, приглашаются участники, которые не были в прошлом году на заключительном этапе, а от остальных регионов — те, кто в прошлом году не был призером или победителем. Школьники из 11 класса не могут принять участие в смене.\u003c/p\u003e\u003cp\u003eОтбор среди тех, кто может принять участие в смене, производится по баллам на региональном этапе. Если у вас на региональном этапе хотя бы 500 баллов, и вы подходите под критерии, мы рекомендуем подать заявку в смену прямо сейчас (можно подать заявку и с меньшим числом баллов, но шансов на зачисление меньше). Кроме того, от регионов, где никто не проходит на Всерос (ориентировочно 550-600 баллов, в зависимости от класса), приглашается по одному участнику не старше 9 класса, при условии что именно этот участник будет представлять регион на заключительном этапе.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e Поскольку эта смена пересекается с \u003ca href\u003d\"http://olympiads.ru/zaoch\"\u003eзаключительным этапом Открытой олимпиады\u003c/a\u003e, в Сириусе будет организована площадка, все участники смены, прошедшие в заключительный этап Открытой олимпиады, смогут принять в нем участие прямо в центре.\u003c/p\u003e\u003cp\u003eУдачи всем и до встречи в Сириусе!\u003c/p\u003e\u003c/div\u003e","tags":[]}}