{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1466782104,"rating":0,"authorHandle":"VastoLorde95","modificationTimeSeconds":1466782104,"id":45633,"title":"\u003cp\u003eHints for Week 3\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch2\u003eA. Mr. Kitayuta, the Treasure Hunter\u003c/h2\u003e\u003cp\u003eDP.\u003c/p\u003e\u003cp\u003edp[i][j] \u003d max number of gems you can collect from the first i islands if you finish at island number i with a jump length of j\u003c/p\u003e\u003cp\u003eTry to prove that you wont need more than 500 values of j.\u003c/p\u003e\u003ch2\u003eB. Maximum Xor Secondary\u003c/h2\u003e\u003cp\u003eUse the stack to compute the first element to the right of each index i that is just greater than a[i]. Let\u0027s call the index of such an element j.\u003c/p\u003e\u003ch2\u003eR2D2 and Droid Army\u003c/h2\u003e\u003cp\u003eGreedy. You need to implement a sliding window algorithm over each type of weapon for a droid. Implement this sliding window using the queue using 2 stacks trick.\u003c/p\u003e\u003ch2\u003eNon-Secret Cypher\u003c/h2\u003e\u003cp\u003eYou need to use a queue where in you push elements to the end of the queue if the frequency of all elements in the queue is less than K. Once the frequency of at least one element becomes K, let\u0027s say at index i, pop elements from the Q till the frequency is K and add n-i+1 for each pop.\u003c/p\u003e\u003ch2\u003eMaximum Submatrix 2\u003c/h2\u003e\u003cp\u003eDP and counting sort.\u003c/p\u003e\u003cp\u003edp[i][j] \u003d maximum horizontal sequence of 1\u0027s that ends at column j of row i. This will be the lengths of the submatrix\u003c/p\u003e\u003cp\u003eFor each j from 1 to n, sort dp[i][j] for i from 1 to n using counting sort. If dp[k][j] is the length of the desired submatrix, then we can rearrange the rows so that all rows with dp[k\u0027][j] \u0026gt;\u003d dp[k][j] are together. Then the area for the submatrix will be dp[k][j] * (# of rows with dp[k\u0027][j] \u0026gt;\u003d dp[k][j])\u003c/p\u003e\u003c/div\u003e","tags":[]}}