{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1457336514,"rating":6,"authorHandle":"Amur4ik","modificationTimeSeconds":1457336514,"id":43629,"title":"\u003cp\u003eЗадача на ДП\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, сообщество! Имеется следующая задача: Вася хочет пересечь лес, в котором полно зверей. Каждый зверь характеризуется своей грозностью di. Вася не собирается с ними воевать, он будет использовать свою суперспособность, которая позволяет переманивать зверей на свою сторону. Для того, чтобы переманить зверя, ему нужно использовать ci единиц энергии. ci может быть либо 1, либо 2. В начале, Вася заходит в лес один. Когда он встречает очередного зверя, он может его переменить. Если Вася не переманит зверя, то зверь убьет Васю. Зверь нападет на Васю, если только его грозность строго больше суммарной грозности тех зверей, кого Вася переманил на свою сторону. Конечно же, Вася хочет минимизировать затраты энергии. Вот это минимальное количество энергии и нужно посчитать. Например, пусть есть 3 зверя, (5, 1), (4, 2), (6, 1). Вначале, Вася идет один, и первого зверя ему нужно переманить в любом случае. После переманивания, общая грозность его компании составляет 5 единиц. Второго зверя Вася пропускает, т.к. он на него все равно не нападет, а вот третьего ему нужно переманить, т.к. его грозность больше, чем 5. Итого — за 2 единицы энергии Вася может перейти через лес. \u003c/p\u003e\u003cp\u003eСейчас решаю так: Пусть cost[0][i] — минимальная стоимость, если зверь i был переманен, а cost[1][i] — если зверь i был пропущен. str[0][i] — максимальная грозность, которую можно набрать, за i зверей, если i-ый зверь был переманен, и str[1][i] — если i-ый зверь был пропущен.\u003c/p\u003e\u003cp\u003eИ сама \u0026quot;динамика\u0026quot;. Когда пробую переманить iого зверя:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eif (cost[0][i - 1] \u003d\u003d cost[1][i - 1]) {\n  cost[0][i] \u003d cost[0][i - 1] + c[i];\n  str[0][i] \u003d calc_max(str[0][i - 1] , str[1][i - 1]) + d[i];\n} else if (cost[0][i - 1] \u0026lt; cost[1][i - 1]) {\n  cost[0][i] \u003d cost[0][i - 1] + c[i];\n  str[0][i] \u003d str[0][i - 1] + d[i];\n} else {\n  cost[0][i] \u003d cost[1][i - 1] + c[i];\n  str[0][i] \u003d str[1][i - 1] + d[i];\n}\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eИ пытаюсь его пропустить: \u003c/p\u003e \u003cpre\u003e\u003ccode\u003eif (d[i] \u0026gt; str[0][i - 1] \u0026amp;\u0026amp; d[i] \u0026gt; str[1][i - 1] \u0026amp;\u0026amp; str[1][i - 1] !\u003d INF) continue;\n\nif (d[i] \u0026lt;\u003d str[0][i - 1]) {\n\tstr[1][i] \u003d str[0][i - 1];\n\tcost[1][i] \u003d cost[0][i - 1];\n}\nif (str[1][i - 1] !\u003d INF) {\n\tif (d[i] \u0026lt;\u003d str[1][i - 1]) {\n\t\tif (cost[1][i - 1] \u0026lt; cost[1][i] || (cost[1][i - 1] \u003d\u003d cost[1][i] \u0026amp;\u0026amp; str[1][i - 1] \u0026gt; str[1][i])) {\n\t\t\tcost[1][i] \u003d cost[1][i - 1];\n\t\t\tstr[1][i] \u003d str[1][i - 1];\n\t\t}\n\t}\n}\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eОтветом, будет являться минимум в последнем столбце. \u003c/p\u003e\u003cp\u003eНо что-то здесь не так, потому что решение не набирает полный балл. Прошу помощи у знающих, буду рад любым наводкам и уточнениям. Спасибо :)\u003c/p\u003e\u003c/div\u003e","tags":["dp","динамика"]}}