{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1480584159,"rating":68,"authorHandle":"MikhailRubinchik.ru","modificationTimeSeconds":1480589687,"id":48750,"title":"\u003cp\u003eСистемные проблемы NEERC 2016\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eЯ традиционно пишу перед полуфиналом посты о каких-то проблемах и решениях, связанных с организацией NEERC. В прошлом году я, например, \u003ca href\u003d\"//codeforces.com/blog/entry/21947\"\u003eделился опытом кволов\u003c/a\u003e, в позапрошлом рассказывал об \u003ca href\u003d\"//codeforces.com/blog/entry/14640\"\u003eидее кволов\u003c/a\u003e, а ещё за год до этого \u003ca href\u003d\"//codeforces.com/blog/entry/9727\"\u003eжаловался\u003c/a\u003e на плохие правила распределения квот. Что интересно, в этом году правила квот, наконец, \u003ca href\u003d\"http://neerc.ifmo.ru/information/selection-rules.html\"\u003eформализовали и немного изменили\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eСегодня я бы хотел поделиться с сообществом своими переживаниями о других проблемах, которые существуют (на мой взгляд) в NEERC. \u003c/p\u003e\u003cp\u003eМногие мои соображения исходят из тезиса “АСМ должен быть как можно доступней”. Этот тезис не мой, а Билла Паучера, но я его полностью разделяю. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003e1.Отсутствие АСМ в Таджикистане и Туркменистане\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eЯ уже немного начал решать этот вопрос. Этот \u003ca href\u003d\"//codeforces.com/blog/entry/22817\"\u003eпост\u003c/a\u003e — первая попытка. К сожалению, пока неудачная. В этом году я связался с ребятами из Туркменистана. Сходу удалось найти только школьников и они подали заявку на вкошп. Вы можете уже найти их в \u003ca href\u003d\"http://neerc.ifmo.ru/school/russia-team/listTeamsFinal.jsp\"\u003eсписках\u003c/a\u003e. Связался я довольно поздно и не факт, что ребята успеют сделать визы. Но возможно, в следующем году в Туркменистане уже появится свой отбор на вкошп и свой чф. Во всяком случае я надеюсь на такой исход и в Туркменистане, и в Таджикистане. \u003c/p\u003e\u003cp\u003eВообще, я в большинстве случаев мыслю не в масштабах NEERC, а в масштабах АСМ. И если руководство NEERC не создаст АСМ в этих странах, то возможно это сделают другие полуфиналы из азии. Но может и нет. И моё основное желание конечно же в том, чтоб АСМ в этих странах появился. С другой стороны я всё-таки патриотичен и для меня более хорошее решение — это появление четвертьфиналов NEERC в этих двух странах. Кроме того я считаю, что несмотря на имеющиеся проблемы структура NEERC лучше структур всех остальных полуфиналов (Кстати, Билл Паучер с этим согласен, он говорил об этом со сцены на финал АСМ в Екатеринбурге).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e2.Отсутствие кволов\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eОтсутствие кволов создаёт очень высокий порог входа для новых вузов. \u003c/p\u003e\u003cp\u003eУ нас некоторые отвечали: что нам ехать на чф, мы там проиграем. А с введением кволов некоторые из таких вузов прошли на чф и поехали, ведь они уже знали, что они обогнали очень многих на кволах и могли показать бумагу об этом руководству. Кажется, что кволы не нужны только московскому чф ввиду маленькой площади и метро. Однако с точки зрения гарантированности одинаковых условий для Москвы конечно всё равно нужны кволы (но организаторы могут конечно часто забивают на необходимость одинаковых условий).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e3.Оргвзнос мешает росту числа команд\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eЯ точно знаю, что оргвзноса нет на урале и нет в Москве. Можете написать в комментариях, где ещё присутствуют или отсутствуют оргвзносы? Мне кажется, идеальная ситуация: ни на одном чф нет оргвзноса. Но в целом при появлении кволов приемлемая ситуация: на кволах нет оргвзноса, а на чф есть. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003e4. Лимиты на число команд от вуза на чф\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eНа сколько я знаю, в некоторых четвертьфиналах, по-прежнему, действуют правила, запрещающие одному вузу выставлять больше 4-5 команд. Это правило конечно же вредное, т.к. уменьшает доступность АСМа и идёт в разрез с правилами полуфинала. Получается организаторы полуфинала предоставляют возможность вузам получить доп.квоты, а организаторы четвертьфинала мешают этому. \u003c/p\u003e\u003cp\u003eОпять же при наличии кволов с большим числом площадок такая проблема исчезает. ЧелГУ и ЮУрГУ было тесно в ЮУрГУ в прошлом году? ЧелГУ в этом году открыл свою площадку, а ЮУрГУ на своей площадке привёл огромное число своих команд.\u003c/p\u003e\u003cp\u003eВ этом году на питерском чф СПбГУ привели около 30 команд. В итоге на чф у них было около 100 команд, а в итмо это около предела. Во всяком случае на пф готовы брать не более 100 с небольшим команд. Были бы кволы и площадка в СПбГУ, могли бы привести столько, сколько захотели. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003e5.Наличие многосайтовых чф и пф\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eВсе мы видели историю с читерством на пф в прошлом и позапрошлом году. И наверное всем из нас это не понравилось. Кажется, что такую проблему нужно решать. Идеально решение с точки зрения этой цели — это односайтовый пф, но тут нужно очень аккуратно, чтоб не навредить цели “доступности АСМа”. Может быть отправка большего числа наблюдателей или выдача наблюдателям больших полномочий решила бы такой вопрос. \u003c/p\u003e\u003cp\u003eАналогичная (но ещё хуже) ситуация в этом году была в чф Узбекистана из-за онлайнового проведения. Более того в Новосибирске на чф так было вообще всегда. Я считаю такую ситуацию недопустимой. \u003c/p\u003e\u003cp\u003eМы, чтобы избежать такого, пошли по пути создания кволов вместо многосайтового чф. \u003c/p\u003e\u003cp\u003eКволы — многосайтовое соревнование с большим числом площадок. При всём желании мы не можем полноценно доверять всем площадкам. Там могут быть читерства, которые не отследить, там может быть плохая организация из-за которой страдают команды. А значит результатам мы не можем полноценно доверять. И брать на полуфинал по таким результатам не хотим. Ведь мы несём ответственность перед организаторами полуфинала за результаты, а здесь мы полноценно не можем ничего гарантировать. \u003c/p\u003e\u003cp\u003eПоэтому мы берём с кволов на чф очень много команд (около 90-100 команд), а уже на чфе отбираем команды на пф. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003e6.Нарезка на четвертьфиналы сложилась исторически и теперь сохраняется статус-кво\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eТекущие четвертьфиналы появились ещё в прошлом веке и никто ни разу публично не говорил о том, как могут они меняться и могут ли. По факту мелкие изменения происходят (Орёл, как я понимаю, переходил из южного в центральный). Почему я считаю, что плохо здесь держать статус-кво? По той же причине доступности АСМа. Например, Сыктывкару довольно далеко ехать до Екатеринбурга, а Екатеринбург участвует дома. Мы почти закрыли эту проблему для нашего чф кволами, но всё равно людям надо тратить деньги на 1-2 команды и ехать целые сутки. Возможно, что ещё где-то есть такие проблемы. Будет здорово, если напишут люди, которые считают, что едут слишком долго или слишком дорого. Я считаю, что приемлемый вариант: вечером сел, утром приехал, остальные уже похуже. Я пока не думал о решении этой проблемы и предлагаю только сообществу задуматься, есть ли такая проблема или нет. \u003c/p\u003e\u003cp\u003eВозможно, что было бы неплохим решением создать новые четвертьфиналы для наиболее удалённых мест.\u003c/p\u003e\u003cp\u003eЕсли вы видите в neerc другие проблемы, пишите об этом :) \u003c/p\u003e\u003cp\u003eНу и если у вас есть комментарии к перечисленным проблемам, тоже было бы здорово увидеть их.\u003c/p\u003e\u003c/div\u003e","tags":[]}}