{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1435960655,"rating":175,"authorHandle":"MakeRussiaGreatAgain","modificationTimeSeconds":1435960655,"id":19066,"title":"\u003cp\u003eЯндекс.Алгоритм 2015: согласие финалиста\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eНедавно мне, как финалисту Яндекс.Алгоритма, пришло письмо с \u003ca href\u003d\"https://yadi.sk/i/nEbaUdn6haQb2\"\u003eдокументом\u003c/a\u003e, который мне предлагается подписать (\u003ca href\u003d\"https://yadi.sk/i/EEBUbMcohaQHZ\"\u003eанглийская версия\u003c/a\u003e). Насторожило меня уже то, как выглядит этот файл в их же собственном просмотровщике:\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://docviewer.yandex.ru/?url\u003dya-disk-public%3A%2F%2FiDi11rKzlK3yEBHR5p%2F7Dh9%2BCn6FRIzPOJ6aJrTYEiQ%3D\u0026amp;name\u003d%D0%A1%D0%BE%D0%B3%D0%BB%D0%B0%D1%81%D0%B8%D0%B5.doc\"\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/63/23/6323f65b0e1ddd96a36be452c5fce003b7d10a2e.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eВпрочем, если сохранять файл в формате, который правильно отображает только одна программа, такой результат вполне ожидаем.\u003c/p\u003e\u003cp\u003eСодержимое меня, однако, опечалило. Вы там в Яндексе вообще читаете то, что предлагаете нам подписать? Или думаете, что мы, финалисты, подмахнём, не глядя? А то уже в первом пункте:\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003e1.я ознакомлен и согласен с Положением о конкурсе «Яндекс.Алгоритм-2015», размещенным в сети интернет по адресу: \u003ca href\u003d\"http://algorithm.contest.yandex.ru/terms/\"\u003ealgorithm.contest.yandex.ru/terms/\u003c/a\u003e (далее — «Положение»)\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eНу предположим, что то, что предложения обычно начинают с заглавной буквы, можно на время проигнорировать. Кому они нужны, эти правила? Больше беспокоит то, что по указанному адресу находится страница с ошибкой 404. Согласен ли я с тем, что там написано? Не уверен. Продолжим:\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eа также с Правилами конкурса «Яндекс.Алгоритм-2015», содержащими условия и правила проведения мероприятия – конкурса «Яндекс.Алгоритм-2014», проводимого ООО «ЯНДЕКС» (далее – Организатор) в срок с 21 апреля 2015 года по 6 августа 2015 года (далее- «Конкурс») по адресу: \u003ca href\u003d\"http://algorithm.contest.yandex.ru/\"\u003ealgorithm.contest.yandex.ru\u003c/a\u003e.\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eДаже не знаю, что более странно: то, что правила Яндекс.Алгоритма 2015 содержат правила Яндекс.Алгоритма 2014, или то, что Яндекс.Алгоритм 2014 проводится в 2015 году?\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003e3.В случае своей победы в Конкурсе (занятия одного из призовых мест, дающих, в соответствии с правилами проведения Конкурса, право на получение приза), я получу денежный приз, предусмотренный п. 10.3. Положения, в зависимости от занятого места.\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eСмотрим этот пункт:\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003e10.3. Победители обязаны предоставить Организатору Конкурса указанные в п. 10.2 Положения документы в течение 14 календарных дней после определения Организатором Победителей конкурса в порядке, предусмотренном п. 7.3 Положения.\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eНе очень понятно, что за денежный приз он предусматривает.\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003e4.Я осознаю, что денежный приз мне будет выплачен в российских рублях за вычетом налога на доходы физических лиц в размере _____, исчисленного в соответствии со ст. 224 Налогового Кодекса РФ.\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eЭто вообще что, проверка того, знаю ли я налоговое законодательство? Кстати, в англоязычной версии ставку налога вписывать не нужно. Видимо, англоязычным финалистам для участия знать налоговый кодекс РФ необязательно.\u003c/p\u003e\u003cp\u003eВ общем, повнимательнее нужно относиться к документам.\u003c/p\u003e\u003c/div\u003e","tags":["яндекс.алгоритм","яндекс.алгоритм 2015","fail"]}}