{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1466338327,"rating":-16,"authorHandle":"giwoo123","modificationTimeSeconds":1466338415,"id":45534,"title":"\u003cp\u003eIntroduction to Graph\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eToday I will write basic contents about graph. Hopefully it is interesting and easy to understand.\u003c/p\u003e\u003cp\u003eChapter 1:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eThe graph we see in the daily life:  — The traffic system  — The net working  — The relation of people  — The mind map :) .  And we want to represent what we see into some kind of information. That\u0027s when we choose graph.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe graph we see in mathematics  \u0026quot;Pure math is beautiful. \u0026quot;  A graph is a pair of 2 sets --\u0026gt; G \u003d (V, E), where E belongs to V * V.  vertices are elements of V.  edges are elements of E.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eHow we use an edge?  When we want to connect 2 vertices --\u0026gt; we use an edge.  In undirected graph u --\u0026gt; v is the same as v--\u0026gt; u  But in directed graph u --\u0026gt; v !\u003d v--\u0026gt; u.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eWhat about isomorphic?  We have function V --\u0026gt; V\u0027.  And with all (u,v) is belong to V --\u0026gt; (u\u0027, v\u0027) is belong to V\u0027 too.  It save \u0026quot;graph property\u0026quot; of orginal G.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eHow do we learn Graph theory and Graph algorithm?  For the beginner like me, I prefer \u0026quot;Introduction to the Algorithm\u0026quot;, many people know it.  I found that Maximum Flow is a little harder to understand, and now I haven\u0027t understood it.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eSome interesting things when learning graph?  When we want to solve some thing, we can search for some definitions and properties, or some theories. We use it like some \u0026quot;roots\u0026quot; of the tree. Then we can BFS it.  When we use DFS, it\u0027s so cool sometimes we can DP. With my love to graph, I will write the next chapter soon.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003c/div\u003e","tags":[]}}