{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1509044853,"rating":0,"authorHandle":"acmASCIS","modificationTimeSeconds":1509044853,"id":55423,"title":"\u003cp\u003eWeek03 — Combinatorics\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003e-What is Combinatorics?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eCombinatorics is all about number of ways of choosing some objects out of a collection and/or number of ways of their arrangement.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e-Multiplication Rule\u003c/strong\u003e: If a task can be broken down into a sequence of k subtasks, where each subtask can be performed in n_1, n_2,.. n_k respectively, then the total number of ways the task can be performed is n_1 * n_2 * ... * n_k.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e-Example 1\u003c/strong\u003e – In how many ways can 3 winning prizes be given to the top 3 players in a game played by 12 players? Solution – We have to distribute 3 prizes among 12 players. This task can be divided into 3 subtasks of assigning a single prize to a certain player.\u003c/p\u003e\u003cp\u003eGiving out the first prize can be done in 12 different ways. After giving out the first prize, two prizes remain and 11 players remain. Similarly, the second prize and third prize can be given in 11 ways and 10 ways. The total number of ways by the product rule is 12 * 11 * 10 \u003d 1320.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e-Example 2-\u003c/strong\u003e How many distinct license plates there are if every license plate has three alphabets in uppercase followed by three number.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003esolution\u003c/strong\u003e -There are 26 possibilities for the each of the three letters and 10 possibilities for each of the digits. Therefore the total number of possibilities is 26*26*26*10*10*10\u003d17576000.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e-Permutation without repetition\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eWhen we choose k objects from n-element set in such a way that the order matters and each object can be chosen only once:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/a0/45/a045fd98c8eef7f4bcd29e143abbdf4b06ecbf52.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eExample\u003c/strong\u003e 1 : How many ways can 5 people sit in 3 chairs when there arrangement matter ?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSolution\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eP(5,3)\u003d5!/(5-3)!\u003d60 Ways\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eExample\u003c/strong\u003e 2 : How many 3 letter words can we make with the letters in the word LOVE? \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSolution\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eSolution: There are 4 letters in the word love and making making 3 letter words is similar to arranging these 3 letters and order is important since LOV and VOL are different words because of the order of the same letters L, O and V. Hence it is a permutation problem. The number of words is given by \u003c/p\u003e\u003cp\u003eP(4,3)\u003d4!/(4-3)!\u003d24.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCombinations without repetition\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eIn combinations we choose a set of elements (rather than an arrangement, as in permutations) so the order doesn’t matter. The number of different k-element subsets (when each element can be chosen only once) of n-element set i \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/8b/ff/8bffffa613184c9caf2f0fb2e9e42acd63438375.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eExample\u003c/strong\u003e 1 :\u003c/p\u003e\u003cp\u003eIf you have 10 balls numbered from 1 to 10 in a box ,how many ways you can choose 3 balls from the box\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSolution\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eChoosing balls number 1,2,3 is the same as choosing balls number 2,1,3. So the order doesn\u0027t matter here, So the number of ways can be calculated by C(10,3)\u003d10!/(3!*(10-3)!)\u003d120.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eExample\u003c/strong\u003e 2 :\u003c/p\u003e\u003cp\u003eIn how many ways can a group of 5 members be formed by selecting 3 boys out of 6 and 2 girls out of 5 ?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSolution\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eNumber of ways 3 boys can be selected out of 6 \u003dC(6,3)\u003d20,Number of ways 2 girls can be selected out of 5 \u003d C(5,2)\u003d10,Therefore, total number of ways of forming the group \u003d 20 x 10 \u003d 200.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eReferences\u003c/strong\u003e-\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.youtube.com/watch?v\u003dbCxMhncR7PU\u0026amp;feature\u003dyoutu.be\"\u003ehttps://www.youtube.com/watch?v\u003dbCxMhncR7PU\u0026amp;feature\u003dyoutu.be\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.khanacademy.org/math/precalculus/prob-comb/combinations/v/combination-formula\"\u003ehttps://www.khanacademy.org/math/precalculus/prob-comb/combinations/v/combination-formula\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://betterexplained.com/articles/easy-permutations-and-combinations/\"\u003ehttps://betterexplained.com/articles/easy-permutations-and-combinations/\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.mathsisfun.com/combinatorics/combinations-permutations.html\"\u003ehttps://www.mathsisfun.com/combinatorics/combinations-permutations.html\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}