{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1470620279,"rating":69,"authorHandle":"Namnamseo","modificationTimeSeconds":1470620279,"id":46461,"title":"\u003cp\u003eIOI 2016 using PCMS2?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cblockquote\u003e\u003cp\u003e\u003cstrong\u003eITC has a CMS but Russia has its own for IOI 2016.\u003c/strong\u003e (from Minutes of IC February meeting)\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003e\u003cem\u003eThought of nothing but a private fork of CMS...\u003c/em\u003e\u003c/p\u003e\u003cp\u003eHi everyone! IOI 2016 is just a few days left, hope everyone\u0027s working out all right.\u003c/p\u003e\u003cp\u003eIOI 2016 is going to use PCMS2, and I have no idea about it. The committee opened IOI 2015 virtual practice sessions (one for each day) and IOI 2016 online practice session. Testing through those, these are a few things that I noticed:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eCMS uses Bootstrap to decorate and prettify elements.\u003c/li\u003e   \u003cli\u003ePCMS2 doesn\u0027t — PCMS2\u0027s graphics looks similar to DOMjudge. It gives you just enough things for the contest, with a few background-colored texts. It does not auto-refresh (if I didn\u0027t miss something).\u003c/li\u003e   \u003cli\u003eCMS gives you the full feedback (in most of the cases it is used, including IOI); it grades your solution against every test cases, and shows you the result for each test cases — including verdict(AC/WA/TLE/MLE/RE/CE/etc.) and time \u0026amp; memory spent.\u003c/li\u003e   \u003cli\u003ePCMS2\u0027s feedback is less; its feedback for sample test cases is just like CMS, but for scored subtasks, it shows something like: \u0027Score \u003d 0; Time limit exceeded, test 95\u0027. And yet, for IOI 2015 contests, we need to \u0027Request feedback\u0027. If I press the button, it asks me if I am \u0027sure that you want to request feedback\u0027.\u003c/li\u003e   \u003cli\u003eIf I click on \u0027Monitor\u0027 button in IOI 2016 online practice session, I get logged out.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eSorry for my querulous tone. I personally like the interface and functions of CMS, and I keep finding myself comparing CMS and PCMS2.\u003c/p\u003e\u003cp\u003eI really don\u0027t mind if the buttons don\u0027t change color when hovered, or the corners of boxes are not round, or the site is not automatically refreshed. But I\u0027m really doubtful of the feedback; it might sound obvious, but I find it much better to have a full feedback, especially when looking for the mistakes I made.\u003c/p\u003e\u003cp\u003eAlso, the \u0027request feedback\u0027 feature: I can think of no other reasons for this but to use tokens, which limits the chances to \u0027request feedback\u0027. But... they won\u0027t, will they?\u003c/p\u003e\u003cp\u003eI have no experience with PCMS2, but the system seems to have been used for quite a few years. \u003ca href\u003d\"//codeforces.com/blog/entry/253\"\u003e\u003cem\u003eAt least for 6 years?\u003c/em\u003e\u003c/a\u003e Was it used (often) in other regular/large contests? If so, how was it? How was it compared to CMS?\u003c/p\u003e\u003cp\u003eThank you :D see you in a few days!\u003c/p\u003e\u003c/div\u003e","tags":["pcms2","ioi 2016"]}}