{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1421962619,"rating":1,"authorHandle":"yongwhan","modificationTimeSeconds":1422420911,"id":15956,"title":"\u003cp\u003eContest Formats\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi all,\u003c/p\u003e\u003cp\u003eI would like to share the formats of the regular contests in this group.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eDetails\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eThere will be \u003cstrong\u003eFOUR\u003c/strong\u003e contests each week.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFriday Contest\u003c/strong\u003e (CodeForces \u003cem\u003eHard\u003c/em\u003e Round) will be brought to you by \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/HidenoriS\" title\u003d\"Expert HidenoriS\"\u003eHidenoriS\u003c/a\u003e. It will consists of \u003cstrong\u003e10\u003c/strong\u003e problems drawn from CF Div. 2 D+E problems.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSaturday Contest\u003c/strong\u003e (CodeForces \u003cem\u003eEasy\u003c/em\u003e Round I) will be brought to you by \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/yongwhan\" title\u003d\"Expert yongwhan\"\u003eyongwhan\u003c/a\u003e. It will consists of \u003cstrong\u003e26\u003c/strong\u003e problems drawn from Div. 2 A+B+C problems.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSunday Contest\u003c/strong\u003e (Online Judge Round) will be brought to you by \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/yongwhan\" title\u003d\"Expert yongwhan\"\u003eyongwhan\u003c/a\u003e. It will consists of \u003cstrong\u003e10\u003c/strong\u003e problems drawn from \u003cem\u003eTimus\u003c/em\u003e OJ.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMonday Contest\u003c/strong\u003e (CodeForces \u003cem\u003eEasy\u003c/em\u003e Round II) will be brought to you by \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/yongwhan\" title\u003d\"Expert yongwhan\"\u003eyongwhan\u003c/a\u003e. It will consists of \u003cstrong\u003e26\u003c/strong\u003e problems drawn from CF Div. 2 A+B+C problems.\u003c/p\u003e\u003cp\u003eWe expect that the contest difficulty would be Friday ~ Sunday \u0026gt;\u0026gt; Saturday ~ Monday.\u003c/p\u003e\u003cp\u003eIf you follow through all the contests, you should be well on your way to becoming a \u003cstrong\u003ered coder\u003c/strong\u003e in TopCoder and CodeForces towards the end of the year, or even earlier. It is imperative that you are \u003cstrong\u003eNOT looking at editorial/solution until the contest is finished — if you do not follow this rule, you may not improve as much as you wish\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eWe will be providing you with the link to the editorial so that you can upsolve them. Remember that upsolving a problem is as crucial (if not more) as participating in the contests.\u003c/p\u003e\u003ch4\u003e\u003cstrong\u003eNote\u003c/strong\u003e\u003c/h4\u003e\u003cp\u003eIf you do not feel challenged enough by those, please let us know. We will be adjusting the difficulty as we go.\u003c/p\u003e\u003cp\u003e(Much) more to come later!\u003c/p\u003e\u003cp\u003eWish you a high rating,\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/yongwhan\" title\u003d\"Expert yongwhan\"\u003eyongwhan\u003c/a\u003e\u003c/p\u003e\u003cp\u003eP.S. If you would like to organize a contest, you are more than welcome to do so. The only rule is that, if you want to make it regular, please let \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/yongwhan\" title\u003d\"Expert yongwhan\"\u003eyongwhan\u003c/a\u003e know so that the contest could become the part of a permanent schedule.\u003c/p\u003e\u003c/div\u003e","tags":[]}}