{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1428675022,"rating":-36,"authorHandle":"konstantanter","modificationTimeSeconds":1472053901,"id":17351,"title":"\u003cp\u003eвсем привет\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВозникновение программирования как рода занятий и, особенно, как профессиональной деятельности трудно датировать однозначно.\u003c/p\u003e\u003cp\u003eПервым аналогом программируемого устройства были музыкальная шкатулка и шарманка, программа записывалась на вращающийся вал. Тот же принцип двоичной системы, как и на перфокарте: звук воспроизводился выступом на валу (\u0026quot;кулачком\u0026quot;), нет выступа – нет звука, кроме того, шарманка предусматривала смену программ и имела 6-8 запрограммированных мелодий.\u003c/p\u003e\u003cp\u003eПервым программируемым устройством принято считать жаккардовый ткацкий станок, построенный в 1804 году Жозефом Мари Жаккаром, который произвёл революцию в ткацкой промышленности, предоставив возможность программировать узоры на тканях при помощи перфокарт.\u003c/p\u003e\u003cp\u003eПервое программируемое вычислительное устройство, Аналитическую машину, разработал Чарльз Бэббидж (но не смог её построить). 19 июля 1843 года графиня Ада Августа Лавлейс, дочка великого английского поэта Джорджа Байрона, как принято считать, написала первую в истории человечества программу для Аналитической машины. Эта программа решала уравнение Бернулли, выражающее закон сохранения энергии движущейся жидкости.\u003c/p\u003e\u003cp\u003eВ своей первой и единственной научной работе Ада Лавлейс рассмотрела большое число вопросов. Ряд высказанных ею общих положений (принцип экономии рабочих ячеек памяти, связь рекуррентных формул с циклическими процессами вычислений) сохранили своё принципиальное значение и для современного программирования. В материалах Бэббиджа и комментариях Лавлейс намечены такие понятия, как подпрограмма и библиотека подпрограмм, модификация команд и индексный регистр, которые стали употребляться только в 1950-х годах.\u003c/p\u003e\u003cp\u003eОднако ни одна из программ, написанных Адой Лавлейс, никогда так и не была запущена.\u003c/p\u003e\u003cp\u003eАду Августу, графиню Лавлейс, принято считать почётным первым программистом (хотя, конечно, написание одной программы по современным меркам не может считаться родом занятий или профессиональной деятельностью). История сохранила её имя в названии универсального языка программирования «Ада».\u003c/p\u003e\u003cp\u003eПервый работающий программируемый компьютер (1941 год), первые программы для него, а также (с определёнными оговорками) первый язык программирования высокого уровня Планкалкюль создал немецкий инженер Конрад Цузе.\u003c/p\u003e\u003cp\u003eИмена людей, впервые начавших профессионально выполнять работу собственно по программированию (в отрыве от наладки аппаратуры компьютера), история не сохранила, так как поначалу программирование рассматривалось как второстепенная наладочная операция.\u003c/p\u003e\u003c/div\u003e","tags":[]}}