{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1503082475,"rating":99,"authorHandle":"whoisshihab","modificationTimeSeconds":1503097987,"id":53942,"title":"\u003cp\u003eProgramming Contest For Flood Victims in Bangladesh\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eDear programmers, \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eA large amount of areas in Bangladesh are flooded. Thousands of people are working to support the vicitms. \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eWe the competitive programmers want to help too, but through a slightly new way. \u003c/p\u003e\u003cp\u003eWe will arrange a conetst on \u003ca href\u003d\"https://toph.co/\"\u003eToph.co\u003c/a\u003e on \u003ca href\u003d\"https://goo.gl/gjNxZy\"\u003e19:00 Bangladesh Time (UTC+6 hours)\u003c/a\u003e. \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eContestants will pay a small amount of money which will directly go to the victims. \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eThis is something new, because Bangladeshi conetstants have no experience in paid online contests :p \u003cbr /\u003e We are used to do it free, whatever the contest is (ICPC regional or anything else).\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eThe scoring will be in ICPC format. \u003cbr /\u003e We personally contacted a few problem setters. \u003cbr /\u003e Still didn\u0027t get any reply. Besides they are very busy too. \u003cbr /\u003e And there are some consecutive contests in Bangladesh including \u003cstrong\u003eACM-ICPC Dhaka Site Preliminary contest\u003c/strong\u003e.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eSo we decided not to disturb them. \u003cbr /\u003e But as the event info is public we expect they can see that.\u003cbr /\u003e And if some of them ping us eagerly, we will be pleased to receive their problems. \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eSo, actually I am here to invite you to \u003cstrong\u003ehelp us providing with some problems\u003c/strong\u003e.\u003cbr /\u003e We know it\u0027s not an easy job and we have only a few days in hand. \u003cbr /\u003e But if you have some problems in your list, or if you could help writing a new one, we would be very grateful. \u003cbr /\u003e This will help the flood victims somehow.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eN.B.: We don\u0027t invite the conetstants to send money to us. They can send the money to any group, any people who will take that to the victims.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eThanks for your time :) \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.facebook.com/events/183569225517188/?active_tab\u003dabout\"\u003eFacebook Event Page\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}