{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1491910657,"rating":209,"authorHandle":"fcspartakm","modificationTimeSeconds":1492148538,"id":51534,"title":"\u003cp\u003ePolygon: updates (January — April 2017)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eIt is time to tell about the improvements in \u003ca href\u003d\"https://polygon.codeforces.com/\"\u003ePolygon\u003c/a\u003e. It is a system for the preparation of programming problems. All Codeforces rounds and many other olympiads prepared in Polygon. Everyone at any time can use this system.\u003c/p\u003e\u003ch4\u003eCommon\u003c/h4\u003e\u003cp\u003eA special fields with examples now displayed on a page with a list of files which used in problem and on checker, interactor and validator pages. It will be very useful for the new users and will help them faster understand the system.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/34/82/3482e25820f50e886b33a31ea2de0bc8927daef5.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eSome new mail notifications on change in problems ans contests have been added. Now letters are sent when you add, change or remove access to problem/contest. Besides that the option of add a special emails has been added. Letters are sent on a special mails on any changes in problem or contest. You can add the special emails for the contest on Properties/Files page (manual how to do that is under the table Contest resources/files) and for the problem on Advanced Setup page.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/f2/9e/f29ec725657a4001af8778d2a526c3b02c064142.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThe field Change Log has been added to each problem commit. This field can be found on Recent Changes page. Change Log contains information about all changes for the relevant commit (likewise with letters that are sent to users).\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/fb/de/fbdeb74969c575b2b4c9b21f5f9a4f19c3b90970.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eAlso the correct transition to the previous viewed page is realized.\u003c/p\u003e\u003ch4\u003eContests and Problems\u003c/h4\u003e\u003cp\u003eThe column Modification Time has been added to the contests page, which are available to the user. This column contains information about the last time when contest or any problem in contest has been changed.\u003c/p\u003e\u003cp\u003eNow if you added contest property you can use it in statements.ftl as contest property. The name of added property must begin from the letter and must contains only letters, digits and underlines. For example, you can add property note and use it in statements.ftl like \u003ccode\u003e${contest.note}\u003c/code\u003e.\u003c/p\u003e\u003cp\u003ePartially problems with equal problem names in a single contest have been solved. If a contest contains problems with equal names you will get a warning on the page with a list of problems which used in the contest.\u003c/p\u003e\u003cp\u003eOn the General Info page the field Contests appeared. This field contains a list of all contests which available to the user and contain this problem.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/b0/10/b010f377c69a28a79330c2b6da473f9643efc286.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThe option of adding notes has been implemented for the problems. For example, you can use it to short description of a problem difficulty. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/1d/45/1d454324a1fceb232a29e301fba25704a634b367.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThe column Warnings has been added to the page with a list of problems which used in the contest. You can see all warnings for the problem here (similarly with issued). The list of warnings updates after commit for this problem.\u003c/p\u003e\u003cp\u003eAlso the logic of deleting and restoring problems and option of grant access to the several users simultaneously have been improved.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/f0/26/f0266b9da0572357d414a768cb76f268a0d29324.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch4\u003eProblem Search\u003c/h4\u003e\u003cp\u003eThe option of searching all problems which was created by user has been added. For that you need to search problems by login of this user (i. e. by the owner login). On the search results page now always show the short description of the problem in it does not empty. Also now you can search the problems with zero revision.\u003c/p\u003e\u003ch4\u003eStatements\u003c/h4\u003e\u003cp\u003eIn the case of errors while building statements for the whole contest now display the name of the problem with error. It will help to faster find the error and fix it.\u003c/p\u003e\u003cp\u003eAlso the warnings about incorrect endings (accruals) of numerals have been added for the Russian statements. Here you can find the correct rules \u003ca href\u003d\"http://new.gramota.ru/spravka/letters/87-rubric-99\"\u003ehttp://new.gramota.ru/spravka/letters/87-rubric-99\u003c/a\u003e (on Russian).\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/29/a3/29a36fc0916940c49ce008a16ffcc84ea6876d79.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch4\u003eValidators\u003c/h4\u003e\u003cp\u003eFor the validator tests the option of adding testset and group has been implemented. It simplifies the testing of validators for the problem in which several testsets and groups are using. You can add or change the names of testset and group directly on the page of add/edit test.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/72/06/7206f196753311ec391536e698c07ebe30a5673d.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eEarlier it was impossible to run validator test if the problem does not has a checker. Now it is fixed. Also for the validators the following warnings have been added: if validator use old format registerValidation() or if validator has unnamed variables.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/a7/3d/a73dcde06a4f724d5b6e0db7a7e5a5c037cca8e9.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch4\u003eTests\u003c/h4\u003e\u003cp\u003eNow you can add/change the group name for the test directly on the page of add/edit test. Also the special logic has been implemented to tip anticipated group name and autocomplete. Errors on edit and copy tests have been fixed. The displaying of errors on preview tests has been improved. Also now you can choose the range of tests with help of the shift button.\u003c/p\u003e\u003ch4\u003eStresses\u003c/h4\u003e\u003cp\u003eThe choosing of solutions for the stress has been improved. Now there are checkboxes to choose needed (similary with tests). Also the option of сopying stress has been implemented. All copies will have equal list of the solutions. When you change solution list in a single stress it will be automatically change for the all stress-copies. Other parameters can be changed independently of other stress-copies.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/83/17/8317409a071c104fe7d97b07ce8fc26f1d870ac3.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eAlso the correct stress-testing for the interactive problems has been improved.\u003c/p\u003e\u003ch4\u003eSolutions\u003c/h4\u003e\u003cp\u003eNow you can download and delete the several number of solutions simultaneously on the Solutions page. Also the option of simultaneous editing solutions on a single page has been implemented. You can save solutions either one by one or all at once.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/1b/b5/1bb598e17e3314c274ada9552426e9203e4ade18.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch4\u003ePackages\u003c/h4\u003e\u003cp\u003eThe logic of creating packages has been improved. For example, earlier you was not be able to create a problem package with verification if before that was created a problem package without verification but for the same revision. Now it is fixed.\u003c/p\u003e\u003ch4\u003eTestlib\u003c/h4\u003e\u003cp\u003eThe useful changes were introduced also in \u003ca href\u003d\"https://github.com/MikeMirzayanov/testlib\"\u003eTestlib library\u003c/a\u003e, which supported in Polygon. You can download the new Testlib release by the link \u003ca href\u003d\"https://github.com/MikeMirzayanov/testlib/releases/tag/0.9.12\"\u003etestlib-0.9.12\u003c/a\u003e. Now in validator you can read in one line the sequences of elements which separated by spaces. The elements can be either numbers (integers or real), and strings. To read numbers you need to use the functions readInts(), readIntegers(), readLongs(), readUnsignedLongs(), readDoubles(), readReals(), readStrictDoubles() and readStrictReals(). To read strings you need to use the functions readWords(), readTokens(), readStrings() and readLines(). The result of this functions is always a vector. For example, to read \u003cspan class\u003d\"tex-span\"\u003e100\u003c/span\u003e integers in the range from \u003cspan class\u003d\"tex-span\"\u003e - 1000\u003c/span\u003e to \u003cspan class\u003d\"tex-span\"\u003e1000\u003c/span\u003e, inclusive, you need to write \u003ccode\u003einf.readInts(100, -1000, 1000, \u0026quot;a\u0026quot;)\u003c/code\u003e.\u003c/p\u003e\u003cp\u003eHere are some more examples:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003evector\u0026lt;string\u0026gt; names \u003d inf.readLines(n, \u0026quot;[a-z]{1,10}\u0026quot;, \u0026quot;names\u0026quot;);\n\nvector\u0026lt;long long\u0026gt; ids \u003d inf.readLongs(2 * n, 1LL, (long long)(1E18), \u0026quot;ids\u0026quot;);\ninf.readEoln();\n\nvector\u0026lt;int\u0026gt; p \u003d inf.readInts(n, 1, n, \u0026quot;p\u0026quot;);\nensuref(set\u0026lt;int\u0026gt;(p.begin(), p.end()).size() \u003d\u003d n, \u0026quot;p should be a permutation of 1..n\u0026quot;);\ninf.readEoln();\n\u003c/code\u003e\u003c/pre\u003e\u003ch4\u003ePolygon-cli\u003c/h4\u003e\u003cp\u003eMultiple improvements implemented in API Polygon. Now it is even more convenient to use the console client. You can learn more about it \u003ca href\u003d\"https://github.com/kunyavskiy/polygon-cli\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eSoon you will get new and new improvements! Thank you all for the attention!\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","polygon","testlib","polygon-cli"]}}