{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1406358623,"rating":73,"authorHandle":"RodionGork","modificationTimeSeconds":1518254963,"id":13198,"title":"\u003cp\u003eE-maxx translation collaboration on GitHub\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch3\u003eUpdate\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003ePLEASE NOTE\u003c/strong\u003e this post have become slightly outdated. Nowadays we have \u003cstrong\u003emore automated process\u003c/strong\u003e. So I have just remove outdated technical details and added more contemporary links.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUptodate info:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eHere is the E-maxx site in English: \u003cstrong\u003e\u003ca href\u003d\"https://e-maxx-eng.appspot.com\"\u003ehttps://e-maxx-eng.appspot.com\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eAnd still here is github project with article sources: \u003ca href\u003d\"https://github.com/e-maxx-eng/e-maxx-eng\"\u003ehttps://github.com/e-maxx-eng/e-maxx-eng\u003c/a\u003e\u003c/p\u003e\u003cp\u003eTo contribute one just needs to create PR in github, so generally one even may work in github web-interface for the whole process. Detailed instructions are here \u003ca href\u003d\"https://e-maxx-eng.appspot.com/contrib.html\"\u003ehttps://e-maxx-eng.appspot.com/contrib.html\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eOlder text follows below\u003c/em\u003e\u003c/p\u003e \u003chr /\u003e\u003ch3\u003ePreface\u003c/h3\u003e\u003cp\u003eNon-zero amount of users have suggested translating \u003ca href\u003d\"http://e-maxx.ru\"\u003eE-Maxx Algo\u003c/a\u003e to English. As far as I know some people even started translating in their blogs, though I\u0027m not aware of any attempt seeing great advance and evolution.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://codeforces.ru/blog/entry/13152#comment-179136\"\u003eThis comment\u003c/a\u003e suggested to attempt to do this in collaborative manner using github.\u003c/p\u003e\u003cp\u003eI\u0027ve created a project and pushed few files here. My idea is that we can write or improve articles in Markdown format (you know it since it is used in posts/comments on CF) using pull-requests here (at least at beginning).\u003c/p\u003e\u003cp\u003eThe results are converted HTML pages and hosted at the google appengine website.\u003c/p\u003e\u003cp\u003e\u003cem\u003eRemaining is removed to decrease bewilderment\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e","tags":["e-maxx"]}}