{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1400692841,"rating":3,"authorHandle":"Fcdkbear","modificationTimeSeconds":1400781209,"id":12367,"title":"\u003cp\u003eРазбор Тренировки 19.05.2014\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eЗадача С\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eПлохая задача на геометрию. Идея решения такая. Пусть первая точка лежит левее и ниже, чем вторая (если первая точка лежит правее — просто поменяем точки местами; если после этого она лежит выше — поменяем координаты y на противоположные, а в конце опять их поменяем). Давайте посмотрим, как будет менятся площадь в зависимости от угла между стороной и диагональю. Пусть этот угол — \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eа\u003c/i\u003e\u003c/span\u003e, длина диагонали — \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ex\u003c/i\u003e\u003c/span\u003e. Одна из сторон равна \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ex\u003c/i\u003e * \u003ci\u003ecos\u003c/i\u003e(\u003ci\u003ea\u003c/i\u003e)\u003c/span\u003e, вторая — \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ex\u003c/i\u003e * \u003ci\u003esin\u003c/i\u003e(\u003ci\u003ea\u003c/i\u003e)\u003c/span\u003e. Значит площадь равна \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ex\u003c/i\u003e * \u003ci\u003ex\u003c/i\u003e * \u003ci\u003ecos\u003c/i\u003e(\u003ci\u003ea\u003c/i\u003e) * \u003ci\u003esin\u003c/i\u003e(\u003ci\u003ea\u003c/i\u003e)\u003c/span\u003e. \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ex\u003c/i\u003e * \u003ci\u003ex\u003c/i\u003e\u003c/span\u003e — константа. Значит площадь зависит от \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ecos\u003c/i\u003e(\u003ci\u003ea\u003c/i\u003e) * \u003ci\u003esin\u003c/i\u003e(\u003ci\u003ea\u003c/i\u003e) \u003d 0.5 * \u003ci\u003esin\u003c/i\u003e(2\u003ci\u003ea\u003c/i\u003e)\u003c/span\u003e Максимум это функции достигается при угле 45 градусов (в промежутке от 0 до 90). Давайте тогда перебирать угол от 0 до 45 градусов двоичным поиском и считать площадь. Пусть после двоичного поиска мы получили какое-то значение угла, максимально близкое к площади. Сравним его с требуемой площадью — если разница между ними больше какого-то epsilon — ответа нет. Иначе посчитаем ответ геометрическими преобразованиями, описывать их не буду, если что — пишите вопросы, расскажу.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/Xzu8inZR\"\u003eКод\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eЗадача D\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eДавайте поддерживать текущий уровень скобок. Когда мы встречаем открывающуюся скобку — увеличиваем его, когда закрывающую — уменьшаем. На основе этого показателя решаем, менять нам скобочку или нет. \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/ZLihUUiD\"\u003eКод\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eЗадача E\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eКаждые два хода чувак будет тратить (b+2b) денег. Можно за О(1) посчитать количество таких пар ходов — как х/(3b). Теперь у нас осталось какое-то количество денег. В зависимости от этого остатка и того, какой блайнд сначала надо делать чуваку, мы можем сделать 0,1 или 2 дополнительных ходов. Детали в коде\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/TR8w1Hja\"\u003eКод\u003c/a\u003e Продолжение следует...\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eЗадача F\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eНам нужно составить палиндром минимальной длины такой, что некотороя строка входит в него как подстрока.\u003c/p\u003e\u003cp\u003eУтверждение. Добавлять буквы для получения палиндрома выгодно только с одной стороны от нашей строки. \u003c/p\u003e\u003cp\u003eДоказательство. Пускай это не так и существует оптимальное решение, в котором буквы добавлялись с обоих сторон. Давайте уберем букву сначала и с конца, получим палиндром меньшей длины. Значит наше начальное решение было не оптимально. Получили противоречие. Значит начальное утверждение доказано.\u003c/p\u003e\u003cp\u003eИ того наше решение: давайте добавлять буквы с одной стороны (с начала или с конца). Из этих двух вариантов выберем более короткий.\u003c/p\u003e\u003cp\u003eТеперь расскажу как решать, если мы добавляем буквы в конец (для начала решается аналогично).\u003c/p\u003e\u003cp\u003eПусть мы добавили k букв. Очевидно, эти буквы образую строку, которая является перевернутым префиксом нашей строки длины k. Значит нам нужно проверить, что суффикс, длины (n-k), где n — длина строки — палиндром. Такое можно проверять, например, за О(1) с помощью хешей.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/CUqG2cJU\"\u003eКод\u003c/a\u003e Продолжение следует...\u003c/p\u003e\u003c/div\u003e","tags":["разбор","тренировка"]}}