{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1507768983,"rating":0,"authorHandle":"GoTo","modificationTimeSeconds":1507769027,"id":55139,"title":"\u003cp\u003eС 28 октября по 5 ноября на площадке Технопарка Университета ИТМО пройдет проектная школа GoTo. \u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eС 28 октября по 5 ноября в Санкт-Петербурге на площадке технопарка Университета ИТМО пройдет проектная школа GoTo.\u003c/p\u003e\u003cp\u003eВ рамках партнерства с Университетом ИТМО организаторы приглашают принять участие в отборе студентов 1-2 курса и абитуриентов университета и выделяют несколько грантов. Участникам необходимо заполнить подать общую заявку на участие и выслать до 18 октября подробную презентацию о проекте для реализации на школе. Победители будут объявлены 20 октября. Для участия в отборе при регистрации укажите, что вы студент Университета ИТМО или, если вы еще учитесь в школе, кодовое слово. Узнать его можно на дне открытых дверей Университета ИТМО 15 октября у представителей ИТМО.СТАРТ. В школе примут участие 50 студентов 1-2 курсов и старшеклассников со всей России, прошедшие предварительный отбор. Каждый участник сможет выбрать одно из направлений: анализ данных и машинное обучение, промышленное программирование, интернет вещей, биоинформатика, распределенные системы и блокчейн. Каждая команда в течение школы пройдет все стадии реализации проекта: от идеи до презентации решения перед организаторами и гостями школы. Работа над проектами и обучение пройдут под руководством специалистов ведущих университетов – ИТМО, МФТИ, ВШЭ, Институт биоинформатики, а также экспертов технологических компаний – Яндекс, КРОК, BIOCAD, Parseq Lab и других. Лучшим ученикам партнеры предоставят возможность продолжить работу над проектами или пригласят на стажировки.\u003c/p\u003e\u003cp\u003eТакже доступна возможность принять участие в общем конкурсе GoTo Challenges и выиграть грант, частично или полностью покрывающий стоимость обучения. Участникам необходимо реализовать один из предложенных проектов, например, сделать криптографический замок для хакспейса или систему голосований на блокчейне. В этот раз конкурсы и обработка решений будут происходить с помощью смарт-контрактов на приватной платформе GoToChain. Блокчейн обеспечит общедоступность и неизменность данных о заявках и их проверке, позволит партнёрам и участникам следить за процессом проведения конкурса и создаст верифицируемые пункты портфолио для всех конкурсантов. \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://goto.msk.ru/camp_autumn\"\u003eПодробности о школе и конкурсах.\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}