{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1398582245,"rating":44,"authorHandle":"AlexanderBolshakov","modificationTimeSeconds":1398589255,"id":11991,"title":"\u003cp\u003eСпам и проблемы с юзабилити\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eНа КФ уже неоднократно поднималась проблема спама. При этом каждый раз высказывались всякие разные стандартные идеи вроде капчи, привязки к мобильному и т.п. Пересказывать недостатки этих методов я не буду, лишь обобщу их: проблемы с юзабилити для всех остальных пользователей.\u003c/p\u003e\u003cp\u003eВысказывалась идея, что КФ с его вкладом — саморегулирующаяся система. В случае со спамом это предполагает возможность заминусовывать спам-посты до их выпадения из прямого эфира.\u003c/p\u003e\u003cp\u003eВот про это я и хотел поговорить. Прямо сейчас (на момент написания текста — прим.) прямой эфир замусорен спамом (извиняюсь за тавтологию). Я, как пользователь, которому не все равно, поставил на \u003cstrong\u003eкаждый\u003c/strong\u003e пост по минусу. Перечислю последовательность действий для каждого поста:\u003c/p\u003e \u003col\u003e   \u003cli\u003eОткрыть пост по ссылке.\u003c/li\u003e   \u003cli\u003eПрокрутить страницу вниз, чтобы добраться до кнопки \u0026quot;не нравится\u0026quot;.\u003c/li\u003e   \u003cli\u003eПеревести курсор в левую часть окна браузера и поставить минус.\u003c/li\u003e   \u003cli\u003eПеревести курсор в правую часть окна (опционально: прокрутить страницу вниз).\u003c/li\u003e   \u003cli\u003eПерейти к пункту 1.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eПроблема в том, что на тачпаде ноутбука (а многие посетители сайта сидят именно с ноутбуков) двигать курсор мыши через весь экран как-то не сильно удобно. Подозреваю, что многим просто лень это делать. Да и с нормальной мышкой это все равно лишние усилия.\u003c/p\u003e\u003cp\u003eВ-общем, предлагаю добавить кнопки \u0026quot;нравится\u0026quot; и \u0026quot;не нравится\u0026quot; непосредственно в область прямого эфира. Чтобы решить проблему случайных нажатий предлагаю сделать необходимым нажимать на эти кнопки два раза, не уводя с них курсор мыши.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e Хотелось бы, чтобы злостные минусующие высказались вслух. Я прекрасно понимаю, что у моей идеи есть некоторые недостатки.\u003c/p\u003e\u003c/div\u003e","tags":[]}}