{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1471315381,"rating":4,"authorHandle":"pabloskimg","modificationTimeSeconds":1471315610,"id":46586,"title":"\u003cp\u003eNeed help with this problem: Freight Train (is it DP? how?)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everybody. I\u0027m struggling to figure out the solution for a problem but I still don\u0027t quite get it. It\u0027s the Problem A, Freight Train, of a latin american problem set, which you can find here: \u003ca href\u003d\"https://dl.dropboxusercontent.com/u/28504121/ProblemsetRPC08.pdf\"\u003ehttps://dl.dropboxusercontent.com/u/28504121/ProblemsetRPC08.pdf\u003c/a\u003e\u003c/p\u003e\u003cp\u003eI recommend you to read the problem statement directly from the link in order to have an unbiased interpretation thereof, otherwise you can read the following summary:\u003c/p\u003e\u003cp\u003eBasically you are given a sequence of \u003cstrong\u003eN\u003c/strong\u003e wagons, where \u003cstrong\u003eW\u003c/strong\u003e of those wagons have freight in them, and the rest is just empty wagons. You are given the actual indexes of the W wagons with freight (all wagons are arranged from 1 to N). You are also given a number \u003cstrong\u003eL\u003c/strong\u003e of locomotives. You can assign wagons to locomotives, but you can only assign \u003cstrong\u003econtiguous sequences\u003c/strong\u003e of wagons to locomotives. So for example one locomotive can pick the first 3 wagons, another locomotive can pick the next 4, etc. But you cannot have a locomotive picking the first and the third wagon an leave the second wagon unpicked in between, for instance. Ok, so there are two targets to send the wagons to, target A and target B. But, the thing is, you are required to send all the \u003cstrong\u003eW\u003c/strong\u003e wagons with freight to A, but the empty wagons can be sent to either A or B (but \u003cstrong\u003ethere cannot be wagons leftover\u003c/strong\u003e, all the wagons must be sent to somewhere). So the challenge is to find an assignment of wagons to locomotives such that \u003cstrong\u003eminimizes the longest train\u003c/strong\u003e (locomotive + wagons) forwarded to A (trains sent to B don\u0027t matter, you can send huge trains to B and their lengths would be ignored). Also, you are not required to use all the \u003cstrong\u003eL\u003c/strong\u003e locomotives, you can use fewer if that is enough.\u003c/p\u003e\u003cp\u003eAnd let me not forget it: 0 \u0026lt;\u003d N \u0026lt;\u003d 10^9, 1 \u0026lt;\u003d W, L \u0026lt;\u003d 10^4, and W \u0026lt;\u003d N\u003c/p\u003e\u003cp\u003eSo even O(N) would yield time limit exceeded, which it\u0027s a clear indication that the algorithm complexity should be based on W and L instead. So my intuition is that there must be some reductions / simplifications around the empty wagons, in other words, it shouldn\u0027t be necessary to try every single position within a contiguous sequence of empty wagons to decide where the previous train ends and where the next one starts. For example, if you assign a partial substring of empty wagons to a train and then send the train to B, that would be stupid because you would be better off sending the whole string of empty wagons to B in one shot. Another insight is that you always have the suboptimal solution of splitting the wagons into L groups with sizes of at most ceil(N / L) each, so that would be an upperbound for any train forwarded to A. I have a feeling that this should be solvable using Dynamic Programming, but still I don\u0027t see a way to define some recursive formula or something that handles the empty wagons correctly.\u003c/p\u003e\u003cp\u003eSo feel free to enjoy yourself solving this problem and any help, insight or advice that you can share would be really appreciated.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNote:\u003c/strong\u003e if you actually want to solve the problem and submit a solution, you can try out this website: \u003ca href\u003d\"https://acm.javeriana.edu.co/maratones/2016/08/\"\u003ehttps://acm.javeriana.edu.co/maratones/2016/08/\u003c/a\u003e. Be aware, though, that the site is in Spanish since it\u0027s a latin american online judge, the server performance is not the best of the world, and in order to submit solutions you need to login using one of the dummy usernames provided in the page and leave the password field empty.\u003c/p\u003e\u003c/div\u003e","tags":["help","help me","dp","time limit"]}}