{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1499098960,"rating":51,"authorHandle":"Lucas97","modificationTimeSeconds":1499099540,"id":53083,"title":"\u003cp\u003eThe unexpected situation with Problem D (CF 422 / Div2)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everybody, this time I just want to share the situation that I lived yesterday during the round 422. I like math problems, so I decided to start solving problem D(I solved the problem and got pretest passed with 1430 ~ 1450 ms(I don\u0027t remember exactly) since I submitted an nlogn solution). Well, at that moment, I was aware that the final verdict in the System Test could be TLE, however, my \u003ca href\u003d\"//codeforces.com/contest/822/submission/28218746\"\u003esolution during the contest\u003c/a\u003e should take the same time for any input since I precomputed the value of the prefix sums and, right after that, the output can be found substracting and multiplying some variables. \u003c/p\u003e\u003cp\u003eThus, I thought that if that solution had passed pretest, it must pass the SysTest as well(even when it was slow). Okay, after some time, the contest ended and the SysTest started. I was waiting for my submission for problem D and I noticed that, on the status page, my submission got TLE on test 1 and suddenly, it disappeared from the \u003ca href\u003d\"//codeforces.com/contest/822/standings/participant/12843150#p12843150\"\u003estandings\u003c/a\u003e. As you can see, it seems that I never submitted any solution for D. \u003c/p\u003e\u003cp\u003eAt that moment, I was a bit confused by the situtation and I sent messages to the author contest \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/melnik\" title\u003d\"Candidate Master melnik\"\u003emelnik\u003c/a\u003e and to the coordinators of the contest. Well, after some time, the ratings were updated D: and I didn\u0027t receive any answer from them. After some more minutes, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/melnik\" title\u003d\"Candidate Master melnik\"\u003emelnik\u003c/a\u003e replied to my message. He explained that it was unexpected and he was really sorry about it(I understand that there are always some issues during any contest). \u003c/p\u003e\u003cp\u003eI decided to forget that situation yesterday. Today, with a better mood, I decided to submit exactly the same solution again(was it really TLE on test 1? Hahaha) and the result was \u003ca href\u003d\"//codeforces.com/contest/822/submission/28259314\"\u003ethis\u003c/a\u003e (The answer was: No, it seems it was not TLE on test1).\u003c/p\u003e\u003cp\u003eIt turned out to be really sad because I would rank around 20 — 30(and I would have recovered my violet color) instead of ranking 420 :D and decrease my rating by 30. Moreover, according to the \u003ca href\u003d\"//codeforces.com/blog/entry/53068\"\u003eEditorial\u003c/a\u003e the first submission for D in Div2 was after 18 minutes while mine was in 17 minutes. Totally sad. \u003c/p\u003e\u003cp\u003eOkay, that was my sad story(maybe in some other contest I can still recover my violet color) and as \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/diversity\" title\u003d\"Candidate Master diversity\"\u003ediversity\u003c/a\u003e pointed out, I was relying on my luck too much. \u003c/p\u003e\u003cp\u003eHowever, currently, I ask the same thing that \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/utsav.delhi2\" title\u003d\"Candidate Master utsav.delhi2\"\u003eutsav.delhi2\u003c/a\u003e asked in the comments. Why does Codeforces run our code against pretest again? For instance, if they had run my solution against the first official test(those that don\u0027t belong to the pretest), this situtation wouldn\u0027t have occurred. I think that the answer to this question can be something technical that almost doesn\u0027t mind in competitive programming, but I would like to read some answer just to feel a bit better.\u003c/p\u003e\u003c/div\u003e","tags":[]}}