{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1490326309,"rating":35,"authorHandle":"aropan","modificationTimeSeconds":1490327660,"id":51176,"title":"\u003cp\u003e7th BSUIR Open Programming Contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv style\u003d\"text-align: center;margin-bottom: 10.0px;\"\u003e  \u003cimg src\u003d\"/predownloaded/6f/84/6f84af44b00b5c51ed74cea04ae375ea99f9fac1.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e\u003cp\u003eThe \u003cstrong\u003e7th BSUIR Open Programming Championship\u003c/strong\u003e will be held from March 31 till April 28, 2017 (Minsk, Belarus). Undergraduates and postgraduates of BSUIR, students of other educational institutions, students from other universities and countries are invited to participate in the Championship.\u003c/p\u003e\u003cp\u003eThe competition will take place in three rounds:\u003c/p\u003e \u003cul\u003e   \u003cli\u003efirst qualifying round (distance, problems in russian) — March 31 — April 3;\u003c/li\u003e   \u003cli\u003esecond qualifying round (distance/onsite semi-final, russian and english problems) — April 6;\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eChampionship final (onsite, only english problems) — April 26-28.\u003c/strong\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eFirst qualifying round is required only for BSUIR and high school teams but other registered teams can also take part in it. \u003cstrong\u003eSecond qualifying round is required for all teams\u003c/strong\u003e; BSUIR and high school teams from Minsk take part onsite, other teams — distance.\u003c/p\u003e\u003cp\u003eTo participate in the Championship teams need to be \u003cstrong\u003e\u003ca href\u003d\"https://docs.google.com/forms/d/e/1FAIpQLSfWocwsBVfScvUs52Xme-fDJWQLCfaC929_TwyJyqeoiCU1hg/viewform\"\u003eregistered\u003c/a\u003e prior to 04.04.2017\u003c/strong\u003e incl (prior to 02.04.2017 for BSUIR and high school teams). Participation is free of charge — have fun.\u003c/p\u003e\u003cp\u003eThe finalists are 42 teams, showed the best results in the qualifying rounds, but no more than:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e7 teams of undergraduates and postgraduates of BSUIR;\u003c/li\u003e   \u003cli\u003e5 school teams (one team from each of the educational institution);\u003c/li\u003e   \u003cli\u003e2 teams from each of the university of Belarus and near and far abroad.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eOpen BSUIR Programming Championship is held by the ACM rules. During the Championship, the teams will be given 5 hours to solve 8 to 12 programming problems. The problems are written in English.\u003c/p\u003e\u003cp\u003eThere is good news for foreign teams who are participating in the final. \u003cstrong\u003eBelarus introduced a \u003ca href\u003d\"http://eng.belta.by/politics/view/no-extra-formalities-for-visiting-belarus-for-five-days-without-visas-97774-2017/\"\u003evisa-free\u003c/a\u003e\u003c/strong\u003e entry procedure for up to 5 days at the entrance to the National Airport Minsk for citizens of 80 countres.\u003c/p\u003e\u003cp\u003eMore information about the championship, as well as the problems and results of previous years, you may find at \u003ca href\u003d\"http://acm.bsuir.by\"\u003eacm.bsuir.by\u003c/a\u003e. A little bit of BSUIR Open into training: \u003ca href\u003d\"//codeforces.com/blog/entry/49057\"\u003ehttp://codeforces.com/blog/entry/49057\u003c/a\u003e\u003c/p\u003e\u003cp\u003eA little bit of last year video: \u003c/p\u003e\u003cdiv style\u003d\"text-align: center;margin-top: 10.0px;\"\u003e \u003ciframe allowfullscreen\u003d\"\" frameborder\u003d\"0\" height\u003d\"359\" src\u003d\"https://www.youtube.com/embed/ckZta1O5y-E\" width\u003d\"640\"\u003e\u003c/iframe\u003e \u003c/div\u003e\u003c/div\u003e","tags":["bsuir","open","7th","2017","contest","programming","championship","42"]}}