{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1507053134,"rating":55,"authorHandle":"RodionGork","modificationTimeSeconds":1507061647,"id":54935,"title":"\u003cp\u003eHacktoberfest 2017, T-shirts and E-maxx-eng\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cem\u003eSuddenly I\u0027ve got a few questions in PM and e-mail about Hacktoberfest 2017 participation with \u003cstrong\u003ee-maxx-eng\u003c/strong\u003e — I dare to confirm and explain a few details in a post.\u003c/em\u003e\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eYes, digitalocean announced new Hacktoberfest: \u003ca href\u003d\"https://blog.digitalocean.com/hacktoberfest-2017/\"\u003ehttps://blog.digitalocean.com/hacktoberfest-2017/\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eYes, it is possible (and easy) to get t-shirt here — just create 4 meaningful pull-requests on github to \u003cstrong\u003eany\u003c/strong\u003e meaningful repository (which are accepted) and then claim your T-shirt (you\u0027ll need to enter your nickname at their site and then probably your postal address and T-shirt size).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eYes, we have tried it in 2016 inspired by Maria (aka \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Nickolas\" title\u003d\"Expert Nickolas\"\u003eNickolas\u003c/a\u003e) — and yes, T-shirts came. I received mine in about a month. (only I think the colors of design were somewhat bleak — see picture below)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eYes, \u003ca href\u003d\"http://e-maxx-eng.appspot.com/\"\u003ee-maxx-eng project\u003c/a\u003e is as suitable for contribution as others — you can either translate one of still untranslated pages from original site, or propose your own original article. Please kindly refer to \u003ca href\u003d\"http://e-maxx-eng.appspot.com/contrib.html\"\u003einstruction\u003c/a\u003e or our \u003ca href\u003d\"//codeforces.com/blog/entry/46774\"\u003e2016 post\u003c/a\u003e.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAs about the effect of our attempt — it seems thanks to all your help was not in vain — current website stats show that user activity gradually increased from roughly 5 to 500 pageviews per day through the year. I know it is not much, but given that site is rather specific in its content and comparatively young — you may be sure people visit it, people read your work.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eSo feel free to participate. You even need not use git for nowadays github allows editing in web-interface (see instruction and demo-video). Feel free to ask and sorry if sometimes (we are somewhat slow to respond). Feel free to report bugs, suggestions.\u003c/p\u003e\u003cp\u003eAnd \u003cstrong\u003eThanks\u003c/strong\u003e to Maria (aka \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Nickolas\" title\u003d\"Expert Nickolas\"\u003eNickolas\u003c/a\u003e) for driving this process through the last year!\u003c/p\u003e\u003cp\u003eP.S. As to question \u0026quot;how t-shirts looked like\u0026quot; — I\u0027ve found a picture in \u003ca href\u003d\"http://annadodson.co.uk/blog/2016/11/01/hacktoberfest.html\"\u003eAnna Dodson blog post\u003c/a\u003e which may give some idea:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"hacktoberfest 2016 t-shirts\" src\u003d\"/predownloaded/62/a1/62a1000b4bcd0e19035a968f1ef9d6898709e674.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["e-maxx","github","t-shirts"]}}