{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399087148,"rating":-30,"authorHandle":"realab4","modificationTimeSeconds":1399087148,"id":12126,"title":"\u003cp\u003eUnited States has become weak\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eUnited States has become weak, saying the United States under Obama\u0027s leadership has become \u0026quot;passive.\u0026quot;Reported that Obama told Japanese Prime Minister Shinzo Abe reiterated during visit to Japan, US-Japan Security Treaty applies to the Diaoyu Islands. Asked by a reporter So, does this mean that the United States would draw the Diaoyu Islands issue on China a new \u0026quot;red line.\u0026quot; Obama on the spot angry, responded by saying:. \u0026quot;I think this question implicit message is that once the country in violation of these rules, the United States\u003ca href\u003d\"http://www.shoejordan.fr/air-jordan-4-c-4.html\"\u003eair jordan 4 pas cher\u003c/a\u003e  should wage war, or preparing to go to war, otherwise, we seem to not strictly adhere to these rules, but it is not so. \u0026quot;Obama noted that Ukraine crisis facing the same problem, and no one really want American troops, but it was suggested to Ukraine to provide weapons. For such a proposal, Obama asked: \u0026quot;Do people really think that, as long as we provide a number of weapons in Ukraine, the Russian army could hinder Or, international pressure we exerted diplomatic pressure and economic pressure impede better \u0026quot;Russian Deputy Prime Minister Dmitry Rogozin on personal social networking accounts that the U.S. sanctions against Russia will affect the U.S. aerospace work, and suggested the United States\u0026quot; by the astronauts to the International Space Station trampoline. \u0026quot;Earlier, Dmitry Rogozin, said during an interview in Simferopol, he sanctions against Russia for the United States and Europe, \u0026quot;tired\u0026quot;, as the U.S. and the EU was not able to understand that these sanctions will have a negative impact on the U.S. and Europe.For him, the U.S. State Department spokesman Pusa Ji did not make a positive response, but said she did not think that this is an accurate description of the impact of sanctions.U.S. and \u003c/p\u003e\u003cp\u003eRussian cooperation projects in the International Space Station sizable, and American astronauts to the space station by Russian rocket delivered.February 22, Ukrainian regime change occurred. Ukrainian parliament ousted President Yanukovych, modify the Constitution, the Speaker Turchinov commissioned to perform duties of head of state, the presidential elections on May 25.Eastern and southern regions of Ukraine and Crimea series does \u003ca href\u003d\"http://www.shoejordan.fr/air-jordan-4-c-4.html\"\u003echaussure air jordan 4\u003c/a\u003e  not recognize the legitimacy of the decision of the Ukrainian parliament, claiming that ousted Viktor Yanukovych nyuk Keya illegal mining on further fate of the referendum held in their respective regions. Crimea and Sevastopol voters in favor of the Crimea to join the Russian Federation.U.S. and EU due to the Crimea to Russia to join the implementation of individual sanctions: the freezing of assets and prohibiting the issuance of visas to its range of people. Russian Foreign Ministry has repeatedly stressed that the sanctions language exchange with \u0026quot;inappropriate\u0026quot; with Moscow, \u0026quot;will be counterproductive.\u0026quot; 28, 2009, the United States and Russia to expand sanctions list, making the list expanded to 50 Russia and Ukraine for this entrepreneur and politician. Rogozin I also sanctions the United States and Russia\u0027s list. United States announced on Tuesday sued Chinese businessman LI Fang-wei, saying suspected of violating sanctions regulations, the use of shell companies to enter the U.S. financial system, and his name was the U.S. government sanctions the eight companies. These companies suspected missile parts for the Iranian government procurement.\u0026quot;If you do not reach a plea agreement,\u0026quot; Richman said, \u0026quot;for him, because the face of the U.S. allegations, although the rest of h\u003c/p\u003e\u003cp\u003eis life to stay in Russia is difficult to his satisfaction, but it is a relatively stable outcome.\u0026quot; Local time on the 30th morning, South Korea held a news conference on the \u0026quot;years number\u0026quot; shipwreck rescue inform the relevant circumstances. South Korea said that the current death toll has increased to 210 people, the future will not previously searched cargo search. On the families of the victims have criticized the rescue deception, lack of efficiency, the ROK spokesman said the families understand the mood soon after there will be a corresponding instructions.South Korea said on April 29 sent 198 vessels\u003ca href\u003d\"http://www.shoejordan.fr/air-jordan-11-c-12.html\"\u003eair jordan 11 acheter\u003c/a\u003e  , 34 helicopters and more than 80 divers conducted 17 searches to Layer 4 and 5 floor lobby bow centered search and found five victims, the current total number of shipwreck victims to 210 people.South Korea said that the current location of the sinking of a variety of internal and external configuration of search and rescue equipment, set up a fence, found the body immediately surrounding reporting requirements.Families placate the situation on the Korean side said it had installed in the family residence at screens, used to protect the family privacy, family area also will improve the environment and actively listening to the families opinion. Shipwreck while requiring schools to protect the students, the students are not in class absences without treatment.South Korea said on rescue latest arrangement, the current use of multi-national expert search; rescue April 30 will be sent more than 100 divers, 4 layer 5 layer continues to search the cabin to the \u003c/p\u003e\u003c/div\u003e","tags":[]}}