{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1480932275,"rating":127,"authorHandle":"gKseni","modificationTimeSeconds":1480933390,"id":48856,"title":"\u003cp\u003eИнтервью с победителями NEERC 2016 SPb State University 1 и тренером Андреем Лопатиным\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПоздравляю чемпионов 21 полуфинала NEERC — команду SPb State University 1 в составе Игоря \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/-XraY-\" title\u003d\"Grandmaster -XraY-\"\u003e-XraY-\u003c/a\u003e Пышкина, Айдара \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/aid\" title\u003d\"International Grandmaster aid\"\u003eaid\u003c/a\u003e Сайранова, Станислава \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ershov.stanislav\" title\u003d\"International Grandmaster ershov.stanislav\"\u003eershov.stanislav\u003c/a\u003e Ершова :)\u003c/p\u003e\u003cp\u003eПоздравляю и все команды, прошедшие на финал! Затаив дыхание смотрела, как вы радуетесь :) Впереди много работы — тренируйтесь и все получится! \u003c/p\u003e\u003cp\u003eПосле церемонии награждения удалось поболтать с Игорем:\u003c/p\u003e\u003cp\u003e— \u003cem\u003eПривет! Поздравляю с победой :) Пару слов о прошедшем контесте.\u003c/em\u003e\u003cbr /\u003e— Довольно тяжело сегодня прошел контест. В какой-то момент показалось, что уже все, у нас нет никаких шансов на первое место, и мы реально боялись за результаты. Но в какой-то момент все поменялось неожиданно. \u003c/p\u003e\u003cp\u003e— \u003cem\u003eЭтот момент был ближе к началу или концу?\u003c/em\u003e\u003cbr /\u003e— Ближе к концу. Мы сдали задачу B, с которой у всех были проблемы. Это была задача с подвохом, и мало кто ее сдал в результате.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eКакая у вас была стратегия?\u003c/em\u003e\u003cbr /\u003e— У нас есть Cтас, который со мной участвовал в прошлом году. Он в основном решает, пишет задачи, которые ему нравятся. А всякие задачи, которые более сложные технически, мало кому нравятся, мы пишем с Айдаром. Решаем все вместе — у нас в команде все умеют решать задачи и это прекрасно.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eКак проходят ваши тренировки?\u003c/em\u003e\u003cbr /\u003e — У нас есть три тренировки в неделю в СПбГУ, пишем пятичасовой контест. Еще мы ходим с Айдаром где-то раз в неделю в ИТМО на тренировки, которые проводит Андрей Станкевич.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eРазборы есть?\u003c/em\u003e\u003cbr /\u003e — После контеста мы друг с другом общаемся и обсуждаем то, что произошло. Бывают интересные и неожиданные задачи — их имеет смысл обсуждать. Остальные все стандартные.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eКакие планы на вечер?\u003c/em\u003e\u003cbr /\u003e — Сейчас гулять пойдем, веселиться.\u003c/p\u003e\u003cp\u003eТренер команд Андрей Лопатин тоже рассказал интересного:\u003c/p\u003e\u003cp\u003e— \u003cem\u003eКак вы проводите тренировки, подбираете контесты для ребят?\u003c/em\u003e\u003cbr /\u003e— Бывают контесты, которые собраны из большого количества сложных задач. Обязательная составляющая — это дорешивание.\u003cbr /\u003eЕсть блицы, которые составлены из задач совсем простых и средней сложности. Бывают просто старые хорошие контесты, которые полезны на мой взгляд. Достаточно часто бывают выборки сложных задач. Зависит от текущей ситуации, того что происходит. В двух словах сложно описать.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eВы принимаете участие в разборе?\u003c/em\u003e\u003cbr /\u003e— Ну мы обсуждаем некоторые теоретические моменты, которые нужно. В основном мы, конечно, стараемся, чтобы ребята сами дорешивали задачи. Если почему-то это не получается, тогда да — мы начинаем искать знания либо мои, либо моих коллег, которые нужно получить для того, чтобы эта задача решалась. \u003c/p\u003e\u003cp\u003e— \u003cem\u003eА есть среди команд новичков девушки? :) Какой процент?\u003c/em\u003e\u003cbr /\u003e— Есть девушки, да. Только, к сожалению, на полуфинале нет команд с девушками. На четвертьфинале человек 10 из 32 команд было точно, может даже и больше.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eСпасибо за общение, поздравляю вас с победой! :)\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/ce/13/ce13064033b7c34eff0d915a4ae41a77af2b4e01.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news","интерью","neerc 2016"]}}