{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1485207239,"rating":0,"authorHandle":"1am","modificationTimeSeconds":1485207239,"id":49979,"title":"\u003cp\u003eExtra Info\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003eArrays\u003c/h1\u003e\u003cp\u003eArrays is a way to store a series of numbers. Imagine if we had a class of 50, and we wanted to store their grades. Its not practical to make 50 integers: int s1, s2, s3...\u003c/p\u003e\u003cp\u003eSo instead we can make it like this: int s[50];\u003c/p\u003e\u003cp\u003ethe first student is s[0], second student is s[1], last student is s[49].\u003c/p\u003e\u003cp\u003eHere is the code, also included is how to sort and reverse arrays: \u003ca href\u003d\"http://ideone.com/27E4wf\"\u003ehttp://ideone.com/27E4wf\u003c/a\u003e\u003c/p\u003e\u003cp\u003eLook at powerpoint arrays and vectors from here: \u003ca href\u003d\"https://drive.google.com/drive/folders/0B54r2jukjz9wZ2JOcDJiWWdfZnc\"\u003ehttps://drive.google.com/drive/folders/0B54r2jukjz9wZ2JOcDJiWWdfZnc\u003c/a\u003e\u003c/p\u003e\u003cp\u003eVectors are a way to allocate a series of grades if you dont know how many people there are beforehand. The powerpoint has more details.\u003c/p\u003e\u003ch1\u003eFrequency Array\u003c/h1\u003e\u003cp\u003eThis is a very broad topic. Frequency array is used to keep track of the number of letters, or numbers, or literally anything you want to keep a count of. Here is a code of finding the frequency of each letter in a lowercase string: \u003ca href\u003d\"http://ideone.com/hvlGsX\"\u003ehttp://ideone.com/hvlGsX\u003c/a\u003e\u003c/p\u003e\u003ch1\u003eSet\u003c/h1\u003e\u003cp\u003eImagine you had a question that wants you to take in make a dictionary of the words used in a text. And output them uniquely and they should also be sorted. You can do that using a set. \u003c/p\u003e\u003cp\u003eSets have the following features:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003ealways ordered from smallest to largest (either alphabetically or numerically; depending on data type)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003econtain only unique elements, no repetitions\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eare accessed through an iterator, to get the element that the iterator is pointing at, you must do *(iterator_name)\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eFor more information on its member functions and syntax, take a look at here: \u003ca href\u003d\"http://www.cplusplus.com/reference/set/set/\"\u003ehttp://www.cplusplus.com/reference/set/set/\u003c/a\u003e Also take a look at slides 23 24 from day 1 from the above google drive for some example code.\u003c/p\u003e\u003cp\u003eHere is an example code of making dictionary of text: \u003ca href\u003d\"http://ideone.com/BLBaf3\"\u003ehttp://ideone.com/BLBaf3\u003c/a\u003e\u003c/p\u003e\u003ch1\u003eMap\u003c/h1\u003e\u003cp\u003eTake a look at slides 25 from day 1 from the above google drive for some example code. \u003c/p\u003e\u003cp\u003eThe the map data structure is quite similar to the set data structure, other than the fact that maps help us to connect a key with a value. For example, the key could be name of grocery item, and the value could be its price. Here is some code that shows some features of it. \u003ca href\u003d\"http://ideone.com/tClL2K\"\u003ehttp://ideone.com/tClL2K\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThey are ordered based on first element from smallest to largest also.\u003c/p\u003e\u003cp\u003eYou can use it to count the frequency of strings like this: \u003ca href\u003d\"http://ideone.com/4yziZR\"\u003ehttp://ideone.com/4yziZR\u003c/a\u003e\u003c/p\u003e\u003ch1\u003eMore Info and Powerpoints\u003c/h1\u003e\u003cp\u003eDay 1 powerpoint contains many important stuff you can also save it for the future. \u003ca href\u003d\"https://drive.google.com/drive/folders/0B54r2jukjz9wZ2JOcDJiWWdfZnc\"\u003ehttps://drive.google.com/drive/folders/0B54r2jukjz9wZ2JOcDJiWWdfZnc\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}