{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1464808723,"rating":42,"authorHandle":"zholnin","modificationTimeSeconds":1464808765,"id":45183,"title":"\u003cp\u003eIPSC — looking for teammates\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eSome of you must have received the following e-mail. So IPSC is coming back to us again. I created this topic to let people search for teammates (in case they want to participate in teams and don\u0027t have one).\u003c/p\u003e\u003cp\u003ePlease comment below if you are available to join team and a little description about yourself.\u003c/p\u003e\u003cp\u003e\u003d ORIGINAL E-MAIL\u003d\u003c/p\u003e\u003cp\u003eYour favorite programming competition is back for its 18th year! We excitedly invite you to compete in IPSC 2016.\u003c/p\u003e\u003cp\u003eInternet Problem Solving Contest is an online programming competition for teams of up to three people. The problems range from easy to very hard, so everyone is welcome to compete. We also have separate ranklists for individuals and secondary school students. You can use any programming language, or even solve problems by hand. Most of the problems are algorithmic in nature, but IPSC is particularly known for its unusual and fun problems.\u003c/p\u003e\u003cp\u003eIPSC 2016 will take place on Saturday, 18 June 2016 from 11:00 to 16:00 UTC. Visit \u003ca href\u003d\"http://ipsc.ksp.sk/\"\u003ehttp://ipsc.ksp.sk/\u003c/a\u003e to register, either as an individual or as a team of up to three people.\u003c/p\u003e\u003cp\u003eWhile you\u0027re waiting for 18 June 2016, you can also visit \u003ca href\u003d\"http://ipsc.ksp.sk/train/\"\u003ehttp://ipsc.ksp.sk/train/\u003c/a\u003e to practice on problems from previous years of IPSC.\u003c/p\u003e\u003cp\u003eIf you like IPSC, help us spread the word! Tell your friends, classmates, coworkers, internet strangers, et cetera.\u003c/p\u003e\u003cp\u003eGood luck in the contest, and have fun!\u003c/p\u003e\u003cp\u003eIPSC Organizing Team\u003c/p\u003e\u003c/div\u003e","tags":["ipsc2016","teammates"]}}