{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1514245051,"rating":45,"authorHandle":"updown1","modificationTimeSeconds":1514260467,"id":56616,"title":"\u003cp\u003eDFS Video Tutorial\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI noticed that there aren\u0027t too many video tutorials for Codeforces problems. There are text editorials but the solutions can be hard to understand and/or implement. Because of this, I decided to create a website with video tutorials of Codeforces \u0026amp; USACO problems. I\u0027m also dividing the problems by topic and difficulty.\u003c/p\u003e\u003cp\u003eThe website is a work in progress. Here is the website: \u003ca href\u003d\"https://www.vplanetcoding.com/\"\u003ehttps://www.vplanetcoding.com/\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eI started this website by taking one problem, \u003ca href\u003d\"/contest/893/problem/C\" title\u003d\"Educational Codeforces Round 33 (рейтинговый для Див. 2)\"\u003e893C - Слух\u003c/a\u003e, and creating a video tutorial explaining Depth-First Search(DFS) and connected components while solving the problem. At the end of the video, I wrote the C++ code without complex syntax and I explained the code, line-by-line, as I wrote it.\u003c/p\u003e\u003cp\u003eI think that explaining the code for the solution will help a lot of people implement the solution.\u003c/p\u003e\u003cp\u003eI know that many people know DFS and connected components, but there are many people who don\u0027t know DFS and connected components who this tutorial will benefit.\u003c/p\u003e\u003cp\u003eHere is the video: \u003ca href\u003d\"https://www.vplanetcoding.com/course-2-standard-algorithms-and-data-structures#1\"\u003ehttps://www.vplanetcoding.com/course-2-standard-algorithms-and-data-structures#1\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eLet me know if you have feedback. Also, let me know which problems I should create video tutorials for next.\u003c/p\u003e\u003c/div\u003e","tags":["dfs","tutorial"]}}