{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1493804072,"rating":95,"authorHandle":"misis","modificationTimeSeconds":1493890319,"id":51816,"title":"\u003cp\u003eО стальных нервах и дурацких каламбурах, или олимпиадное программирование в НИТУ “МИСиС”\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВдохновившись \u003ca href\u003d\"//codeforces.com/blog/entry/48384\"\u003eпостом Михаила Рубинчика\u003c/a\u003e, мы хотели описать, как устроена \u003ca href\u003d\"http://acm.misis.ru\"\u003eсекция олимпиадного программирования у нас в НИТУ “МИСиС”\u003c/a\u003e, но потом осознали, что, в отличие от УрФу, про нас даже не все слышали, и вполне можно получить в ответ: “\u003ca href\u003d\"http://misis.ru\"\u003eКакой МИСиС?\u003c/a\u003e Нет там ничего”. Так что, в итоге, получился текст не только об устройстве секции, но и о том, сколько сил и желания в нее вкладывается.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/d6/7a/d67a791217f0bdcca3a1c74bfa7fac4a2507249e.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e\u003cp style\u003d\"margin: 0 auto 10.0px;text-align: center;\"\u003e \u003cem\u003eкоманда МИСиС на сборах в Ижевске, 2016 год\u003c/em\u003e \u003c/p\u003e \u003cp\u003eИтак, спортивное программирование в НИТУ “МИСиС” зародилось в 2009 году при поддержке Д.В. Ливанова, бывшего тогда ректором университета, и компании Cognitive Technologies. В этом же году был осуществлен первый набор в секцию. Перед тренерским составом на тот момент ставилась непростая цель — добиться результатов на международном чемпионате по программированию ACM ICPC, в котором участвуют лучшие команды университетов со всего мира. Для подготовки наших студентов тогда были приглашены такие выдающиеся личности, член-корр. РАН, д.т.н., профессор Арлазаров В.Л. и доц., к.т.н. Фараджев И.А. И надо отметить, что с тех пор мы добились немалых результатов.\u003c/p\u003e\u003cp\u003eНачиная с 2012 года команды НИТУ “МИСиС” выходят в полуфинал ACM ICPC каждый год. Трижды команда НИТУ “МИСиС” выходила в финал ACM ICPC. В 2014 году команда НИТУ “МИСиС” заняла 19 место в финале. В 2016 году на московском четвертьфинале команда NUST MISIS: NEVERMIND заняла 8 место.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/d1/15/d11588eac10a167ee0f86fa43935f3683d3cfb53.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e\u003cp style\u003d\"margin: 0 auto 10.0px;text-align: center;\"\u003e \u003cem\u003eкоманда МИСиС в финале ACM ICPC, 2014 год\u003c/em\u003e \u003c/p\u003e\u003cp\u003eСтоит отметить, что за 8 прошедших лет, тренерский состав претерпел значительные изменения. Сейчас в него входит 6 человек: главный тренер к.ф.-м.н. Мамай Игорь, а также Крохина Дарья, Савинов Сергей, Притула Наталия, Овчинкин Антон и Чернышова Юлия. Стоит отметить, что особо важной для нас является преемственность поколений, и поэтому студенты, переставшие выступать как участники, зачастую помогают в тренировках новых команд. Например, Дарья Крохина и Антон Овчинкин — участники финала ACM ICPC 2013 и 2014 годов, соответственно.\u003c/p\u003e\u003cp\u003eЯрким примером того, что секция НИТУ “МИСиС” успешна и жизнеспособна является открытие на ее базе площадки четвертьфинала ACM ICPC в 2016 году. На данный момент, в Москве лишь четыре университета имеют свою площадку: МГУ, МФТИ ГУ, НИУ ВШЭ и НИТУ “МИСиС”. Стоит сказать, что в ходе четвертьфинала в “МИСиС” не возникло никаких технических неполадок и других возможных проблем, которые нередко случаются даже на площадках с многолетним стажем. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/e1/d5/e1d56ab58fb089a808204240f8b104159e82b384.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e\u003cp style\u003d\"margin: 0 auto 10.0px;text-align: center;\"\u003e \u003cem\u003eПлощадка МИСиС, четвертьфинал ACM ICPC, 2016 год\u003c/em\u003e \u003c/p\u003e\u003cp\u003eГоворя о деятельности тренерского состава, нужно знать, что среди наших достижений не только площадка четвертьфинала. Начиная с 2010, проводится открытая олимпиада НИТУ “МИСиС” и Cognitive Technologies по программированию, которая в 2016/2017 учебном году получила статус олимпиады второго уровня, а значит, дает возможность поступления в ВУЗ вне конкурса. В 2015/2016 очный тур олимпиады впервые проводился на двух площадках: НИТУ “МИСиС” и МФТИ, а начиная с 2016/2017 учебного года олимпиада проводится нашими ВУЗами совместно. Набор задач очного тура олимпиады 2016/2017 использовался на студенческих сборах по спортивному программированию “Hello Barcelona programming bootcamp”, проводящихся в сотрудничестве с Moscow Workshops ACM ICPC, в рамках второго дня в обоих дивизионах.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/4d/87/4d874cde451043cbdaa2c410bbc1d1e437a443f2.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e\u003cp style\u003d\"margin: 0 auto 10.0px;text-align: center;\"\u003e \u003cem\u003eоткрытая олимпиада НИТУ “МИСиС”, МФТИ и Cognitive Technologies по программированию, 2017\u003c/em\u003e \u003c/p\u003e\u003cp\u003eНаборы в секцию спортивного программирования в НИТУ “МИСиС” происходят каждый год. Отдельно хотелось бы отметить, что тренеры команды ставили и ставят себе задачей подготовить успешные команды не только из людей, выступавших на олимпиадах по программировании еще в школьные годы, но просто из талантливых студентов, заинтересованных возможностью развиваться и работать над собой, но не имеющих серьезной базы по информатике и математике.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/1f/21/1f21815f36240a90b940c303d445cde52c7184c8.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e\u003cp style\u003d\"margin: 0 auto 10.0px;text-align: center;\"\u003e \u003cem\u003eзанятие по спортивному программированию МИСиС, 2015 год\u003c/em\u003e \u003c/p\u003e\u003cp\u003eДля этого каждый год в МИСиС происходит набор первокурсников в секцию с помощью небольшого тестирования по математике. На нем проверяются прежде всего способности студентов мыслить нестандартно и находить решения не встречавшихся им прежде задач, а не навыки программирования. По результатам тестирования лучшие приглашаются в секцию. Однако, студентов неудачно написавших тестирование, а также желающих заниматься старшекурсников мы тоже всегда рады видеть.\u003c/p\u003e\u003cp\u003eУспешно выступающие команды ездят на различные соревнования и сборы. Каждый год команды НИТУ “МИСиС” посещают сборы МФТИ и ИжГТУ, летнюю школу “Сазанка”, организованную СГУ. Регулярно наши лучшие команды представляют НИТУ “МИСиС” на чемпионате Урала по программированию, считающимся одним из самых серьезных в России, и на открытой всесибирской олимпиаде по программированию им. И.В. Поттосина. Также мы выезжаем на Открытый чемпионат БГУИР и на открытый командный чемпионат ГрГУ им. Янки Купалы.\u003c/p\u003e\u003cp\u003eОрганизаторы команды олимпиадного программирования делают всё для полноценной подготовки своих студентов к соревнованиям.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/d8/66/d866acbae9fb445bfee37ec23815fd6ecb67b43a.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e\u003cp style\u003d\"margin: 0 auto 10.0px;text-align: center;\"\u003e \u003cem\u003eсборы МИСиС и ГрГУ, 2015 год\u003c/em\u003e \u003c/p\u003e\u003cp\u003eДважды в год секция проводит выездные сборы, на которые приглашаются успешно проявившие себя во время семестра участники, которые длятся по 10-15 дней. За время сборов у учащихся бывают, как правило, два выходных, во все остальные дни они слушают лекции и решают различные контесты. \u003c/p\u003e\u003cp\u003eВ НИТУ “МИСиС” уже стало хорошей традицией проводить летние сборы в августе в Гродно, Беларусь, на базе ГрГУ им. Янки Купалы, известном своим чемпионатом и математическими контестами. Зимние сборы проходят после завершения сессии в конце января и начале февраля в различных пансионатах Подмосковья. \u003c/p\u003e\u003cp\u003eВ течение учебных семестров, занятия проходят 3 раза в неделю — 2 будних дня (вторник и четверг, как правило, 2,5 часа), воскресенье — 5 часов. Если студенты заинтересованы в дополнительных занятиях для подготовки к чемпионатам, то тренеры всегда готовы заниматься индивидуально с командой или отдельными участниками. В качестве приятного бонуса участникам команд не требуется ходить на занятия по физкультуре, что добавляет шесть свободных часов в неделю.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/67/59/67595c9d63479550abd8f0841cbe6391a1859d18.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e\u003cp style\u003d\"margin: 0 auto 10.0px;text-align: center;\"\u003e \u003cem\u003eкоманда МИСиС на полуфинале ACM ICPC, 2016 год\u003c/em\u003e \u003c/p\u003e\u003cp\u003eТакже необходимо отметить, что лучшим участникам команд ежемесячно выплачиваются денежные премии, позволяющие младшекурсникам не переживать о поисках подработок. И, раз уж был затронут денежный вопрос, хотелось бы упомянуть, что в НИТУ “МИСиС” действует программа стипендий BEST MISIS. В ее рамках можно получать от 10 до 20 тысяч рублей. В 2017/2018 учебном году для ее получения при поступлении на первый курс бакалавриата на \u003ca href\u003d\"http://misis.ru/university/struktura-universiteta/instituty/itasu/\"\u003eIT-специальность\u003c/a\u003e (при сдаче ЕГЭ по информатике) необходимо иметь не менее 260 баллов по трем предметам или же быть победителем одной из олимпиад всероссийского перечня.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/63/7e/637e4fc168b7cd348b9f26fc0a62462fdcca78eb.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e\u003cp style\u003d\"margin: 0 auto 10.0px;text-align: center;\"\u003e \u003cem\u003eкоманда МИСиС на Московском Фестивале программирования, 2017 год\u003c/em\u003e \u003c/p\u003e\u003cp\u003eПосле завершения учебы и на старших курсах наши участники работают в самых разных компаниях IT-отрасли: AIM Tech, Google, Яндекс, Smart Engines, Cognitive Technologies и т.д.\u003c/p\u003e\u003cp\u003eДля иногородних абитуриентов стоит отдельно отметить общежития НИТУ “МИСиС”. Все они находятся в шаговой доступности от метро, и, чтобы добраться до института, нужно не более 20 минут. Общежитие “Дом Коммуна” находится рядом с метро Ленинский проспект, “Горняк” расположен между станциями метро Ленинский проспект и Академическая, студгородок “Металлург” находится на метро Беляево. Сам НИТУ “МИСиС” расположен около станции метро Октябрьская.\u003c/p\u003e\u003cp\u003eUPD. По совету \u003ca href\u003d\"//codeforces.com/profile/Sibiryak\"\u003eSibiryak\u003c/a\u003e, мы решили добавить ссылки, которые могут быть полезны: \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://misis.ru\"\u003eНИТУ \u0026quot;МИСиС\u0026quot;\u003c/a\u003e\u003c/p\u003e \u003cp\u003e\u003ca href\u003d\"http://acm.misis.ru\"\u003eСпортивное программирование в НИТУ МИСиС\u003c/a\u003e\u003c/p\u003e \u003cp\u003e\u003ca href\u003d\"http://misis.ru/spglnk/e18cf66a\"\u003eКафедра Инженерной Кибернетики\u003c/a\u003e — основная кафедра, на базе которой развивается спортивное программирование\u003c/p\u003e \u003cp\u003e\u003ca href\u003d\"http://misis.ru/university/struktura-universiteta/instituty/itasu/\"\u003eИнститут ИТАСУ\u003c/a\u003e — место, где собраны кафедры, связанные с IT\u003c/p\u003e \u003cp\u003e\u003ca href\u003d\"http://misis.ru/applicants/\"\u003eИнформация для абитуриентов\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["acmmisis"]}}