{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1427614284,"rating":269,"authorHandle":"mfv","modificationTimeSeconds":1428351381,"id":17187,"title":"\u003cp\u003eКак попасть в div1, используя особенности психологии человека\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e Приём заявок завершён. С момента публикации статьи к проекту присоединились более 150 участников. Если кто-то подавал заявку по почте и не получил ответ — свяжитесь со мной через личные сообщения codeforces.\u003c/p\u003e\u003cp\u003eВы всё ещё в div2, но мечтаете попасть в div1? Учёба занимает много времени, и олимпиадные задачи получается решать редко? Чувствуете, что постоянно решаете простые задачи, но никак не продвигаетесь к решению сложных?\u003c/p\u003e\u003cp\u003eЕсли Вы ответили “Да” на любой из этих вопросов, и хотите изменить текущую ситуацию, тогда эта статья для Вас!\u003c/p\u003e\u003cp\u003eПрочитав её, Вы узнаете\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eкакие особенности человеческой психики можно использовать для оптимизации процесса тренировок;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eкакие конкретные шаги Вы можете предпринять, чтобы начать использовать эти особенности.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eЗнакомая ситуация в течение года: учёба и другие дела занимают много времени, после них хочется отдохнуть, в результате трудно выкроить время на решение олимпиадных задач.\u003c/p\u003e\u003cp\u003eЗнакомая ситуация сразу после олимпиады: эх, опять готовился к олимпиаде только последние 3 дня, а вот если бы весь год перед этим готовился — точно бы прошёл на Всерос.\u003c/p\u003e\u003cp\u003eКак же осуществить мечту о тренировках круглый год?\u003c/p\u003e\u003cp\u003eМожно использовать следующие особенности человеческой психологии:\u003c/p\u003e\u003cp\u003e 1. Легче начать выполнять работу, когда она кажется маленькой и простой. Начать решать одну задачу проще, чем начать решать 5-часовую тренировку.\u003c/p\u003e\u003cp\u003e 2. Человек может неограниченно откладывать какое-то дело, если это дело можно выполнить когда угодно. А если есть фиксированное время, к которому нужно выполнить это дело, то мотивация существенно повышается при приближении этого времени. Вспомните хотя бы последние дни подготовки перед олимпиадой. ;-)\u003c/p\u003e\u003cp\u003e 3. Легко не выполнить данные себе обязательства (например, регулярно решать задачи), если об этих обязательствах известно только Вам. Но если кто-то другой в курсе этих обязательств, то отказаться от них становится сложнее. Значительно возрастает мотивация выполнить задуманное, а не остановиться на полпути, впустую потеряв много сил и времени.\u003c/p\u003e\u003cp\u003e 4. Когда параллельно тренируются несколько человек, возникает дух соревнования, что также повышает мотивацию решить задачу.\u003c/p\u003e\u003cp\u003eВсе эти и некоторые другие особенности человеческой психологии используются в тренировках Вологодского многопрофильного лицея, в которых Вы тоже можете принять участие. Далее я опишу формат тренировок, чтобы Вы могли понять, насколько они Вам подходят.\u003c/p\u003e\u003cp\u003eРаз в 2 дня даётся задача для решения, по окончании отведённого срока производится разбор этой задачи и выдаётся новая задача для решения.\u003c/p\u003e\u003cp\u003eРазбор происходит в виде видеоконференции. Часть участников участвуют в звонке, часть смотрит трансляцию. Архив записей разборов доступен всем участникам тренировок. После разбора вопросы по задачам можно задавать в комментариях к видео.\u003c/p\u003e\u003cp\u003eТренировки в таком формате начались 28.10.2014, и на момент написания статьи (25.03.2015) разборы проводились 75 раз, каждые 2 дня в 22:00 без единого пропуска. Продолжительность разборов составляет от 10 минут до 1.5 часов, в последнее время типичное время разбора 20 минут.\u003c/p\u003e\u003cp\u003eДо сих пор разбор проводил я, Меньшиков Фёдор Владимирович, в будущем возможно приглашение других экспертов для разбора конкретных задач.\u003c/p\u003e\u003cp\u003eДо сих пор задачи брались с сайта acmp.ru, в будущем возможно использование задач с других сайтов, особенно для тем, недостаточно представленных на acmp.\u003c/p\u003e\u003cp\u003eОбычно разбор сопровождается написанием (и отладкой в случае необходимости) полного решения задачи. Большинство решений написано на C++, пара решений написана на Java для демонстрации подводных камней языка и библиотеки.\u003c/p\u003e\u003cp\u003eНа текущий момент в тренировках принимают участие вологодские школьники, студенты и преподаватели.\u003c/p\u003e\u003cp\u003eЧто даёт такой формат тренировок? Ответим на этот вопрос по пунктам, обозначенным выше.\u003c/p\u003e\u003cp\u003e 1. На каждые 2 дня даётся только 1 задача, типичному участнику тренировок эту задачу вполне по силам решить за час или меньше, и они это знают по опыту решения предыдущих задач, поэтому легче выделить время и приступить к решению задачи.\u003c/p\u003e\u003cp\u003e 2. Крайним сроком для самостоятельного решения каждой задачи можно считать время разбора этой задачи, соответственно, откладывать решение больше чем на 2 дня у Вас не получится.\u003c/p\u003e\u003cp\u003e 3. Если Вы участвуете в тренировках, и уже сдали какие-то задачи, то коллеги по тренировкам это видят. И что Вы очередную задачу даже не пытались сдавать, они тоже увидят. В таких условиях труднее пропустить задачу, когда “нет настроя решать”.\u003c/p\u003e\u003cp\u003e 4. В тренировках участвуют несколько человек, возникает дух соревнования, и каждому хочется самостоятельно решить максимум задач. Фактически, участники тренировок получают 183 “олимпиады” в год.\u003c/p\u003e\u003cp\u003eКроме того, у этих тренировок есть следующие плюсы:\u003c/p\u003e\u003cp\u003e 5. Сложность задач постепенно возрастает. Это означает, что участники со временем приобретают навыки решения всё более сложных задач. Текущий цикл увеличения сложности планируется продолжать ещё минимум полтора года.\u003c/p\u003e\u003cp\u003e 6. Задачи одной темы даются на близких по времени тренировках, что позволяет использовать при решении следующих задач знания, полученные на разборах предыдущих задач.\u003c/p\u003e\u003cp\u003e 7. Во время разбора используются различные возможности языка и стандартной библиотеки, так что участники, знающие только основы языка, могут узнать о каких-то новых полезных возможностях и более простых реализациях.\u003c/p\u003e\u003cp\u003eКто может получить максимальную пользу от таких тренировок:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eЧеловек, уже обладающий базовыми знаниями языка (массивы, строки, вложенные циклы). Если Вы можете решить задачу 109 acmp.ru не более чем за день, то Ваш уровень достаточен.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eУчастник div2. Для участников div1 на codeforces большинство разбираемых в текущее время (март 2015) задач будут достаточно простыми. Задачи, интересные участникам div1, ожидаются примерно через полгода.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eЕсли Вас заинтересовали эти тренировки, Вы можете принять в них участие. Для этого Вам необходимо написать на \u003ca href\u003d\"mailto:mfv@mail.ru\"\u003emfv@mail.ru\u003c/a\u003e о своём желании присоединиться к проекту, указав адрес своего аккаунта на acmp.ru с решённой задачей 109.\u003c/p\u003e\u003cp\u003eПрисоединяйтесь, тренируйтесь и добивайтесь успехов! Это бесплатно. ;-)\u003c/p\u003e\u003cp\u003eСейчас самое время присоединиться к тренировкам. Если Вы присоединитесь через полгода, то уровень разбираемых в то время задач может оказаться слишком высоким, и Вы попросту не сможете решать текущие задачи наравне с остальными участниками. Архив разборов, конечно, будет доступен, но решение задач архива перечёркивает большинство плюсов, обозначенных в этой статье.\u003c/p\u003e\u003cp\u003eЕсли Вы чувствуете, что эти тренировки могут привнести реальные улучшения в процесс Вашей подготовки к олимпиадам и помочь Вам добиться успеха, тогда сейчас самое время присоединиться к ним!\u003c/p\u003e\u003cp\u003eЧтобы облегчить процесс принятия решения, я воспользуюсь принципом 2 из этой статьи и зафиксирую время, до которого можно присоединиться к тренировкам. Присоединиться к ним можно будет или до 5 апреля, или после 1 июня 2015 года. Связано это с тем, что 19 марта начался цикл задач на динамическое программирование, и пока там задачи довольно простые, но их сложность будет неуклонно возрастать в течение пары месяцев, так что присоединиться в середине этого цикла будет сложно. Чтобы успешно присоединиться в середине цикла, нужно будет иметь уже значительный уровень или для набора необходимого уровня потребуется решать задачи этого цикла сначала, что перечеркнёт плюсы, описанные в этой статье.\u003c/p\u003e\u003cp\u003eИтак, жду Вашего письма на \u003ca href\u003d\"mailto:mfv@mail.ru\"\u003emfv@mail.ru\u003c/a\u003e.\u003c/p\u003e\u003ch4\u003eОб авторе\u003c/h4\u003e\u003cp\u003eМеньшиков Фёдор Владимирович:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eавтор книги “Олимпиадные задачи по программированию”,\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eучастник финала студенческого чемпионата мира по программированию 2003,\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eтренер порядка десяти победителей и призёров заключительных этапов Всероссийской олимпиады школьников по информатике и ВКОШП.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":["тренировки","разборы","психология"]}}