{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1420580840,"rating":0,"authorHandle":"Hinidu","modificationTimeSeconds":1420581882,"id":15634,"title":"\u003cp\u003eЭкзамен!\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВот и настал этот долгожданный момент! Мы приближаемся к экзамену.\u003c/p\u003e\u003cp\u003eЯ подготовил 20 вопросов по пройденным темам:\u003c/p\u003e \u003col\u003e   \u003cli\u003eИнвариант. Инвариант цикла. Пример инварианта.\u003c/li\u003e   \u003cli\u003eДвоичный поиск. Поиск элемента в упорядоченном массиве. Обобщённый двоичный поиск.\u003c/li\u003e   \u003cli\u003eАнализ алгоритмов. Время работы алгоритма. Асимптотические обозначения. Рекуррентные соотношения.\u003c/li\u003e   \u003cli\u003eМетод \u0026quot;разделяй и властвуй\u0026quot;. Сортировка слиянием.\u003c/li\u003e   \u003cli\u003eСтруктуры данных. Массивы. Динамические массивы.\u003c/li\u003e   \u003cli\u003eУказатели и связные списки. Стеки. Очереди.\u003c/li\u003e   \u003cli\u003eЗадача сортировки. Применения сортировки. Нижняя оценка сложности для сортировки сравнениями.\u003c/li\u003e   \u003cli\u003eОчереди с приоритетами. Двоичная куча.\u003c/li\u003e   \u003cli\u003eПирамидальная сортировка (heapsort).\u003c/li\u003e   \u003cli\u003eБыстрая сортировка (quick sort).\u003c/li\u003e   \u003cli\u003eСортировка подсчётом (count sort).\u003c/li\u003e   \u003cli\u003eПоразрядная сортировка (radix sort).\u003c/li\u003e   \u003cli\u003eКарманная сортировка (bucket sort).\u003c/li\u003e   \u003cli\u003eХэши. Применение хэшей. Поиск подстроки в строке с помощью полиномиальных хэшей.\u003c/li\u003e   \u003cli\u003eХэш-таблицы. Способы разрешения коллизий.\u003c/li\u003e   \u003cli\u003eБинарные деревья поиска.\u003c/li\u003e   \u003cli\u003eАлгоритм Кнута-Морриса-Пратта.\u003c/li\u003e   \u003cli\u003eПеребор с возвратом. Метод ветвей и границ. Пример применения.\u003c/li\u003e   \u003cli\u003eПоиск в глубину. Сравнение различных способов представления графа. Особенности реализации на дереве.\u003c/li\u003e   \u003cli\u003eПоиск в ширину. Сравнение различных способов представления графа. Особенности реализации на дереве.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eВопросы не будут спарены: нужно будет вытянуть две бумажки, на каждой из которых будет один вопрос.\u003c/p\u003e\u003cp\u003eОтветом на каждый вопрос в идеале должно быть описание задачи/алгоритма/структуры данных/whatever, анализ времени выполнения алгоритма/основных операций над структурой данных, какой-нибудь [псевдо]код по вопросу.\u003c/p\u003e\u003cp\u003eНапоминаю, что для допуска к экзамену нужно сдать все лабораторные работы. Если Вы ещё их не сдали, не отчаивайтесь: у Вас будет возможность сдать их на консультации перед экзаменом, а так же прийти на сам экзамен и сдать их в \u0026quot;последний день\u0026quot;. При этом, если в итоге сдадите всё, то сможете в этот же день вытянуть билет.\u003c/p\u003e\u003cp\u003eНе стесняйтесь писать мне в личные сообщения на этом сайте, если есть вопросы по лабам, или, если Вы мне их уже сдавали, и я попросил немного их доделать (в этом случае, я могу зачесть их в онлайне).\u003c/p\u003e\u003cp\u003e5 автоматом заработали Котов и Широченко, поздравляю!\u003c/p\u003e\u003cp\u003eЕсли есть какие угодно вопросы по билетам или форме проведения экзамена, пишите сюда.\u003c/p\u003e\u003c/div\u003e","tags":[]}}