{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1415106466,"rating":782,"authorHandle":"Fefer_Ivan","modificationTimeSeconds":1415119106,"id":14580,"title":"\u003cp\u003eAndrew Stankevich Contests — 46 contests later\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eGood evening, Codeforces.\u003c/p\u003e\u003cp\u003eSome time ago I added the last 46th Andrew Stankevich Contest to the Gym. Now all of them are added. Here is a complete \u003ca href\u003d\"/group/j9VlExDLmA/blog/entry/64\"\u003elist\u003c/a\u003e and the \u003ca href\u003d\"/group/j9VlExDLmA/contests\"\u003egroup\u003c/a\u003e with all the contests.\u003c/p\u003e\u003cp\u003eNow I want to tell what was done during the process of adding all the contests to the gym.\u003c/p\u003e\u003cp\u003e   \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eIn some problems tests and checkers (the program to check if the participant\u0027s answer is correct if it is ambigious) are fixed. Errors were found not only by me, but by the members of Codeforces community as well.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIn most of the archive tests were generated from scratch. I tried to use the sam compiler versions because some test generator program used built-in pseudorandom number generator and they can produce different numbers in different compilers.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIn old contests time limits were adapted to fit on modern computers. For more precise time limit tuning I used not only jury\u0027s solutions from the contest archives, but actual solutions from the contestants of the Petrozavodks Training Camps. All used solutions are available in Gyms if you have coach access.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eAndrew Stankevick Contests materials are distributed under \u003ca href\u003d\"http://creativecommons.org/licenses/by/4.0/deed\"\u003eCreative Commons 4.0 Attribution\u003c/a\u003e license. My work with ASCs is finished for now. But soon Winter Petrozavodks Training Camp 2014-2015 will take place and, I hope, that Andrew Stankevich Contest 47 will be successfully held there. And after it I will successfully add it to the Gym.\u003c/p\u003e\u003cp\u003eAlso, I want to inform you, that from now on I am not Codeforces developer any more. I was a developer for 1.5 year. During this time I learned a lot of interesting things and implemented, I hope, useful features for Codeforces, Polygon and you, dear users. Validator and checker tests in Polygon, groups, mashups and so on. This 1.5 year is unforgettable for me. Thank you.\u003c/p\u003e\u003cp\u003eWith best regards, Ivan.\u003c/p\u003e\u003c/div\u003e","tags":["asc","codeforces"]}}