{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1478897406,"rating":65,"authorHandle":"duckladydinh","modificationTimeSeconds":1478897406,"id":48340,"title":"\u003cp\u003eAny solution to the problem of \u0027aging\u0027?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eDear competitive coders, (this is as lengthy as \u0027Codeforces problem statements\u0027 and irrelevant to improving your skills, so never mind it if you are short of time, but if you could read it and find an \u0027AC solution\u0027 to my problem, I would like to deeply appreciate it)\u003c/p\u003e\u003cp\u003eThe past 2 years made the most tedious period of my life. Time has revealed to me a miserable truth that I am too old to be a coder or even anything. If one takes a look at my rating graph, it would be crystal clear that my 2 years of lifetime has been wasted. The line was just fluctuating around some certain points depending on my emotional states (approximately 1600 at first, then 1850 thanks to the recent \u0026quot;Rating Inflation\u0026quot;, I was actually happy with it for a while though). No improvement, yeah, 2 years without any improvement at all. I start to wonder if I am really aging that fast.\u003c/p\u003e\u003cp\u003eNever can I forget the first time I started coding, 8 years ago. When my friends were learning Excel, I was coding my the first infamous Pascal program, \u0026quot;Hello World\u0026quot;, for... almost 1 and a half hour (Well I am aware that I was originally not an intelligent being, trying to replace the command name and the \u0026quot;;\u0026quot; for something more beautiful :p and receive red warnings all over the windows, but hard work beats smart mind, I made it run finally). I coded through days and nights since then; stay in the local bookstores to read all the programming books I found till they closed. Now, whenever I attempt to code, my body seems to be functioning on its own, like I want to break something, hit someone, jump back and forth, and even after... trying all, I could never force myself to focus on a problem for long enough, not to mention sometimes I did even give up reading a problem statement because I forgot the sentence as soon as I moved on to the next one. What is exactly going wrong with me? No idea but it is just terrible... but not all. At first glance, it seemed that I just could not improve, but the more terrifying truth to me is that my learning ability has a serious problem. I cannot learn new things. Everything got worse in my class. I still survived through my exams, but all I did were \u0027sleep till the final day\u0027 and write all stuff that I \u0027already knew long long ago\u0027 (thanks God that I study Computer Science). My lectures are hopeless. Over the past 2 years, I simply could not learn a single new thing. My brain seems full even though I know more than anyone, it has always been empty. Is this a symptom of aging? I wonder if it is really too late for me to learn. Am I really that old? I am already 20. \u003c/p\u003e\u003cp\u003eIt is not like I don\u0027t devote enough time to learning. \u0027Even more\u0027, I can say. I did attend \u0027all\u0027 my lectures, trying to listen to my teacher without sleeping (in the past I often skipped my class and got away from school whenever I could do it officially). I spend nights trying to force myself to read book, all sorts of book, mostly till midnight, many till morning, but all were in vain. I simply could not read at all. Deep inside my mind, I am still able to sense some sort of desire to break through my limit, to fly higher and succeed, but just as soon as I get started, foolish thoughts suck as \u0026quot;Let\u0027s eat first\u0026quot;, \u0026quot;A movie is nice\u0026quot;, \u0026quot;Sleep please\u0026quot;. I end up doing nothing, fighting against these thoughts like fighting a loosing battle until no time left any more or even if I somehow I manage to get rid of them temporarily, I end up so tired and loose consciousness soon enough... before they came back.\u003c/p\u003e\u003cp\u003eI understand Codeforces is not a place for self-complaining. I just believe that, among us, there exist many great people, who are old (even older than me) enough to suffer from something similar and are well experienced enough to find a solution for it. I want to know if I have any light hope of gaining back my youth or should I better just accept my age and leave the playground now.\u003c/p\u003e\u003cp\u003eThank you for reading so far. Your patience and determination are far superior to that of mine. Happy Coding\u003c/p\u003e\u003c/div\u003e","tags":[]}}