{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1465654805,"rating":33,"authorHandle":"tenshi_kanade","modificationTimeSeconds":1465654976,"id":45367,"title":"\u003cp\u003eSPOJ — What the...?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI want to tell a curious story that happened to me while solving a problem on SPOJ. It happened a few days ago.\u003c/p\u003e \u003cul\u003e   \u003cli\u003eSolved a problem. Submitted the code. Result: \u003cstrong\u003eWA\u003c/strong\u003e.\u003c/li\u003e   \u003cli\u003eI, being pretty sure that my solution was correct and knowing that SPOJ\u0027s checker is an abomination, decided to resubmit the \u003cstrong\u003eexact\u003c/strong\u003e same code, only seconds apart from my first submission. Result: \u003cstrong\u003eAC\u003c/strong\u003e.\u003c/li\u003e   \u003cli\u003eNot happy enough, I decided to test the unstable system of SPOJ. So I submitted the same code, for the third time. As I expected, the junk that SPOJ use went haywire again, and result was \u003cstrong\u003eWA\u003c/strong\u003e.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThis was obviously not the first time I had problems with SPOJ and its rusty short-circuited servers. Every single time I want to solve a problem there, I know what\u0027s coming. I expect lots of unstable testing and false WA\u0027s.\u003c/p\u003e\u003cp\u003eSo, I\u0027ve made up my mind. From now on, or at least until SPOJ staff decide to do something about that junkyard they use, I\u0027ll only use SPOJ if I want to solve a problem that\u0027s not on \u003cstrong\u003eany\u003c/strong\u003e other online judge. Nothing will give more headaches, not even UVA with its ridiculous parsers.\u003c/p\u003e\u003cp\u003eOK, I just wanted to share my thoughts. Let\u0027s hope I don\u0027t get so many downvotes for my shitpost. Have a nice day!\u003c/p\u003e\u003c/div\u003e","tags":["spoj","junk","judge","horseshit","stinky","abominable"]}}