{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1489087615,"rating":0,"authorHandle":"AN_out_of_date","modificationTimeSeconds":1489119972,"id":50890,"title":"\u003cp\u003e1.Graph covering with prespecified subgraphs _ medium-hard _ As a sample structur\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI want to define a new structure as the first problem of this group. As you may know, in the world of problem solving, the main things are structures. Actually I think a real problem solver is who can see structures and work with them.\u003c/p\u003e\u003cp\u003eIn this structure we maintain a group of graphs( like trees ), to be covered by some subgraphs. If we can find the structure we can ask some problems like finding minimum number of subgraphs to cover a graph or number of ways to do it.\u003c/p\u003e\u003cp\u003eFirst I thought about this idea a bit: Our graph is a square of \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e·\u003ci\u003em\u003c/i\u003e\u003c/span\u003e cells. Now we want to cover this graph with subgraphs that have diameters less than d?\u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003e1\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eI saw maybe the problem could be solved with covering the graph with squares of \u003cimg align\u003d\"middle\" class\u003d\"tex-formula\" src\u003d\"/predownloaded/1b/dc/1bdca651b1168304e6b721e405a7d23717e85ce5.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eI saw the problem was not interesting. So I changed the problem a bit. I used this constraint that there shouldn\u0027t be a 2*2 square as a subgraph of these subgraphs.\u003c/p\u003e\u003cp\u003eI was trying to come up with this problem that I thought about solve the problem for trees. There, it was quite more simple. \u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003e2\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eThe idea is you first start from vertex with degree 1, do greedily and don\u0027t worry about two subgraph overlapping.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eBut I\u0027m a little confused about the previous problem.\u003c/p\u003e\u003cp\u003ePlease write your Ideas about the improvements. I will think about it more and update this blog.\u003c/p\u003e\u003cp\u003eThe problem is a simple problem and I don\u0027t think about it well, yet.\u003c/p\u003e\u003c/div\u003e","tags":[]}}