{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1478357161,"rating":17,"authorHandle":"stgatilov","modificationTimeSeconds":1479184682,"id":48236,"title":"\u003cp\u003eFirst tour of Wide-Siberion Olympiad (2016)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThis year contestants implemented AI to manage robotic vacuum cleaners.\u003c/p\u003e\u003cp\u003eThe game has massive-multiplayer style, which is strongly different from our previous games, which were usually either single-player (e.g. \u003ca href\u003d\"https://www.youtube.com/watch?v\u003dGwdrpD7SRng\"\u003ein 2010\u003c/a\u003e) or player-vs-player (e.g. \u003ca href\u003d\"https://www.youtube.com/watch?v\u003dWbNQp144eEk\"\u003ein 2013\u003c/a\u003e). All 50 participating teams compete altogether in every game. Each player manages 10 robots, which drive on the round field. If a robot collides with another smaller robot (or with passive immobile \u0026quot;food\u0026quot;), then the former devours the latter, and its area is increased by the area of the devoured object. The player who devours everything wins (this surely happens since game field is gradually contracting). Game score of arbitrary player is defined as the overall area of all his robots at the best (for him) time moment. As size of robot increases, its speed decreases. That\u0027s why the game has turbo mode, which allows to double robot speed from time to time.\u003c/p\u003e\u003cp\u003eIn order to avoid technical problems with running 50 solutions simultaneously, we decided to restrict the competition to a single programming language, which is Lua language. This is \u003ca href\u003d\"//codeforces.com/blog/entry/9438\"\u003enot the first time\u003c/a\u003e when we have to ask contestants to use this language. The game is launched in a single OS process, and each player lives in its own sandboxed Lua-state. As a result, it is possible to run a game with 50 players even locally on an ordinary computer.\u003c/p\u003e\u003cp\u003eThe game was launched in a loop approximately every three minutes during the tour. Only the most recent solution of each team took part in the game. Since about the middle of the tour we started to show the results of current games on a big TV or a projector in each classroom. \u003ca href\u003d\"https://www.youtube.com/watch?v\u003dq5stX69iefA\"\u003eSupporters were stuck near the TV\u003c/a\u003e in the jury room, which looked approximately like this:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"The TV in jury room\" src\u003d\"/predownloaded/0b/42/0b426439ef1ae8ce7a6e33166c03fd4134105fc1.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eOf course, the most interesting games were in the middle of the competition, when players\u0027 strategies changed dramatically. During some time these games can be downloaded from \u003ca href\u003d\"http://parallels.nsu.ru/shelezyaka/main/\"\u003ethe server\u003c/a\u003e, for instance using the \u0026quot;download.bat\u0026quot; script. Here are the videos of several games (\u003ca href\u003d\"https://www.youtube.com/watch?v\u003dugxPVCC4hxQ\u0026amp;list\u003dPLqXJ4pZLQdm07wTB_BKp2ASY_tCi383_Q\"\u003eyoutube-playlist\u003c/a\u003e of all games; good quality videos can be downloaded from \u003ca href\u003d\"https://yadi.sk/d/T43ecZ0iyc4jD\"\u003ehere\u003c/a\u003e):\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eAn hour after the contest started: \u003ca href\u003d\"https://youtu.be/ugxPVCC4hxQ\"\u003erun 100\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eTwo hours after the start: \u003ca href\u003d\"https://youtu.be/YV8RYF72VZo\"\u003erun 150\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThree hours after the start: \u003ca href\u003d\"https://youtu.be/_Frwl5oVfdI\"\u003erun 175\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThree hours and a half after the start: \u003ca href\u003d\"https://youtu.be/SxIPMlZ3okk\"\u003erun 200\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eFour hours and a half after the start: \u003ca href\u003d\"https://youtu.be/48XrYTubZZ8\"\u003erun 230\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAfter the tour ended: \u003ca href\u003d\"https://youtu.be/L9CkOeQRtrk\"\u003erun 256\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eNow you can download (related to the game):\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003e\u003ca href\u003d\"https://yadi.sk/d/fi8x6ej_yc3zu\"\u003eThe full archive\u003c/a\u003e: source codes of the game, participants\u0027 solutions, Windows binaries.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca href\u003d\"https://yadi.sk/d/b_qI_0Tay7yVt\"\u003eMaterials\u003c/a\u003e: only Windows binaries.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003c/div\u003e","tags":["wso","lua","game"]}}