{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1520883676,"rating":26,"authorHandle":"Seryi","modificationTimeSeconds":1520883920,"id":58332,"title":"\u003cp\u003eОткрытый чемпионат Юга России 2018\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eC 15 марта по 22 апреля Институт компьютерных технологий и информационной безопасности Южного федерального университета проводит II Открытый чемпионат Юга России по программированию. \u003c/p\u003e\u003cp\u003eВ этом году в соревновательную программу Чемпионата входят шесть турниров:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eКомандный турнир по спортивному программированию (все желающие, команда из 2-3 чел., очный финал 22 апреля);\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eТурнир игровых стратегий Code Warriors Challenge (все желающие, команда из 2-3 чел.);\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eТурнир школьников (школьники 9-11 классов и студенты колледжей; победители и призеры турнира получают льготы при поступлении в ЮФУ);\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eТурнир Junior Contest (школьники не старше 9 класса, не имеющие серьезного опыта участия в олимпиадах по программированию);\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eТурнир по программированию на языке Scratch (школьники не старше 7 класса);\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eЛичный турнир по спортивному программированию (для студентов ЮФУ).\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eКаждый турнир проводится в 2 этапа: отборочный онлайн-тур и очный финал в г. Таганроге (20-22 апреля). \u003c/p\u003e\u003cp\u003eВ Чемпионате могут принимать участие все желающие из России и других стран, независимо от возраста, уровня образования, специальности, места работы и т.п. Участие в Чемпионате бесплатное для всех категорий участников. \u003c/p\u003e\u003cp\u003eПартнерами Чемпионата являются ведущие IT-компании Юга России.\u003c/p\u003e\u003cp\u003eРегистрация, расписание и другая информация доступны на сайте Чемпионата: \u003ca href\u003d\"http://www.contestsfedu.org\"\u003ewww.contestsfedu.org\u003c/a\u003e\u003c/p\u003e\u003cp\u003eОтзывы о прошлогоднем чемпионате: \u003ca href\u003d\"//codeforces.com/blog/entry/51716\"\u003ehttp://codeforces.com/blog/entry/51716\u003c/a\u003e\u003c/p\u003e\u003cp\u003eТренировка по задачам прошлого года: \u003ca href\u003d\"//codeforces.com/gym/101364\"\u003ehttp://codeforces.com/gym/101364\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["таганрог","юфу","чемпионат юга россии"]}}