{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1467024785,"rating":19,"authorHandle":"MiptLited","modificationTimeSeconds":1467129853,"id":45685,"title":"\u003cp\u003eЛетняя олимпиадная школа МФТИ 2016\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/27/a6/27a646ace08c3b29e174e5e45776985f617f14bf.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eВ 2016 году на базе кампуса МФТИ и Физтех-лицея (куратор \u003ca href\u003d\"http://it-edu.mipt.ru/ru\"\u003eЦРИТО МФТИ\u003c/a\u003e) пройдут две Летних олимпиадных школы. К участию приглашаются школьники, закончившие 8, 9, 10 или 11 класс. В школе можно обучаться по направлениям: математика + информатика, математика ПРОФИ, информатика ПРОФИ, робототехника + информатика (только 1-я смена) и прочие.\u003c/p\u003e\u003cp\u003eДаты проведения:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003e17-30 июля — 1-я смена\u003c/strong\u003e\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003e31 июля — 13 августа 2016-го года — 2-я смена\u003c/strong\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eЕжедневно на школе проводятся 6 академических часов занятий в небольших группах. Программа школы включает в себя ежедневные лекции и семинары, разбор методов решения олимпиадных задач, научно-популярные лекции приглашенных преподавателей, олимпиады. На занятиях в 8, 9 и 10 классах преподаватели разбирают различные олимпиадные задачи и эффективные методы их решения. В 11 классе занятия направлены на подготовку к дальнейшему обучению в МФТИ. В свободное время для всех желающих запланировано проведение спортивных соревнований и интеллектуальных игр. Так же вы можете в любое время обращаться с различными вопросами к преподавателям. По итогам школы всем участникам будут выданы сертификаты. \u003c/p\u003e\u003cp\u003eНа время проведения школы для участников будет организован полный пансион в кампусе МФТИ (проживание в общежитии повышенной комфортности и пятиразовое питание).\u003c/p\u003e\u003cp\u003eДля поступления в школу вам необходимо заполнить форму \u003ca href\u003d\"https://goo.gl/8hvQQJ\"\u003ehttps://goo.gl/8hvQQJ\u003c/a\u003e и пройти тестирование. \u003cstrong\u003eОтправить заявку на регистрацию и пройти тестирование необходимо до 4 июля\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eДля направлений математика + информатика и информатика ПРОФИ вам необходимо пройти тестирование по математике и информатике. Для направлений математика ПРОФИ вам достаточно пройти одно тестирование по математике. Для направления робототехника + информатика (только 1-я смена) вам необходимо пройти тестирование по информатике.\u003c/p\u003e\u003cp\u003eТестирование по \u003ca href\u003d\"http://abitu.net/event/1934/olympic.profile-olympics\"\u003eматематике\u003c/a\u003e и \u003ca href\u003d\"https://contest.yandex.ru/miptsummer2016/form/?ncrnd\u003d3206\"\u003eинформатике\u003c/a\u003e(\u003ca href\u003d\"http://it-edu.mipt.ru/school_olymp/summer16/inform_instructions\"\u003eинструкция по тестированию\u003c/a\u003e).\u003c/p\u003e\u003cp\u003eТестирование нужно проходить за тот класс, который вы закончили(например, если вы закончили 8 класс, то тестирование вам нужно проходить за 8 класс). Тестирование по информатике одинаковое для всех классов.\u003c/p\u003e\u003cp\u003eПодробную информацию и списки приглашенных можно найти на сайте школы: \u003ca href\u003d\"http://it-edu.mipt.ru/ru/school_olymp/summer16\"\u003ehttp://it-edu.mipt.ru/ru/school_olymp/summer16\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["лош","мфти"]}}