{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1487554965,"rating":231,"authorHandle":"SuprDewd","modificationTimeSeconds":1487554965,"id":50528,"title":"\u003cp\u003eAlgoWiki: A wiki dedicated to competitive programming\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg align\u003d\"right\" alt\u003d\"AlgoWiki logo\" src\u003d\"/predownloaded/90/99/9099e63ce0d03764f940b1afcb2caa8d53510b0c.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHi everyone. Over the past couple of years I\u0027ve been collecting problems, articles, and competitive programming resources that I find interesting. It\u0027s already grown to dozens of sheets in multiple Google Sheet documents, and is a pretty bad mess. As an effort to organize this list and make it public, I decided to turn it into an online wiki dedicated to competitive programming: \u003ca href\u003d\"https://wiki.algo.is/\"\u003eAlgoWiki\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe url is \u003cstrong\u003ewiki.algo.is\u003c/strong\u003e, so it should be easy to remember.\u003c/p\u003e\u003cp\u003eI\u0027m far from done migrating stuff into the wiki, but I think there\u0027s already quite a bit of useful information in there. I tried to prioritize algorithms/data structures/techniques that are less known, and then listed problems and articles that I thought were especially useful for learning/practicing the given topic. In some cases I\u0027ve additionally extracted/written content about the given topic, with notes that point out common pitfalls or help give a better intuition for the topic.\u003c/p\u003e\u003cp\u003eTo give you an example, consider the \u003ca href\u003d\"https://wiki.algo.is/Minkowski%20sum\"\u003eMinkowski sum\u003c/a\u003e page, a topic that I think is pretty neat, but has yet to become \u0026quot;mainstream\u0026quot; among competitive programmers (as far as I can tell). Here I\u0027ve extracted relevant sections from Wikipedia, listed problems that can be solved using Minkowski sums, linked to comments/editorials that might give some hints for each problem, and given some links about Minkowski sums that I thought were useful. Ideally I would like to rewrite the text with competitive programming in mind, but the Wikipedia sections serve as filler content for now.\u003c/p\u003e\u003cp\u003eNow, while I hope you enjoy what I have gathered so far as well as what may be added in the future, I would also like to invite you to contribute whichever neat algorithms/data structures/techniques/problems/articles you may encounter, so that others may also benefit. This is a wiki after all... Currently there are two ways to contribute:\u003c/p\u003e \u003col\u003e   \u003cli\u003eby \u003ca href\u003d\"https://wiki.algo.is/_register\"\u003ecreating an account\u003c/a\u003e on AlgoWiki and  editing pages through the web interface (as is common on online wikis), or\u003c/li\u003e   \u003cli\u003eby forking \u003ca href\u003d\"https://github.com/SuprDewd/AlgoWiki\"\u003eAlgoWiki on Github\u003c/a\u003e, where  all the wiki source files are stored.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eMy goal is to keep the wiki as open as possible, while also keeping the quality of the content high. If you want to help me moderate contributions, feel free to get in touch.\u003c/p\u003e\u003cp\u003eI also have another related project in the works, which is at an even earlier stage of development. The motivation for that project is that great problem sets, articles, and other competitive programming resources, especially older ones, are slowly \u003ca href\u003d\"//codeforces.com/blog/entry/47808\"\u003edisappearing\u003c/a\u003e \u003ca href\u003d\"//codeforces.com/blog/entry/8061\"\u003efrom\u003c/a\u003e \u003ca href\u003d\"//codeforces.com/blog/entry/16515?#comment-214071\"\u003ethe\u003c/a\u003e \u003ca href\u003d\"//codeforces.com/blog/entry/21658?#comment-298168\"\u003einternet\u003c/a\u003e. Another case in point: the link to the third problem on the Minkowski sum page linked to above is already dead. As a digital data hoarder with much respect for the effort that went into developing these resources, that makes me very sad. To battle that, I would like to create an archive/mirror of competitive programming resources.\u003c/p\u003e\u003cp\u003eI already have something very primitive up and running at \u003ca href\u003d\"http://archive.algo.is/\"\u003earchive.algo.is\u003c/a\u003e, with some content that I\u0027ve scraped online. As this is very early stage (and this applies to the wiki as well), I have not yet gone through licenses/contacted rights owners, so if there is anything there that I may not be allowed to redistribute, please let me know.\u003c/p\u003e\u003cp\u003eI also have a lot of other material, both digital (e.g. training camp material) and on paper (e.g. \u0026quot;vintage\u0026quot; problem sets from CMU around 2000), that I would love to make available online, given an approval from the respective sources.\u003c/p\u003e\u003cp\u003eThe ultimate goal would then be a vast, yet well organized collection of problem sets (with test data), and other kinds of competitive programming resources, reliably mirrored over several machines on the internet. In particular, this could then be used by the wiki without fear that the links eventually die.\u003c/p\u003e\u003cp\u003eIf you would like to help me get this started, or have any material you can contribute to this, please, also get in touch.\u003c/p\u003e\u003c/div\u003e","tags":["wiki","algowiki"]}}