{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1426889962,"rating":36,"authorHandle":"adurysk","modificationTimeSeconds":1427227313,"id":17050,"title":"\u003cp\u003eInsomnia — 2K15\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eAre you up for the challenge?\u003c/p\u003e\u003cp\u003e24 Hours of Non-Stop Thrill! Insomnia 2015!\u003c/p\u003e\u003cp\u003eProgramming and Algorithms Group, and SDSLabs of IIT Roorkee are jointly organizing their flagship programming competition, Insomnia. \u003c/p\u003e\u003cp\u003eSince its inception in 2009, Insomnia has been witnessing an increasingly huge international participation. Noticing participation from some of the leading names of competitive programming, PAG and SDSLabs have amped up the level of the competition from a 12 hour to a 24 hour contest.\u003c/p\u003e\u003cp\u003eThis year\u0027s problem setters include members of 3Spades, Winner of ACM-ICPC Amritapuri Regional and previous ICPC World Finalists.\u003c/p\u003e\u003cp\u003eThe contest will have about 20 odd problems and will last for 24 hours with varying difficulty. Contestants will be expected to submit working code in either C/C++ or Java. \u003c/p\u003e\u003cp\u003eIt is a team contest with a maximum team size of 3. The contest will be held on our own personal grader \u003ca href\u003d\"https://codevillage.sdslabs.co/\"\u003eCode Village\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe contest starts at 21:00(IST) on 21st March, 2015.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate :\u003c/strong\u003e The prize money of the contest is INR 20,000.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate 2:\u003c/strong\u003e The contest started!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate 3:\u003c/strong\u003e Coming into the last two hours of the contest, we see a fierce battle between the top teams of the leaderboard. Even though Yuhao Du is still leading with 17 solved problems, we have Team Believe at second followed by team confused, both with 16 accepted solutions! Team WontGiveItBack is right at their heels with 15 ACs! It is going to be interesting to see how this ends!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate 4:\u003c/strong\u003e So finally we have a winner! Having stayed on the top of the leaderboard right from the start of the contest, Yuhao Du from China has won Insomnia 2015! Kudos, man!\u003c/p\u003e\u003cp\u003eBelieve from IIIT Hyderabad comes second, followed by Team confused from Jahangirnagar University, Bangladesh. Three different countries in the top-3! The campus winner is team WontGiveItBack. All the winners shall be contacted soon regarding their prize money.\u003c/p\u003e\u003cp\u003eYou can check out the complete leaderboard at \u003ca href\u003d\"https://codevillage.sdslabs.co/user/view_rank/1/1000/30\"\u003ehttps://codevillage.sdslabs.co/user/view_rank/1/1000/30\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe editorials will be sent to all the participants at the email ids which you used to register for the contest. Others can check our event page for updates. This year, Insomnia saw over 600 distinct users and about 3000 submissions. This is a huge increase from last year. We hope you liked the problem set. If you enjoyed the contest, please spare a moment and give us your feedback. This will help us improve for next year!\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://docs.google.com/forms/d/18UaLy7lcizLiDPwdt6xLNEbkaEITijGCnj8I0OYURQA/viewform?edit_requested\u003dtrue\"\u003ehttps://docs.google.com/forms/d/18UaLy7lcizLiDPwdt6xLNEbkaEITijGCnj8I0OYURQA/viewform?edit_requested\u003dtrue\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate 5:\u003c/strong\u003e Editorials of Insomnia 2015 are up, check them out \u003ca href\u003d\"http://ge.tt/59npSrC2/v/0\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eFor further details and updates, check out our \u003ca href\u003d\"https://www.facebook.com/events/1590085714569735/\"\u003efacebook event page\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/d0/89/d089b002fc516c03bddef0415812a3641c1be292.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["#algorithms","competitive programming","c++","java","iit roorkee","#acmicpc"]}}