{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1421050226,"rating":58,"authorHandle":"Yury_Bandarchuk","modificationTimeSeconds":1422775259,"id":15748,"title":"\u003cp\u003eОбластная олимпиада в Беларуси 2015\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет! \u003c/p\u003e\u003cp\u003eСовсем скоро, 13-14 января, пройдут основные туры областной олимпиады в Беларуси.\u003c/p\u003e\u003cp\u003eПредлагаю после туров обсуждать задачи и делиться результатами здесь!\u003c/p\u003e\u003cp\u003eGL \u0026amp;\u0026amp; HF!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e Ну что, как вам задачки первого тура? \u003c/p\u003e\u003cp\u003eКраткие соображения по решению задач (SPOILER) :\u003c/p\u003e\u003cp\u003e\u003cem\u003e1.\u003c/em\u003e Тут все ясно, просто массив на сто элементов.\u003c/p\u003e\u003cp\u003e\u003cem\u003e2.\u003c/em\u003e Перебираем R до корня, затем бинарным поиском ищем максимальное C. Не забыть лонги.\u003c/p\u003e\u003cp\u003e\u003cem\u003e3.\u003c/em\u003e Два указателя + добавить спереди нулей, чтобы числа были одной длины. Не забыть при выводе убрать лидирующие нули. Не забыть лонги [2].\u003c/p\u003e\u003cp\u003e\u003cem\u003e4.\u003c/em\u003e Дп по дереву: dp[ver][0] — максимальный путь до какого-либо из листов + мы не снимали налог ни с одной дороги, за которые отвечает вершина \u003cstrong\u003ever\u003c/strong\u003e. dp[ver][1] — то же самое, только мы уже сняли один налог. Затем просто два максимума по детям dp[ver][1] и dp[ver][0]. \u003c/p\u003e\u003cp\u003eНадеюсь это должно работать \u003d) \u003c/p\u003e\u003cp\u003eУсловия первого дня \u003ca href\u003d\"http://dropmefiles.com\"\u003eздесь\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eВторой тур завершен. Мне задачи понравились :)\u003c/p\u003e\u003cp\u003eОпять соображения :\u003c/p\u003e\u003cp\u003e\u003cem\u003e1.\u003c/em\u003e Два указателя на концы строк и погнали.\u003c/p\u003e\u003cp\u003e\u003cem\u003e2.\u003c/em\u003e Раскладываем на простые множители и каждый множитель доводим до степени, кратной трем. Это и будет ответ.\u003c/p\u003e\u003cp\u003e\u003cem\u003e3.\u003c/em\u003e Посчитаем H[i][j] — количество спичек на одинаковых местах у чисел \u003cstrong\u003ei\u003c/strong\u003e и \u003cstrong\u003ej\u003c/strong\u003e.\u003cbr /\u003eЗатем посчитаем такую динамику : dp[len][sum][eq], где len — длина префикса, который рассмотрели, sum — сумма спичек, которую набрали, eq — сколько на нормальных местах стоит, что не пришлось менять. Затем ответом будет просто сумма по всем dp[n][mySum][x], где mySum — x \u0026lt;\u003d k. Ограничение по памяти не позволяло считать такую дп, поэтому считаем просто по слоям.\u003c/p\u003e\u003cp\u003e\u003cem\u003e4.\u003c/em\u003e Первые 8 тестов — динамика за N^2 * K. Где dp[len][used] — минимальная стоимость, если мы уже набрали used групп, и последняя группа закончилась в позиции len. Предварительно нужно отсортить массив. 9-й тест — просто костыльный, там все тройки в инпуте. А в 10й написал жадность — сделал группы макс размера и следовательно остались ещё группы. Тогда уменьшаю самую большую группу и добавляю новую или добавляю в старую, но меньшего размера. Улучшаем пока улучшается.\u003c/p\u003e\u003cp\u003eДелитесь своими идеями и решениями, а я буду надеяться, что это все зайдет! \u003d)\u003c/p\u003e\u003cp\u003eКидайте резы по вашим областям мне в лс.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e Есть резы Брестской, г. Минска, Гомельской области и Лицея БГУ и , скидывайте резы свои, жду!\u003c/p\u003e\u003cp\u003eНеполные результаты : \u003ca href\u003d\"http://dropmefiles.com/q3inZ\"\u003eLink\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e Добавил Могилевскую область.\u003c/p\u003e\u003c/div\u003e","tags":["2015","беларусь","картошечка"]}}