{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1436963273,"rating":-28,"authorHandle":"Yet1","modificationTimeSeconds":1436969102,"id":19228,"title":"\u003cp\u003eПочему не стоит заниматься олимпиадным программированием в Алматы.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ Казахстане три университета, где развито олимпиадное программирование ( ОП ). В Алмате — КБТУ и МУИТ, в Астане — Назарбаев Университет. Не знаю, как обстоят дела в Астане, но расскажу об алматинских. Они могут гордиться своими командами, побывавшими на финалах АСМ. Боюсь, во многом это была заслуга Фуада Гаджиева, который понимал трудность совмещения учебы и ОП и помогал олимпиадникам в решении их проблем. Те времена прошли, Фуад Гаджиев уехал из Казахстана и никто не смог заменить его. Университеты отчаянно борются за абитуриентов олимпиадников, раздавая им гранты. И школьники клюют на посулы – занимайся ОП и прославляй университет, попадешь на финал — станешь гордостью страны, о тебе напишут в газетах! А теперь посмотрим, что на самом деле. Сколько надо заниматься, чтобы попасть на финал? Допустим, ты в первой команде университета. Сентябрь – ты в Ижевске на сборах две недели (с дорогой). Октябрь – в Москве две недели. Ноябрь – усиленная подготовка перед полуфиналом в Ташкенте. В декабре – сессия. Сколько ты проучился? Сколько пропустил рубежек? Итог – первый семестр в лучшем случае на троечку и с хвостами. Не дай бог (!!!) пробьешься в финал – второй семестр вообще будет не до учебы. И опять хвосты , хвосты. Вся проблема в том, что ты , абитуриент-олимпиадник, нужен для пиара университета, но преподавателям университета на тебя… И помощи ждать неоткуда. Выкручивайся сам как хочешь. А может, особо отличившимся все-таки помогают? Я знаю, дважды финалиста АСМ, не закончившего второй (!!!) курс за несколько лет! Школьники, подумайте сто раз прежде чем заниматься ОП в Казахстане. PS. Команда олимпиадников ищет ВУЗ, который ПОМОЖЕТ заниматься ОП. PS2. Хотел призвать к обсуждению казахстанцев, но думаю, что студенты откровенны не будут. \u003c/p\u003e\u003c/div\u003e","tags":[]}}