{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1485659250,"rating":4,"authorHandle":"mutreta","modificationTimeSeconds":1485659250,"id":50091,"title":"\u003cp\u003eYet another blog... Why?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eSince \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/kogyblack\" title\u003d\"Expert kogyblack\"\u003ekogyblack\u003c/a\u003e and I (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/athoscouto\" title\u003d\"Candidate Master athoscouto\"\u003eathoscouto\u003c/a\u003e) started studying competitive programming we couldn\u0027t solve the problem of how to keep and share all the knowledge that we were learning. As soon as we started we realized we couldn\u0027t be much better than the people that were studying and competing with us.\u003c/p\u003e\u003cp\u003eSo we assembled a group of people interested from IME (our college) and started teaching them (I\u0027d say that 90% of the effort was \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/kogyblack\" title\u003d\"Expert kogyblack\"\u003ekogyblack\u003c/a\u003e\u0027s). We tried to create Power Point slides, Google Drive docs, sheets, etc.. Even to create our own website with Markdown and LaTeX renderer. Nothing really kind of stuck on.\u003c/p\u003e\u003cp\u003eSo I decided to create this blog, where we could create posts about all the topics we would teach people every year. I also started it in English, although our primary language is Portuguese. This last decision has two main reasons: computer science subjects demands good English, the blog contents could be used by more people.\u003c/p\u003e\u003cp\u003eWhy to I think is better to write it on Codeforces?\u003c/p\u003e \u003col\u003e   \u003cli\u003eWe use it almost everyday.\u003c/li\u003e   \u003cli\u003eIt\u0027s easy to add content.\u003c/li\u003e   \u003cli\u003eIt\u0027s easy to receive feedback.\u003c/li\u003e   \u003cli\u003eContent can be easily shared outside our college too.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eAlthough most of our content is available on the web, I\u0027d like to make the best material possible for our peer\u0027s needs. we have pretty tight time constraints and search for good content and some unusual tips and tricks (some of them are only available in comments) can be very time consuming. It may not suit the needs of everybody, nor be the best material available, but I hope this blog will be of good use for some :)\u003c/p\u003e\u003c/div\u003e","tags":[]}}