{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1476602558,"rating":3,"authorHandle":"tcchung","modificationTimeSeconds":1476602558,"id":47794,"title":"\u003cp\u003eIntroduction to competitive programming\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eFor those who are new to \u003ca href\u003d\"http://hkoi.org\"\u003eHKOI\u003c/a\u003e / \u003ca href\u003d\"https://en.wikipedia.org/wiki/Competitive_programming\"\u003ecompetitive programming\u003c/a\u003e, we usually practice our programming skills using online judge platforms.\u003c/p\u003e\u003ch3\u003eGood Online Judges\u003c/h3\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com\"\u003eCodeforces\u003c/a\u003e (here)\u003c/p\u003e\u003cp\u003ePros: You can see everyone else\u0027s submissions (including mine), regular contests.\u003c/p\u003e\u003cp\u003eCons: Problemset contains too many problems. Users cannot know the difficulty of the problems easily.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://judge.hkoi.org/\"\u003eHKOI online judge\u003c/a\u003e\u003c/p\u003e\u003cp\u003ePros: I can see your submissions. (You may ask me to look at / debug your submissions).\u003c/p\u003e\u003cp\u003eCons: No editorials.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://train.usaco.org/usacogate\"\u003eUSACO\u003c/a\u003e\u003c/p\u003e\u003cp\u003ePros: Step by step guide to typical problems, good for newbies.\u003c/p\u003e\u003cp\u003eCons: Strange/old style of submitting solutions (involve file I/O).\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://open.kattis.com/\"\u003eKattis\u003c/a\u003e\u003c/p\u003e\u003cp\u003ePros: Nice UI with a builtin problem difficulty ranking system.\u003c/p\u003e\u003cp\u003eCons: Pascal is not supported. Cannot search problems by topic.\u003c/p\u003e\u003ch3\u003eWhere to start?\u003c/h3\u003e\u003cp\u003eMy suggestion is to start with HKOI online judge first. Begin with the \u0026quot;popular\u0026quot; tasks first to familiarize yourself with the problem format.\u003c/p\u003e\u003cp\u003eAfter that, practice with those division 2 A/B problems on Codeforces. Learn from others\u0027 source codes. You can learn how to write a better program and learn tricks from others.\u003c/p\u003e\u003cp\u003eSolving 10 problems a week can improve your programming skills rapidly within a year. Challenge yourself to Codeforces contest will also help you to do better in \u003cstrong\u003ereal\u003c/strong\u003e contests like HKOI.\u003c/p\u003e\u003cp\u003eIf you have problems, please ask!!! I am here to help you guys!!\u003c/p\u003e\u003ch3\u003ePascal or C or C++ or Java?\u003c/h3\u003e\u003cp\u003ePascal / C is ok. \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Tourist\" title\u003d\"Legendary grandmaster Tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eT\u003c/span\u003eourist\u003c/a\u003e won \u003ca href\u003d\"http://stats.ioinformatics.org/\"\u003eIOI\u003c/a\u003e gold medals 6 times with Pascal.\u003c/p\u003e\u003cp\u003eC++ / Java comes with handy libraries and can make your life easier in some cases. C++ is preferred by most of the top competitive programmers in the world. Learning C++ is advisable. To learn C++ is easy, just read others source code on Codeforces; Search STL reference at \u003ca href\u003d\"http://www.cplusplus.com/reference/\"\u003ehttp://www.cplusplus.com/reference/\u003c/a\u003e :)\u003c/p\u003e\u003cp\u003eHappy Coding!\u003c/p\u003e\u003c/div\u003e","tags":[]}}