{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1477917873,"rating":105,"authorHandle":"savinova","modificationTimeSeconds":1477940338,"id":48110,"title":"\u003cp\u003eОтчет о деятельности Botan Investments за октябрь + интервью тренера команд ИКТиИБ ЮФУ Сергея Тарасова\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ октябре одно из наиболее значимых событий — четвертьфинал ACM. Виктор Шабуров уже не первый год является спонсором четвертьфинала Южного подрегиона в Саратове. Botan Investments поздравляет всех участников, занявших призовые места, и прошедших в полуфинал! В Южном подрегионе среди вузов-участников грантовой программы фонда в полуфинал вышли: СГУ (Саратов), Самарский Университет (Самара), ВолгГТУ (Волгоград), УлГТУ (Ульяновск), ЮФУ (Ростов-на-Дону и Таганрог), КФУ (Казань), МГУ (Саранск), в Северном подрегионе — САФУ (Архангельск), в Восточном — ПГНИУ (Пермь), УрФУ (Екатеринбург), УГАТУ (Уфа), в Центральном — ЯрГУ (Ярославль), в Западно-Сибирском (ТПУ, СИбГУТИ). \u003c/p\u003e\u003cp\u003eВ этом месяце в нашей программе 17 активных университетов, а по количеству активных участников и проведенных тренировок лидируют Уральский федеральный университет (тренер Михаил \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik\" title\u003d\"Мастер MikhailRubinchik\"\u003eMikhailRubinchik\u003c/a\u003e Рубинчик) и Саратовский государственный университет (тренер Михаил \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Штаб, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e Мирзаянов). А еще в октябре к нам присоединился новый вуз — Ярославский государственный университет. \u003c/p\u003e\u003cp\u003eВ группе Botan Investments в ВК продолжают выходить посты Михаила Рубинчика: \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_48%2Fall\"\u003eпро основные сборы по подготовке к ACM\u003c/a\u003e, \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_54/all\"\u003eалгоритмы, которые должны знать студенты\u003c/a\u003e, \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_57/all\"\u003eорганизацию массовых тренировок любителей\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eВ этом месяце мы попросили одного из преподавателей, участвующих в нашей грантовой программе, ответить на несколько вопросов. Сергей \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Seryi\" title\u003d\"Кандидат в мастера Seryi\"\u003eSeryi\u003c/a\u003e Тарасов — тренер команд ИКТиИБ ЮФУ (Таганрог). На четвертьфинале в Саратове его ребята заняли 10 место и прошли в полуфинал, что является очень хорошим показателем для города с населением 250 тыс.\u003c/p\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e   \u003ci\u003e — Сергей, расскажите в общем, насколько развито олимпиадное программирование в Таганроге? Насколько я знаю, был перерыв в несколько лет, и команду пришлось набирать с нуля.\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e Студенческие олимпиады в Таганроге начали проводить ещё в 90-е годы. В начале 2000-х была разработана своя система тестирования и появилась ежегодная Открытая олимпиада ЮФУ (ТРТУ), которая и по сей день является крупнейшим онсайт-контестом на юге России. За исключением нескольких лет доминирования Ставропольского ГУ с легендарным kia в составе, Таганрогские команды всегда были сильнейшими на юге, а олимпиадное движение — самым активным. Этим можно было гордиться, однако результаты ACM ICPC наглядно демонстрировали, какая пропасть разделяет нас и команды Поволжья, Урала, Сибири, не говоря уже о столицах. Только в 2007-м году нам впервые удалось выйти в полуфинал, и это было огромным шагом вперёд. Если раньше факультатив был развивающим кружком, расчитанным на массы, то теперь мы были одержимы идеей \u0026quot;выйти в финал\u0026quot;: сотнями решали задачи из архивов, тренировались несколько раз в неделю, ездили на сборы и т.д.  \u003cbr /\u003e\u003cbr /\u003e  Одержимость сыграла с нами злую шутку — пока мы вкладывались в 2 лучшие команды, безуспешно пытаясь пробиться в \u0026quot;элиту\u0026quot;, были полностью заброшены остальные. Факультатив стал \u0026quot;закрытым\u0026quot; клубом, попав в который, студенты в ужасе убегали через 2-3 занятия, потому что вместо постепенного развития под руководством тренера им предлагали сразу окунуться в мясорубку спорта высоких достижений. Нашего первого запала хватило на 8 лет регулярных выходов в полуфинал с россыпью дипломов третьей степени. После того как последний из опытных участников закончил обучение, в институте не осталось ни одного студента, имеющего хотя бы малейшее представление об олимпиадах, — только выжженная земля.   \u003cbr /\u003e\u003cbr /\u003e К сентябрю 2015-го я уже 3 года не тренировал и не участвовал в контестах, но когда мне предложили вернуться, выбор был очевидным — либо я начинаю всё заново, либо все многолетние усилия пойдут прахом, а олимпиадное движение в Таганроге просто исчезнет или вернётся в каменный век.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e \u003cdiv style\u003d\"width: 100.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/c5/03/c503aa311504edaf1fc0c8d0118d7fbf013c1717.jpg\" style\u003d\"width: 49.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg src\u003d\"/predownloaded/01/ba/01ba6f7841d2caa802dbab4058366a754c402be9.jpg\" style\u003d\"width: 49.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003ccenter\u003e\u003csmall\u003eКоманда ИКТиИБ ЮФУ (Таганрог): Иван Маныч, Эдуард Минасян, Анна Митина\u003c/small\u003e\u003c/center\u003e \u003c/div\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e  \u003ci\u003e— Как удалось собрать команду, замотивировать ребят начать заниматься?\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e Таганрог хоть и маленький, но очень IT-шный город. Компаний, занимающихся разработкой ПО, здесь больше, чем во многих городах-миллионниках. Благодаря такому сильному IT-комьюнити, у студентов есть множество возможностей для саморазвития: бесплатные курсы в IT-компаниях, стажировки, хакатоны, CTF (где Таганрог весьма успешен), да и учёбу ведь никто не отменял. Убедить студентов заняться именно олимпиадами сложно — это тяжёлый труд, который не сулит быстрого успеха или лёгких денег. Здесь важен личный пример — я рассказал ребятам о том, что это дало мне: как я проделал путь от учащегося колледжа, делающего \u0026quot;поделки\u0026quot; на Delphi, до полуфинала чемпионата мира, сколько получил уникальных знаний и опыта, и как много хороших людей встретил на этом пути. Конечно, говорил и о профессиональной карьере — своей и знакомых олимпиадников из других городов — у всех она складывается успешно, во многом, благодаря олимпиадному опыту.  \u003cbr /\u003e\u003cbr /\u003e В прошлом году я преподавал ООП у второго курса, что позволило мне ближе познакомиться с ребятами и обеспечило приток людей на факультатив. Всего в занятиях участвовало около 20-ти студентов — почти треть профильных студентов второго курса и несколько первокурсников. С точки зрения олимпиад какие-то перспективы были примерно у половины, для остальных же я постарался сделать факультатив приятным местом, где в условиях живого общения с тренером они могут постичь азы C++ и научиться писать эффективный код. Часть способных студентов бросили занятия, увлёкшись чем-то другим или потеряв интерес, — это нормально, ведь спорт подходит не всем. Осенью удалось собрать 2 команды из ребят, готовых тренироваться \u0026quot;на результат\u0026quot;, и мы сосредоточились только на подготовке к четвертьфиналу. \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003e— Как готовились к четвертьфиналу?\u003c/i\u003e  \u003cbr /\u003e\u003cbr /\u003e В течение года занятия не были интенсивными — всего 3-4 часа личных тренировок (мэшапы уровня Div2) в неделю и периодические лекции по теории. Однако благодаря этому постоянству ребята всё время были в тонусе и, что самое главное, решали задачи дома — хотя и меньше, чем мне бы хотелось. Летом удалось отправить одну команду на сборы в Сазанку — там ребята впервые узнали, что тренироваться можно каждый день и это не смертельно. В сентябре, помимо тренировок в институте, две наших команды участвовали в недельных сборах под руководством тренеров из ИТМО, проводимых Botan Investment в Ростове-на-Дону — удалось закрыть несколько пробелов в знаниях и обозначить наши слабые места. Ну а в конце я устроил ребятам марафон из десятка пятичасовых тренировок-четвертьфиналов, лично присутствуя на каждой из них и корректируя их действия. Дьявол кроется в мелочах и важно было научить их самым разным соревновательным аспектам: как угадывать трудоёмкость по ограничениям, какую информацию можно извлечь из монитора, сколько тратить времени на тесты, как параллелить работу за ПК, как выбираться из трудных ситуаций и когда стоит просто дать переписать задачу соседу. И это не говоря уже об обычных разборах задач и корректировке стиля кодирования.  \u003cbr /\u003e\u003cbr /\u003e За 2 недели до четвертьфинала ребята из первой команды впервые показали достаточный результат для выхода в полуфинал на тренировке — это нас сильно воодушевило. А на последней тренировке ребята из второй команды неожиданно для всех обыграли первую и тоже виртуально \u0026quot;вышли в полуфинал\u0026quot;. Так что учитывая большую квоту региона в этом году, теплилась надежда даже выйти в полуфинал двумя командами. Однако в Саратове у второй команды всё сразу пошло наперекосяк и недостаток опыта не позволил им исправить ситуацию. Зато первая команда преподнесла приятный сюрприз, быстро решив 5 задач без штрафов и войдя в Top 10. Учитывая, что в рейтинге Сodeforces на момент четвертьфинала в команде не было даже ни одного синего участника — это великолепный результат, который показывает значимость командной работы и правильность нашей стратегии тренировок.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e \u003c/p\u003e\u003cdiv style\u003d\"width: 100.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/6a/4d/6a4d585ca97aead60f7d462b7bc2ad89759f4b5b.jpg\" style\u003d\"width: 45.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg src\u003d\"/predownloaded/cd/1d/cd1dd766ada6e8a05a4d430b4f814982dc114531.jpg\" style\u003d\"width: 50.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003ccenter\u003e\u003csmall\u003eРебята на четвертьфинале Южного подрегиона в Саратове\u003c/small\u003e\u003c/center\u003e \u003c/div\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e \u003ci\u003e— Можете дать какие-то советы для преподавателей из небольших городов — как искать студентов, как в течение года подготовить команду к выходу в полуфинал?\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e Поднять олимпиадное движение в маленьком городе очень трудно. Набор студентов в ВУЗе маленький, а абитуриенты, как правило, не только не имеют опыта участия в олимпиадах, но и вообще не умеют программировать. За всю многолетнюю историю к нам не поступил ни один школьник, имеющий хотя бы какой-то диплом Всероссийской олимпиады по информатике. Так что выбирать студентов не приходится — мы рады всем, кто приходит, а если студент ещё и способный — это большая удача. С другой стороны, как показала практика, подготовить команду уровня середняка полуфинала можно за 1-2 года — нужно заинтересовать студентов, вселить в них уверенность в достижимости успеха, а дальше — решать, решать, решать, в том числе и самому, чтобы не терять связь с реальностью и подавать пример. Если же тренер сам не участвовал в контестах — всё гораздо сложнее, потому что сейчас почти не осталось типовых задач на применение готовых алгоритмов, а навыки, приносящие результат, становятся очень специфичными. \u003cbr /\u003e\u003cbr /\u003e Гораздо больше меня волнует вопрос — как добиться большего и стоит ли оно того? Этого я пока не знаю, потому что тренировка олимпиадника, не имеющего школьных достижений и ЛКШ за плечами, похожа на гонку со временем — на первом курсе учимся программировать, на втором — готовимся к четвертьфиналу, на третьем пытаемся закрепить результат, а дальше... половина ребят разбегается по местным IT-компаниям, а олимпиады уходят на второй план. И даже те, кому удаётся сохранить сильный состав на протяжении пяти лет, имеют мало шансов прорваться в \u0026quot;элиту\u0026quot; и выйти в финал, потому что наша страна — мировой лидер спортивного программирования с сумасшедшей конкуренцией. \u003cbr /\u003e\u003cbr /\u003e Конечно, круто научиться решать \u0026quot;гробовые\u0026quot; задачи, но стоит ли тратить все годы обучения в ВУЗе на то, чтобы научиться их решать за 5 часов, а не за неделю — большой вопрос, ведь дальнейшая профессиональная карьера — это не соревнование на скорость. Ответ скорее всего очень индивидуален: для азартных и увлечённых — конечно, стоит — чтобы не жалеть потом об упущенных возможностях. Для тех же, кто рассматривает олимпиады как способ саморазвития и не ставит больших спортивных целей — не факт. В любом случае, стоит решать задачи до тех пор, пока это доставляет удовольствие, поэтому главная задача тренера — создать здоровую соревновательную атмосферу на тренировках, чтобы студентам хотелось туда возвращаться. \u003c/p\u003e\u003c/div\u003e","tags":["botan investments","виктор шабуров"]}}