{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1498389114,"rating":148,"authorHandle":"joisino","modificationTimeSeconds":1499067535,"id":52892,"title":"\u003cp\u003eJOI Open Contest 2017\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://cms.ioi-jp.org/open-2017/index.html\"\u003eJOI Open Contest 2017\u003c/a\u003e will be held on \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dJOI+Open+Contest+2017+Round+1\u0026amp;iso\u003d20170702T04\u0026amp;p1\u003d1440\u0026amp;ah\u003d5\"\u003eJuly 2. (04:00-09:00 GMT)\u003c/a\u003e and \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dJOI+Open+Contest+2017+Round+2\u0026amp;iso\u003d20170702T10\u0026amp;p1\u003d1440\u0026amp;ah\u003d5\"\u003eJuly 2. (10:00-15:00 GMT)\u003c/a\u003e .The tasks for Round 1 and Round 2 are the same. So you can choose the round you will participate in.\u003c/p\u003e\u003cp\u003eThe main purpose of this contest is to give an opportunity to Japanese delegations and candidates of delegations for training and practice for IOI. But the contest itself is open to everybody. Everybody is welcome to attend JOI Open Contest 2017!\u003c/p\u003e\u003cp\u003eThe contest duration is 5 hours and there will be 3 problems. Problem statements will be provided both in Japanese and English.\u003c/p\u003e\u003cp\u003eDetails are available in \u003ca href\u003d\"http://cms.ioi-jp.org/open-2017/index.html\"\u003econtest information\u003c/a\u003e .\u003c/p\u003e\u003cp\u003eThe past contest information is available in \u003ca href\u003d\"http://cms.ioi-jp.org/\"\u003eJOI Website\u003c/a\u003e .\u003c/p\u003e\u003cp\u003eGood luck and have fun!\u003c/p\u003e\u003cp\u003eUPD: The round1 will start in 90 minutes. The contest site and registration form will be announced 30 minutes before the contest.\u003c/p\u003e\u003cp\u003eUPD2: The contest is over. Thank you for your participation! Now, you can get problem statements, editorials and test data from \u003ca href\u003d\"http://cms.ioi-jp.org/open-2017/index.html\"\u003econtest information\u003c/a\u003e . Also, we open judge for analysis for about 24 hours from now. contest page is \u003ca href\u003d\"http://cms.ioi-jp.org/contest/\"\u003ehere\u003c/a\u003e .\u003c/p\u003e\u003cp\u003eWe are carrying out the questionnaire to improve our contests. Please tell me your impressions about the contest. You can access the questionnaire sheet \u003ca href\u003d\"https://goo.gl/forms/wlpsDZBWcdnEdf1w2@\"\u003ehere\u003c/a\u003e . Thank you for your cooperation.\u003c/p\u003e\u003cp\u003eUPD3: The judge program for amusement_park was wrong in the contest as mentioned in this blog comment. Now, you can use the correct judge in the analysis round. We extend the analysis round 24 hours (The end of the round is 7/5 01:00 GMT) . You can also get the correct judge program from the test data section. We are very sorry for this issue.\u003c/p\u003e\u003c/div\u003e","tags":[]}}