{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1403461710,"rating":247,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1403489609,"id":12789,"title":"\u003cp\u003eACM-ICPC World Finals 2014: Before Opening Ceremony\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eOh yes! Only a few days left before the Championship finals! The teams have already gathered in Yekaterinburg, most of them have registered and are watching a game between Russia and Belgium.\u003c/p\u003e\u003cp\u003eI want to start from some history and remember that the tradition to publish travel notes about Saratov State University\u0027s trips to finals started back in 2005. The regular pattern is that almost every year when we made notes, our team won a medal. I won\u0027t try my luck, so here are some of the first impressions of this year. The Codeforces community knows this year\u0027s team very well, its members are:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Gerald\" title\u003d\"Master Gerald\"\u003eGerald\u003c/a\u003e — Gerald Agapov, a person who coordinates Codeforces problems. He has been the key person collaborating with problem authors for Codeforces rounds since 2012. Oh yes, if something goes wrong with problems, he is the one I beaker at, but the guy is great and we hardly ever hae any problems :-) Gerald isn\u0027t only into programming. He loves maths, magnificently lectures students – you could listen to his lectures in workshops in Sazanka, Sevastopol and Kharkov. Also, he teaches programming metрods in Saratov State University with theoretical and practical lessons. All in all, he has \u003ca href\u003d\"https://vk.com/mikemirzayanov?z\u003dvideo-30492350_167987221%2Fbca7b92158d2a2fb21\"\u003elots of talents\u003c/a\u003e.\u003c/li\u003e   \u003cli\u003e\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Fefer_Ivan\" title\u003d\"Master Fefer_Ivan\"\u003eFefer_Ivan\u003c/a\u003e — Ivan Fefer, he says that Fefer is the German for \u0027pepper\u0027. A Codeforces developer, he has been constantly amazing us with innovations this year. A year ago Ivan, a person without any particular technical background, immediately figured out the Codeforces code base and now he can write a sophisticated and nice code quickly and neatly. As a post-graduate student, Ivan also teaches in SSU and highschool children programming club.\u003c/li\u003e   \u003cli\u003e\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/kuviman\" title\u003d\"Master kuviman\"\u003ekuviman\u003c/a\u003e — Vitaly Kudasov. Some people argue that his handle stands for \u0027Kudasov Vitaly is da Man!\u0027 Vitaly came to SSU three years ago after a transfer from the Moscow SU. In fact, he is from Saratov but he spent his graduating school year in the Specialized Study and Research Center of MSU and he tried studying in MSU. He appeared in SSU summer personal training camps and immediately showed really cool coding. That\u0027s how it started: personal training, Sazanka, training camp in Dubki, the quarter finals. He has recently become red on Codeforces. We have already developed a local meme with him: \u0027simple school geometry\u0027 – that\u0027s what he says about any problem on geometry of any complexity. By the way, besides from showing cool coding he also shows cool wushu skills.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eWe got lucky as the Saratov-Yekaterinburg flight has literally just been introduced this year. So, only a couple of hours of sleep with a sandwich break – and here we are in Yekaterinburg.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/photos/finals-2014/1/DSCN0494.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eAs we arrived, we immediately noticed that the city is seriously getting ready for the finals: a big banner in the airport, cool dummies of Ural acm guys. We liked the girl dummies more :-)\u003c/small\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cbr /\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/photos/finals-2014/1/DSCN0507.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003e We were immediately welcomed by volunteer girls and we even bot a minibus to our home. Thanks for the warm welcome! \u003c/small\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cbr /\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/photos/finals-2014/1/DSCN0513.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003e We saw lots of eye-catching billboards on out way. I wish I had had time to make the photo: one of those billboards was followed by another one saying \u0027Realty in Thailand\u0027! Do they know about next year World Finals? \u003c/small\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cbr /\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/photos/finals-2014/1/DSCN0528.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003e Also, the city often has banners dedicated to the finals. On this picture the banner is between two identical singer concert banners. We can make a wish. \u003c/small\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cbr /\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/photos/finals-2014/1/DSCN0542.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003e Talk about small world. As we were walking along the Weiner street, we met a team from Petrozavodsk. \u003c/small\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e \u003ccenter\u003e \u003cbr /\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/photos/finals-2014/1/DSCN0549.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003e ACM-ICPC competitor\u0027s banner on Yekaterinburg streets. \u003c/small\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e\u003cp\u003eAfter we checked in a hotel with an immodest name \u0027Grand Hotel Atrium\u0027, we were quickly sent to the registration. To get there, I had to get past the metal detector frames (they didn\u0027t beep at me once) and serious security guards. They asked to show them my backpack, I opened one of the three compartments. It was empty but the guards still seemed satisfied.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/photos/finals-2014/1/DSCN0593.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eWhen we arrived, we found out that the registration was due to only an hour later and who knows why everybody had been rushed to the venue. Luckily, the weather was great, the embankment was beautiful and shashlyk (a type of shish kebab – yours truly, translator) was very tasty.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/photos/finals-2014/1/DSCN0613.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eThe registration consisted of 14 (yeah, fourteen!) stations and each team was entitled to a volunteer not to get lost. The registration is when each team gave in everything they could use during the contest. Specifically, my team gave: two thick checkered notebooks, pens and 25-page printouts. You can partially use pre-prepared materials at the finals – each team can bring 25-page printouts with all sorts of Gomory-Hu and other weird words. This, by the way, is a very important point: I have heard with my own eyes that a team had a bug in the printouts that lost them lots of time at the contest. I do hope that my guys have checked the whole code carefully :-)\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/photos/finals-2014/1/DSCN0627.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e\u003cbr /\u003e \u003cimg src\u003d\"//assets.codeforces.com/photos/finals-2014/1/DSCN0630.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003e Each year at the finals we get a plush toy wearing clothes with ACM-ICPC logo. This year the mascot is a squirrel from UrFU. In fact, it looks like a loose interpretation of what a squirrel. Unfortunately, we never got any decent backpacks or hoodies. \u003c/small\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/center\u003e\u003cp\u003eWe arrived home shortly before the match between Belgium and Russia started. Planning tomorrow showed that we should get up at 7:15, local time. And tomorrow and the day after tomorrow we get up even earlier. Why does the timetable have to be pulled up all the way to early morning? Or is it done on purpose to make us sleepy and tire at the contest?\u003c/p\u003e\u003c/div\u003e","tags":["world finals","ekaterinburg","acm-icpc"]}}