{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1486503108,"rating":-115,"authorHandle":"wag","modificationTimeSeconds":1486564280,"id":50308,"title":"\u003cp\u003eSTAND-UP Евгения Недашковского S01E01\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eДисклеймер\u003c/strong\u003e: перед прочтением ознакомьтесь с \u003ca href\u003d\"//codeforces.com/blog/entry/50304\"\u003eмоей вступительной речью\u003c/a\u003e\u003c/p\u003e\u003cp\u003eДобрый день, дорогие кодфорсчане!\u003c/p\u003e\u003cp\u003eКак говорил Лао Цзы, Петр Митреевич – редиска. Первым делом, хотелось бы поблагодарить за поддержку \u003ca class\u003d\"rated-user user-green\" href\u003d\"/profile/Deus_Vult\" title\u003d\"Pupil Deus_Vult\"\u003eDeus_Vult\u003c/a\u003e и \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/I_Love_Julia\" title\u003d\"Specialist I_Love_Julia\"\u003eI_Love_Julia\u003c/a\u003e. В том числе благодаря вашим тёплым словам и пишется этот текст. Кроме того, хотелось бы сказать \u0026quot;спасибо\u0026quot; тем, кто ставил \u003cstrong\u003eПЛЮСИКИ\u003c/strong\u003e на мой первый блог и комментарии и тем, кто поставил мне звёздочку. Я написал свой первый раунд и получил свой первый рейтинг, с чем я себя и поздравляю. По причинам, которые я уже описывал в своём первом посте, сегодня я начинаю серию юмористических публикаций, или так называемый STAND-UP Евгения Недашковского. \u003c/p\u003e\u003cp\u003e\u0026quot;Но хватит прелюдий, давайте же скорее шутки\u0026quot; – скажете вы. Темой своего первого стэндапа я выбрал программирование, потому что это сайт для программистов. Решил, что так будет проще привлечь читателей. Кроме того, так как люди стесняются признаться, что не понимают шутку, и просто минусуют меня, теперь объяснения к некоторым сложным шуткам будут под спойлерами. Надеюсь, это поможет. Поехали!\u003c/p\u003e\u003cp\u003eЗаходит в бар программист и застревает в дверях.\u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eРешение\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eДело в том, что многие здесь очень толстые.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eПрограммист заходит в лес и начинает выкапывать деревья и переворачивать их. \u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eРешение\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eДеревья рисуются с корнем сверху.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eУчёные доказали, что люди, которые занимаются программированием, в среднем на 10-15% умнее своих парней\u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eПодсказка\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eОбратите внимание на слово \u0026quot;парней\u0026quot;.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eТеперь смешная и немного философская история из жизни. Сижу я как-то на занятии по информатике, а рядом со мной сидит мой одногруппник. Он качался на стуле и упал с него прямо на пол, а стул упал на него сверху, \u003cstrong\u003eБАБАХ\u003c/strong\u003e. Встает, отряхивается, снова начинает качаться и вдруг опять \u003cstrong\u003eБАБАХ\u003c/strong\u003e упал со стула. Получается, что для него жизнь – как для меня те занятия – ничему не научила. \u003c/p\u003e\u003cp\u003eЧтобы закончить на более позитивной и менее философской ноте, расскажу ещё одну шутку. Заходит как-то \u003ca class\u003d\"rated-user user-gray\" href\u003d\"/profile/Hedgehogy\" title\u003d\"Newbie Hedgehogy\"\u003eHedgehogy\u003c/a\u003e в магазин \u0026quot;Всё для туризма\u0026quot; через широкие двери и говорит: \u0026quot;Мне, пожалуйста, компьютер\u0026quot;. Ему отвечают: \u0026quot;У нас нет компьютеров, только рюкзаки и палатки\u0026quot;. А он спрашивает: \u0026quot;Как же тогда я стану туристом?\u0026quot;\u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eРешение\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eОбыгрывается ник первого в рейтинге и сообразительность последнего\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eСпасибо за внимание, ставьте \u003cstrong\u003eПЛЮСИКИ\u003c/strong\u003e, подписывайтесь на мой блог, пишите комментарии. Берегите себя и своих близких.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eP.S.\u003c/strong\u003e В этом и предыдущем посте есть также более скрытые и тонкие шутки и отсылки. Если нашёл – пиши в комментарии и тоже набирай \u003cstrong\u003eПЛЮСИКИ\u003c/strong\u003e! В следующем выпуске будут указаны ответы.\u003c/p\u003e\u003c/div\u003e","tags":["юмор","standup","шутки","философия"]}}