{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1399674433,"rating":-20,"authorHandle":"zholnin","modificationTimeSeconds":1399674455,"id":12246,"title":"\u003cp\u003ePython в соревнованиях\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eТак как я недавное решил переключится на C++ для использования в соревнованиях, хотелось бы сказать пару слов на эту тему:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003e\u0026quot;скриптовые\u0026quot; языки, к которым принадлежит Python, сейчас очень активно используются при разработке приложений для Web. Никто не отбирает лавры самого крутого языка для выжимания максимум из железа у C/C++, но, в то же время, говорить, что языки типа Python, Ruby, PHP и прочих — это такое развлечение для тех, кто на самом деле программировать не умеет — тоже неправильно. А это именно то сообщение, котороые посылают контесты, где с этими языками расситывать не на что.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eКонкретно о Russian Code Cup — проводится под эгидой Mail.ru. Представители Mail.ru, скажите мне, в этой компании всё, что разрабатывается пишется только на Java и C++? или ещё что-то используется? Кажется несколько странным, что в России программируют только на этих двух языках (если не это имелось в виду, то почему название — Russian Code Cup, а не Russian C++ and Java Code Cup ?)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eхорошему программисту наплевать на язык — он читает документацию и пишет на любом — я с этой формулировкой по большей части согласен, поэтому и переключаюсь на С++. Посмотрим, насколько я хороший программист. Пока моя надежда — добраться до уровня рейтингов в 2000, когда я пообвыкнусь и поучаствую в большем количестве сорвенований.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eразница между языками типа C++ и Python большая, но ... константа. Насколько оправданы те лимиты, которые устаналиваются для программ на C++? Конкретно для Russian Code Cup, задачка про трёхцветные шахматы — максимальный размер доски — 14*50. При таком размере хорошее решение на С++ требует 0.4 секунды, хорошее решение на Python — 11 секунд. Если убавить размер до 12*50, Python начнёт умещаться в 2 секунды. Существуют ли какие-то \u0026quot;неправильные\u0026quot;, brute force решения на C++, которые могут покрыть поле в 12*50 за две секунды? Сомневаюсь. Обычно в соревнованиях идёт речь о экспоненциальной или как минимум в несколько степеней разнице между правильным и неправильным решением. В такой ситуации разница между Python и C++ не принципиальна.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eВ общем, не хочу разводить \u0026quot;Питон срач\u0026quot;, но просто хотелось выговориться. Думаю, что роль скриптовых языков будет постепенно расти, а системных — оставаться на одном уровне, так что в какой-то момент надо будет принимать решение о том, как сделать соревнования доступными для всех. В соревнованиях, где не важна чистая скорость исполнения — типа того же Google Code Jam, Python уже потихоньку приближается к Java в схватке за второе место по использованию.\u003c/p\u003e\u003cp\u003eЕсли у кого-нибудь есть мысли по этому поводу — приглашаю к вежливому диалогу.\u003c/p\u003e\u003c/div\u003e","tags":["python","c++"]}}