{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399079264,"rating":-6,"authorHandle":"dustr80","modificationTimeSeconds":1399079264,"id":12095,"title":"\u003cp\u003eincluding a stretch even in four\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003esecond quarter, including a stretch even in four three-pointers. Only the second section, the Eagles 13 of 16 shots, hit a spurt of 41-19. Eagles also became the Bucks after 1970, the first team\u0027s own 40 single score, scoring less than 20 points the\u003ca href\u003d\"http://www.freeasicscheap.co.uk/nike-free-40-v3-c-13.html\"\u003enike free 4.0 v3 mens\u003c/a\u003e  other playoff teams.Official website: Paul — George H under 26 points the whole game. Although the Pacers trailed by as many as 30 points in the final minute, but they will be worse once reduced to eight points. But unfortunately time is running out, eventually concede defeat Pacers home.Highlights: the home fans booed Pacers defectionPacers return home with a score of 2-2, prepare Battle of King Mountain. All the fans are enthusiastic and hope the team won match point. But it is the so-called expectations, the greater the disappointment in the game the second quarter, the Pacers shot in the third row was an eagle, the points difference even came outside 20 separately. Walker did not first Eastern style, was beaten disgraced. At this point, the home fans could not, turned against him, booed Pacers. And wait until the third quarter behind 30 timeshare walkers, some fans have even booed enthusiasm is gone, just quietly waiting for the end of the game early. Yesterday, the Hubei basketball, has the milestone, along with Marco Polo Professional Basketball Club formally marked the farewell Hubei no high-level professional basketball club history.Sounded AssemblyHubei Marco Polo Professional Basketball Club in February this year to complete the business registration in Wuhan, March Chinese Basketball \u003c/p\u003e\u003cp\u003eAssociation issued a formal approval, agreed with the investors of Hubei Sports Bureau of Guangdong aesthetic Group co-founded the club.Provincial Sports Bureau Hude Chun said the club was established as a professional development Hubei basketball has taken a solid step, it will greatly promote the exchange and integration of Hubei athletes, coaches, referees and domestic and international basketball, will exercise and training large number of outstanding young athletes.Lee, general manager of the club may be \u003ca href\u003d\"http://www.freeasicscheap.co.uk/nike-free-30-v5-c-7.html\"\u003enike free 3.0 v5 running shoes\u003c/a\u003e  introduced this year, the main task of the club and the national goal is to lay the Chinese Basketball League (referred NBL) qualifying and qualifying game, to get qualified for next year NBL League Group A. Meanwhile, the club will play their own advantages, and actively participate in and promote all kinds of basketball charity. He said that currently the club\u0027s main training base in Dongguan basketball, the game will be located in Hubei Province, home to the Olympic Sports Center.Former national team leaderCurrently, the club has completed the formation of the first team, men\u0027s basketball coach is a former Liaoning Zheng Yonggang, an assistant coach for Hubei famous Daiyong and Linyao Sen, Zhaoren Bin, 16 first team players and clubs have all signed a contract in which the former was undoubtedly the best known national champion Stephen Long.At yesterday\u0027s listing ceremony, Zheng Yonggang introduction, Mr Long because something happens at home, so not able to attend. Stephen Long the national team in 2010, was seen as a promising outsiders young \u003c/p\u003e\u003cp\u003edefender, during the 2010 World Championships in Turkey debut as a backup point guard, averaging 9.3 minutes debut time contribution 2.8 points, 0.7 steals and 0.3 assists. However, last season, Stephen Long in Dongguan team almost did not get any playing time. Zheng Yonggang, said: \u0026quot;Because of this, he can represent us to participate in this year\u0027s NBL game.\u0026quot;Daiyong introduction, there are eight teams in the Hubei Ji athletes, including Nguyen Hang, Zhang Lei, the main members of the Xia Jianheng are Shenyang Games Hubei youth team, the team average height of 1.98 m, with an average age of 20 years old, is a positive in the formative years of the young team.No quitterNBL professional basketball team\u003ca href\u003d\"http://www.freeasicscheap.co.uk/nike-free-30-v4-c-4.html\"\u003enike free 3.0 v4 uk\u003c/a\u003e  for one year the cost is about 12 million, if the CBA campaign, it will have to turn over two or three times. Investors, Huang Jianping, chairman of Guangdong aesthetic Group said that they had to cooperate with CBA teams Dongguan New Century team for a decade, the two sides eventually achieve a win-win, this time in collaboration with Hubei Provincial Sports Bureau, it must be rooted in Hubei, Hubei basketball total growth.He definitely said: \u0026quot;Financially, we do not have to worry about, or does not do, we must do our best, we have a full \u0027ammunition\u0027 to prepare.\u0026quot;Huang Jianping said that engage professional basketball, industrialization, definitely not an overnight thing, never give up halfway. As for the selection of Hubei partners, he believes that this is weather, geography, and cooperation. \u0026quot;The Chinese basketball territory, and ultimately, the city of Wuhan.\u0026quot;He also said, \u0026quot;This decade, we have accumulated a lot of resources in the basketball world, including international resources, as long as various conditions are\u003c/p\u003e\u003c/div\u003e","tags":[]}}