{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1409499323,"rating":9,"authorHandle":"milesstevenson","modificationTimeSeconds":1409499323,"id":13645,"title":"\u003cp\u003eUSACO Number Triangles\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI was hoping to ask for a bit of advice on a USACO question. It is the Number Triangles problem in section 1.4. The problem statement can be found \u003ca href\u003d\"http://pastebin.com/vnvjJQYx\"\u003ehere\u003c/a\u003e\u003c/p\u003e\u003cp\u003eMy initial idea is that it cannot be avoided that this tree-like structure must be traversed in all possible ways, they\u0027ve listed (downwards left diagonal or downwards right diagonal).\u003c/p\u003e\u003cp\u003eIn the example input they give in the problem statement, with 5 rows, it can be worked through that there are 16 possible traversals of the tree. In an example of 4 rows, there are 8 possible ways, ..., and in an example with 1 row there is one possible way. So there are 2^(r-1) possible traversals that need to be checked for maximum sum.\u003c/p\u003e\u003cp\u003eI believe this can be solved if I can find out a way to represent static trees in an array data structure, where I will traverse each possibility given the constraints they\u0027ve laid out.\u003c/p\u003e\u003cp\u003eThat\u0027s all fine and dandy, and I think is realistic to do but the problem statement is in the last section of chapter 1, called Introduction to Binary Numbers. Because of this, I cannot for the life of me think of if this is the way the authors intended me to go about solving the problem or if there is an approach I am completely blind to. If I were to solve the problem using the approach mentioned above, I could use binary representations for each node but I see no particular reason to do so when the same could be done with decimal representations. \u003ca href\u003d\"http://i.imgur.com/clvNKiQ.jpg\"\u003eHere is my thought process on paper to show I have put some time into the problem.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIf you have any input you could share, I would be most grateful. Also, I\u0027ve only been working on this problem today. I almost feel like I am cheating by asking you for hints. When you are solving problems, how much time do you generally give yourself to think alone before reaching out for help. Am I doing the right thing?\u003c/p\u003e\u003cp\u003eThank you for reading.\u003c/p\u003e\u003c/div\u003e","tags":["train.usaco.org"]}}