{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399089318,"rating":-20,"authorHandle":"measu80","modificationTimeSeconds":1399089318,"id":12137,"title":"\u003cp\u003ecurrently including contacts and\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eLung club sources, currently including contacts and negotiations with Harrelson, including several NBA players, no accident will determine next week.Problems. Recently, football and basketball in this world\u0027s most popular sport in two, players are different actions to say \u0026quot;no\u0026quot; to racial discrimination.Alves solidarity with all the playersBarca\u0027s game against Villarreal on Sunday carried out a rare scene appears: When Alves penalty corner\u003ca href\u003d\"http://www.airfreeshoes.es/nike-free-30-v4-c-4.html\"\u003enike free 3.0 v4 mujer\u003c/a\u003e  , fans threw bananas at him, sounded \u0026quot;Mono (monkey, Spanish) stands Mono \u0026quot;sounds.Brazilian fullback did not make a strong protest, on the contrary, he used humor attitude towards this act of racial discrimination, pick up and eat bananas. Alves often strongly criticized past racial discrimination, this time, he\u0027s clever way to fight back to win the praise of the media. After the Spanish media that Alves through such sensible and humorous way, declared war against acts of racism, this is the best response to the deplorable behavior.Alves in the micro-Bo wrote: \u0026quot;My dad always told me: Son, more bananas to prevent cramps So you all know the truth.\u0026quot;Afterwards many players including Neymar, Hulk, Aguero, including solidarity Alves. Neymar after the game through social networks put up a photo of his son, he was holding a banana, while his son is holding a banana toy. Neymar also jokingly said: \u0026quot;We all are monkeys.\u0026quot;Villarreal officially announced, throwing bananas to Alves fans will never be able to re-enter the madrigal.Clippers owner alerted ObamaMeanwhile, on the other side of the Atlantic, as previously Clippers owner Donald Sterling was exposed racist remarks, so the Clippers players in front of the Braves started a playoff game Fan silent protest.Obviously, in this period of\u003c/p\u003e\u003cp\u003eracial remarks before the exposure of Stirling has sparked outrage, including entire Clippers. Before the game started, the Clippers players collective action, in a warm-up during training the red T-shirt and outside anti-wear (in order to keep the Clippers LOGO displayed in the chest), in protest. In addition, the players still in the game wearing a black armband, wrist or wear socks. Yesterday, the first round of the playoffs the Heat and Bobcats fourth war, James led the Heat players will have played the anti-wear clothes to support the Clippers players Stirling collective protest racism remarks.The incident alarmed the U.S. President Barack Obama, visited him in Malaysia condemned the incident, he said the United States has been in the fight against racial discrimination and believe that the new presi\u003ca href\u003d\"http://www.airfreeshoes.es/nike-free-30-v5-c-7.html\"\u003enike free 3.0 v5 hombre\u003c/a\u003e  dent of Silverstone NBA can properly handle this matter. Silverstone has also been promised, NBA League will be the fastest around Stirling recordings involving exposure of racist remarks during that collect and verify the evidence. At the same time, I will also enter Stirling legal proceedings. U.S. Central Time on April 29, Bulls playoff series against the Wizards usher in the third home game. Previously, the Bulls are two home losses, the big score of 1 to 3 behind. Tonight, the Bulls placing full, generals Gibson IV injury leave. Eventually, 69 more than 75, the Chicago Bulls ended the 2013-2014 season, all game. Latest news show after the game, Gibson did not fracture.For this season, the Bulls can be described as \u0026quot;ill-fated.\u0026quot; First, the early season, just because of a knee injury comeback Ross again reimbursement; then the Bulls and another pillar of trading Luol — Deng, to save six million of cap space. Coach Tom \u003c/p\u003e\u003cp\u003eThibodeau said after the game: \u0026quot;These are our problems in dealing with all year we lost Derrick (Rose), traded Luol — Deng; change you, how would you do the players have spared no effort, with each other. support a lot of people in this case, would have to give up, but we did not and I really for them (the players) feel proud. \u0026quot;NOAA feisty somewhat tired after the game. Thibodeau said: \u0026quot;The second half, Joe (NOAA) have been very tired, but I can not put him down.\u0026quot; Indeed, the role of Noah for the entire bull no one can replace. Although the night he \u0026quot;jump\u0026quot; over the court, but a knee injury has plagued the Bulls center. . \u0026quot;Should be in the latter half of the season, he began to feel uncomfortable knee,\u0026quot; Thibodeau said; \u0026quot;is the left knee, I do not know exactly what the situation, in short, not very comfortable.\u0026quot; Sai\u003ca href\u003d\"http://www.airfreeshoes.es/nike-free-run-3-c-29.html\"\u003enike free run 3 mujer\u003c/a\u003e  d Noah himself.For tonight\u0027s game, Thibodeau said: \u0026quot;We played the first half is better than before, but the second half, the defense of our opponents too many mistakes DJ (Augustin) we do the whole are very good fight, but the opponent to play. even more remarkable. \u0026quot;fourth injury leave Gibson also appeared in the locker room, a thick bandage on his left ankle clearly visible. \u0026quot;(Series) are like every game we played with them anxious first half, the second half when we tried to control the game, they always lead; IWho was always playing catch-up. Basketball should not be such a hit. \u0026quot;Gibson reluctantly summarizes the series.Before the start of the playoffs, the Bulls tend to be more comments next round. But ultimately, the success of the Wizards with better talent through the first round off. NOAA represented entire Bulls never give up with their own interpretation of the blue-collar spirit, let us look\u003c/p\u003e\u003c/div\u003e","tags":[]}}