{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1495548759,"rating":3,"authorHandle":"getitright","modificationTimeSeconds":1495548803,"id":52142,"title":"\u003cp\u003eInterview problem doubt\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThere are 2 people who play a game. The game is as follows:\u003c/p\u003e\u003cp\u003eThe are P sticks, each of length Q meters in length. The player play in turns. For each move a player choses a stick and splits it into 2 or more equal parts, each having an integer length greater than or equal to S meters. Each resulting part is also a stick. The player who can\u0027t make a move loses and the other player wins. \u003c/p\u003e\u003cp\u003eIf both the players play optimally, determine the winner, given the values of P, Q and S.\u003c/p\u003e\u003cp\u003eFor example : 2\u003c/p\u003e\u003cp\u003e1 15 4\u003c/p\u003e\u003cp\u003e4 9 5\u003c/p\u003e\u003cp\u003eAnswer:\u003c/p\u003e\u003cp\u003ePlayer 1\u003c/p\u003e\u003cp\u003ePlayer 2\u003c/p\u003e\u003cp\u003eConstrains: 1 \u0026lt;\u003d T \u0026lt;\u003d 10, the number of test cases\u003c/p\u003e\u003cp\u003e1 \u0026lt;\u003d P, Q, S \u0026lt;\u003d \u003cspan class\u003d\"tex-span\"\u003e{10}\u003csup class\u003d\"upper-index\"\u003e9\u003c/sup\u003e\u003c/span\u003e.\u003c/p\u003e\u003cp\u003eMy approach till now: I was trying to solve this problem using grundy numbers. If the xor of grundy numbers of all piles is 0, player 2 is winner else player 1 is winner. Since all sticks are of same length, P \u003d even number implies, player 2 is always the winner. When P \u003d odd number, then if the grundy number of stick is 0, then player 2 is winner else player 1 is winner. The grundy is 0 only when all the proper divisors (i.e. except 1 and number itself) of the stick length are less than S. \u003c/p\u003e\u003cp\u003eCould anyone please verify whether my approach is correct or not? \u003c/p\u003e\u003cp\u003eAny help would be appreciated. \u003c/p\u003e\u003c/div\u003e","tags":["interview","sprague-grundy","divisors"]}}