{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1464635427,"rating":156,"authorHandle":"TeaPot","modificationTimeSeconds":1464638289,"id":45130,"title":"\u003cp\u003eTopCoder Arena Beta (ненависть)\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eСегодня написал SRM после перерыва в год. И увиденное меня сильно разочаровало. После знакомства с Arena Beta у меня только один вопрос: создателям совсем плевать?\u003c/p\u003e \u003col\u003e   \u003cli\u003eПочему в таблице результатов в комнате (в которой указываются 4 лучших участника) первая строчка гласит \u0026quot;Place, R, Handle, 300, 300, 500, 500, 900, 900\u0026quot;, а дальше всего три столбца с баллами по задачам 500, 900, 300 (именно в таком порядке)?\u003c/li\u003e   \u003cli\u003eПочему нельзя открыть две вкладки с ареной?\u003c/li\u003e   \u003cli\u003eС каких пор нельзя посмотреть результаты всего дивизиона во время контеста?\u003c/li\u003e   \u003cli\u003eПлагины для этой арены вообще существуют? (чтобы хотя бы темплейт с названием класса и функции сразу был)\u003c/li\u003e   \u003cli\u003eРаньше окошко с кодом можно было развернуть примерно на 3/4 от экрана. Теперь окошко занимает меньше 1/2.\u003c/li\u003e   \u003cli\u003eЧто произошло с practice room-ами. Почему теперь чтобы решить задачу после контеста нужно знать ее название?\u003c/li\u003e   \u003cli\u003eГде-нибудь пишут, как раньше, сколько стоит задача, которую ты сейчас решаешь (возможно, я не заметил просто)?\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eЕсли я правильно понял, поддержка старой арены прекращена. Ее, конечно, все еще можно скачать и запустить (прорвавшись через настройки безопасности в Java), но что если они совсем изничтожат старую версию арены (не специально, но если поддержка старой арены не в приоритете, то когда-нибудь могут возникнуть баги, несовместимые с жизнью)?\u003c/p\u003e\u003cp\u003eА где вы пишете tс? Мучаетесь с бетой, или пишете в старой версии, пока она еще хоть как-то жива?\u003c/p\u003e\u003cp\u003eP.S. Сам сайт тоже ужасен, но это отдельная тема.\u003c/p\u003e\u003cp\u003eP.P.S. Да, и раньше было плохо, но не настолько, на мой взгляд.\u003c/p\u003e\u003cp\u003eUPD. Я все неправильно понял, поддержка старой арены вроде не прекращалась. Так что для паники повода, по крайней мере, нет.\u003c/p\u003e\u003c/div\u003e","tags":["topcoder","arena"]}}