{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1398869558,"rating":82,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1398882131,"id":12068,"title":"\u003cp\u003eUnusual Testing Round 3\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello,\u003c/p\u003e\u003cp\u003eOnce again I\u0027d like to host unusual unrated round. With your help we want to test untypical scoring system and unusual problems.\u003c/p\u003e\u003cp\u003eThe contest will start today on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?day\u003d30\u0026amp;month\u003d4\u0026amp;year\u003d2014\u0026amp;hour\u003d22\u0026amp;min\u003d30\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003e18:30 (UTC)\u003c/a\u003e. We will add large and bright special link to enter into the contest area. The contest duration is 90 minutes. But it will be easy problems and hope that many participants will solve all of them before the end.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e \u003cspan style\u003d\"font-size: 2.0em;\"\u003e\u003ca href\u003d\"/alpha49\"\u003eGo to the Contest →\u003c/a\u003e\u003c/span\u003e \u003cbr /\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eIt will be two types of problems: logic puzzles and programming tasks.\u003c/p\u003e\u003cp\u003eA logic puzzle is a task that is designed to be solved by hand (but it is not forbidden to write some helper code to do this). Each logic puzzle consists of one or more tests. Each question can be answered separately from the others. There is a \u0026quot;Submit\u0026quot; button below each test. To answer the question, press \u0026quot;Submit\u0026quot; button. Your answer will be acknowledged and checked after the end of the contest. You can change your answer any number of times – only the last attempt is checked. For the correct answer to the question you will get the number of points which is indicated in the question description.\u003c/p\u003e\u003cp\u003eA programming task is which you usually see in Codeforces rounds. Solutions can be submitted at any time during the contest. A solution is evaluated on a fixed set of tests right after it is submitted. For each passed test, a contestant will get a fixed amount of points. The sum of points for all passed tests is the total points received by the solution. The contestant can submit a solution several times. The contestant will receive points for only one solution per problem. The solution with the maximum amount of points will be chosen.\u003c/p\u003e\u003cp\u003eIf a pair of contestants have the same number of points gained in contest time, they will be ordered according to the time (in seconds) of the last submission which gave them an improved positive score.\u003c/p\u003e\u003cp\u003eFor each programming task, we will consider only the best submission (or if there are many submissions which are equally correct, the earliest). For logic puzzles, we will judge last submission per test.\u003c/p\u003e\u003cp\u003eIn other words, it\u0027s always safe to submit a new answer for programming tasks (you can only improve your situation). It is not always safe to do that for logic puzzles – consider carefully whether or not you want to do that (you may replace correct answer with incorrect).\u003c/p\u003e\u003cp\u003eMany thanks to all of you who will help. Waiting for your feedback in comments.\u003c/p\u003e\u003c/div\u003e","tags":["testing round"]}}