{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1520417524,"rating":0,"authorHandle":"avriskin","modificationTimeSeconds":1520438583,"id":58218,"title":"\u003cp\u003eОткрытый ежегодный Чемпионат \u0026quot;АТП^ИМКН\u0026quot;, Основной тур\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eСоревнование закончено, доступна финальная таблица результатов. Можно отправлять новые решения в режиме дорешивания.\u003c/p\u003e\u003cp\u003eРезультаты с указанием фамилий и информация о разборе задач будут опубликованы через несколько дней.\u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eТекст поста до соревнования\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eОсновной тур пройдет 7 марта с 15:30. Продолжительность — 3 часа. Учавствовать в соревновании можно удаленно или из аудиторий 422/423 ИМиКН ТюмГУ. Аналогично пробному туру, результаты проверки будут доступны сразу после отправки, а также будет доступна общая таблица с результатами всех участников. За 40 минут до конца соревнования таблица будет заморожена — вы не будете знать результаты проверок других участников, но все еще будете знать свои. В 18:45 таблица будет разморожена — будет доступна финальная таблица результатов.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eДля отправки решений необходимо зарегистрироваться нажав красную кнопку \u0026quot;Зарегистрироваться »\u0026quot; в списке соревнований или пройдя по ссылке: \u003ca href\u003d\"//codeforces.com/group/vqiJl9kbBY/contestRegistration/220693?backUrl\u003d%2Fgroup%2FvqiJl9kbBY%2Fcontests\"\u003ehttp://codeforces.com/group/vqiJl9kbBY/contestRegistration/220693?backUrl\u003d%2Fgroup%2FvqiJl9kbBY%2Fcontests\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eНапоминаем, что \u003ca href\u003d\"http://acm.timus.ru/help.aspx?topic\u003dcontest\u0026amp;locale\u003dru\"\u003eзасчитываются только полные решения задач, а за неудачные посылки прибавляется 20 минут штрафного времени,\u003c/a\u003e а \u003ca href\u003d\"http://acm.timus.ru/help.aspx?topic\u003djudge\u0026amp;locale\u003dru\"\u003eпрограмма должна быть консольным приложением не выводящей ничего лишнего\u003c/a\u003e. Задачи могут \u003cstrong\u003eне быть\u003c/strong\u003e упорядочены по возрастанию сложности.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e","tags":[]}}