{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1467050596,"rating":49,"authorHandle":"duckladydinh","modificationTimeSeconds":1467050705,"id":45702,"title":"\u003cp\u003eHow can I go further?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi guys,\u003c/p\u003e\u003cp\u003eCoding for several years, all I can say is that Competitive Programming is so great that I love it so much, despite my innumerable failures and the enormous amount of time it takes. I have always happily enjoyed it until I read \u003ca href\u003d\"//codeforces.com/blog/entry/17302\"\u003ethis\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eI hate to say this but I have to admit that what other people say about us (or at least me), competitive programmers, is true: We are not so great as we are supposed to be. As a Computer Science student, I feel it myself too. When it comes to learning a new programming language, it has always been so easy for me, but then I recognise that I can only learn as much as the previous one, to compete here on Codeforces, but not anywhere else. I could not build anything useful like an OS or an IDE when I was using Pascal and neither can I now when I have already know C/C++, Python, Matlab, Java... I feel so disappointed about myself.\u003c/p\u003e\u003cp\u003eI also want to build something useful just like when Linus Torvald built his first Linux Kernel. That kernel was written in C, and I know C but I am still unable to do anything similar. I hate this. I hate the feeling of being inferior to those people who called themselves professional programmers. I hate that but how and what can I do?\u003c/p\u003e\u003cp\u003eI hope that some of you have similar feelings like me, and I would like to know your thinking and experience, about how we can go further, go beyond what we currently are.\u003c/p\u003e\u003cp\u003eThank you for your time and consideration. HAPPY CODING \u003c/p\u003e\u003c/div\u003e","tags":[]}}