{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1403532932,"rating":0,"authorHandle":"adiko2008","modificationTimeSeconds":1403538705,"id":12800,"title":"\u003cp\u003eРегламент\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eКроме мест в рейтинге соревнования, вы получаете очки в копилку общего рейтинга. Очки за каждый контест будут считаться для пущего интересу по следующим правилам:\u003cbr /\u003e R\u003dR1+R2+R3+R4+R5, где\u003cbr /\u003e R1 — коэффициент за занятое место в первой десятке и квалификацию;\u003cbr /\u003e R2 — коэффициент за решённые задачи;\u003cbr /\u003e R3 — бонус за самую первую принятую попытку в контесте;\u003cbr /\u003e R4 — бонус за самую первую принятую попытку за задачу;\u003cbr /\u003e R5 — бонус за чистоту.\u003cbr /\u003e Теперь подробнее.\u003cbr /\u003e\u003c/p\u003e\u003ch3\u003eR1\u003c/h3\u003e \u003ctable\u003e \u003ctbody\u003e\u003ctr\u003e \u003ctd\u003eМесто\u003c/td\u003e \u003ctd\u003e1\u003c/td\u003e \u003ctd\u003e2\u003c/td\u003e \u003ctd\u003e3\u003c/td\u003e \u003ctd\u003e4\u003c/td\u003e \u003ctd\u003e5\u003c/td\u003e \u003ctd\u003e6\u003c/td\u003e \u003ctd\u003e7\u003c/td\u003e \u003ctd\u003e8\u003c/td\u003e \u003ctd\u003e9\u003c/td\u003e \u003ctd\u003e10\u003c/td\u003e \u003c/tr\u003e \u003ctr\u003e \u003ctd\u003eR1\u003c/td\u003e \u003ctd\u003e25\u003c/td\u003e \u003ctd\u003e18\u003c/td\u003e \u003ctd\u003e15\u003c/td\u003e \u003ctd\u003e12\u003c/td\u003e \u003ctd\u003e10\u003c/td\u003e \u003ctd\u003e8\u003c/td\u003e \u003ctd\u003e6\u003c/td\u003e \u003ctd\u003e4\u003c/td\u003e \u003ctd\u003e2\u003c/td\u003e \u003ctd\u003e1\u003c/td\u003e \u003c/tr\u003e \u003c/tbody\u003e\u003c/table\u003e\u003cp\u003eПри этом участник не получит своего R1, если он не квалифицируется, пусть даже и заняв место в первой десятке. Квалифицироваться — значит сдать заранее определённое число задач. Для первого контеста мы опускаем условие квалификации, однако далее оно обязательно будет применяться. Таким образом, никто не будет получать заоблачного числа очков, если все решат мало задач.\u003cbr /\u003e\u003c/p\u003e\u003ch3\u003eR2\u003c/h3\u003e\u003cp\u003eЗдесь всё просто — по одному очку за каждую задачу.\u003c/p\u003e\u003ch3\u003eR3\u003c/h3\u003e\u003cp\u003eТри очка дополнительно получит участник за первый аксепт в контесте.\u003c/p\u003e\u003ch3\u003eR4\u003c/h3\u003e\u003cp\u003eКроме того, участник получит по очку дополнительно за каждую задачу, которую он сдал первым.\u003c/p\u003e\u003ch3\u003eR5\u003c/h3\u003e\u003cp\u003eИ наконец, +3 балла самому чистому игроку. (Графа \u0026quot;Без пыли и шуму\u0026quot; в статистике, число попыток / число сданных задач.)\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}