{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1434619582,"rating":31,"authorHandle":"Sammarize","modificationTimeSeconds":1434619582,"id":18687,"title":"\u003cp\u003eНаписание контеста в автобусе\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eНа днях случился \u003ca href\u003d\"http://www.russiancodecup.ru/championship/round/39/\"\u003eотборочный раунд RCC\u003c/a\u003e. Волею судеб мне пришлось писать его в рейсовом автобусе и я решил поделиться с вами своим опытом.\u003c/p\u003e\u003cp\u003eОбычно я не пишу контесты по дороге, в кафешках, в шуме, с мобильника и прочих подобных условиях, но это был отборочный раунд RCC, так что я решил попробовать.\u003c/p\u003e\u003cp\u003eПо счастью, как раз в 13:00 автобус сделал остановку на 40 минут, так что начался контест спокойно. Интернет с мобильника, на удивление, был достаточно стабильным, с этим проблем не было. Ноут лежал на коленях и был менее зафиксирован, чем я к тому привык, но к этому легко удалось удалось адаптироваться — достаточно было не опираться на него руками. Был яркий солнечный день и экран бликовал, тем более, что мне пришлось немного убавить яркость, чтобы зарядки хватило на 3 часа, однако, и к этому удалось довольно легко адаптироваться, скоро я перестал замечать блики. В общем, первые 45 минут прошли довольно успешно, я сдал А и почти дописал В. Вокруг шумели дети, которых мы везли на выезд по по случаю выпускного из 9 класса, но и к этому легко удалось адаптироваться. Можно, конечно, было надеть наушники с музыкой, но этого не потребовалось.\u003c/p\u003e\u003cp\u003eПотом автобус поехал и пол стал дрожать под ногами, а вместе с ним и ноут. Впрочем, эту неприятность тоже было легко обойти, достаточно оказалось печатать, прижимая ноут подушечками ладоней к коленям.\u003c/p\u003e\u003cp\u003eВ общем, серьёзных препятствий к написанию программ не было. Однако открылась неожиданная проблема. Я тщётно пытался тестировать решение задачи B и думать о решении задач C и D — выяснилось, что из-за дражание сиденья, которое ощущалось во всём теле, совершенно невозможно было погрузиться в размышления о задачах. Через некоторое время мне пришлось выключить ноут.\u003c/p\u003e\u003cp\u003eА насколько вы терпимы к окружающим условиям во время контеста?\u003c/p\u003e\u003c/div\u003e","tags":["автобус","условия","russiancodecup"]}}