{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1432640381,"rating":225,"authorHandle":"kien_coi_1997","modificationTimeSeconds":1432640381,"id":18114,"title":"\u003cp\u003eAn efficient way to control energy in a contest (Part 1+2)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003eChapter 1. Introduction\u003c/h1\u003e\u003cp\u003eEvery activities consume energy. Usually, people tend to consume energy instinctively. However, this automatic mechanism is not really good.\u003c/p\u003e\u003cp\u003eI\u0027m sure that sometimes you thought, “Today I haven\u0027t done anything”. It means in that times, you didn\u0027t consume energy effectively.\u003c/p\u003e\u003cp\u003eBefore, I didn\u0027t control energy well too, especially in contests. I often thought that “I spent one hour doing nothing”. My worst time was in APIO 2014, I couldn\u0027t do anything in last 4 hours.\u003c/p\u003e\u003cp\u003eThen I realized that, it is necessary to control energy (I means consuming energy proactively). By understanding the right way to consume energy, I have got many wonderful achievements. In the team selection test in this year (a national contest which has 2 days), I got 16-17 per 20 points each days, then got rank 1 after the contest. In APIO 2015, I got 300/300 points. Although I got such scores, I didn\u0027t feel tired, but felt confortable after such contests.\u003c/p\u003e\u003cp\u003eI write this article in order to share my experience about controlling energy. This experience has been built for a long time, and the context in this article has been carefully checked. However, because this is personal thought, if you feel not convinced, it is usual.\u003c/p\u003e\u003cp\u003e. .\u003c/p\u003e\u003ch1\u003eChapter 2. Energy is finite\u003c/h1\u003e\u003cp\u003eEnergy of people is not infinite. That seems obvious and useless. However, there is a bad fact. In a normal day, everyone has a certain amount of energy, but few people consume all of energy. In contrast, in a contest, everyone has a certain amount of energy too, but before the contest ended, people consumed all of energy.\u003c/p\u003e\u003ch2\u003eEnergy is valuable, people should not waste it\u003c/h2\u003e\u003cp\u003eWhy do people often consume all of energy in a contest?\u003c/p\u003e\u003cp\u003eIn a normal day, people work under low pressure and don\u0027t need to think continuously. While working, there are familiar activities like brushing teeth, washing face, which does not require body\u0027s energy. There are also activities like cleaning room, washing clothes, which does require body\u0027s energy but does not need thinking. While learning, people often learn in a normal/familiar intensity, without much competitive spirit as in a real contest. Therefore, the brain works in a normal intensity, sometimes relaxes because of familiar activities (activities which does not need thinking).\u003c/p\u003e\u003cp\u003eIn a contest, people work under pressure and usually have to think continuously. There are many factors contributing to this essence. The only running organ is brain. People often work with high competitive spirit. There is no longer familiar activities like cleaning room, washing dishes for the brain to relax. During the contest, the pressure can\u0027t be left out. Therefore, there is a big difference between a normal day and a contest. Because the brain has to run continuously under pressure, it is obvious that the energy should be ran out quickly.\u003c/p\u003e\u003cp\u003eTo summarize, in a contest, energy is valuable. So, people should not waste it.\u003c/p\u003e\u003ch2\u003eEnergy is possible to be estimated\u003c/h2\u003e\u003cp\u003eLet the energy level when you are full of energy be 100%. And let the energy level when you are tired (I means when you ran out of energy) be 0%. Using personal experience, you can estimate the current energy level yourself. Brain\u0027s energy level and body\u0027s energy level should be distinguished. It is possible that the brain are tired while the body still remains energy. In a contest, because the only running part is brain, so in this article, we only have to concern about the brain\u0027s energy.\u003c/p\u003e\u003cp\u003eIn a normal day, the energy amount can be increased of decreased. It is widely known that the ways to refill the energy amount is to eat, sleep and rest. However, competitors don\u0027t do these in a contest. Therefore, in a contest, the energy amount is only decreased and never increased.\u003c/p\u003e\u003cp\u003eBy understanding the current energy level yourself, you can use the information to make proper decisions. For example,\u003c/p\u003e \u003cul\u003e   \u003cli\u003eIf you run out of energy before the contest end, you will waste the remaining time. If you still remain much energy when the contest end, you will waste the remaining energy. Therefore, optimally, the time you run out of energy should be the ending time of the contest. Estimating current energy level allows you to adjust the time you run out of energy.\u003c/li\u003e   \u003cli\u003eAssume that half of the contest time is over, and you still have more than 50% of energy. That means you should increase the pressure to do more things in the remaining time.\u003c/li\u003e   \u003cli\u003eAssume that half of the contest time is over, and you have less that 50% of energy. That means you should relax (I means make your body comfortable). In the remaining time, you have to calm down and lower the pressure.\u003c/li\u003e \u003c/ul\u003e \u003chr /\u003e\u003ch1\u003eP/S:\u003c/h1\u003e\u003cp\u003eMy article is not ended. There will be 3 more parts in this article. I have not finished them because this article require a long time.\u003c/p\u003e\u003cp\u003eChapter 3 will talk about pressure, how the pressure affects the performance.\u003c/p\u003e\u003cp\u003eI will be glad if you share your own experience.\u003c/p\u003e\u003cp\u003eNếu bạn đọc tiếng Việt thì có thể xem bài viết ở đây: \u003ca href\u003d\"https://sites.google.com/site/kc97ble/skill/kiem-soat-nang-luong-trong-ki-thi\"\u003ehttps://sites.google.com/site/kc97ble/skill/kiem-soat-nang-luong-trong-ki-thi\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["experience"]}}