{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1412596650,"rating":43,"authorHandle":"kingofnumbers","modificationTimeSeconds":1412792235,"id":14134,"title":"\u003cp\u003e[GYM] Syrian Collegiate Programming Contest 2014\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello,\u003c/p\u003e\u003cp\u003eSyrian Collegiate Programming Contest 2014 (SCPC) was held as a multisite contest in both Damascus and Latakia between 21st and 23rd of September , I think it\u0027s the first ACM contest which take place in two sites in two different cities!\u003c/p\u003e\u003cp\u003eForty four teams from eleven universities participated in the contest beside three other unofficial teams\u003c/p\u003e\u003cp\u003eI\u0027ve uploaded the contest to GYM and I invite you to participate in this contest which I choosed \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?day\u003d8\u0026amp;month\u003d10\u0026amp;year\u003d2014\u0026amp;hour\u003d17\u0026amp;min\u003d0\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003ethis time\u003c/a\u003e for it , I hope I chose the time which suits as many coders as possible.\u003c/p\u003e\u003cp\u003emost problems may be easy for yellow and red coders but at least one problem will interest you.\u003c/p\u003e\u003cp\u003eit\u0027s the first time that I upload a contest to GYM so I hope everything is technically ok!\u003c/p\u003e\u003cp\u003eif you have coach rights please don\u0027t enter the contest before it starts.\u003c/p\u003e\u003cp\u003eBy the way, today is the third day of \u003ca href\u003d\"http://en.wikipedia.org/wiki/Eid_al-Adha\"\u003eEid al-adha\u003c/a\u003e festival so Happy feast to all Muslims :D\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e Contest is finished , thanks for participation and Cogratulations to winners.\u003c/p\u003e\u003cp\u003eproblem H is a traditional dynamic programming but allowing negative values tricked a lot of contestants because they didn\u0027t initialize the corner values of dp to -INF (i.e dp[i][0]\u003d-INF and dp[0][i]\u003d-INF)\u003c/p\u003e\u003cp\u003eproblem I is very simple implementation problem the fault of many participants is not considering the case when there\u0027s no 5 different letters in the song.\u003c/p\u003e\u003c/div\u003e","tags":[]}}