{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1505940718,"rating":397,"authorHandle":"SirRembocodina","modificationTimeSeconds":1505942015,"id":54666,"title":"\u003cp\u003eWhy I will not go to Barcelona Bootcamp\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eFirst I\u0027ll answer the question. In this season Sberbank payed for places in the hostel for participants. In the summer we notified the organisers that we want to go, but we decided on the team\u0027s line-up just recently. It turned out that the payed places are over, though we had a verbal agreement about us coming for the reduced price. I think it\u0027s not good to do so. Maybe it was a misunderstanding, but I became offended, so I will tell you about my impression of the first ride which was this winter.\u003c/p\u003e\u003cp\u003eThat time our rector payed the fee, it was 1270 euro per person for 10 days. We were settled in a narrow hostel with wind blowing through the window, and it was quite cold then. As a result, everyone in our team got ill, and I had acute bronchitis for half a year. Settling for 10 days in that room costs 213 euro per person. We took breakfast in the hostel, for lunch they gave us the same burger every day, without any sauce and with raw meat, and a can of cola. There was no dinner. Suppose, that burger costed 3 euro, cola – 1 euro, for 10 days we get 40 euro. The remaining 1017 euro should have went for renting a room for contests, for lecturers\u0027 payment and for entertainment. Suppose, every lecturer got 1000 euro, there were no more than 10 of them, there were also about 100 participants, then everyone payed no more than 100 euro. We took part in the contests in a narrow place, which is not intented for this purposes. We brought our own laptops. According to their site, renting this place for 10 days costs about 30 euro per person. The enternainment was an excurcion to Sagrada Familia, which costs no more than 24 euro.\u003c/p\u003e\u003cp\u003eThere is 863 euro (\u0026gt; 2/3 of the fee) left, and I know where they went. Not to mention the fact that this event had several large sponsors. I did not pay money, so I\u0027m not complaining, but I want to bring this information to those who still invest in this. Think about whom you give your money to.\u003c/p\u003e\u003c/div\u003e","tags":["barcelona bootcamp","barcelona","maleev","corruption"]}}