{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1461085506,"rating":124,"authorHandle":"csacademy","modificationTimeSeconds":1461780018,"id":44451,"title":"\u003cp\u003eBeta Round #4 — csacademy.com\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eWe are happy to announce that we\u0027re going to host a new contest at \u003ca href\u003d\"http://csacademy.com\"\u003ecsacademy.com\u003c/a\u003e. Once again we\u0027d like to thank all our users for the great feedback they provide. We try to listen to your advice and improve our platform with each competition.\u003c/p\u003e\u003cp\u003eOur \u003ca href\u003d\"https://csacademy.com/contest/beta-round-4/\"\u003eBeta Round #4\u003c/a\u003e will take place on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dCSAcademy+Beta+Round+4\u0026amp;iso\u003d20160426T16\u0026amp;p1\u003d1440\u0026amp;ah\u003d2\"\u003eTuesday, Apr/26/2016 16:00 (UTC)\u003c/a\u003e. If you want to take part in this round you need to \u003ca href\u003d\"https://csacademy.com/contest/beta-round-4/\"\u003eregister\u003c/a\u003e before the contest begins. You can access the chat room for this round \u003ca href\u003d\"https://csacademy.com/contest/beta-round-4/#chat\"\u003ehere\u003c/a\u003e (login required). Initially we were planning on having two divisions starting with this round. After taking a closer look at the rankings we decided it\u0027s too early to separate our users. So this round will be a Div1 + Div2, with 3 easy tasks and 3 more challenging ones.\u003c/p\u003e\u003ch4\u003ePlatform changes since Beta Round #3:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003eWe have integrated our rating system and retroactively applied it to the previous three rounds. You can access the rankings \u003ca href\u003d\"https://csacademy.com/ratings/\"\u003ehere\u003c/a\u003e. For each round we considered only those users who submitted at least one solution. If you registered but didn\u0027t submit anything your rating should\u0027ve been unaffected.\u003c/li\u003e   \u003cli\u003eWe have created \u003ca href\u003d\"https://csacademy.com/myprofile\"\u003eprofile pages\u003c/a\u003e. \u003cstrong\u003eImportant:\u003c/strong\u003e You need to have a username set in order to access your profile page. If you want to use your Codeforces handle you need to link your account in the \u003ca href\u003d\"https://csacademy.com/accounts/settings/\"\u003eaccount settings\u003c/a\u003e page.\u003c/li\u003e   \u003cli\u003eFor those of you who linked your CF account we used our charts library to plot the CF rating. If you didn\u0027t link your account you can check out what it looks like \u003ca href\u003d\"https://csacademy.com/user/enot.1.10\"\u003ehere\u003c/a\u003e, under the \u0026quot;External profiles\u0026quot; tab. The charts support zoom and drag behaviours.\u003c/li\u003e   \u003cli\u003eWe have added global chat rooms for the contests. The chat room will be available only before and after the round takes place. During the contest we will deactivate it.\u003c/li\u003e \u003c/ul\u003e\u003ch4\u003eContest format:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003eYou will have to solve \u003cstrong\u003e6\u003c/strong\u003e tasks in \u003cstrong\u003e2\u003c/strong\u003e hours.\u003c/li\u003e   \u003cli\u003eThere will be full feedback throughout the entire contest.\u003c/li\u003e   \u003cli\u003eTasks will not have partial scoring, so you need to pass all test cases for a solution to count (ACM-ICPC-style).\u003c/li\u003e   \u003cli\u003eTasks will have dynamic scores. According to the number of users that solve a problem the score will vary between 100 and 1000.\u003c/li\u003e   \u003cli\u003eBesides the score, each user will also get a penalty that is going to be used as a tie breaker.\u003c/li\u003e \u003c/ul\u003e\u003ch4\u003eAbout the penalty system:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003eComputed using the following formula: the minute of the last accepted solution + the penalty for each solved task. The penalty for a solved task is equal to log2 (no_of_submissions) * 5.\u003c/li\u003e   \u003cli\u003eSolutions that don\u0027t compile or don\u0027t pass the example test cases are ignored.\u003c/li\u003e   \u003cli\u003eOnce you solve a task you can still resubmit. All the following solutions will be ignored for both the score and the penalty.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eWe still recommend using an updated version of Google Chrome. If you find any bugs please email us at \u003ca href\u003d\"mailto:contact@csacademy.com\"\u003econtact@csacademy.com\u003c/a\u003e\u003c/p\u003e\u003cp\u003eDon\u0027t forget to like us on \u003ca href\u003d\"https://www.facebook.com/csacademy\"\u003eFacebook\u003c/a\u003e, \u003ca href\u003d\"https://vk.com/realcsacademy\"\u003eVK\u003c/a\u003e and follow us on \u003ca href\u003d\"https://twitter.com/realCSAcademy\"\u003eTwitter\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEDIT\u003c/strong\u003e: The \u003ca href\u003d\"https://csacademy.com/blog/2016/04/26/beta-round-4/\"\u003eeditorial\u003c/a\u003e is ready. Congratulations to all the users and we hope you had a great time. We are waiting for you at Beta Round #5.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLATER EDIT\u003c/strong\u003e: We fixed the bug and updated the \u003ca href\u003d\"https://csacademy.com/ratings/\"\u003eratings\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["csacademy","csacademy beta round #4","announcement","rated"]}}