{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1498910220,"rating":70,"authorHandle":"jonathanirvings","modificationTimeSeconds":1499279407,"id":53037,"title":"\u003cp\u003eInvitation to 2017 Indonesian National Olympiad in Informatics Open Contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello!\u003c/p\u003e\u003cp\u003eIndonesia will hold 2017 National Olympiad in Informatics next week (July 3rd — July 5th 2017) in Pekanbaru, Indonesia. It is a competition for Indonesian high school students as one of the preliminary round of Indonesian IOI selection. \u003c/p\u003e\u003cp\u003eAnd this is the third year for Indonesia (\u003ca href\u003d\"//codeforces.com/blog/entry/44892\"\u003e2016\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/blog/entry/17924\"\u003e2015\u003c/a\u003e) to invite everyone around the world to try solving the problems by participating the Open Contest! The contest will be conducted on \u003ca href\u003d\"https://competition.ia-toki.org/contests\"\u003eTLX Online Judge\u003c/a\u003e. You may need to register for a TLX account if you do not have one. If you have a TLX account, you can login and go to the contest link to register for the contest.\u003c/p\u003e\u003cp\u003eThere will be three different contests, one for each day. You may participate them separately (e.g. only participate in Day 1 and Day 2, but not in Day 0), but we expect you to join them all. The Open Contest will start after an hour from the real contest. Here are the schedule and details for the Open Contest:\u003c/p\u003e \u003col\u003e   \u003cli\u003eDay 0 (Practice Contest): \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003d2017+Indonesian+National+Olympiad+in+Informatics+Open+Contest-+Day+0\u0026amp;iso\u003d20170703T1530\u0026amp;p1\u003d583\u0026amp;ah\u003d8\u0026amp;am\u003d30\"\u003eMonday, July 3rd 15.30 — 24.00 (UTC +7)\u003c/a\u003e. \u003ca href\u003d\"https://competition.ia-toki.org/contests/204\"\u003eRegister here.\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eDay 1: \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003d017+Indonesian+National+Olympiad+in+Informatics+Open+Contest-+Day+1\u0026amp;iso\u003d20170704T0930\u0026amp;p1\u003d583\u0026amp;ah\u003d5\"\u003eTuesday, July 4th 09.30 — 14.30 (UTC +7)\u003c/a\u003e. \u003ca href\u003d\"https://competition.ia-toki.org/contests/205\"\u003eRegister here.\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eDay 2: \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003d2017+Indonesian+National+Olympiad+in+Informatics+Open+Contest+-+Day+2\u0026amp;iso\u003d20170705T0930\u0026amp;p1\u003d583\u0026amp;ah\u003d5\"\u003eWednesday, July 5th 09.30 — 14.30 (UTC +7)\u003c/a\u003e. \u003ca href\u003d\"https://competition.ia-toki.org/contests/206\"\u003eRegister here.\u003c/a\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eThe rules of this contest are\u003c/p\u003e \u003cul\u003e   \u003cli\u003eThere will be 3 IOI-style problems for each competition day.\u003c/li\u003e   \u003cli\u003eProblem statements will be provided in English and Bahasa Indonesia.\u003c/li\u003e   \u003cli\u003eYou can only submit at most 50 submissions for a problem.\u003c/li\u003e   \u003cli\u003eYou will get full feedback for each submission.\u003c/li\u003e   \u003cli\u003eFor each problem, there are several subtasks:\u003c/li\u003e   \u003cli\u003eFor each subtask, there are points assigned to it.\u003c/li\u003e   \u003cli\u003eEach subtask contains several test cases.\u003c/li\u003e   \u003cli\u003eYou get the points from that subtask if the program passes all the test cases in that subtask.\u003c/li\u003e   \u003cli\u003eThe score of a submission is the sum of all the points that you get from completing subtasks.\u003c/li\u003e   \u003cli\u003eThe final score for a problem is the maximum of all the submission scores for that problem.\u003c/li\u003e   \u003cli\u003eOnly C++11, C, and Pascal are allowed.\u003c/li\u003e   \u003cli\u003eYou will need to read the input from standard input and print the output to standard output.\u003c/li\u003e   \u003cli\u003eYou can submit clarification requests in either Bahasa Indonesia or English.\u003c/li\u003e   \u003cli\u003eNo medals/certificates will be awarded to Open Contest participants.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eNOTE : TLX uses a standard \u003ccode\u003ediff\u003c/code\u003e to check contestant\u0027s output. Therefore, contestant\u0027s output must be exactly the same as expected output. (e.g. no extra/missing spaces, no extra/missing newline, etc.). Make sure to print a newline after the last output.\u003c/p\u003e\u003cp\u003eWe invite everyone to participate in this contest. See you at the leaderboard.\u003c/p\u003e\u003cp\u003e2017 Indonesian National Olympiad in Informatics Committee\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e: The problems are available for upsolving \u003ca href\u003d\"https://training.ia-toki.org/archives/48\"\u003ehere\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}