{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1405093741,"rating":48,"authorHandle":"KAP","modificationTimeSeconds":1405093741,"id":13015,"title":"\u003cp\u003eНесколько алгоритмических текстов\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eТак сложилось, что в 2008­-2009 годах я написал несколько довольно объемных текстов на разные темы алгоритмического программирования. Писал я их в то время для некоторой группы нижегородских школьников, но с тех пор некоторые из этих текстов я довольно широко распространял, последнее время явно в них указывая лицензию CC-BY-SA.\u003c/p\u003e\u003cp\u003eТеперь я решил выложить эти тексты на github, чтобы а) сделать их распространение еще более широким, но при этом более упорядоченным; б) чтобы желающим было бы проще исправлять ошибки и опечатки, коих там достаточно.\u003c/p\u003e\u003cp\u003eИтак:\u003c/p\u003e\u003ch2\u003e\u003ca href\u003d\"https://github.com/petr-kalinin/progtexts\"\u003ehttps://github.com/petr-kalinin/progtexts\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eили, если вам интересуют только pdf, а не LaTeX-исходники, то \u003c/p\u003e\u003ch2\u003e\u003ca href\u003d\"https://github.com/petr-kalinin/progtexts/releases/latest\"\u003ehttps://github.com/petr-kalinin/progtexts/releases/latest\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eТемы текстов (кружочком помечены те, которые получили довольно широкое распространение):\u003c/p\u003e \u003col\u003e   \u003cli\u003e   \u003cul\u003e     \u003cli\u003eПеребор с возвратом\u003c/li\u003e   \u003c/ul\u003e\u003c/li\u003e   \u003cli\u003eСложность алгоритмов, O-нотация\u003c/li\u003e   \u003cli\u003eРазличные мелкие алгоритмические идеи, а также около-программистские замечания\u003c/li\u003e   \u003cli\u003e   \u003cul\u003e     \u003cli\u003eПоиск в глубину\u003c/li\u003e   \u003c/ul\u003e\u003c/li\u003e   \u003cli\u003e   \u003cul\u003e     \u003cli\u003eДинамическое программирование\u003c/li\u003e   \u003c/ul\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eТексты, конечно, подразумевают некоторый начальный уровень знаний. Если за шкалу «уровней знаний» для удобства принять параллели ЛКШ, то тексты ориентированы примерно на уровень начиная с «чуть старше параллели C» и до параллели A\u0027.\u003c/p\u003e\u003cp\u003eСразу предупреждаю (disclaimer), основной текст писался 5-6 лет назад, поэтому местами могут быть устаревшие фрагменты. Вообще, там было довольно много упоминаний Borland Pascal, я вроде постарался при подготовке к публикации их все убрать, но, возможно, что-то я пропустил. Кроме того, там могут быть и разные другие проблемы и даже где-нибудь может быть написана полная ерунда — я особенно внимательно тексты давно не перечитывал. Сообщайте о таком.\u003c/p\u003e\u003cp\u003eЕсли тексты вас заинтересуют, и будут комментарии, замечания, ошибки — пишите или (даже лучше!) предлагайте pull-request\u0027ы.\u003c/p\u003e\u003cp\u003eЛицензия на pdf-ки — CC-BY-SA. На TeX-код пока не знаю, какая лицензия; подскажите, какую лицензию лучше использовать?\u003c/p\u003e\u003c/div\u003e","tags":["теория","самообучение"]}}