{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1406143933,"rating":14,"authorHandle":"Izot_NNSTU","modificationTimeSeconds":1406152630,"id":13165,"title":"\u003cp\u003eАлгоритм для вырезания полости в произвольной 3D модели\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eСобственно, столкнулся на производстве с такой вот задачей. Дан 3-мерный не обязательно выпуклый многогранник (mesh), грани — треугольники. Задача такая: построить один или несколько многогранников вложенных в данный так, чтобы суммарный объем этих многогранников был максимальным и никакая точка внутренних многогранников не была ближе k мм от внешнего. Проще говоря — вырезать полость (полости) максимального объема так, чтобы \u0026quot;стенки\u0026quot; везде были толщины не менее k мм.\u003c/p\u003e\u003cp\u003eНужно это, естественно, для 3Д печати. Вот здесь показано как это делать, например, для куба: \u003ca href\u003d\"https://www.shapeways.com/tutorials/creating-hollow-objects\"\u003ehttps://www.shapeways.com/tutorials/creating-hollow-objects\u003c/a\u003e Наши модели, само собой, более сложные — фигурки людей и пр.\u003c/p\u003e\u003cp\u003eСейчас решаем проблему приближенно, строим внутри полости из \u0026quot;кубиков\u0026quot; (вокселей). При большом количестве вокселей результат хороший, но в модели получается очень много вершин и граней и принтеру иногда сносит крышу.\u003c/p\u003e\u003cp\u003eСоответственно требования такие:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eмаксимальный внутренний объем\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eтолщина стенок\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eколичество \u0026quot;внутренних\u0026quot; граней должно быть не больше, чем количество граней в исходном меше\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eработает быстро и не жрет память, в идеале O(количество вершин)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eестественно, никаких самопересечений, вырожденных граней и прочего\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eУ кого нибудь есть идеи как написать такой алгоритм? Буду рад любым идеям — можно начать с решения в 2мерном случае, например. Заранее спасибо :)\u003c/p\u003e\u003c/div\u003e","tags":["3d","геометрия","вычисления"]}}