{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1419584400,"rating":8,"authorHandle":"andymitrich","modificationTimeSeconds":1419584400,"id":15384,"title":"\u003cp\u003eПоиск максимального паросочетания в задаче \u0026quot;Испорченный паркет\u0026quot;\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет всем! Прошу помощи.\u003c/p\u003e\u003cp\u003eЕсть задача \u0026quot;Испорченный паркет\u0026quot;. Условие задачи следующее:\u003c/p\u003e\u003cp\u003eПол в некоторой комнате размером M ×N замощен паркетом. При этом некоторые плитки паркета оказались испорчены. Петя решил сделать ремонт в этой комнате, заменив только испорченные клетки. Придя в магазин, он обнаружил, что паркетные плитки бывают двух типов — размера 1 × 2, которые стоят A рублей (немного подумав, Петя понял, что плитки 1×2 можно поворачивать на 90 градусов, получая тем самым плитки 2×1) и размера 1 × 1, которые стоят B рублей. Разрезать плитку размера 1 × 2 на две, размера 1 × 1 Петя не может. Определите, какая минимальная сумма денег нужна Пете, чтобы сделать ремонт.\u003c/p\u003e\u003cp\u003eФормат ввода Первая строка входных данных содержит 4 целых числа N, M, A, B (1 ≤ N, M ≤ 300, A, B ≤ 1000). Каждая из последующих N строк содержит по M символов. Символ «.» обозначает неиспорченную плитку паркета, а символ «*» — испорченную. В конце строк могут идти незначащие пробелы. В конце входных данных могут быть пустые строки.\u003c/p\u003e\u003cp\u003eФормат вывода В выходных данных выведите одно число — минимальную сумму денег, которую необходимо будет потратить для ремонта в комнате.\u003c/p\u003e\u003cp\u003eРешение Для решения я использовал алгоритм Куна для нахождения максимального паросочетания в двудольном графе: если раскрасить плитки паркета в \u0026quot;шахматы\u0026quot;, то получается, что в двойной плитке (размера 1х2) одна плитка лежит на белой стороне, другая — на черной. Таким образом, испорченные плитки, которые находятся рядом можно соединить ребрами и получить двудольный граф.\u003c/p\u003e\u003cp\u003eРешение я написал, но оно проходит только 11 тестов, на 12-ом валится. Очевидный ответ давать не прошу. Если кто-нибудь может привести пример теста, на котором свалится решение, или направить меня в нужном направлении — помогите \u003c/p\u003e\u003cp\u003eКод: \u003ca href\u003d\"http://pastebin.com/06pDNvLe\"\u003ehttp://pastebin.com/06pDNvLe\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["c++","решение","wrong answer"]}}