{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1421384436,"rating":102,"authorHandle":"mukel","modificationTimeSeconds":1421385459,"id":15823,"title":"\u003cp\u003eLike a boss!!!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eToday I starred a dramatic/pure-adrenaline experience.\u003c/p\u003e\u003cp\u003eIt was during TopCoder SRM 646, after a few months of no participation on SRMs, I started fresh, by configuring Greed (arena plugin) from zero on my shiny Mint box. It was 3:00AM 3, 2, 1 ... Go, SRM 646 started.\u003c/p\u003e\u003cp\u003e250 was rather easy I think, I managed to solve it in a few minutes. The 600 problem was another story, the idea was rather standard, compress the coordinates ... and BFS, but the implementation was, without doubt, the most difficult part. I coded and coded, and coded using the old C++ standard with make_pair, long-named iterators and no auto ... I\u0027m quite rusty since I\u0027m using mainly Scala now, and suddenly C++ seemed to be very verbose.\u003c/p\u003e\u003cp\u003eI finished coding 2 minutes before the end, but with only the first test case PASSED, I had no idea, my code was hairy, I double checked, triple checked, but nothing. The adrenaline kept me focused, and in the last 5 seconds I decided to submit with only one test PASSED, yes I know I\u0027m crazy, but I was very confident..., no wait, I wasn\u0027t, but something (my internal purely-rational programmer) pushed my to submit my \u0026quot;wrong\u0026quot; solution in the last second, yes, in the last second!!!!. The \u0026quot;Contest ended\u0026quot; message box followed my submission instantly. I felt sad because in such cases the most probable outcome is obvious, but I still had some hope.\u003c/p\u003e\u003cp\u003eThe challenge phase started, one by one, many solutions (of red coders) were mercilessly hacked, but not mine, I was intrigued, nearly the end of the challenge phase I suddenly remembered that the Greed tester code runs all the tests in a single run, it does not run your program for each test (I knew it, but I\u0027m rusty). F#!U%*\u003ca\u003eC@#*\u0026amp;%K!!!!!!\u003c/a\u003e, all the static variables were filled with garbage after the first test.\u003c/p\u003e\u003cp\u003eI regained confidence, I still had no guarantee at all, I was again in tension. System testing started, and YEEEEEEEEEESSSSSSSSSSSSSS, System Tests Passed on both problems, the adrenaline rush make me feel that I was the smartest human being ever lived. I finished 34th overall, and everything due to my self-confidence. I feel like a boss!!!\u003c/p\u003e\u003cp\u003eI hope that you enjoyed such a large post, it\u0027s a lesson about luck (yes, mainly luck), confidence and the risks and rewards that came attached.\u003c/p\u003e\u003c/div\u003e","tags":["srm646","topcoder","likeaboss"]}}