{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1437936898,"rating":-4,"authorHandle":"eldor4do","modificationTimeSeconds":1437938293,"id":19431,"title":"\u003cp\u003eBeginner Dynamic Programming help\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eProblem : Isotope\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eScientist recently found a new element X, which can have different isotopes upto an atomic value of 199. Speciality of element X is that when two atoms fuse they produce energy multiple of their atomic value and forms an atom with atomic value of their multiple modulus 199. For Eg: If atom1 with value 56 and atom2 with value 61 fuse. They produce energy of 3416 KJ (56 * 61) Resulting atom will have atomic value (56*61) mod 199 \u003d 33 Scientists created a nuclear reactor to create energy by this method. Everyday they get several atoms of X from supplier in a particular sequence. Since this element highly radioactive they cant risk by changing its sequence. So each atom can fuse only with another atom nearby. Nevertheless scientists can choose order of fusion thereby maximizing total energy produced. Now, for given sequence of atomic values, output maximum energy that can be produced.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eInput Format\u003c/strong\u003e Input starts with a number specifying number of inputs(n) followed by n space separated integers specifying atomic values of n atoms.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSample Input/ Output\u003c/strong\u003e Input: 3 56 61 2\u003c/p\u003e\u003cp\u003eOutput: 6954\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLimits\u003c/strong\u003e 1 \u0026lt; n \u0026lt; 1000\u003c/p\u003e\u003cp\u003e0 \u0026lt; a[i] \u0026lt; 199\u003c/p\u003e\u003cp\u003eI believe there must exist a method better than simply brute forcing, maybe dynamic programming. Can anyone give an idea how to proceed for the correct solution?\u003c/p\u003e\u003c/div\u003e","tags":["dynamic programming"]}}