{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1464415031,"rating":1,"authorHandle":"gsmcoder97","modificationTimeSeconds":1464415031,"id":45091,"title":"\u003cp\u003eF.Snow sellers\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI was solving this problem Snow Sellers (\u003ca href\u003d\"//codeforces.com/contest/48/problem/F\"\u003ehttp://codeforces.com/contest/48/problem/F\u003c/a\u003e) and I am having problem understanding the idea behind it. If I look at the input test case it is as follows: 2 3 10 4 4 4 5 5 8 1 2 5\u003c/p\u003e\u003cp\u003eAccording to the question, 2 are the number of days for which the winter goes on(sale); 3 are the number of the snow selling companies; and 10 is the amount of the snow he has to buy everyday exactly(not less and not more).\u003c/p\u003e\u003cp\u003eNow, my understanding is as follows: \u003cstrong\u003eOn the starting of the first day\u003c/strong\u003e \u003cstrong\u003eThe first company\u003c/strong\u003e was selling 4 cubic metres for 5 bourles; this means 1 cubic metre for 1.25 bourle. \u003cstrong\u003eThe second company\u003c/strong\u003e was selling 4 cubic metres for 5 bourles; this means 1 cubic metre for 1.25 bourle. \u003cstrong\u003eThe third company\u003c/strong\u003e was selling 8 cubic metres for 8 bourles; this means 1 cubic metre for 2 bourles. Thus, to buy 10 cubic metres on the first day, he will buy it from the first or second shop for 12.5 bourles.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOn the starting of the second day\u003c/strong\u003e \u003cstrong\u003eThe first company\u003c/strong\u003e was selling 4 cubic metres for 4 bourles; this means 1 cubic metres for 1 bourle. \u003cstrong\u003eThe second company\u003c/strong\u003e was selling 4 cubic metres for 3 bourles; this means 1 cubic metre for 0.75 bourle. \u003cstrong\u003eThe third company\u003c/strong\u003e was selling 4 cubic metres for 3 bourles; this means 1 cubic metre for 0.75 bourle. Thus, to buy 10 cubic metres on the second day, we will buy it from the second or third shop for 7.5 bourles.\u003c/p\u003e\u003cp\u003eHence, the total amount is 7.5+12.5\u003d20 bourles.\u003c/p\u003e\u003cp\u003eBut, the otuput of the first test case is 22. Please help. Thank you.\u003c/p\u003e\u003c/div\u003e","tags":["greedy","sorting"]}}