{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399081887,"rating":-21,"authorHandle":"reign88","modificationTimeSeconds":1399081887,"id":12101,"title":"\u003cp\u003ethis policy will not change\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eand win-win banner, this policy will not change because of some trouble.Cui Wilson Center who attended the American Institute of Sino-US relations, Kissinger opening ceremony of the new logo, made the remarks when interviewed by the media after the meeting. He said the Chinese side on U.S. policy toward China has always been a full, comprehensive and clear understanding of the issue and not easily changed because of a momentary view.Cui said China\u0027s development has been faced with a complex international environment, regardless o\u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-95-c-32.html\"\u003enike air max 95 comprar\u003c/a\u003e  f how changes in the international environment, China will stick to the road of peaceful development, will be exalted in the international peace, development, cooperation and win-win banner.\u0026quot;This policy will not change because of some trouble, from this perspective, China will be maintaining the status quo.\u0026quot; Cui said.He also pointed out that if someone in the world continue to adhere to the Cold War mentality, attempting to contain China, to block China\u0027s development, China will have a variety of responses, \u0026quot;From this perspective, China will be the status quo should remain unchanged.\u0026quot;Cui day with former U.S. Secretary of State Henry Kissinger to join the US-China Relations Institute of the opening ceremony of the new logo and the new logo handwritten Chinese character \u0026quot;base.\u0026quot; Cui said the Chinese character \u0026quot;base\u0026quot; is not only the first word Kissinger Chinese names, there are \u0026quot;basic\u0026quot;, \u0026quot;basic\u0026quot; means. Kissinger and the older generation of leaders of China jointly opened the door to Sino-US relations, laying a solid foundation for the development of Sino-US relations. Over the years, Kissinger has been concerned about the development of China-US relations and put forward a number of very interesting proposals for the healthy and stable development of Sino-US relations have played an important role in the hope that US-China Relations Institute Kissinger can be the starting point f\u003c/p\u003e\u003cp\u003eor the new logo for the new continue to contribute to the development of Sino-US relations this is an old story half a century ago, but has still saddening to read: 1941 \u0026quot;Southern Anhui Incident\u0026quot; occurred, the New Fourth Army commander Ye Ting unfortunately captured. KMT authorities want to draw the famous expedition, he\u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-1-c-1.html\"\u003enike air max 1 baratas\u003c/a\u003e  proposed the appointment of a third theater deputy commander in chief. The third theater was under the jurisdiction of Jiangsu, Zhejiang, Anhui, Jiangxi, Fujian five provinces, sitting on hundreds of thousands of troops. The face of temptation, Ye Ting flatly refused, I would rather be a prisoner, not as a guest of the forces of evil. This integrity, Ye Ting\u0027s always confirms the belief that: \u0026quot;the rich to me like a cloud.\u0026quot;Confucius saying \u0026quot;unjust rich and expensive, to me as a cloud,\u0026quot; Du Fu poem \u0026quot;veteran to know Dan, rich in me as a cloud.\u0026quot; The value of the sort of traditional culture, the more moral righteousness Billy priority, the ideal life is not to great wealth and trampled virtue and morality, above material interests, but should focus on ethical practice. This is the ancient \u0026quot;Righteousness identified\u0026quot; value starting at the front line today, we still candles.Indeed, in our time, everyone has the right to pursue legitimate interests. But \u0026quot;Gentlemen love fortune, in a proper way,\u0026quot; the road of righteousness, how can the interests and money in the first \u003c/p\u003e\u003cp\u003eposition, and even sacrifice for the benefit of the principle, in order to wealth can break the bottom line, in order to enjoy can disregard the moral Leading cadres concerned, in particular, should put the relationship between justice and profits can pursue legitimate rights and interests of individuals, but not their own selfish interests gray, not the power as a tool for personal gain, which should be done to get rid of selfishness, righteousness sake . This is the leading cadres should uphold the concept of justice and\u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-90-c-10.html\"\u003enike air max 90 españa\u003c/a\u003e  benefit, but also the central leadership has repeatedly stressed that \u0026quot;official fortune should be two,\u0026quot; the meaning lies.From tomorrow, armed patrols the streets of Guangzhou normalization system will be officially implemented. In fact, the reporter learned from the Provincial Public Security Bureau, the whole of Guangdong Province, the normalization of the road patrol is not new. From 2010 onwards, the increasing incidence of Guangdong prominent road, Shenzhen, Huizhou, Shunde and other places have opened the \u0026quot;big patrol\u0026quot; model to improve the road to see alarm rate, steward rate, disposal rate, has a lot of experience and practice is worth around Guangzhou reference.Leadership also patrol the streetsThe biggest problem to set up a specialized police force patrols, increased patrol force, is the problem facing the shortage of police. \u0026quot;In the police can effectively increase the short-term situation, only through organ weight, the police toward the road to implementation.\u0026quot; Provincial Public Security Bureau official said, much of the city \u003c/p\u003e\u003c/div\u003e","tags":[]}}