{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1415102340,"rating":-24,"authorHandle":"beatoriche","modificationTimeSeconds":1415102340,"id":14576,"title":"\u003cp\u003eSocial Justice\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eWhen I was young, I thought that all programmers have rational thinking. But I see that they are more like normal people. One of high ranked CFers spoke of similarity of interracial marriage and same-sex marriage, and got upvotes for that.\u003c/p\u003e\u003cp\u003eOf course, the analogy exists only in \u0026quot;progressive\u0026quot; narrative (many of us are so americanized so even we speak from U.S. POV) -- interracial marriage ban purposefully discriminated people, whereas absence of same-sex marriage is status quo even for countries which have never had anti-sodomy laws to begin with.\u003c/p\u003e\u003cp\u003eSo what are the consequences of the former civil rights victory, lifting an interracial marriage ban? I in 2012, 72% of Black babies were born to unwed mothers (highest amongst all ethnic groups) \u003ca href\u003d\"http://www.cdc.gov/nchs/data/nvsr/nvsr62/nvsr62_09.pdf\"\u003ehttp://www.cdc.gov/nchs/data/nvsr/nvsr62/nvsr62_09.pdf\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWhy? The answer is very simple: black women are not sexually attractive for most men. \u003ca href\u003d\"http://qz.com/149342/the-uncomfortable-racial-preferences-revealed-by-online-dating/\"\u003ehttp://qz.com/149342/the-uncomfortable-racial-preferences-revealed-by-online-dating/\u003c/a\u003e They look too masculine. While black men may go for marrying White or Asian women, it\u0027s not easy for black woman to marry or even date outside their race. Given that in U.S. black population is smaller than White, this effect barely noticeable for Whites but very noticeable for Black women.\u003c/p\u003e\u003cp\u003eYou don\u0027t hear much about this problem because it\u0027s difficult to link white racism to it. However, \u0026quot;civil rights\u0026quot; advocates probably will label me as racist just for noticing it. Of course there are some people trying to \u0026quot;explain\u0026quot; it by saying that most black males are poor, \u003ca href\u003d\"https://en.wikipedia.org/wiki/Marriage_squeeze\"\u003ehttps://en.wikipedia.org/wiki/Marriage_squeeze\u003c/a\u003e But you have to be really ignorant of reality to believe in it, given that this doesn\u0027t prevent black males to marry outside their race at much greater rate as black females.\u003c/p\u003e\u003cp\u003eThere are many attributes of people. People can male or female, tall or short, clever or dumb, dark-skinned or light-skinned, extraverted and intraverted, sexually attractive and sexually repulsive. For unknown reason, civil rights movement picks some attributes (namely, race, sex, and sexual preference) as sacred but maintain it\u0027s okay to discriminate by other attributes. Why there is no affirmative action for intraverts? Why there are no affirmative action for sexually unattractive people? In a sense, a ban on interracial marriage was affirmative action for black women to get a black husband. It\u0027s not black women\u0027s fault that they are not attractive. They are just lucky enough that they aren\u0027t white males -- in that cases, civil rights advocates would blame them for what they are.\u003c/p\u003e\u003cp\u003eLifting ban on interracial ban has benefited very few people, and has made worse for much more. Black children don\u0027t get their fathers, too, which probably adds to crime rate. But social justice warriors don\u0027t need to think -- they only need to repeat anything that they have been told as \u0026quot;good\u0026quot;.\u003c/p\u003e\u003c/div\u003e","tags":[]}}