{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1413573388,"rating":8,"authorHandle":"Slamur","modificationTimeSeconds":1415524832,"id":14318,"title":"\u003cp\u003eОлимпиадное программирование: немного обо всем\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЯ хотел бы немного рассказать о том, чем занимался несколько последних лет, и чем мы предлагаем заняться вам)\u003c/p\u003e\u003cp\u003eОлимпиадное программирование — дисциплина, в которой программисты соревнуются в умении придумать оптимальный алгоритм и реализовать его. Для выяснения, кто же лучший, на соревновании даются несколько задач, для которых участники должны написать программу. Для каждой задачи тестирующая система запускает решение участника на специально подготовленном наборе тестов. Программа должна читать входные данные и выдавать результат в формате, указанном в условии. Также в условии даются ограничения по времени и по памяти для программы на 1 тест. \u003c/p\u003e\u003cp\u003eНа решение всех задач обычно дается некоторый ограниченный промежуток времени и один компьютер с установленными средами разработки. Также запрещается использовать какие-то дополнительные библиотеки, поэтому приходится думать самому) Так как компьютер один, а задач много, то многие олимпиады по программированию являются командными; стандартный размер команды — 3 человека (а компьютер все равно один). \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eОтличительной особенностью задач на олимпиадах по программированию является их идейная и алгоритмическая составляющая — от участника не требуют сложного интерфейса программы, от него требуется выдать результат за короткое время и ограниченную память, что иногда является нетривиальной задачей. Решение таких задач развивает математический аппарат, знание и понимание алгоритмов и улучшает навык программирования в целом. Хороший пост, повествующий о плюсах олимпиадного программирования: \u003ca href\u003d\"http://codeforces.ru/blog/entry/1851\"\u003ehttp://codeforces.ru/blog/entry/1851\u003c/a\u003e (советую прочесть перед прочтением следующей части статьи). \u003c/p\u003e\u003cp\u003eСамым, пожалуй, известным соревнованием по олимпиадному программированию является ACM ICPC — международная студенческая командная олимпиада по программированию под эгидой ассоциации вычислительной техники ACM и IBM. Этот чемпионат, судя по википедии, современный облик обрел в 1977, хотя до 1990-х там участвовали преимущественно вузы США и Канады. Стандартный формат ACM-соревнований (а применяется он в большинстве командных, а также некоторых личных соревнований) — 5 часов, 8-13 задач, 3 человека в команде. Команды в итоговой таблице сортируются\u003c/p\u003e \u003col\u003e   \u003cli\u003eПо количеству сданных задач\u003c/li\u003e   \u003cli\u003eПри равенстве сданных задач сортируются по суммарному штрафному времени. Штрафное время начисляется за каждую СДАННУЮ задачу, вычисляется как количество минут с начала контеста (то есть максимум 300) + 20 штрафных минут за каждую неудачную посылку до сдачи. В таблице соревнования посылки по задаче отображаются в формате \u0026lt;+/-\u0026gt;, говорящие о сдаче/несдаче задачи, и числа, обозначающего количество неудачных посылок до сдачи (0 посылок никак не обозначаются). Например, если команда на 130 минуте сдала задачу с результатом +5 означает, то команда сдала задачу, сделав до сдачи 5 неудачных попыток. В итоге они получили 130 + 5 * 20 \u003d\u003d 230 штрафных минут.\u003c/li\u003e   \u003cli\u003eПри равенстве и количества задач, и штрафного времени, выше находится команда, раньше отправившая последнюю сданную задачу (ну такое вообще редко бывает, чтобы по этому пункту смотрели).\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eВ ACM ICPC участвуют команды от разных вузов, причем команда не может состоять из студентов различных вузов. Каждый год проводятся субрегиональные соревнования (четвертьфиналы), из которых часть команд проходит в региональные соревнования (полуфиналы), по результатам которых отбираются финалисты чемпионата мира. От каждого вуза на финал чемпионата мира имеет право поехать не более одной команды, поэтому среди команд топовых вузов часто разгораются нешуточные \u0026quot;сражения\u0026quot; за выход в финал. По результатам финала награждаются (на данный момент) 12 команд — 4 золотых, 4 серебряных и 4 бронзовых медали (иногда бывают исключения с увеличением призовых мест). Призовое место (да и выход в финал) считается очень почетным для вуза, поэтому каждый год в ACM ICPC участвуют команды от множества вузов со всего мира. Важное уточнение — в настоящее время языками ACM ICPC являются C/C++ и Java.\u003c/p\u003e\u003cp\u003eСГАУ участвует в ACM ICPC с конца 1990-х годов. Наш вуз принадлежит к южному субрегиону, четвертьфинал проходит на базе Саратовского ГУ, и северо-восточному региону, полуфинал проходит на базе Санкт-Петербургского университета информационных технологий, механики и оптики (который становился победителем ACM ICPC уже 5 раз подряд — абсолютный рекорд среди вузов). В финале команды нашего вуза участвовали 2 раза:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eв сезоне 2009-2010 в Харбине команда в составе Константина Дроздова \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/I_love_natalia\" title\u003d\"Master I_love_natalia\"\u003eI_love_natalia\u003c/a\u003e, Семушина Павла \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/craus\" title\u003d\"Candidate Master craus\"\u003ecraus\u003c/a\u003e и Егорова Егора \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/Jeg\" title\u003d\"Specialist Jeg\"\u003eJeg\u003c/a\u003e, заняв 14 место с 5 задачами (команды с 6 задачами уже попадали в медали);\u003c/li\u003e   \u003cli\u003eв сезоне 2012-2013 в Санкт-Петербурге команда \u0026quot;Teddy Bears\u0026quot; в составе Семушина Павла \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/craus\" title\u003d\"Candidate Master craus\"\u003ecraus\u003c/a\u003e, Глащенко Никиты \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Hohol\" title\u003d\"Candidate Master Hohol\"\u003eHohol\u003c/a\u003e и Дергунова Алексея \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/dalex\" title\u003d\"Candidate Master dalex\"\u003edalex\u003c/a\u003e, заняв 27 место с 5 задачами (команды с 7+ задачами, а также 4 команды с 6 задачами и маленьким штрафным временем стали медалистами). Замечу, что на данном финале было выдано целых 13 комплектов медалей по причине малой разницы между 12 и 13 местами (877 и 882 штрафных минуты соответственно).\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eХотелось бы отдельно отметить вклад Пшеничникова Виктора Владимировича, доцента кафедры геоинформатики, являвшегося единственным тренером и наставником команд СГАУ много лет и посещавшим с ними все этапы чемпионата мира. Также Виктор Владимирович вел продолжительное время кружки по программированию в СМАЛе и СамЛИТе; многие оранжевые и красные самарские олимпиадники уверены, что именно его кружок стал отправной точкой в их карьере спортивного программиста.\u003c/p\u003e\u003cp\u003eНо, кроме командных, постоянно проводится множество личных соревнований. Самые известные периодические соревнования — на сайтах Topcoder и Codeforces. Формат их схожий, но имеются некоторые различия:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eСоревнование на Topcoder носит название SRM (Single Round Match), длится обычно 1:15 — 1:30. За это время участнику предлагается решить 3 задачи различной степени сложности с различной, убывающей после открытия задачи стоимостью (обычно это 250, 500 и 1000 баллов). В процессе соревнования решение не тестируется вообще ни на каких тестах (но вы можете проверить на нескольких тестах из условия). После фазы \u0026quot;кодинга\u0026quot; и 5-минутной передышки следует 10-минутная фаза \u0026quot;взломов\u0026quot;: все участники поделены на комнаты по 15-20 участников, в пределах комнаты можно посмотреть решение любого другого участника. В случае, если вы считаете, что решение участника не проходит определенный тест (выдает неправильный ответ или не влезает в ограничения по времени/памяти), то можете отправить данный тест в систему. Если решение участника и правда не выдаст корректный ответ, войдя в ограничения, то вы получите +50 баллов, а участник теряет все баллы за эту задачу. За неудачный взлом вы получаете -25 баллов. После фазы взлома проходит тестирование всех невзломанных решений на всех тестах по всем задачам. По итогам результатов раунда у каждого участника изменяется рейтинг — величина, показывающая успешность его выступления в данного рода соревнованиях.\u003c/li\u003e   \u003cli\u003eНа Codeforces соревнование называется \u0026quot;Codeforces Round\u0026quot;, длится обычно 2 часа, участнику дается для решения 5 задач. Разбаллов здесь также есть, обычно это 500 — 1000 — 1500 — 2000 — 2500. В процессе соревнования решение тестируется лишь на ограниченном наборе тестов (называемых претестами). Взломы здесь также присутствуют, но вы можете взламывать людей в своей комнате в течение всего контеста. Для этого необходимо сдать решение по данной задаче, которое проходит претесты, и заблокировать его. После блокирования задачи вы не сможете переотправлять решение по данной задаче, но зато получите возможность просматривать решения других участников в своей комнате и ломать их. За успешный взлом участник получает +100 баллов, за неудачный -50.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eВажной особенностью и SRM, и CR является штраф за переотправку верного решения, в отличие от формата ACM (в нем после успешной сдачи за все последующие попытки по данной задаче штраф не начисляется). Это обусловлено тестированием решений не на всех тестах в процессе соревнования, что оставляет пространство для взломов.\u003c/p\u003e\u003cp\u003eХотелось бы немного рассказать о рейтинге. Рейтинг на Topcoder и Codeforces считается аналогично ЭЛО-системе (влияет место, которое вы заняли и место, которые вы должны были занять, исходя из вашего рейтинга перед контестом). Градация цветов на двух сайтах похожа (написано по возрастанию рейтинга):\u003c/p\u003e \u003cul\u003e   \u003cli\u003eTopcoder : Серый, Зеленый, Синий, Желтый, Красный.\u003c/li\u003e   \u003cli\u003eCodeforces : Серый, Зеленый, Синий, Фиолетовый, Оранжевый, Красный.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eТакже особенностью данных сайтов является деление всех участников на 2 дивизиона. В дивизион 1 входят красные, желтые, фиолетовые на Codeforces и синие на Topcoder. Дивизион 2 считается дивизионом для начинающих, для него даются отдельные от 1 дивизиона более простые задачи (или задачи 1 дивизиона, но имеющие выше стоимость).\u003c/p\u003e\u003cp\u003eДля программистов, захотевших порешать задачи вне соревнований, существует множество сайтов — архивов задач. Одним из самых известных в русскоязычном сообществе является acm.timus.ru — сайт Уральского федерального университета, содержащий порядка 1000 задач на данный момент. Также архивы задач с прошедших контестов есть на Topcoder и на Codeforces.\u003c/p\u003e\u003cp\u003eТакже хотел бы отметить, что приятным дополнением к участию во многих олимпиадах по спортивному программированию являются футболки, вручаемые за участие или за попадание в определенное число лучших участников. ^_^\u003c/p\u003e\u003cp\u003eВ конце я бы хотел привести небольшой глоссарий спортивного программиста:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eКонтест — соревнование по программированию;\u003c/li\u003e   \u003cli\u003eМонитор — таблица результатов контеста;\u003c/li\u003e   \u003cli\u003eСемплы — тесты из условия, обычно они совпадают с первыми тестами при тестировании решения;\u003c/li\u003e   \u003cli\u003eTL и ML — Time Limit и Memory Limit, ограничения по времени (обычно 1-2 секунды) и по памяти (обычно 64 — 256 МБ), накладываемые на решение на 1 тест.\u003c/li\u003e   \u003cli\u003eOnline judge, OJ — архив задач с встроенной тестирующей системой;\u003c/li\u003e   \u003cli\u003eTC и CF — сокращенное название Topcoder и Codeforces;\u003c/li\u003e   \u003cli\u003eТаргет — выделенная группа участников TC с красным рейтингом, имеющая особо высокий рейтинг (обозначаются мишенью, откуда и исходит название);\u003c/li\u003e   \u003cli\u003eОнсайт — этап соревнования, когда участники приезжают и пишут контест из одного места;\u003c/li\u003e   \u003cli\u003eМайк — Михаил Мирзаянов, основатель Codeforces;\u003c/li\u003e   \u003cli\u003eПетр и Гена — Петр Митричев \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Legendary grandmaster Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e и Геннадий Короткевич \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e, два спортивных программиста, про которых слагают легенды;\u003c/li\u003e   \u003cli\u003eСнарк — большой человек с большой бородой, ведет сайт snarknews.info, на котором выкладывается много различной информации по различным событиям в среде олимпиадного программирования;\u003c/li\u003e   \u003cli\u003eПТЗ — Сборы на базу Петрозаводского ГУ, проводящиеся 2 раза в год (август и январь) в целях подготовки к финалу ACM ICPC; отличаются высокой сложностью задач и участием ограниченного количества топовых (в основном) команд;\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":[]}}