{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1406400316,"rating":26,"authorHandle":"RodionGork","modificationTimeSeconds":1406400339,"id":13203,"title":"\u003cp\u003eЭпицентр Взрыва\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЕсть такая задача: На полигоне происходит взрыв, который регистрируется сейсмодатчиками в нескольких точках — требуется определить время и координаты взрыва.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eДано:\u003c/strong\u003e \u003ccode\u003eXi\u003c/code\u003e, \u003ccode\u003eYi\u003c/code\u003e, \u003ccode\u003eTi\u003c/code\u003e — координаты и время регистрации взрыва каждым из датчиков (\u003ccode\u003ei \u003d 1..4\u003c/code\u003e больше всё равно не нужно, вроде).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eНайти:\u003c/strong\u003e \u003ccode\u003eX0\u003c/code\u003e, \u003ccode\u003eY0\u003c/code\u003e, \u003ccode\u003eT0\u003c/code\u003e — координаты и время самого взрыва.\u003c/p\u003e\u003cp\u003eПредполагаем что полигон плоский и скорость распространения волны постоянна и одинакова во всех направлениях (но неизвестна).\u003c/p\u003e \u003chr /\u003e\u003cp\u003eВопрос собственно не в том как решить задачу. Подбором например несложно порешать включив немного аналитики и геометрии, итерациями...\u003c/p\u003e\u003cp\u003eА вот как её решить изящно / красиво / аккуратно?\u003c/p\u003e\u003cp\u003eВ 2009-м кажется году я её и решил, и сдал заказчику и контора вроде даже какие-то денежки получила. Но я совершенно не помню решения, а найти пояснительную записку которую тогда составлял не могу (да и я с тех пор пяток контор уж сменил).\u003c/p\u003e\u003cp\u003eМне упорно кажется что у меня чуть ли не к линейной системе свелось всё и оказалось можно скорость исключить. Но когда я беру в руки карандаш и бумагу — мне перестаёт казаться что это возможно.\u003c/p\u003e\u003cp\u003eСами мы не местные! Помогите старому склерознику! А то коллеги кому я эту задачку задал интересуются — а я запоздало обнаружил что сам не помню как решал :)\u003c/p\u003e\u003c/div\u003e","tags":["геометрия"]}}