{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399077526,"rating":-8,"authorHandle":"revenge5","modificationTimeSeconds":1399077526,"id":12090,"title":"\u003cp\u003ethe league will be announced\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eemerge.According to previous reports, before the league will investigate the exposure of two recording is real, the sound of which is whether the Clippers owner Sterling himself. Also, according to reports, there are more Stirling discriminatory speech recordings have not been disclosed. All details about the incident, the league will be announced tomorrow.Sterling could face penaltiesStirling Racial remarks upon exposure, it triggered the NBA players, coaches, the other team owners and league officials from anger, and even U.S. President Barack Obama denounced his ignorance. Player representative, James called for the strike, Bryant said would never play for the Sterling, said he does not deserve to have t\u003ca href\u003d\"http://www.maxsalesupras.com/nike-air-max-tn-c-39.html\"\u003enike air max tn 2013\u003c/a\u003e  he Clippers. And numerous NBA team owners, are trying to stand up firmly supports Silverstone Stirling any punishment.In fact, Stirling in the end will face the punishment, this conference is also the most concern. According to media speculation, Stirling suffered heavy fines and prohibit spectators to the arena, these penalties can not fly away. However, given the current public attitudes, NBA is also possible to make a more severe punishment, it is forced to leave Stirling NBA.However, according to existing rules league, NBA League boss has no right to force the sale of Stirling Clippers. But Rockets owner Leslie Alexander provides a new punishment scheme that allows players to become free agents Clippers, eventually forcing Stirling away from NBA. \u0026quot;We have to stop him to continue in charge of the Clippers, to ensure that such \u003c/p\u003e\u003cp\u003eincidents do not happen again.\u0026quot; Alexander said, \u0026quot;I suggest that all Silverstone Clippers players have become a free agent, so there is no players and coaches are willing to Manchester forest work. \u0026quot;For this proposal, Silverstone said he would consider it. That is, if the league really announce a punishment for a scheme to force Clippers owner to get out, that this will be the Stirling want to see.Sterling Event ReviewRacial remarks Stirling incident broke out on the 26th local time, when the gossip website \u0026quot;TMZ\u0026quot; exposed him\u003ca href\u003d\"http://www.maxsalesupras.com/nike-air-max-97-c-29.html\"\u003enike air max 97 hyperfuse\u003c/a\u003e  and his girlfriend arguing recordings. In the quarrel, Stirling uses speech discrimination against blacks, blacks allowed to warn his girlfriend to his own site watching, including \u0026quot;Magic\u0026quot; Johnson is not OK. After the \u0026quot;TMZ\u0026quot; once again exposed a recording, Stirling said it was the blacks themselves to food, clothes, cars and houses. According to reports, there are about one hundred hours of recordings yet Stirling exposure.Stirling\u0027s remarks after being exposed, he instantly became a target. Denounce him in the league, the Clippers players choose a strong protest, many sponsors canceled the sponsorship of the Los Angeles Clippers. Even Stirling\u0027s son and daughter, have publicly condemned him. Today, Sterling will face fines from the NBA Hall of Fame coach Ramsey died at age 89, the marshal is the iconic figure in the history of the Trail Blazers, he coached the team for the first year will be led by the never belly into the playoffs, becoming the dream of the division championship. Ramsay to create a team-oriented pioneers, will release a\u003c/p\u003e\u003cp\u003ecollection of the greatest players the ability to writing a fairytale 1976-77 season, the legendary center Wharton promotions in the peak year for God.They can make the playoffs on the goodBlazers in 1970 joined NBA, six years before the 1976-77 season, the team never winning more than 50% on average six seasons to win 28 games. They lost guard Jeff in 1976 — Petrie, he retired because of a leg injury had to make a decision, striker Sidney — Wicks switch to Celtic, these two players are the pioneers of 1975-76 season II and One\u003ca href\u003d\"http://www.maxsalesupras.com/nike-air-max-90-hyperfuse-c-1.html\"\u003enike air max 90 hyperfuse sale\u003c/a\u003e  scorer. Blazers had workouts Moses — Malone, but did not leave him. Blazers even more disturbing is that they can get in a 1974 draft pick Wharton seemed so fragile, the college basketball after UCLA swept the major center in the NBA time to recuperate, creating a curse Blazers center, Former NBA career two seasons because of a foot injury played a total of 86 games.When the arrival of the 1976-77 season, the Portland Trail Blazers of the media is not optimistic about the prospects when it comes to this team is usually \u0026quot;hit .500 even if successful\u0026quot; or \u0026quot;make the playoffs is quite good.\u0026quot; sort of argument. As for the championship, would have been unthinkable loss of two firing points, the center is regarded as the savior of the most prominent manifestation is sick, you want to win Stop dreaming!Ramsay\u0027s magic wandRamsay coached the 1976-77 season was the first year the Blazers, he clearly recognizes the problem with this team, even if Wharton stay healthy, their athleticism is quite mediocre, you want to create success is only one wa\u003c/p\u003e\u003c/div\u003e","tags":[]}}