{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1418641021,"rating":-72,"authorHandle":"Konstantin.Zakharov","modificationTimeSeconds":1418641951,"id":15171,"title":"\u003cp\u003eНенавижу понедельники...\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЗдравствуй, codeforces! Вроде бы ничем не примечательный день обернулся чередой тяжелейших утрат и удивительнейших находок.\u003c/p\u003e\u003cp\u003eВо-первых, сегодня в 7 утра вместе с мои двадцатым годом (с днем меня!!) ушел из жизни таракан Квазимодо. Его светлой памяти я посвящаю все оставленные мной за последние несколько дней комментарии, принесшие в сумме где-то -100 вклада. Именно он еще вчера рассказывал мне со стены, в чем не правы все пользователи и как свергнуть мировое правительство. Вместе с ним уходит целая философия...\u003cbr /\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/92/52/925259d16fd0dee24ecd6292a067da9acbf8d127.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e\u003cp\u003eВо-вторых, мою общажную комнату решила покинуть так полюбившаяся всем крыса Василиса\u003cbr /\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/74/96/749653264ebe7e67eff41b21b39a2739f583957e.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/7d/5c/7d5cfc1fc4f48e441eeaeaf9d2995ceb4080ccd0.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003eСколько я ни пытался уговорить ее остаться, она продолжала молча уходить от разговора\u003cbr /\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/2e/72/2e72d4858a71f38c4cbdea987d08e24422ef4f3d.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/62/59/62592ca6f4fdc1d02c5d692c0365369adfbb2635.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003eА потом просто протиснулась в другую комнату, и скорее всего\u003cbr /\u003eбольше мы не увидимся, как это было с мышонком Аркадием...\u003cbr /\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/f4/72/f472f9cd287cebc74ac4a5e9bece5807cc77e7bc.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cpre\u003e\u003ccode\u003eГлава 2  \n\u003c/code\u003e\u003c/pre\u003e \u003cpre\u003e\u003ccode\u003e...\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003e\u003cem\u003eМеня предали те, на кого, я думал, могу положиться. Мою веру в дружбу втоптали в грязь. Меня обрекли на празднование дня рождения в одного. Но моя темная сторона рано праздновала победу, я понимаю, что они были всего лишь тараканом и крысой, а им не свойственно отвечать за свое завтра, или за то, что они делают сегодня...\u003c/em\u003e\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e...\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eЯ снова вышел из комнаты, теперь уже навстречу новому дню, но т.к. на этот раз шел неспешно — заметил ранее упущенную картину. На полу валялись клочки волос, состриженные явно в спешке. Просыпающийся мозг напомнил, что вчера вечером здесь бегали наши этажные бывшие студенты и вроде как при них были ножницы. \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/1b/6e/1b6e7c1275809c48f8fe7b1b1a023db421d76294.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u0026quot;Это всего лишь безобидная шутка\u0026quot; — успокоил я себя.\u003cbr /\u003e\u0026quot;Хорошая попытка\u0026quot; — ответил разум. \u003c/p\u003e\u003cp\u003eНо я вспомнил про купленную вчера еду, эта мысль заставит встрепенуться любого загрустившего студента. Варка вареников не заняла много времени. \u003c/p\u003e\u003cp\u003eСел к экрану с тарелкой, врубил скоростной модем.\u003cbr /\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/4a/aa/4aaa2ca469376f0df4215f0a5642ed9229fec8e3.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eПервые три проглотил не жуя, но то ли увидев -50 у своего комментария, то ли заметив странный вкус — заподозрил неладное.\u003cbr /\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/6d/c1/6dc1a14c765510da0f12c7a5260fec94720ff8e2.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003eВидимо, я прозевал надпись \u0026quot;Только сегодня, вареники с картошкой, землей и камушками (0.5%) + бонус, в каждом вы найдете остатки луковой кожуры\u0026quot;. Есть известная история, как один мужик из Муромской области после такого завтрака решил призваться в армию, хотя ему было уже за 30. Но я все же предпочел просто спуститься в магазин и предъявить бракованный продукт. Мне сказали \u0026quot;спасибо, учтем, можете идти доедать\u0026quot;. \u003c/p\u003e\u003cp\u003eЗатравочка у 21 года выдалась что надо! А когда уже не знаешь, что и думать, добрые люди всегда подскажут\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/72/81/7281d366bd5a60d1ff7744501e57f1e661f9bfe5.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cpre\u003e\u003ccode\u003eГлава 3 \n\u003c/code\u003e\u003c/pre\u003e \u003cpre\u003e\u003ccode\u003e...\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003e\u003cem\u003eЕсли я пойду и долиною смертной тени, не убоюсь зла. Это просто здорово звучит.\u003c/em\u003e\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e...\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eК счастью, те мои 20 лет были очень поучительны, они ушли не впустую. Само число 20 мало отличается, от, например, 19.836, но, даже не будучи приспешником фатальных дат и цифр, задумываться о прошедшем почему-то всегда начинаешь как раз на круглых датах. Подводить итоги сложно, но если все же пытаться — мне правда интересно, что будет дальше, и, как всегда, немного тревожно) То, что раньше мне для понимания приходилось разделять — сейчас частенько умещается в одну строку) Что же там впереди — кто его разберет?)\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/b6/a5/b6a5c5c78f666b15f5b64104af7572d6d43568c8.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/Mahno\" title\u003d\"Specialist Mahno\"\u003eMahno\u003c/a\u003e принес в честь праздника студенческий торт! Спасибо, чувак! Я буду есть, пока не возненавижу себя! :D\u003c/p\u003e\u003c/div\u003e","tags":["таракан квазимодо","крыса василиса","экзистенциализм","сессия","зачеты","экзамены"]}}