{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1478706441,"rating":14,"authorHandle":"gKseni","modificationTimeSeconds":1478710970,"id":48300,"title":"\u003cp\u003eОпределены победители XVII Открытой Всесибирской олимпиады по программированию им. И.В. Поттосина\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/ff/40/ff403694f403f8afd3b892e1a74e9149bfa6edc4.png\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e Соревнования \u003ca href\u003d\"https://olympic.nsu.ru/widesiberia/2016/news\"\u003eXVII Открытой Всесибирской олимпиады по программированию им. И.В. Поттосина\u003c/a\u003e делятся на два тура — заочный (отборочный) по правилам АСМ-ICPC, а также очный, состоящий из двух номинаций, в котором команды непосредственно решают задачи на одной площадке. Как подчеркивают организаторы, Всесибирская олимпиада является одной из важных ступеней подготовки к чемпионату ACM ICPC.\u003c/p\u003e\u003cp\u003eПо \u003ca href\u003d\"https://olympic.nsu.ru/files/internet2016.pdf\"\u003eрезультатам заочного тура\u003c/a\u003e, условия задач которого \u003ca href\u003d\"https://olympic.nsu.ru/files/problems_3.pdf\"\u003eдоступны сейчас\u003c/a\u003e, были \u003ca href\u003d\"https://olympic.nsu.ru/files/invited_teams_2016.pdf\"\u003eопределены участники очного тура\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eВ первой номинации очного тура участникам нужно было реализовать игровую стратегию на языке программирования Lua (версия 5.1). Игра о роботах-пылесосах, очищающих свою планету от мусо... хм, других роботов планеты. А потом от других роботов-пылесосов! Читайте \u003ca href\u003d\"https://olympic.nsu.ru/files/statement-main.pdf\"\u003eподробное условие\u003c/a\u003e, \u003ca href\u003d\"https://yadi.sk/d/S54X2lHsxzz5C\"\u003eматериалы игры\u003c/a\u003e и \u003ca href\u003d\"https://olympic.nsu.ru/files/results_1_0.pdf\"\u003eрезультаты финального тестирования\u003c/a\u003e. Вкратце — по полю ездят кружки, и если площадь одного кружка больше другого, то при соприкосновении он его «съедает». Стратегии соревнующихся управляли маневрированием кружков. \u003c/p\u003e\u003cp\u003e«Эта олимпиада сильно выделяется по сравнению с остальными за счет первого тура — турнира стратегий. Результат выступления здесь слишком сильно зависит от удачи. Ведь в обычных олимпиадах есть некоторое количество задач, и каждую ты либо решил, либо не решил. А тут не существует правильного решения, нужно примерно оценивать, какая стратегия лучше, что нужно делать в каждой ситуации», — \u003ca href\u003d\"http://news.ifmo.ru/ru/university_live/achievements/news/6185/\"\u003eделится своими впечатлениями\u003c/a\u003e Николай Будин.\u003c/p\u003e\u003cp\u003eВторая номинация проводилась по правилам АСМ ICPC. Участникам нужно было \u003ca href\u003d\"https://olympic.nsu.ru/files/problems_4.pdf\"\u003eрешить 11 задач\u003c/a\u003e — и \u003ca href\u003d\"https://olympic.nsu.ru/files/results_2_0.pdf\"\u003eвот как справились с ними команды\u003c/a\u003e. Тройка победителей: \u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eSPb ITMO University 2(СПбГУ ИТМО, Санкт-Петербург) — Николай \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/BudAlNik\" title\u003d\"Гроссмейстер BudAlNik\"\u003eBudAlNik\u003c/a\u003e Будин, Михаил \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/SpyCheese\" title\u003d\"Гроссмейстер SpyCheese\"\u003eSpyCheese\u003c/a\u003e Путилин, Дмитрий \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/YakutovDmitriy\" title\u003d\"Мастер YakutovDmitriy\"\u003eYakutovDmitriy\u003c/a\u003e Якутов;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eMoscow IPT Jinotega (МФТИ, Москва) — Артем \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Arterm\" title\u003d\"Гроссмейстер Arterm\"\u003eArterm\u003c/a\u003e Жук, Константин \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/zemen\" title\u003d\"Международный гроссмейстер zemen\"\u003ezemen\u003c/a\u003e Семенов, Иван \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ifsmirnov\" title\u003d\"Международный гроссмейстер ifsmirnov\"\u003eifsmirnov\u003c/a\u003e Смирнов;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eSPb AU: Bandity (СПбАУ, Санкт-Петербург) — Всеволод \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Tehnar\" title\u003d\"Международный мастер Tehnar\"\u003eTehnar\u003c/a\u003e Степанов, Михаил \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/MZuev\" title\u003d\"Кандидат в мастера MZuev\"\u003eMZuev\u003c/a\u003e Зуев, Николай \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/ZhNV\" title\u003d\"Международный мастер ZhNV\"\u003eZhNV\u003c/a\u003e Жидков.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eКомпания Гузик учредила специальный приз команде, первой решившей самую сложную задачу во второй номинации. Приз вручен команде HSE such fabulous (НИУ ВШЭ, Москва) — Алексей \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Um_nik\" title\u003d\"Легендарный гроссмейстер Um_nik\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eU\u003c/span\u003em_nik\u003c/a\u003e Данилюк, Полина \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/WYOCMWYH\" title\u003d\"Кандидат в мастера WYOCMWYH\"\u003eWYOCMWYH\u003c/a\u003e Святокум, Антон \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/urusant\" title\u003d\"Кандидат в мастера urusant\"\u003eurusant\u003c/a\u003e Урусов.\u003c/p\u003e\u003cp\u003eCтуденты, вернувшиеся с олимпиады, отмечают, что многие из тех, кто хорошо проявил себя в первой номинации, с трудом справились с задачами во второй, и наоборот. \u003c/p\u003e\u003cp\u003e«В очном туре олимпиады собираются сильнейшие команды России и стран Ближнего зарубежья, из них 50% — команды Сибири и Дальнего Востока. Олимпиада — это профессиональный рост студентов, их самостоятельная работа, достижения, которые они могут включить в свое резюме при приеме на работу», — \u003ca href\u003d\"http://news.ifmo.ru/ru/university_live/achievements/news/6185/\"\u003eотмечают\u003c/a\u003e организаторы.\u003c/p\u003e\u003cp\u003eНовосибирский государственный университет совместно с компаниями-спонсорами XVII Открытой Всесибирской олимпиады по программированию им. И.В. Поттосина установил стипендии командам-победителям:\u003c/p\u003e\u003cp\u003eI место — 90 000 руб. (3 студента по 30 000 руб);\u003c/p\u003e\u003cp\u003eII место — 60 000 руб. (3 студента по 20 000 руб);\u003c/p\u003e\u003cp\u003eIII место — 30 000 руб. (3 студента по 10 000 руб).\u003c/p\u003e\u003cp\u003eПоздравляем победителей и участников с успешным выступлением на олимпиаде!\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news"]}}