{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1475261992,"rating":6,"authorHandle":"BigBag","modificationTimeSeconds":1475263733,"id":47447,"title":"\u003cp\u003eПоехали!\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eИтак, мы хотим немного подготовиться к полуфиналу ACM ICPC. Т.к. осталось около двух недель, то, я предлагаю следующий план тренировок. Я последовательно прохожусь по своему списку тем и пишу разбор на каждую тему, где у кого-нибудь из вас оценка \u003cspan class\u003d\"tex-span\"\u003e ≤ \u003c/span\u003e 3. Ко всем темам, где ваша оценка \u003cspan class\u003d\"tex-span\"\u003e ≤ \u003c/span\u003e 4 в соревнования добавляю задачи для тренировок.\u003c/p\u003e\u003cp\u003eТеперь, чуть более подробно про решение задач. Вначале нужно задать вопросы по обзору темы, и только потом приступать к решению задач. Задачи я буду стараться подбирать так, чтобы были и те, в которых нужно просто в лоб применить описанный алгоритм, так и те, в которых нужно еще немножко подумать. Процесс решения : вначале вы сами думаете над задачей, и если не получается, я даю маленькую подсказку. Если и после этого не получается решить, я пишу подробный разбор. Еще один важный момент \u003cspan class\u003d\"tex-span\"\u003e  — \u003c/span\u003e это то, что задачу нужно решить именно новым алгоритмом, даже при наличии другого решения.\u003c/p\u003e\u003cp\u003eЦель этих тренировок \u003cspan class\u003d\"tex-span\"\u003e  — \u003c/span\u003e ознакомиться с большим кол-вом алгоритмов, чтобы можно было быстро генерировать идеи. Так как времени осталось мало, я не ставлю цель научиться быстро писать каждый алгоритм, куда более важно четко понимать его идейно, и знать, в каких случаях его нужно использовать.\u003c/p\u003e\u003cp\u003eЕще один нюанс по поводу структуры кода. Понятно, что у каждого из нас свой стиль, но т.к. мы выступаем командой, то было бы неплохо придерживаться более-менее одного стиля. В частности, я предлагаю : \u003c/p\u003e \u003col\u003e   \u003cli\u003eОбъявлять константы \u003ccode\u003emax_n\u003c/code\u003e, \u003ccode\u003emax_m\u003c/code\u003e, \u003cspan class\u003d\"tex-span\"\u003e...\u003c/span\u003e. Не должно быть массивов вида \u003ccode\u003ea[111111]\u003c/code\u003e. Так же все эти константы стоит объявлять с небольшим запасом, чтобы не было лишних RE.\u003c/li\u003e   \u003cli\u003eВсегда использовать \u003ccode\u003e{}\u003c/code\u003e, даже если в \u003ccode\u003eif\u003c/code\u003e-е или \u003ccode\u003efor\u003c/code\u003e-e только одно действие. Это нужно для того, чтобы в случае необходимости можно было легко и удобно дописать что-то в этот блок, и плюс это улучшает читаемость кода.\u003c/li\u003e   \u003cli\u003eЖелательно научится всегда использовать \u003ccode\u003escanf\u003c/code\u003e/\u003ccode\u003eprintf\u003c/code\u003e вместо \u003ccode\u003ecin\u003c/code\u003e, \u003ccode\u003ecout\u003c/code\u003e. Из-за медленного ввода/вывода довольно часто набираются штрафные очки.\u003c/li\u003e \u003c/ol\u003e\u003c/div\u003e","tags":[]}}