{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1421255808,"rating":46,"authorHandle":"slycelote","modificationTimeSeconds":1428852577,"id":15801,"title":"\u003cp\u003ecaide is like chelper but for C++, C#, Visual Studio, Codelite and other IDEs/languages\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003etl;dr:\u003c/strong\u003e Install \u003ca href\u003d\"https://visualstudiogallery.msdn.microsoft.com/4fa8cbb8-abb3-4bc6-97c8-6dd25a3a3c74?SRC\u003dHome\"\u003eVsCaide\u003c/a\u003e extension in extensions manager of Visual Studio 2013.\u003c/p\u003e\u003cp\u003e(NOTE: it\u0027s recommended to create caide project from scratch after update: use \u003ccode\u003ecaide init\u003c/code\u003e from command line or \u0026quot;Create caide solution\u0026quot; button in Visual Studio.)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ev1.2.1:\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e   \u003cli\u003eFix Codeforces contest parser, GCJ, HackerRank\u003c/li\u003e   \u003cli\u003eSupport RCC contests, POJ\u003c/li\u003e   \u003cli\u003eC++ inliner: don\u0027t remove used typedefs defined at class scope.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cstrong\u003ev1.2:\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e   \u003cli\u003eFix Codeforces parser in russian interface\u003c/li\u003e   \u003cli\u003eC++: Remove inactive preprocessor blocks, unused macros, unused typedefs\u003c/li\u003e   \u003cli\u003eC# support in VS plugin\u003c/li\u003e   \u003cli\u003eCompatibility with CHelper extension (command line only)\u003c/li\u003e   \u003cli\u003eSupport Google Code Jam, Russian Code Cup, HackerRank\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eCurrently supported online judges: Codeforces, GCJ, CodeChef, Timus, HackerRank, POJ, RCC. (Topcoder is planned.) Currently supported IDEs: Visual Studio 2013, CodeLite. Currently supported programming languages: C++, C#.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://github.com/slycelote/caide\"\u003ecaide\u003c/a\u003e automates certain common tasks that you do during programming competitions: parsing, running and debugging problem tests, inlining library code.\u003c/p\u003e\u003cp\u003ecaide is inspired by such projects as chelper or jhelper. Its purpose is to automate the following tasks:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eParsing problem statement and extracting test cases\u003c/li\u003e   \u003cli\u003eGenerating solution scaffold\u003c/li\u003e   \u003cli\u003eInlining library code and preparing a single source file for submission\u003c/li\u003e   \u003cli\u003eRunning the tests on your solution\u003c/li\u003e   \u003cli\u003eDebugging the tests\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eUnlike other projects, caide is designed to support multiple programming languages and IDEs/editors.\u003c/p\u003e\u003cp\u003ecaide is split into the following projects:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003ca href\u003d\"https://github.com/slycelote/caide/blob/master/libcaide/README.md\"\u003elibcaide\u003c/a\u003e is core command line application implementing all functionality. Windows and Linux are supported. Theoretically, it should also build on OS X, but I don\u0027t have access to a Mac.\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"https://github.com/slycelote/caide/blob/master/vscaide/README.md\"\u003eVsCaide\u003c/a\u003e is caide frontend (extension) for Visual Studio; currently supports only C++ programming language.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eDocumentation, issue tracker and code: \u003ca href\u003d\"https://github.com/slycelote/caide\"\u003ehttps://github.com/slycelote/caide\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["caide","tool","c++","visual studio","codelite","c#"]}}