{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1432289571,"rating":182,"authorHandle":"MikhailRubinchik.ru","modificationTimeSeconds":1432382158,"id":18026,"title":"\u003cp\u003eО случайностях на контестах\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет! \u003c/p\u003e\u003cp\u003eСегодня я буду писать о такой вещи, о которой раньше не встречал открытых постов. В комментах поворчать на авторов конкретного контеста — это да, сплошь и рядом. В этом посте я постараюсь сформулировать список тех вещей, которые влияют на результаты случайно. Т.е. вносят непредсказуемость. Конечно я пишу пост не из абстракнтых, а из вполне конкретных наблюдений. Написал его черновик я сразу после полуфинала. Когда заявил (\u003ca href\u003d\"//codeforces.com/blog/entry/15093#comment-200686\"\u003ehttp://codeforces.com/blog/entry/15093#comment-200686\u003c/a\u003e) об этом. Но тогда я почему-то отождествил мнение сообщества и мнение \u003cstrong\u003eсамарских троллей\u003c/strong\u003e (кстати, предлагаю ввести это как официальный термин :) ) и отложил пост. Но увидев, что третья российская команда находится аж на 42-м месте (в прошлом году 7-я российская команда была на 32-м!), я решил, что всё-таки стоит причесать пост и опубликовать. \u003c/p\u003e\u003cp\u003eИтак, регламент поста. Я верю, что на официальных отборочных контестах (четвертьфиналы, полуфиналы) жюри стремятся уменьшить рандом. Т.е. чтоб некий “средний” рейтинг не очень сильно отличался от результатов контеста. Моя вера основана на том, что жюри обычно из той же страны/региона и имеют патриотические чувства, а значит стараются на финал отправить команды, которые привезут лучший результат. Есть развлекательные контесты вроде тех, что бывают на сборах в Петрозаводске, на Чемпионате Урала. На такие контесты мы часто осознанно даём трешовые задачи. Они призваны разнообразить тренировки, но полуфинал и четвертьфинал не место для этого.\u003c/p\u003e\u003cp\u003eБудет много пунктов, в каждом пункте я буду приводить какое-то свойство контеста и говорить, почему оно часто приводит к случайностям на контестах. Любой автор задач может каждый из этих пунктов пробовать “примерить”. Причём, на мой взгляд, каждый автор комплекта \u003cstrong\u003eобязан\u003c/strong\u003e все эти пункты мысленно примерять на свой контест до его начала. И если какой-то из них срабатывает, то внимательно подумать и понять, не увеличит ли это рандомность. \u003c/p\u003e\u003cp\u003eСразу оговорюсь, я буду подразумевать, что мы говорим здесь о хорошо подготовленном контесте, т.е. багов в тестах, чекерах, условиях нет, тесты сильные. Также оговорюсь, что контесты бывают необычными (например, очень идейными или очень техническими), но это не добавляет рандомности, просто сортирует команды по-другому свойству. А здесь я буду говорить именно о добавлении случайностей. \u003c/p\u003e\u003cp\u003eНачнём:\u003c/p\u003e\u003cp\u003e1) Очень сложные задачи и очень простые задачи.\u003c/p\u003e\u003cp\u003eНу тут вроде всё более менее понятно. Для каждой команды есть задачи, которые они щёлкают (халва), есть такие, которые никогда не решат на 5часовом контесте (гробы). Это могут быть и идейные, и технические гробы. А между ними средние.\u003c/p\u003e\u003cp\u003eТеперь если две команды уровнем различаются существенно, но жюри даёт такие, что они халва для обеих команд, то кто будет выше — это случайная величина. Если же жюри даёт гробы для обеих, то опять же слабой команде может чуть больше повезти и она сдаст гроб, а сильная не сдаст. \u003c/p\u003e\u003cp\u003eА вот если в комплекте будет задача, которая гроб для одной команды и средняя для другой, то исход предрешён. И это хорошо с точки зрения отбора самой сильной.\u003c/p\u003e\u003cp\u003eКак с таким быть? Стараться, чтоб не было “резких ступенек” между соседними задачами. Иначе те, кто повиснут на этой ступеньке и те, кто её перешагнут и повиснут за ней неотличимы. Если без ступенек не обойтись, то их нужно сделать пониже (скажем, на 2 задачи ниже, чем выход в следующий этап или медали). Т.е. если у вас медали от n задач, то лучше, чтоб ступенька была между n — 1 и n — 2. \u003c/p\u003e\u003cp\u003e2) Существование решения на грани TLя.\u003c/p\u003e\u003cp\u003eК примеру, жюри не хочет, чтоб заходил квадрат, но хочет, чтоб заходила линия. Написали решение за квадрат и за линию. Поставили ограничение 200000, чтоб квадрат точно не зашёл. В итоге решение за n * n / log n (т.е. квадрат с методом четырёх русских) написали куча команд, у кого-то TL, у кого-то АС. Кто-то из тех, у кого TL попихал, но так и не сдал, а кто-то упихал. Результаты по этой задаче — это случайная величина. Ни один человек не умеет идеально предсказывать кеш, оптимизации компилятора и подобные тонкости. Поэтому будет работать чуть быстрей у того, кому повезло на этой задаче, а не у более сильного участника (умного/опытного и т.д.) \u003c/p\u003e\u003cp\u003eКак с таким бороться? Нужно делать комп жюри и комп участника абсолютно одинаковыми(как на финале), либо давать возможность запускать на сервере жюри (как на cf и тимусе). Это поможет избежать TL и соптимизить локально. А ещё писать \u003cstrong\u003eвсе\u003c/strong\u003e решения, которые смогут придумать и на java, и на c++ и следить, чтоб TL не попал ровно на границу какого-то решения. \u003c/p\u003e\u003cp\u003e3) Задачи, в которых сложно оценить правильность до написания \u003c/p\u003e\u003cp\u003eСюда входит много разных задач. Сразу в голову приходят задачи, где много вычислений в double (и про нужную точность заранее не угадать), и задачи, которые легко придумать, но сложно доказать. Тут есть задачи на закономерность (что не так страшно, ведь там код обычно короткий) и задачи, где на вход подаются “случайные” данные, там часто и жюри-то не умеет доказывать своё решение строго. \u003c/p\u003e\u003cp\u003eКак бороться с таким? Ну моя позиция тут простая (хотя её многие не разделят): задачи, которые доказать трудно (на контесте), но код по ним большой, просто \u003cstrong\u003eнельзя\u003c/strong\u003e давать на официальные контесты (в птз — пожалуйста). Либо задача должна быть такой, что случайно догадаться до факта нельзя (можно только доказывая). Что касается задач на точность (в особенности, численные методы), то если жюри решило дать такую задачу, то они \u003cstrong\u003eдолжны\u003c/strong\u003e доказать (на разборе или выложить в инете), что их решение имеет необходимую точность и дать такие ограничения в задаче, чтоб у людей не было сомнения, что численный метод тут зайдёт.\u003c/p\u003e\u003cp\u003e4) Эффект монитора и много задач, несданных тобой.\u003c/p\u003e\u003cp\u003eЕсли у какой-то команды в итоге задач существенно меньше, чем всего в комплекте, то это значит, что либо она не успела подумать над остальными (что добавляет случайной величины, вдруг на какую-то из них им бы хватило нескольких минут?), либо думала над всеми (и тогда могла не успеть что-то сдать из-за того, что сильно распараллелилась), либо выбрала одну и фигачила весь контест (и тогда случайность оттого, что могла попасть не в ту задачу). Поэтому чем ниже команда в мониторе, тем больше шанс на случайность. Но на команды внизу обычно жюри смотрит не так внимательно. А вот на верхи эта штука влияет очень сильно. И чем больше задач, которые не сдал никто, тем сильней добавляется рандомности в результаты. Ведь у топ-команд (в отличие от команд внизу) даже нет возможности посмотреть на монитор и узнать, поэтому у них полностью случайная величина.\u003c/p\u003e\u003cp\u003eЧто делать с этим? Стараться делать так, чтоб задач, которые никто не сдал не было. Если не выходит (боитесь тоталов), то хотя бы делать их по минимуму.\u003c/p\u003e \u003chr /\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e: Была пара комментариев, я обдумал и хочу добавить. \u003c/p\u003e \u003col\u003e   \u003cli\u003eТо, что выше черты, это мои соображения, которые не привязаны к полуфиналу.\u003c/li\u003e   \u003cli\u003eРезльутаты полуфинала неадекватны ровно по той причине, что не коррелируют с результатами большинства контестов.\u003c/li\u003e   \u003cli\u003eА то, что ниже, это мои попытки соотнести предыдущие 2 пункта и объяснить такую неадекватность результатов. Совсем не факт, что удачно :)\u003c/li\u003e \u003c/ol\u003e \u003chr /\u003e\u003cp\u003eP.S. Меня на этот пост побудил полуфинал, поэтому всё же скажу, какие пункты там про что. Не думаю, что нарушение пунктов было осознанными действиями жюри полуфинала. Но за результат NEERC в финале этого года конечно же несут ответственность именно они. Очень надеюсь, что они это осознают и чувствуют эту ответственность. Если бы на финале были The Sun, Saratov SU 1 и SPb SU Trawa, то мат.ожидание медалей было существенно выше. \u003c/p\u003e\u003cp\u003eп.1 — ступенька между 5 и 6\u003c/p\u003e\u003cp\u003eп.3 — G, H и немного D — в D вроде выставили маленькие ограничения, но команды всё равно не решались писать численное интегрирование\u003c/p\u003e\u003cp\u003eп.4 — G, H — хоть их никто и не сдал, но на G многие потратили время\u003c/p\u003e\u003cp\u003eНа мой взгляд, самые серьёзные косяки — это задача G (по ней реально невозможно оценить правильность решения) и ступенька между 5 и 6 (которая очевидна всем и обсуждена миллион раз). Ну и я не уверен, есть ли по D у жюри доказательство.\u003c/p\u003e\u003c/div\u003e","tags":["acm icpc wf 2015","neerc 2014"]}}