{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1431575816,"rating":66,"authorHandle":"I_love_Tanya_Romanova","modificationTimeSeconds":1431706268,"id":17874,"title":"\u003cp\u003eMay Clash 2015\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003eI want to invite you to participate in \u003ca href\u003d\"https://www.hackerearth.com/may-clash15/\"\u003eMay Clash\u003c/a\u003e at \u003ca href\u003d\"http://hackerearth.com/\"\u003eHackerEarth\u003c/a\u003e. Contest is scheduled on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dMay%20Clash%2715\u0026amp;iso\u003d2015-05-23T01:30:00\u0026amp;p1\u003d64\u0026amp;ah\u003d0\"\u003eMay, 23\u003c/a\u003e. Contest duration was increased comparing to previous editions — now it lasts for 24 hours, to make it even easier for you to find some time at least to try it :)\u003c/p\u003e\u003cp\u003eThere will be six tasks in a problemset. Five of them are classic algorithmic problems with partial solutions allowed — you get points for every test that your solution passed. And the last task is an approximate problem — your score for this task depends on how good your solution is comparing to current best solution. \u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/PrinceOfPersia\" title\u003d\"Мастер PrinceOfPersia\"\u003ePrinceOfPersia\u003c/a\u003e is author of this problemset. Check his blog to get a taste of problems authored by him — he was a writer of recent \u003ca href\u003d\"/contest/536\" title\u003d\"Codeforces Round 299 (Div. 1)\"\u003eCodeforces Round #299 (Div. 1)\u003c/a\u003e, and also prepared few interesting contests in CF gym.\u003c/p\u003e\u003cp\u003eI was working on this contest as a tester. I would like to say that I find this problemset interesting, I hope that some problems will be not too hard for beginners (don\u0027t give up and show your best with partial scoring) and some other tasks are challenging enough to attract more experienced contestants. It was nice experience to work with \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/PrinceOfPersia\" title\u003d\"Мастер PrinceOfPersia\"\u003ePrinceOfPersia\u003c/a\u003e on preparing problemset. He really impressed my by the speed with which he is generating ideas :) Also I want to thank to \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/chandan111\" title\u003d\"Эксперт chandan111\"\u003echandan111\u003c/a\u003e for technical help and doing his best on fixing all issues and improving HackerEarth platform.\u003c/p\u003e\u003cp\u003eIf you are still not sure about participation in this contest — I want to add one more thing, \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTop5 of leaderboard will also receive some nice prizes:\u003c/strong\u003e\u003c/p\u003e \u003col\u003e   \u003cli\u003e$80 Amazon gift card + HackerEarth T-shirt\u003c/li\u003e   \u003cli\u003e$60 Amazon gift card + HackerEarth T-shirt\u003c/li\u003e   \u003cli\u003e$40 Amazon gift card + HackerEarth T-shirt\u003c/li\u003e   \u003cli\u003eHackerEarth T-shirt\u003c/li\u003e   \u003cli\u003eHackerEarth T-shirt\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eI guess some of top contestans will be busy because of ACM ICPC World Finals — it only increases your chances for a prizes :)\u003c/p\u003e\u003cp\u003eGood luck to everybody — I hope to see you at the scoreboard :)\u003c/p\u003e\u003cp\u003e\u003cem\u003eUPD. First announcement said that contest is scheduled on May, 16. Due to unavoidable reasons it has been moved on May, 23 now.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e","tags":["hackerearth","may","clash","contest","announcement","prizes"]}}