{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1498495542,"rating":36,"authorHandle":"Devushka","modificationTimeSeconds":1498745878,"id":52921,"title":"\u003cp\u003eКафедра КТ. О нас.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет!\u003c/p\u003e\u003cp\u003eВот краткое описание \u003ca href\u003d\"https://vk.com/ct_ifmo\"\u003eжизни на кафедре КТ\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eМы постарались собрать для вас все плюсы и минусы обучения здесь.\u003c/p\u003e\u003ch3\u003eПлюсы\u003c/h3\u003e \u003cul\u003e   \u003cli\u003eПолучать актуальные знания и изучать полезные дисциплины\u003c/li\u003e   \u003cli\u003eЗаниматься в дружелюбной и конкурентной среде\u003c/li\u003e   \u003cli\u003eРаботать над научными проектами (с 1 курса)\u003c/li\u003e   \u003cli\u003eДовести английский язык до upper-intermediate (и даже выше)\u003c/li\u003e   \u003cli\u003eПолучать стипендию выше прожиточного минимума почти в полтора раза\u003c/li\u003e   \u003cli\u003eВсе занятия в одном месте\u003c/li\u003e   \u003cli\u003eПостроить полезные контакты с нужными людьми\u003c/li\u003e   \u003cli\u003eЕздить по миру: на соревнования по информатике и математике, научные конференции, стажировки, хакатоны\u003c/li\u003e   \u003cli\u003eПринимать участие в организации международных мероприятий\u003c/li\u003e   \u003cli\u003eЖить в культурном центре Санкт-Петербурга на Петроградке за 400 руб./мес. (или за 2500 руб./мес.)\u003c/li\u003e   \u003cli\u003eПешком ходить в универ из общежития\u003c/li\u003e   \u003cli\u003eАктивно заниматься спортом на любом уровне (от начального до профессионального)\u003c/li\u003e   \u003cli\u003eЕда хорошего качества в столовой и три отличные булочные неподалеку\u003c/li\u003e   \u003cli\u003eМожно перевестись на кафедру, где легче учиться (не вылететь из универа и не попасть в армию)\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003eМинусы\u003c/h3\u003e \u003cul\u003e   \u003cli\u003eПолучить тройку и остаться без стипендии\u003c/li\u003e   \u003cli\u003eЕсли прикладывать мало усилий, то легко вылететь с КТ (но не из универа)\u003c/li\u003e   \u003cli\u003eПреподаватели будут знать имена не всех студентов\u003c/li\u003e   \u003cli\u003eЗданию общежития много лет, оно отремонтировано не всё\u003c/li\u003e   \u003cli\u003eПредметы, которые нельзя выкинуть по закону (физкультура, философия, безопасность жизнедеятельности и что-то ещё)\u003c/li\u003e   \u003cli\u003eНет коворкинга с диваном для студентов на кафедре (будет)\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003eПерспективы\u003c/h3\u003e \u003cul\u003e   \u003cli\u003eСтать крутым разработчиком в крутой ИТ-компании\u003c/li\u003e   \u003cli\u003eЗаниматься наукой в нашей лаборатории: машинным обучением, эволюционными вычислениями, биоинформатикой и многим другим\u003c/li\u003e   \u003cli\u003eПоступление в \u003ca href\u003d\"http://abit.ifmo.ru/program/7952/\"\u003eмагистратуру\u003c/a\u003e, \u003ca href\u003d\"http://aspirantura.ifmo.ru/\"\u003eаспирантуру\u003c/a\u003e КТ (в том числе совместную с университетами других стран)\u003c/li\u003e   \u003cli\u003eСоздать свой \u003ca href\u003d\"http://news.ifmo.ru/ru/science/it/news/6376/\"\u003eмногомиллионный бизнес\u003c/a\u003e или \u003ca href\u003d\"https://habrahabr.ru/company/jugru/blog/279819/\"\u003eизвестную ИТ-компанию\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eА еще на КТ можно \u003ca href\u003d\"http://news.ifmo.ru/ru/university_live/leisure/news/6439/\"\u003eнайти свою любовь\u003c/a\u003e\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003eПолезные ссылки\u003c/h3\u003e\u003cp\u003eПриемная кампания-2017: \u003ca href\u003d\"http://news.ifmo.ru/ru/education/official/news/6748/\"\u003eвсе, что важно знать о поступлении в Университет ИТМО\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://ct.ifmo.ru/ru/page/17003/FAQ_dlya_abiturientov.htm\"\u003eОтветы на частые вопросы\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://ct.ifmo.ru/ru/page/15082/otzyvy_studentov.htm\"\u003eОтзывы наших студентов\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://ct.ifmo.ru/ru/listnews/show_all_news.htm\"\u003eНовости кафедры\u003c/a\u003e\u003c/p\u003e\u003ch3\u003eКонтакты\u003c/h3\u003e\u003cp\u003e\u003ca href\u003d\"https://vk.com/id14471560\"\u003eДарья Яковлева\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eПодробности\u003c/h2\u003e\u003ch3\u003eМаленькая история\u003c/h3\u003e\u003cp\u003e\u003ca href\u003d\"http://ct.ifmo.ru/\"\u003eКафедра компьютерных технологий\u003c/a\u003e (КТ) входит в состав \u003ca href\u003d\"http://www.ifmo.ru/ru/viewfaculty/7/fakultet_informacionnyh_tehnologiy_i_programmirovaniya.htm\"\u003eфакультета информационных технологий и программирования\u003c/a\u003e. С 1991 года (уже 25 лет!) кафедра готовит высококвалифицированных программистов, работающих в ведущих IT-компаниях мира. В 2013 году была издана книга \u003ca href\u003d\"http://is.ifmo.ru/belletristic/2013/ctd-history.pdf\"\u003e«История кафедры КТ»\u003c/a\u003e, в которой рассказаны захватывающие истории и мотивирующие моменты жизни кафедры.\u003c/p\u003e\u003ch3\u003eОбучение\u003c/h3\u003e\u003cp\u003eРеальный учебный план доступен \u003ca href\u003d\"http://ct.ifmo.ru/ru/page/15600/uchebnyy_plan.htm\"\u003eпо ссылке\u003c/a\u003e, по многим предметам есть ссылка на преподавателя и на учебные материалы.\u003c/p\u003e\u003cp\u003eУ нас есть военная кафедра, которая реализует программы подготовки сержантов и офицеров запаса.\u003c/p\u003e\u003ch4\u003eМатематика\u003c/h4\u003e\u003cp\u003eМатематике на кафедре уделяется большое внимание, потому что у хорошего специалиста должен быть сильный математический аппарат.\u003c/p\u003e\u003cp\u003eМатанализ читают преподаватели с большим стажем. Например, доцент СПбГУ Кохась Константин Петрович. Курс матанализа длится 4 семестра. Константин Петрович – медалист международной олимпиады школьников по математике.\u003c/p\u003e\u003cp\u003eКурс “Дифференциальные уравнения” читает Владимир Владимирович Басов, доцент, кандидат физико-математических наук.\u003c/p\u003e\u003cp\u003eЛинейную алгебру читает Рыжков Александр Евгеньевич – тренер сборной ИТМО по математике. Математики участвуют в IMC и олимпиаде им. Ярника, также математическая кафедра проводит международную олимпиаду \u003ca href\u003d\"http://mathdep.ifmo.ru/ncumc/\"\u003eNCUMC\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eДискретную математику, теорию сложности, теорию формальных языков и грамматик преподает \u003ca href\u003d\"http://www.ifmo.ru/ru/viewperson/289/stankevich_andrey_sergeevich.htm\"\u003eАндрей Сергеевич Станкевич\u003c/a\u003e. Обладатель премий (в области образования и не только), медалей, наград, известный во всем мире тренер команд университета.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eМатематические предметы:\u003c/strong\u003e Алгебра и геометрия, дискретная математика, математический анализ, дифференциальные уравнения, теория функций комплексного переменного, математическая логика, математическая физика, теория вероятностей и математическая статистика, численные методы.\u003c/p\u003e\u003ch4\u003eПрограммирование\u003c/h4\u003e\u003cp\u003eБольшинство курсов по программированию на кафедре читают приглашенные специалисты из компаний (Яндекс, Кронштадт Технологии, DevExperts, JetBrains, Mail.ru Group), которые всегда в курсе новых разработок и технологий. Приятно отметить, что большинство из них – выпускники ИТМО. Благодаря этому наши студенты получают самые актуальные знания. Средний возраст преподавателей около 33 лет.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eC++, Java, Haskell, Assembler, Android, операционные системы, архитектура ЭВМ, сети, машинное обучение\u003c/strong\u003e – джентльменский набор знаний позволит не только использовать любые технологии, но и понимать особенности их совместной работы.\u003c/p\u003e\u003cp\u003eНапример, компания DevExperts занимается распределенными вычислениями. Наш выпускник, Роман Елизаров, один из основателей компании, преподает «Параллельное программирование». Роман Анатольевич сейчас занимается разработкой языка программирования Kotlin, который утвержден компанией Google в качестве одного из основных языка разработки под Android.\u003c/p\u003e\u003cp\u003eКомпания Кронштадт Технологии занимается разработкой симуляторов для обучения пилотов самолетов и кораблей. Важной частью их продуктов является высокая точность расчетов и моделирования. Антон Ковалев, начальник отдела систем подготовки данных и ГИС компании Кронштадт Технологии ведет на кафедре КТ вычислительную геометрию. Антон – выпускник нашей кафедры.\u003c/p\u003e\u003cp\u003eКурс создания мобильных приложений читают разработчики из компании Яндекс.\u003c/p\u003e\u003cp\u003eЯзык программирования C++ и курс по компиляторам читают специалисты из компании JetBrains.\u003c/p\u003e\u003cp\u003eДискретную математику читает Андрей Станкевич (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/andrewzta\" title\u003d\"Гроссмейстер andrewzta\"\u003eandrewzta\u003c/a\u003e), алгоритмы и структуры данных преподают Нияз Нигматуллин (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/niyaznigmatul\" title\u003d\"Международный гроссмейстер niyaznigmatul\"\u003eniyaznigmatul\u003c/a\u003e) и Павел Маврин (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/pashka\" title\u003d\"Международный гроссмейстер pashka\"\u003epashka\u003c/a\u003e). Содержание курсов можно посмотреть \u003ca href\u003d\"http://neerc.ifmo.ru/wiki/\"\u003eна вики-конспектах\u003c/a\u003e. Им помогают: Николай Ведерников (\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Niko\" title\u003d\"Мастер Niko\"\u003eNiko\u003c/a\u003e), Артём Васильев (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/VArtem\" title\u003d\"Гроссмейстер VArtem\"\u003eVArtem\u003c/a\u003e), Никита Кравцов.\u003c/p\u003e\u003cp\u003eПреподаватель курса “машинное обучение” Андрей Фильченков возглавляет лабораторию по машинному обучению.\u003c/p\u003e\u003ch4\u003eАнглийский язык\u003c/h4\u003e\u003cp\u003eАнглийский язык преподают носители и профессионалы одного из лучших центров по обучению языку English First. Для студентов читаются два курса: английский разговорный и технический английский. В учебном плане на занятия английским предусмотрено 4 часа в неделю.\u003c/p\u003e\u003ch4\u003eУчебные группы\u003c/h4\u003e\u003cp\u003eВесь набор первого курса разделяется на учебные группы по трем уровням сложности. Предметы во всех группах одинаковые, но бывают разные преподаватели или разные задания. Группы формируются по результатам вступительного тестирования по математике и информатике, которое проводится 1 сентября. По результатам сессии студенты могут переходить на уровень выше или ниже.\u003c/p\u003e\u003ch3\u003eПрактика и стажировки\u003c/h3\u003e\u003cp\u003eНачиная с третьего курса студенты должны \u003ca href\u003d\"http://ct.ifmo.ru/ru/page/16522/stazhirovki.htm\"\u003eпроходить практику\u003c/a\u003e. Часто их выбором оказываются Яндекс, Транзас, DevExperts, JetBrains, Mail.ru Group, Facebook, Google (\u003ca href\u003d\"http://news.ifmo.ru/ru/education/students/news/5802/\"\u003eинтервью студентов\u003c/a\u003e). \u003ca href\u003d\"http://ct.ifmo.ru/ru/page/16522/stazhirovki.htm\"\u003eЕжегодные презентации\u003c/a\u003e проектов для практики позволяют выбрать интересное направление исследований или разработки.\u003c/p\u003e\u003cp\u003eНа третьем курсе есть возможность устроиться работать на неполный рабочий день (20 часов в неделю), поэтому 80% студентов третьего курса имеют опыт работы в компании.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://ct.ifmo.ru/ru/alumnus/information_about_alumnus.htm\"\u003eВыпускниками факультета\u003c/a\u003e создано более 40 компаний с общей численностью сотрудников более 2000 человек. Например, Михаил Бабушкин, Станислав Столяр, Роман Елизаров, Артем Козырев основали компанию \u003ca href\u003d\"http://www.devexperts.com/en/company/a/about.html\"\u003eDevExperts\u003c/a\u003e, в которой работает более 370 сотрудников.\u003c/p\u003e\u003ch3\u003eНаука\u003c/h3\u003e\u003cp\u003eНа факультете базируются четыре \u003ca href\u003d\"http://ctlab.ifmo.ru/\"\u003eмеждународных научно-исследовательских центра\u003c/a\u003e, в которых работают ведущие иностранные и российские ученые, а также более ста российских молодых исследователей занимаются научной деятельностью в таких актуальных областях, как нейронные сети, машинное обучение и системы искусственного интеллекта, анализ данных, эволюционные алгоритмы, биоинформатика. Ежегодно на кафедре публикуются \u003ca href\u003d\"http://ctlab.ifmo.ru/ru/87845/publication_list/publications_list.htm\"\u003eболее 40 статей\u003c/a\u003e в высокорейтинговых мировых научных изданиях и трудах ведущих международных конференций.\u003c/p\u003e\u003cp\u003eС научной деятельностью, публикациями, конференциями и многим другим вы можете ознакомиться на \u003ca href\u003d\"http://is.ifmo.ru/\"\u003eсайте\u003c/a\u003e Анатолия Абрамовича Шалыто, научного руководителя, профессора, основателя автоматного программирования, а также автора \u0026quot;Заметок о мотивации\u0026quot;.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://vk.com/itmo.ctlab\"\u003eЛаборатория\u003c/a\u003e проводит регулярные научные семинары для студентов кафедры и гостей. Большая часть бакалаврских и магистерских работ студентов КТ основывается на проведенных в лаборатории исследованиях. Лаборатория с удовольствием примет в свои ряды студентов, желающих реализовать свой научный потенциал.\u003c/p\u003e\u003cp\u003eВ ИТМО реализуется программа \u003ca href\u003d\"http://www.ifmo.ru/ru/listjep/mezhdunarodnye_obrazovatelnye_programmy.htm#ixzz3WWwKNnLO\"\u003eдвойных магистерских программ\u003c/a\u003e, которая позволяет обучаться в магистратуре вуза-партнера и после защиты диплома на английском языке получить магистерский диплом не только ИТМО, но и другого университета. Например, студенты Ксения Бурая, Денис Механиков и Иван Самборский учатся \u003ca href\u003d\"http://news.ifmo.ru/ru/science/it/news/6753/\"\u003eв магистратуре ИТМО и Национальном университете Сингапура\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eВ Университете \u003ca href\u003d\"http://news.ifmo.ru/ru/events/?order\u003dpast\u0026amp;tab\u003d1\u0026amp;page\u003d1\u0026amp;subjects\u003d19,13\u0026amp;types\u003d2,34\u0026amp;dates\u003d\"\u003eрегулярно проходят открытые лекции приглашенных ученых\u003c/a\u003e.\u003c/p\u003e\u003ch3\u003eПоступление\u003c/h3\u003e\u003cp\u003eНа кафедре КТ ведется подготовка по направлению 01.03.02 Прикладная математика и информатика, образовательная программа “\u003ca href\u003d\"http://abit.ifmo.ru/program/8055/\"\u003eИнформатика и программирование\u003c/a\u003e”. \u003c/p\u003e\u003cp\u003eКТ \u003ca href\u003d\"https://abit.ifmo.ru/file/pages/82/olimpiady_rsosh.pdf\"\u003eпринимает без вступительных испытаний\u003c/a\u003e всех победителей и призеров олимпиад школьников по математике, информатике и физике первого и второго уровня РСОШ и только победителей третьего уровня.\u003c/p\u003e\u003cp\u003eПоследние годы мы набираем на первый курс 90-120 человек.\u003c/p\u003e\u003cp\u003eВ прошлом году поступило 123 человек, 110 из них были призерами олимпиад школьников. Семь человек поступили к нам на кафедру \u003ca href\u003d\"http://abit.ifmo.ru/page/72/\"\u003eпо ЕГЭ с баллами 289-300\u003c/a\u003e.\u003c/p\u003e\u003ch4\u003eСтипендия\u003c/h4\u003e\u003cp\u003eВ первом семестре студенты получают достойную стипендию \u003ca href\u003d\"http://abit.ifmo.ru/page/94/\"\u003eдо 15 000 руб./мес. от Университета\u003c/a\u003e, а также участвуют в конкурсе на стипендию правительства СПб (5000 руб./мес.).\u003c/p\u003e\u003cp\u003eВ случае успешной (без троек) сдачи сессии все имеющиеся стипендии продлеваются на второй семестр.\u003c/p\u003e\u003cp\u003eСо второго курса действуют\u003ca href\u003d\"http://ct.ifmo.ru/ru/page/16362/stipendii.htm\"\u003e стипендии Университета за различные достижения\u003c/a\u003e. Самое важное условие получения стипендии -- отсутствие долгов и троек за последнюю сессию.\u003c/p\u003e\u003ch4\u003eОбщежитие\u003c/h4\u003e\u003cp\u003eСтуденческий городок – 25 минут до университета пешком. Комнаты общежития рассчитаны на 2-3 человека. В студенческом городке есть столовая, учебные комнаты, тренажерный зал, настольный теннис, танцевальный зал, киноклуб, комната с музыкальными инструментами.\u003c/p\u003e\u003ch3\u003eМероприятия\u003c/h3\u003e\u003cp\u003eКафедра КТ \u003ca href\u003d\"https://vk.com/neercnews\"\u003eпроводит\u003c/a\u003e четвертьфинал NEERC, \u003ca href\u003d\"http://neerc.ifmo.ru/information/index.html\"\u003eполуфинал NEERC\u003c/a\u003e, \u003ca href\u003d\"http://neerc.ifmo.ru/school/russia-team/index.html\"\u003eВКОШП\u003c/a\u003e, \u003ca href\u003d\"http://neerc.ifmo.ru/school/ioip/index.html\"\u003eИОИП\u003c/a\u003e, Интернет-олимпиады, \u003ca href\u003d\"http://www.russiancodecup.ru/en/#\"\u003eRussian Code Cup\u003c/a\u003e, региональный этап ВсОШ по информатике. Сотрудники и студенты КТ входят в жюри заключительного этапа ВсОШ по информатике.\u003c/p\u003e\u003ch3\u003eСпортивное программирование\u003c/h3\u003e\u003cp\u003eКонечно, все слышали об успехах команды ИТМО на финале чемпионата мира -- и именно студенты нашей кафедры составляют команды чемпионов. Даже пошел слух, что на КТ все участвуют в олимпиадах. На самом деле это не так -- участвуют только те, кто хочет: на первом курсе таких 10-15%, в дальнейшем остаются студенты, которые решили заниматься этим серьезно.\u003c/p\u003e\u003cp\u003eТренировки проходят два раза в неделю, желающие студенты слушают дополнительные лекции по продвинутым алгоритмам и структурам данных. Лучшие команды отправляются на сборы. Самые активные и сильные команды участвуют в Открытом Кубке, отборах на открытые чемпионаты.\u003c/p\u003e\u003cp\u003eПриветствуется участие и в нестандартных соревнованиях, таких как Challenge 24, Marathon 24. Для команды-финалиста к этому набору добавляются сборы в Урозере (с СПбГУ и ПетрГУ) и Цюрихе (с ETH Zurich). Тренировки команд являются важной частью жизни Университета, который оплачивает участие команд во всех необходимых соревнованиях.\u003c/p\u003e\u003cp\u003eСтуденты и сотрудники кафедры проводят серию \u003ca href\u003d\"http://wcps.ifmo.ru/\"\u003eмеждународных сборов\u003c/a\u003e для вузов со всего мира, в том числе для таких университетов как UCLA, Peking University, ETH Zurich, Harbin Institute of Technology, Tongji University. Университет ИТМО является десятикратным чемпионом России и семикратным чемпионом мира по программированию. \u003c/p\u003e\u003ch3\u003eКроме учебы\u003c/h3\u003e\u003cp\u003eВ Университете ИТМО есть \u003ca href\u003d\"http://www.ifmo.ru/ru/page/133/tvorcheskie_studii_i_kluby_po_interesam.htm\"\u003eмного разных активностей для студентов\u003c/a\u003e. \u003ca href\u003d\"http://kronbars.ifmo.ru/\"\u003eСпортивный клуб\u003c/a\u003e с практически всеми видами спорта, \u003ca href\u003d\"https://vk.com/muzclubitmo\"\u003eмузыкальных клуб “Живой звук”\u003c/a\u003e, \u003ca href\u003d\"http://olimp-union.com/\"\u003eлаборатория ОЛИМП\u003c/a\u003e, \u003ca href\u003d\"http://fablab.ifmo.ru/language/ru/sample-page/\"\u003eФабЛаб ИТМО\u003c/a\u003e, \u003ca href\u003d\"http://www.ifmo.ru/ru/page/135/kvn.htm\"\u003eКВН\u003c/a\u003e.\u003c/p\u003e\u003ch3\u003eОбратная сторона медали\u003c/h3\u003e\u003cp\u003eНа самом деле, обучение на кафедре достаточно сложное и вместе с этим интересное. Чтобы успешно закончить сессию и понимать каждый предмет, нужно потратить немало времени и сил. Но все силы, которые вы потратите, непременно окупятся. \u003c/p\u003e\u003cp\u003eКаждый курс, действительно, полезен студенту, как будущему профессионалу своего дела. Преподаватели кафедры не будут ничего делать за вас, но помогут вам с чем угодно. Если вы хотите и готовы много работать, то вы получите огромное удовольствие от учебного процесса.\u003c/p\u003e\u003ch3\u003eУниверситет ИТМО\u003c/h3\u003e\u003cp\u003e\u003ca href\u003d\"http://www.ifmo.ru/\"\u003eУниверситет ИТМО\u003c/a\u003e находится в Санкт-Петербурге. Один из лидеров программы \u003ca href\u003d\"http://5100.ifmo.ru/\"\u003e5 top 100\u003c/a\u003e. Ректор – Владимир Николаевич Васильев, проф., член корр. РАН, Вице-президент Российского Союза ректоров, занимает \u003ca href\u003d\"https://www.timeshighereducation.com/world-university-rankings/itmo-university#ranking-dataset/595528\"\u003e56 место среди вузов мира в рейтинге THE\u003c/a\u003e (Times Higher Education) в области компьютерных наук.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://www.ifmo.ru/ru/map/1/glavnyy_korpus.htm#map\"\u003eГлавный корпус\u003c/a\u003e, в котором происходит обучение студентов КТ, находится в самом историческом месте Санкт-Петербурга, на Петроградской стороне в 5 минутах от метро, 10 минутах от Петропавловской крепости.\u003c/p\u003e\u003cp\u003eПомимо прочего, в Университете работает \u003ca href\u003d\"http://www.ifmo.ru/ru/viewunit/89565/biznes-inkubator.htm\"\u003eстартап инкубатор\u003c/a\u003e, позволяющий предприимчивым студентам начать свое дело не выходя из ИТМО. Партнерство с венчурными фондами, стартап сообществами и инвестиционными ангелами, а также эндаумент фонд университета позволяют стартовать с комфортом.\u003c/p\u003e\u003cp\u003e~\u003c/p\u003e\u003cp\u003eОсобенностью Университета и особенно кафедры является ее динамичность. Мы следим за качеством образования, нам важно поддерживать постоянную связь со студентами нашей кафедры, получать отзывы о курсах и преподавателях. Ежегодно мы вводим новые курсы в программу обучения, модифицируем старые. Идеи для изменения программы предлагают сами студенты. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/df/1e/df1eb793be34c0a89a6f9db335c61008eb91ab97.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["итмо","кт","кафедра кт","программирование"]}}