{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1404295011,"rating":62,"authorHandle":"RodionGork","modificationTimeSeconds":1404295011,"id":12909,"title":"\u003cp\u003eПоход на собеседование в магистратуру CS (СПбАУ)\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eОколо месяца назад \u003ca href\u003d\"http://codeforces.ru/blog/entry/12489\"\u003eя постил вопросы\u003c/a\u003e о поступлении / обучении в магистратуре СПб Академического Университета.\u003c/p\u003e\u003cp\u003eВчера посетил собеседование — попробую теперь что-то добавить к ответам на мои вопросы.\u003c/p\u003e\u003cp\u003eЧеловек который меня встретил и проводил на собеседование подозрительно похож на \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Dumpty\" title\u003d\"Candidate Master Dumpty\"\u003eDumpty\u003c/a\u003e (с точностью до фио).\u003c/p\u003e\u003cp\u003eСначала тестовые задачи, как предупреждали в \u003ca href\u003d\"http://codeforces.ru/blog/entry/12489#comment-172423\"\u003eэтом комментарии\u003c/a\u003e. Впрочем задачи оказались значительно проще чем я ожидал.\u003c/p\u003e\u003cp\u003eНе в том смысле что я всё решил и притом легко :) но для студента 1-2 курса произвольного технического ВУЗа они наверняка привычны — сходимость последовательностей / рядов (незамысловатых), задачка на программирование на уровне Div2 B может (когда мне подсказали что можно обойтись без доп.памяти, я потупив даже оптимальное решение сообразил), три из задач касались основ линейной алгебры (тут уж я тупил по-чёрному — единственный курс по ней я проходил в 2000-м году — например, меня спросили \u003cem\u003eпо-вашему, в определителе матрицы 3x3 всего 3 слагаемых\u003c/em\u003e, гы).\u003c/p\u003e\u003cp\u003eНа собеседовании просматривали мои ответы на тестовые задачи, что-то уточнили, что-то подсказали. Предложили вспомнить быстродействие алгоритма Дейкстры (я сам его упомянул) — мучительно вспомнил что в нём можно использовать priority queue и со второй попытки ответил правильно.\u003c/p\u003e\u003cp\u003eОсновной вопрос касался предполагаемой нагрузки — утверждают что уделять работе даже 20 часов в неделю — весьма сложно. Учитывая мой общий низкий уровень я склонен поверить.\u003c/p\u003e\u003cp\u003eДругой вопрос — что именно меня интересует (например из предлагаемой программы). Обратили внимание на то что люди с направления CS в АУ в основном сами интересуются глубокими и абстрактными вещами, сложностью вычислений — хотя упомянули также возможности заниматься магистерской работой в сторону машинного обучения например.\u003c/p\u003e\u003cp\u003eНу и вытекающий из этих двух вопрос \u003cstrong\u003eа точно ли оно вам надо и вы этого хотите\u003c/strong\u003e — я попросил пару деньков на обдумывание. Результаты пообещали через две недели сообщить.\u003c/p\u003e\u003cp\u003eПрокомментирую пару высказываний из упомянутого комментария:\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eИтак, процедура поступления непрозрачная. Ощущение, что берут по принципу понравился — не понравился. \u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eТакого ощущения не возникло. Нужно понимать что перед собеседующими стоит не самая простая задача — определить сколько мест брать и по возможности не взять людей которые в процессе обучения отсеются — более того по возможности выбрать тех кто планирует \u0026quot;двигать науку\u0026quot; и после магистратуры.\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eЗачем-то заставили оставить под замком телефон с сумочкой, как-будто кто-то собирается обманывать или списывать.\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eИмхо ничего странного или страшного тут нет — сейчас и на ЕГЭ небось примерно так же — не сидеть же над душой у человека... :)\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eСобеседование — тяжёлое психологическое испытание: одновременно собеседуют несколько человек, задавая разноплановые вопросы. Возглавлял комиссию почему-то не зав. кафедрой, а обычный преподаватель, пусть и титулованный.\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eНапротив, мне собеседование понравилось. Люди вежливые, внимательные, приятные. Вопросы разноплановые, да, но не тупые и не заоблачные. Никто не запрещает сказать \u0026quot;не знаю\u0026quot;. Возглавлял в моём случае, по-видимому \u003ca href\u003d\"http://compscicenter.ru/teachers/dmitsykson\"\u003eД.М. Ицыксон\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eЗаключение\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eТестирование и собеседование натолкнуло меня на мысль что полезно было бы не торопиться а потратить годик на то чтобы восстановить в памяти требуемые азы мат.анализа и линейной алгебры. Вспоминать такие вещи по ходу учёбы вероятно будет мучительно.\u003c/p\u003e\u003cp\u003eКроме того когда стали обсуждать \u0026quot;что интересует\u0026quot; я в частности упомянул что сейчас периодически приходится сталкиваться с необычными базами данных — проблемами их применения и т.п. — и поэтому один из интересов естественно лежит в углублении фундаментальных познаний в этой области (знания мои тут настолько поверхностны что я даже не в курсе относится ли CAP-теорема к предмету изучения CS или к чему-то ещё) — тут мне предложили поинтересоваться обучением в СПбГУ у \u003ca href\u003d\"http://www.math.spbu.ru/user/boris_novikov/index.shtml\"\u003eБ.Новикова\u003c/a\u003e если я не ошибаюсь.\u003c/p\u003e\u003cp\u003eВ общем, хоть сам я погрузился в мучительные раздумия, но в целом мне понравилось и если кому магистратуру будет сложно выбирать — осмелюсь порекомендовать пособеседоваться здесь!\u003c/p\u003e\u003c/div\u003e","tags":["аспирантура","спбау"]}}