{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1465162898,"rating":54,"authorHandle":"gKseni","modificationTimeSeconds":1465450815,"id":45259,"title":"\u003cp\u003eТехнологии успеха: Как начинался чемпионат Урала по программированию\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПродолжаем погружаться в историю спортивного программирования в России — с согласия авторов делюсь частями книги В.Н. Васильева и В.Г. Парфенова «Технологии успеха». Рисунки и фотографии — также из книги.\u003c/p\u003e\u003cp\u003eПредыдущие части:\u003cbr /\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/45235\"\u003eТехнологии успеха: Тернистый путь к полуфиналу\u003c/a\u003e\u003cbr /\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/45199\"\u003eТехнологии успеха: Начало пути\u003c/a\u003e\u003cbr /\u003e\u003c/p\u003e\u003chr /\u003e\u003chr /\u003e Предлагаемая ниже статья состоит из двух частей. Вначале своими воспоминаниями и впечатлениями делится тогдашний студент, а ныне доцент кафедры математического анализа С.Н. Васильев, затем некоторые комментарии от декана математико-механического факультета М. О. Асанова.\u003ch4\u003eВзгляд студента...\u003c/h4\u003e\u003cp\u003eЛетом 1996 г. многие российские вузы получили приглашение участвовать в полуфинале чемпионата мира по программированию и одновременно в чемпионате России. В те послеперестроечные годы это было первое, начиная с 1991 г., студенческое соревнование, и студенты, особенно бывшие участники школьных олимпиад, восприняли его с большим энтузиазмом: многим давно хотелось с кем нибудь посостязаться. В Уральском государственном университете нашелся энтузиаст Женя Штыков, который организовал и провёл отборочный тур — первый чемпионат Уральского ГУ. Первые чемпионы Уральского ГУ решили две задачи из четырёх предложенных, две команды решили одну задачу, а остальные не решили ни одной. Неудивительно — если сейчас привести на любой чемпионат по программированию десяток команд, никогда не участвовавших раньше в подобных соревнованиях и не тренировавшихся, то, скорее всего, результаты окажутся сходными. На первый полуфинал чемпионата мира и чемпионат России от Уральского ГУ были направлены две команды. В те времена Интернет был доступен немногим, серверов с наборами задач и, тем более, с проверяющей системой не было (или мы о них не знали), поэтому тренироваться было крайне сложно. Женя Штыков стал первым тренером команд Уральского ГУ. Он разыскал в Интернете несколько комплектов задач с финалов чемпионата мира (разумеется, без тестов). Прорешав эти комплекты и успешно проверив свои программы на нескольких придуманных на скорую руку тестах, мы почему-то решили, что готовы к чемпионатам России и мира.\u003c/p\u003e\u003cp\u003eНо в чемпионате России наши две команды заняли только восьмое и девятое места, отстав от чемпионов и вицечемпионов на одну задачу. Сейчас такой результат может показаться превосходным, но тогда мы воспринимали его как полный провал. Нам казалось, что всего лишь какие-то пустяки отделили нас от поездки в финал. Назад мы возвращались убитые горем и обсуждали, как теперь жить. Поезд Санкт-Петербург-Екатеринбург предоставил восьмерым студентам более полутора суток на обсуждение. Мы поняли, что из-за нашей неопытности огромная часть усилий во время тура была потрачена на ерунду, мы решали не те задачи и не тем способом. А значит, нужны были тренировки. И не такие, как проводили мы, а настоящие: со сложными тестами, независимой проверкой и сильными командами-соперниками.\u003c/p\u003e\u003cp\u003eИ тут возник вопрос: задачи и тесты можно придумать, проверку обеспечить, но где же брать сильных соперников? Ведь мы чувствовали себя бесконечно более опытными по сравнению с временем первого внутреннего университетского отбора, и значит, остальные команды нашего вуза никак не могли составить нам серьёзную конкуренцию. Кстати, именно это ощущение великого опыта и мудрости подвигло некоторых из нас на написание нашумевшего труда «Как стать чемпионом мира по программированию или разбор полётов». Согласитесь, не каждая команда, всего один раз поучаствовавшая в полуфинале, наберётся нахальства написать статью с таким громким названием.\u003c/p\u003e\u003cp\u003eКоманда другого вуза из нашего города заняла место где-то во второй половине итоговой таблицы результатов полуфинала, и поэтому тоже не казалась нам достойной внимания. Зато команда из Пермского государственного университета, которая заняла седьмое место и опередила нас всего на какие-то 17 минут штрафного времени, выглядела очень привлекательным соперником (не говоря уже о возможности взять у нее реванш).\u003c/p\u003e\u003cp\u003eПоразмыслив, мы решили, что если бы нас пригласили в Челябинск поучаствовать в соревновании, мы бы к ним съездили, а, значит, и челябинцы могут прислать к нам пару команд. Ну, может быть, еще приедут из Перми. Так, несколько студентов, поговорив в поезде, решили, что надо провести «большую тренировку», которая поначалу мыслилась фактически как открытый чемпионат Уральского ГУ, пригласив на нее команды из других городов.\u003c/p\u003e\u003cp\u003eДекан математико-механического факультета нашего университета М.О. Асанов и ректор В.Е. Третьяков поддержали студенческую инициативу, при условии, что зачинщики сами проведут основную работу по организации. Евгений Штыков и старший из участников первого полуфинала Сергей Герштейн взяли на себя подготовку задач, создание веб-странички и обеспечение проверки. Чтобы привлечь к нам больше сильных команд других вузов, большую тренировку «повысили в звании» и назвали чемпионатом Урала по программированию. Именно с таким названием и были разосланы приглашения. Правда, в приглашении честно говорилось, что этот чемпионат не является официальным отбором куда-либо и его результаты ни на что не влияют.\u003c/p\u003e\u003cp\u003eПредполагалось, что у нас будут хотя бы два-три иногородних вуза, и тогда громкое название «чемпионат Урала» оправдает себя. Однако мы не учли, что в других вузах тоже соскучились по соревнованиям. На приглашения откликнулись не два-три, а практически все приглашённые вузы! То, что задумывалось как «большая тренировка», переросло в солидное соревнование.\u003c/p\u003e\u003cp\u003eВозможно, первый опыт был не самым лучшим, но руководители команд-участниц чемпионата Урала сошлись во мнении, что такие соревнования надо проводить ежегодно. Через два года чемпионат Урала официально стал первым четвертьфиналом чемпионата мира. Более того, признав наш опыт удачным, организаторы полуфинала Северо-Восточного Европейского региона и чемпионата России решили сделать обязательным проведение четвертьфиналов и для остальных регионов России и стран ближнего зарубежья.\u003c/p\u003e\u003cp\u003eИнициатива студентов, подкреплённая готовностью работать и поддержанная руководством университета, породила более чем серьёзные результаты. Вряд ли кто-то из обсуждавших первоначальную идею мог себе представить, что среди уральских вузов возникнет конкуренция за право проведения нашей «большой тренировки». За прошедшие после старта десять лет чемпионат Урала успел попутешествовать — IV и V чемпионаты Урала проводились в Пермском государственном университете, а VI и VII — в Южно-Уральском государственном университете, и вернуться на родину.\u003c/p\u003e\u003cp\u003eКонечно, сейчас у команд есть множество других возможностей проводить «настоящие» тренировки со сложными тестами, независимой проверкой и сильными командами-соперниками. Начиная с десятого юбилейного чемпионата Урала, он перестал являться официальным четвертьфиналом, и формально его результаты снова не влияют на отбор к полуфиналу. Но он остался интересным и престижным соревнованием.\u003c/p\u003e\u003cp\u003eЧемпионаты Урала изменили жизнь многих людей. Хочется верить, что в лучшую сторону. Будем надеяться, что эта традиция будет жить и развиваться дальше.\u003c/p\u003e\u003ch2\u003eВзгляд декана...\u003c/h2\u003e\u003cp\u003eГде-то в мае 1996 г. тогдашний ректор Уральского ГУ В.Е. Третьяков показал мне заметку неведомых мне В.Н. Васильева, В.Г. Парфенова, А.А. Суханова о том, что в декабре впервые в России состоится полуфинал командного студенческого чемпионата мира по программированию. Прочитав заметку, я ахнул: «Какие же мы отсталые! Чемпионаты мира проводятся с 1977 г. (!), Москва и Питер уже дважды участвовали в полуфиналах и выступили в финале, а мы ничего не знаем!». В волнении я прибежал в деканат, снял ксерокс с этой заметки и вывесил на стенде. Стал ждать реакции студентов. Ждал недолго. Очень быстро, буквально через полчаса прибежали три взволнованных студента, Евгений Штыков, Сергей Герштейн и Петр Лазаренко, со словами: «Вот мы — команда, отправьте нас!». Тут же договорились с Женей, что он изучит правила соревнований. Дело в том, что тогда в Уральском ГУ еще не было Интернета! Интернет появился в Уральском ГУ только в самом конце 1996 г., а Женя уже работал в компьютерной фирме и имел доступ во всемирную сеть. В следующий перерыв прибежали еще три студента, Станислав Васильев, Александр Клепинин и Марат Бакиров, с такой же просьбой. А по тогдашним условиям в полуфинал допускалась от каждого вуза только одна команда. Возникла конкуренция.\u003c/p\u003e\u003cp\u003eНа следующий день пришел удрученный Штыков. Оказалось, что по существовавшим тогда правилам в каждой команде мог быть только один студент выпускного курса. А в его команде таких членов было двое. Пришлось выбирать, и Штыков пожертвовал собой, сказав, что будет тренером (что это такое, мы еще и не знали) и берется организовать отбор. После некоторого спора решили организовать первый чемпионат Уральского ГУ сразу после летней сессии. О его результатах выше рассказал Станислав Васильев.\u003c/p\u003e\u003cp\u003eНаступила осень 1996 г. Нынешним студентам сложно себе представить те годы. Не зря их называют «Лихие девяностые». Главное — вообще не было никаких денег. Из Москвы в университет приходили деньги в лучшем случае только на зарплату и стипендии. А тут командировка... Посчитали со Штыковым требуемую сумму. Получили, что на поездку двух команд нужно 6 000 000 рублей. Да-да, я не ошибся в количестве нулей, нужно было наскрести именно шесть миллионов рублей. С учетом деноминации 1998 г., это сейчас 6 000 рублей. Нынешнее поколение может легко представить себе уровень инфляции. Ведь этой суммы было достаточно тогда на проезд восьми человек в Питер и обратно плюс оплату гостиницы. Сейчас этих денег хватит только на один билет...\u003c/p\u003e\u003cp\u003eСтали думать, что же делать? Была в те годы Областная программа, по которой Министерство по делам молодежи распределяла некие суммы для вузов. На дележе денег университет представлял тогдашний председатель профкома Х.С. Сугаипов. Я написал ему речь, что являлось нетривиальной задачей, ибо слово письменное и слово устное сильно различаются. Я писал, стараясь максимально соблюсти интонации устной речи, и попросил Х.С. Сугаипова просто зачитать свою речь с бумажки. Что он и сделал. В результате четыре миллиона мы получили из областного бюджета! Из разных других источников собрали еще пару миллионов. В результате поездка состоялась...\u003c/p\u003e\u003cp\u003eЯ хорошо помню, как после полуфинала в большой аудитории обсуждались его итоги. Все пришли к выводу, что надо тренироваться. Лучший способ — провести собственное соревнование, не то чемпионат города, не то чемпионат Урала. Я изложил идею ректору, он поддержал, но попросил включить в состав жюри академика Н.Н. Красовского. Мало кто знает, что Н.Н. Красовский был одним из пионеров соревнований по программированию. Именно он смог добиться того, чтобы в Свердловске, единственном городе СССР, было аж 100 одинаковых компьютеров Yamaxa. Именно по его инициативе и при деятельном участии впервые в СССР была проведена олимпиада школьников по информатике. Причем дети писали программы не на бумажке, а набирали в компьютере. Н.Н. Красовский внимательно выслушал идею организации чемпионата Урала и сказал, что он согласен войти в жюри лишь при выполнении двух условий. Первое — в чемпионате Урала должны участвовать сильнейшие команды Москвы, Санкт-Петербурга, Новосибирска, и второе — соревнование одновременно должно проходить в Интернет с участием в нем студентов разных стран. Я вздрогнул и просто испугался. Как же так, проводить первый чемпионат и сразу на весь мир. Но идеи запомнил. Нелишне напомнить, что, начиная с осени 2000 г., все более-менее крупные соревнования в Уральском ГУ (теперь уже — в Уральском федеральном университете) проходят в Интернет и собирают команды из 20-30 стран, а, начиная с 2006 г., чемпионат Урала стал открытым, и в нем участвуют и Москва, и Санкт-Петербург, и многие другие. А в 2013 г. мы вообще «учудили», организовав в рамках чемпионата Урала матч гигантов, Россия-Китай.\u003c/p\u003e\u003cp\u003eИтак, весна 1997 г. Сочинили письмо нашего ректора ректорам ведущих вузов Урала. Помню, тогда он дал определение ведущего вуза: «В каждом городе есть только два ведущих вуза — это технический и классический университеты». Именно по таким университетам мы и разослали приглашения. Я ожидал, что откликнется два-три университета и заказал в студгородке 20 мест для поселения участников. Действительность превзошла все ожидания. Откликнупись все. В результате к нам приехало более 20 команд. А как их расселить, ведь денег ни у кого нет! Нашли нетривиальный выход. Вынесли из читального зала одного из общежитий все столы и стулья, поставили кровати и поселили в читалку несколько команд.\u003c/p\u003e\u003cp\u003eПервый чемпионат окончился большим конфузом. Минут за пять до конца соревнований мы обнаружили, что в утешительной задаче есть тест, не совпадающий с условием задачи. Причем программу можно было написать так, чтобы эта деталь не срабатывала, и в результате большинство команд задачу сдали. Но часть не сдала по вине жюри! Нам еще повезло, что пострадали команды Уральского ГУ. На закрытии мы посыпали голову пеплом, каялись в своей ошибке, и я вынужден был заявить, что нам отступать некуда и в следующем году мы реабилитируемся, организовав второй чемпионат Урала. Впрочем, нас не шибко ругали за промах в тесте, а, наоборот, говорили о необходимости и в будущем проводить чемпионат Урала. Наш второй чемпионат Урала уже получил статус четвертьфинала чемпионата мира. А далее пошли четвертьфиналы по всей России. Но мы были первыми! \u003c/p\u003e\u003chr /\u003e Следующая часть: \u003ca href\u003d\"//codeforces.com/blog/entry/45315\"\u003eТехнологии успеха: Стратегии для будущих чемпионов мира по программированию\u003c/a\u003e\u003c/div\u003e","tags":["codeforces::news","технологии успеха"]}}