{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1524314921,"rating":161,"authorHandle":"HYEA","modificationTimeSeconds":1524314921,"id":59044,"title":"\u003cp\u003eWhy there are no syllabus in ACM-ICPC?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI participated ACM-ICPC World Finals in 2017 and 2018, and I am trying to coach people who are willing to compete ACM-ICPC.\u003c/p\u003e\u003cp\u003eAs a participant and educator, I always wondered that \u0026quot;Why there are no syllabus in ACM-ICPC?\u0026quot; IOI has their syllabus. It changes from year to year, but it is least guideline that how can you ready for the competition. For example, \u0027non-trivial calculations on floating point numbers, manipluating precision errors\u0027 is excluded in IOI, so I did not practiced about real precision error deeply (but did in ACM-ICPC, since some problem requires it). Actually handling real numbers in computer is complicated, same recursion formula can earn different result, etc,. You can think about following problem: \u0026quot;Determine whether \u003cimg align\u003d\"middle\" class\u003d\"tex-formula\" src\u003d\"/predownloaded/8d/48/8d48a5d01119e7b82961878a63fd1a0f8d5118a8.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e for integer \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ea\u003c/i\u003e\u003c/span\u003e, \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eb\u003c/i\u003e\u003c/span\u003e, \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ec\u003c/i\u003e\u003c/span\u003e, \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ed\u003c/i\u003e\u003c/span\u003e.\u0026quot; Double precision cannot help you when each number is 5 digit.\u003c/p\u003e\u003cp\u003eWhich area you should concentrate on practicing ACM-ICPC or other programming contests? Even well-known part in programming contest is not covered by undergraduate (at least school where I am, Computation Geometry, Graph Theory is for Master\u0027s degree.) and some is not covered by even graduate education. You might know about impartial game and Sprague-Grundy theorem about impartial game. Game theory is one of topic for Senior and Graduate student in departure of Mathematics, and the class did not handle about impartial game.\u003c/p\u003e\u003cp\u003eMoreover, do we really have to know about Physics (Newton\u0027s laws of motion, Optics, etc,.) while programming? You do when you have to write some simulation program for physics lab or class but really in participating ACM-ICPC or other programming contest? Does it really help us for testing competitive programming skills?\u003c/p\u003e\u003cp\u003eActually, I am writing this because I am writing a book titled \u0026quot;Mathematics for programming contest.\u0026quot; and I have no idea about which area should I write about. I am considering even writing about Matroid theory and Generating function.\u003c/p\u003e\u003cp\u003eI hope programming contest concentrate on algorithmic thinking, not prior knowledge of harsh area. So I have a question. Why there are no syllabus in ACM-ICPC?\u003c/p\u003e\u003c/div\u003e","tags":["acm-icpc","syllabus"]}}