{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1414486327,"rating":112,"authorHandle":"AlexDmitriev","modificationTimeSeconds":1414494690,"id":14473,"title":"\u003cp\u003eМосковский ЧФ и батхёрт\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eНе знаю, кого пинать напрямую, но мне как-то передавали слова одного из членов жюри про мой комментарий(и): \u0026quot;Кто такой Алексей Дмитриев и какого черта он это пишет?\u0026quot;, так что я надеюсь и это снова прочитают.\u003c/p\u003e\u003cp\u003eНет, я понимаю задержки на старте, к этому все привыкли. Но почему ссылку на пробный тур уже после его запланированного начала можно узнать только через Снарка? К слову, к тому времени этот самый пробный тур еще не начался. В чем вообще проблема включить пробный тур да хоть за неделю до старта и забыть про него? Все равно там задачи те же, что были в прошлом году. Ссылку на основной тур нам вообще не сказали(!) (Благо наша команда догадалась еще на пробном туре перебрать id контестов в обе стороны на единицу).\u003c/p\u003e\u003cp\u003eГвоздь программы — клар \u0026quot;В Москве можно печатать\u0026quot;. Да какого черта?! Ладно, на секунду забудем о настройке печати с начала контеста, но почему нельзя включить эту функциональность одновременно? Ладно, благодаря тому, что Физтех (ровно как и некоторые другие вузы, включая МГУ) всегда имеет в топе достаточное кол-во команд, не меньшее своей квоты, никакого влияния на выход в ПФ это не поимело и весь Физтех был в равных условиях. Однако, когда в прошлом году встал вопрос о включении standings на больших мониторах, которые висят у нас в кабинетах, где проводится ЧФ, все окончилось на том, что \u0026quot;участники из МГУ не имеют такой возможности, поэтому — нет\u0026quot;.\u003c/p\u003e\u003cp\u003eКстати, о том, что печать заработало можно было бы послать клар/объявить в аудиториях. Мы случайно заметили, что кто-то печатает.\u003c/p\u003e\u003cp\u003eКстати, почему нельзя настроить печать и на пробном туре? Собственно, пробный тур вроде не для того сделан, чтобы задачки порешать, а как раз протестировать все и участникам, и жюри. Может быть вам жалко по листику на каждую команду? (Тогда рекомендую не делать задачи типа K, целые 3 листа с команды экономии).\u003c/p\u003e\u003cp\u003eК слову о качестве печати: у нас, например, первые несколько символов в каждой строке не печатались. Если бы это можно было проверить во время пробника, то и пофиксить бы, наверно, можно было, а заниматься кларописанием во время тура — неудобно.\u003c/p\u003e\u003cp\u003eПо поводу печати на половинках: там уже научились переносить длинные строки? Помнится у нас раньше были с этим проблемы, нынче вроде не столкнулись (печатали не много).\u003c/p\u003e\u003cp\u003eА вот за проблемсет спасибо авторам. Все, кроме задачи G, было хорошо понятно, а сами задачи были довольно интересными.\u003c/p\u003e\u003c/div\u003e","tags":["moscow subregion","butthurt"]}}