{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1431616196,"rating":145,"authorHandle":"Arterm","modificationTimeSeconds":1431616950,"id":17881,"title":"\u003cp\u003eGood Code\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eGood day everyone. \u003c/p\u003e\u003cp\u003e\u003cem\u003eEvery programmer occasionally, when nobody\u0027s home, turns off the lights, pours a glass of scotch, puts on some light German electronica, and opens up a file on their computer. It\u0027s a different file for every programmer. Sometimes they wrote it, sometimes they found it and knew they had to save it. They read over the lines, and weep at their beauty, then the tears turn bitter as they remember the rest of the files and the inevitable collapse of all that is good and true in the world.\u003c/em\u003e\u003cbr /\u003e\u003cem\u003eThis file is Good Code. It has sensible and consistent names for functions and variables. It\u0027s concise. It doesn\u0027t do anything obviously stupid. It has never had to live in the wild, or answer to a sales team. It does exactly one, mundane, specific thing, and it does it well. It was written by a single person, and never touched by another. It reads like poetry written by someone over thirty.\u003c/em\u003e \u003c/p\u003e\u003cp\u003e(excerpt from \u003ca href\u003d\"http://www.stilldrinking.org/programming-sucks\"\u003ehttp://www.stilldrinking.org/programming-sucks\u003c/a\u003e) \u003c/p\u003e\u003cp\u003eDo you have such code? For me it\u0027s code for binary power\u003c/p\u003e \u003cpre\u003e\u003ccode\u003elong bin(long x, long a) {\n   long y \u003d 1;\n   while (a) {\n      if (a \u0026amp; 1)\n         y \u003d (y * x) % mod;\n      x \u003d (x * x) % mod;\n      a \u0026gt;\u0026gt;\u003d 1;\n   }\n   return y;\n}  \n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eand Gauss algorithms (the latter is longer than nine lines, so I don\u0027t post it here). \u003c/p\u003e\u003cp\u003eI\u0027ll be happy to see yours masterpieces! \u003c/p\u003e\u003c/div\u003e","tags":[]}}