{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1511106137,"rating":68,"authorHandle":"stgatilov","modificationTimeSeconds":1511108655,"id":55882,"title":"\u003cp\u003eВсесибирская олимпиада: первый тур (2017)\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ этом году в первой номинации Всесибирской олимпиады участникам снова предлагалось написать программу управления роботами-пылесосами. \u003c/p\u003e\u003cp\u003eКак и в прошлом году, игра массовая: в каждой игре запускаются вместе стратегии всех 46 команд. Поэтому, как и в прошлом году, участником пришлось писать стратегии на языке Lua. По появившейся в прошлом году хорошей традиции, в каждом классе, в котором писали соревнование участники, был включен телевизор или проектор, на котором постоянно по циклу показывались последние игры, прошедшие на сервере жюри. Это позволяло участникам быстрее и проще адаптировать свои стратегии под изменения стратегий соперников. Более того, каждый участник мог даже скачать решения всех других участников в любой прошедшей игре, и запустить их локально в любых желаемых конфигурациях.\u003c/p\u003e\u003cp\u003eПравила игры были довольно простые. У каждого игрока есть пылесос, который ездит по полю, и своя территория. Когда пылесос ездит вне своей территории, он оставляет за собой хвост. Если пылесос замыкает свой хвост, вернувшись на свою территорию, тогда все клетки замкнутого контура переходят к нему. Если в хвост пылесоса кто-либо врезается, то игрок умирает: его пылесос, хвост и территория исчезают. Поле циклически замкнуто по горизонтали и вертикали. В качестве очков игрока бралась максимальная достигнутая в течение игры площадь своей территории, к тому же был бонусный множитель за убийства.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.youtube.com/watch?v\u003daBMQuWy3sUM\"\u003eВидео одной игры финального тестирования\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"Игровое поле\" src\u003d\"/predownloaded/bb/59/bb59b8cec343e0741be669d60abffdf39f89da3a.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eСейчас по задаче можно скачать:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003e\u003ca href\u003d\"https://yadi.sk/d/iaQ6TzND3PqDgK\"\u003eИсходные коды игры\u003c/a\u003e. Для сборки нужны CMake и Qt, но дорогу осилит идущий \u003d)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca href\u003d\"https://yadi.sk/d/Pz2_yrIL3Podsq\"\u003eОригинальные материалы\u003c/a\u003e. Этот архив выдавался участникам на соревновании. В нём есть в том числе полное условие задачи и виндовые бинарники. Если визуализатор сходу не запускается, советуем собрать из исходников.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003e.\u003c/p\u003e\u003cp\u003e.\u003c/p\u003e\u003cp\u003eНемного фото с места проведения:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"Игра и котики\" src\u003d\"/predownloaded/ac/da/acdaf3bfdf86cf46b8b8c5cf653d7eb01fac3dbb.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"Обсуждение после конца тура\" src\u003d\"/predownloaded/8a/2d/8a2d2bb94a0d3c1312403e2b6e8e01cd9ac5490c.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["всесибирская","lua","игра"]}}