{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1473317397,"rating":3,"authorHandle":"Anonymous_rush","modificationTimeSeconds":1473317397,"id":47007,"title":"\u003cp\u003eCan AnyOne Give me Some idea how to solve this Problem? I am new to DP Problem. (Light Oj -1031- Easy Game)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eYou are playing a two player game. Initially there are n integer numbers in an array and player A and B get chance to take them alternatively. Each player can take one or more numbers from the left or right end of the array but cannot take from both ends at a time. He can take as many consecutive numbers as he wants during his time. The game ends when all numbers are taken from the array by the players. The point of each player is calculated by the summation of the numbers, which he has taken. Each player tries to achieve more points from other. If both players play optimally and player A starts the game then how much more point can player A get than player B?\u003c/p\u003e\u003cp\u003eInput\u003c/p\u003e\u003cp\u003eInput starts with an integer T (≤ 100), denoting the number of test cases.\u003c/p\u003e\u003cp\u003eEach case contains a blank line and an integer N (1 ≤ N ≤ 100) denoting the size of the array. The next line contains N space separated integers. You may assume that no number will contain more than 4 digits.\u003c/p\u003e\u003cp\u003eOutput\u003c/p\u003e\u003cp\u003eFor each test case, print the case number and the maximum difference that the first player obtained after playing this game optimally.\u003c/p\u003e\u003cp\u003eSample Input\u003c/p\u003e\u003cp\u003e2\u003c/p\u003e\u003cp\u003e4\u003c/p\u003e\u003cp\u003e4 -10 -20 7\u003c/p\u003e\u003cp\u003e4\u003c/p\u003e\u003cp\u003e1 2 3 4\u003c/p\u003e\u003cp\u003eOutput for Sample Input\u003c/p\u003e\u003cp\u003eCase 1: 7\u003c/p\u003e\u003cp\u003eCase 2: 10\u003c/p\u003e\u003c/div\u003e","tags":[]}}