{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1430774397,"rating":30,"authorHandle":"FerranAlet","modificationTimeSeconds":1430775156,"id":17715,"title":"\u003cp\u003eTSP in a \u0027segment graph\u0027 where 2-opt seems ineffective\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/mariabauza\" title\u003d\"Expert mariabauza\"\u003emariabauza\u003c/a\u003e and I are trying to do the Travelling Salesman Problem in a segment graph (for a real life application, it\u0027s not a CP problem): you are given 10-100 segments in the plane you have to color (go through), give the shortest path to color them all.\u003c/p\u003e\u003cp\u003eFor example, here are 2 possible paths (in red) for the same segments, one shorter than the other.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/c8/e0/c8e0d0b362f6777ebd112746e3b9ad0bafca5d9b.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/54/de/54de63bfc66e62f4a40167707edb3005b79be2d9.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eTo do it we use the \u003ca href\u003d\"http://en.wikipedia.org/wiki/2-opt\"\u003e2-opt algorithm\u003c/a\u003e we learned in \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Legendary grandmaster Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e\u0027s \u003ca href\u003d\"http://hamiltonianplumber.appspot.com/\"\u003eblog\u003c/a\u003e. There he explains that the 2-opt algorithm works very well, finding the best solution in very few tries. However, with only those 5 (random) segments it only finds the optimal solution 26% of the time after 400 restarts (finding only local minimums during 400 tries, 74% of the time).\u003c/p\u003e\u003cp\u003eDo you think the algorithm may not be as effective for the fact we are now dealing with segments and not points? Or are you sure the algorithm should work almost perfectly and we must have some bug? (We have looked our code thoroughly before posting here, but you never know) Can it be slightly modified to work better in this kind of graph?\u003c/p\u003e\u003cp\u003eFinally, we know that we can develop TSP algorithms for Euclidean graphs, but the only one we know (using the MST) doesn\u0027t quite apply when dealing with segments. Do you know/can you come up with any other algorithm that could help?\u003c/p\u003e\u003cp\u003eThanks!\u003c/p\u003e\u003c/div\u003e","tags":["tsp","2-opt"]}}