{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1481292497,"rating":125,"authorHandle":"gKseni","modificationTimeSeconds":1481304399,"id":48962,"title":"\u003cp\u003eFabby — приложение для обработки изображений с помощью нейросетей от олимпиадников\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eСлышали про запуск приложения по обработке изображений \u003ca href\u003d\"https://itunes.apple.com/by/app/fabby-photo-picture-editor/id1147967413?mt\u003d8\"\u003eFabby\u003c/a\u003e (iOS)? Там не обошлось без рук олимпиадников! \u003c/p\u003e\u003cp\u003eНейросети обрабатывают изображения на самом девайсе. \u003ca href\u003d\"https://roem.ru/08-12-2016/237844/fabby-launch/\"\u003eПо словам команды\u003c/a\u003e, у них это сделать будет проще, чем в Prisma или MSQRD, которые тоже позволяют редактировать снимки.\u003c/p\u003e\u003cp\u003e\u003ciframe allowfullscreen\u003d\"\" frameborder\u003d\"0\" height\u003d\"480\" src\u003d\"//vk.com/video_ext.php?oid\u003d3240642\u0026amp;id\u003d456239038\u0026amp;hash\u003dd7afc62fc5a8d522\u0026amp;hd\u003d2\" width\u003d\"853\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003cp\u003eЛюдям нравится — Юрий \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Ra16bit\" title\u003d\"Grandmaster Ra16bit\"\u003eRa16bit\u003c/a\u003e Писарчик, член команды Fabby, пишет на страничке Вконтакте:\u003c/p\u003e \u003ccenter\u003e\u003cimg src\u003d\"/predownloaded/ac/fd/acfd0bc9124f7ec0f9108f827d3a86ba2370ef3e.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/center\u003e\u003cp\u003eПочитайте, что он рассказал мне о проекте:\u003c/p\u003e\u003cp\u003e— \u003cem\u003eПоздравляю с запуском! Видео с котиками очень крутое. Жду выхода приложения на андроид. Теперь не надо будет вырезать себя в фотошопе вручную, чтобы пошутить над друзьями, что я куда-то уехала ;) А с какой мыслью вы начинали проект?\u003c/em\u003e\u003cbr /\u003e— Спасибо за поздравление! Я присоединился к стартапу \u003ca href\u003d\"http://www.aimatter.com/\"\u003eAimatter\u003c/a\u003e, спустя пару месяцев после его основания. Я как раз тогда искал, чем бы интересным и новым заняться, и меня привлекло то, что эта компания занимается технологиями на основе нейронных сетей.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eПочему выбрали нейронные сети?\u003c/em\u003e\u003cbr /\u003e— Эта тема выглядит сейчас очень перспективной, потому что вычислительные мощности GPU возросли в достаточной степени, чтобы тренировать глубокие сети. И параллельно с этим учёные публикуют много интересных работ, связанных с их применением к различным прикладным задачам. В общем, сложилось впечатление, что нейронные сети в ближайшие годы позволят решать многие задачи, к которым сложно подступиться с помощью алгоритмов и классического машинного обучения. А начать мы решили с применения их к computer vision, в частности для задач стилизации фото и выделения контура человека на портретной фотографии.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eПроект дошел до выпуска целиком в том виде, в каком задумывалось?\u003c/em\u003e\u003cbr /\u003e— Разработку проекта здесь можно разделить на две смысловые части: технологическую и продуктовую. \u003c/p\u003e\u003cp\u003eЧто касается технологий, то да, мы зафиксировали перед собой две главный задачи: выделение контура человека и перенос стиля, и совершенствовали их все эти месяцы, чтобы получить действительно качественный результат. Кроме нейронных сетей, нам понадобилось применить и некоторые алгоритмы классического computer vision, и даже решать дифференциальные уравнения.\u003c/p\u003e\u003cp\u003eА вот продуктовая часть сильно менялась по ходу разработки. Постоянно появлялись новые идеи, а также отбрасывались некоторые старые, которые со временем стали казаться не столь удачными. Также надеемся через несколько недель выпустить версию, которая работает не только с фотографиями, но и с видео — первоначально мы как раз больше на видео ориентировались.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eНавыки, приобретенные на олимпиадах по программированию, пригодились?\u003c/em\u003e\u003cbr /\u003e— Олимпиадные навыки пригодились, причём, что удивительно, с самого первого дня: как часть эксперимента, мне надо было реализовать один из часто встречающихся на контестах алгоритмов. Так как у нас в приложении всё выполняется на телефоне, а не на сервере, то крайне важно писать код так, чтобы он и быстро работал и соответствовал строгим ограничениям на потребляемую память. А ещё пришлось вспомнить и реализовать кое-что из линейной алгебры и мат. анализа с первых курсов универа.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eВ команде еще есть олимпиадники?\u003c/em\u003e\u003cbr /\u003e— Из олимпиадников, кроме меня, у нас работают \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/aropan\" title\u003d\"Grandmaster aropan\"\u003earopan\u003c/a\u003e и \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/Tkach1024\" title\u003d\"Specialist Tkach1024\"\u003eTkach1024\u003c/a\u003e, которые также ежегодно организуют чемпионат БГУИР, а также \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/kostya_by\" title\u003d\"Grandmaster kostya_by\"\u003ekostya_by\u003c/a\u003e (он был в команде БГУ на финале ACM ICPC 2016 года, а также взял серебро на IOI 2013). У меня и \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/aropan\" title\u003d\"Grandmaster aropan\"\u003earopan\u003c/a\u003e были медали на IOI 2008 и ACM ICPC 2012. И ещё несколько людей, которые работали над проектом, сейчас уже не пишут или редко пишут контесты, но имеют олимпиадное прошлое. Среди бывших олимпиадников, кстати, и тимлид команды разработки Сергей \u003ca href\u003d\"https://www.topcoder.com/members/P_YegreS_P\" style\u003d\"color: rgb(199,107,213);\"\u003eP_YegreS_P\u003c/a\u003e Писарчик, и основатель проекта Юрий \u003ca href\u003d\"https://www.topcoder.com/members/What1\" style\u003d\"color: rgb(199,107,213);\"\u003eWhat1\u003c/a\u003e Мельничек. Но понятное дело, что среди разработчиков у нас не только олимпиадники. Например, написание самого мобильного приложения или кода для GPU, над этим уже работали ребята с соответствующим опытом.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eУчастники IOI этого года посмотрят и воодушевятся твоим примером. Поищешь фотографий?\u003c/em\u003e\u003cbr /\u003e— Хорошо, только у нас не много фоток, таких, чтобы большая часть команды на них присутствовала. \u003c/p\u003e\u003cp\u003e— \u003cem\u003eХм. А вы думали насчет объединения людей с нескольких фотографий? :)\u003c/em\u003e\u003cbr /\u003e— В таком направлении особо не думали. Вот есть такая, это в офисе в сентябре.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/e7/aa/e7aa9bf85e418d6a132a8799724221ce2fe62725.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003eСлева направо: Полина Ковальчук, Юрий Писарчик, Александр Баранов, Роман Сорокин, Матвей Жданович, Сергей Писарчик, Андрей Кулик (в оранжевом), Андрей Ткаченко, Валентин Базаревский, Константин Сокол и Дмитрий Пылило\u003c/small\u003e\u003c/center\u003e\u003cp\u003eИ есть ещё такая вот, это мы летом ездили в Хорватию пописать код на берегу моря 10 дней.Тогда наша команда была чуть меньше.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/a9/d1/a9d193f7a8074a93e3e6f6c06a50e9b349d6659b.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003eСлева направо: Николай Чирков, Сергей Писарчик, Юрий Писарчик, Дмитрий Пылило, Алексей Ропан, Андрей Ткаченко, Юрий Мельничек, Игорь Кибальчич\u003c/small\u003e\u003c/center\u003e\u003cp\u003e— \u003cem\u003eО, круто! И каково работалось в таких условиях?\u003c/em\u003e\u003cbr /\u003e— Отлично, мы все жили в одном большом съёмном коттедже, поэтому работали даже больше обычного. Но каждый день обязательно ходили поплавать в море — иногда несколько раз. А также катались на велосипедах и на катере, в общем было весело.\u003c/p\u003e\u003cp\u003eПоездка в Хорватию действительно очень сплотила команду, а также помогла мне быстро влиться в коллектив, потому что я тогда только присоединился к работе над проектом.\u003c/p\u003e\u003cp\u003e— \u003cem\u003eПланы на будущее — видео, андроид... Еще есть мысли?\u003c/em\u003e\u003cbr /\u003e— Сейчас основным видится реал-тайм обработка видео, версия под андроид и обучить сеть сегментировать не только людей. Иногда по ходу дела к нам приходят новые идеи, тогда мы экспериментируем ещё и с ними.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eP.S.\u003c/strong\u003e: Это уже \u003ca href\u003d\"http://ain.ua/sdelka-goda-snapchat-kupil-odesskij-startap-looksery-za-150-mln\"\u003eвторой стартап по обработке изображений от олимпиадников\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news","стартап"]}}