{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1465719255,"rating":43,"authorHandle":"Nickolas","modificationTimeSeconds":1466089150,"id":45379,"title":"\u003cp\u003eA lightning Marathon before TCO16 NYC regional event\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIf you like Marathons but don\u0027t have two weeks to dedicate to participation in a typical match, consider taking a look at the match that will run for 28 hours right before the TCO16 NYC regional event. The coding phase will start on Thursday, June 16 at 8:00 a.m. EDT (\u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dNYC+regional+event+Marathon\u0026amp;iso\u003d20160616T08\u0026amp;p1\u003d179\"\u003ein your time zone\u003c/a\u003e) and end on Friday, June 17 at Noon EDT (\u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dNYC+regional+event+Marathon+end\u0026amp;iso\u003d20160617T12\u0026amp;p1\u003d179\"\u003ein your time zone\u003c/a\u003e). It will be a rated event featuring a somewhat easier than usual problem (I am the writer ;-)) and following the usual Marathon rules (apart from the shorter duration).\u003c/p\u003e\u003cp\u003eAnd if you happen to live in New York area, consider not only participating in the Marathon but stopping by at the \u003ca href\u003d\"https://tco16.topcoder.com/regional-events/nyc-usa/\"\u003eTCO16 NYC regional event\u003c/a\u003e at the Google office afterwards: top participants of this match who will be present at the event will get prizes! Nothing as spectacular as a trip to TCO16 finals, I\u0027m afraid, but I hear it\u0027s something quite special :-)\u003c/p\u003e\u003cp\u003eEveryone can participate in the match, but to get the prize you have to be present at the NYC regional event.\u003c/p\u003e\u003cp\u003eUPD: NYC Lightning Round \u003ca href\u003d\"https://community.topcoder.com/longcontest/?module\u003dViewProblemStatement\u0026amp;compid\u003d52472\u0026amp;rd\u003d16756\"\u003eColorCapture\u003c/a\u003e is now live.\u003c/p\u003e\u003c/div\u003e","tags":["marathon","topcoder"]}}