{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1434989489,"rating":63,"authorHandle":"allllekssssa","modificationTimeSeconds":1435043884,"id":18796,"title":"\u003cp\u003eYou have free time — read this blog ;)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everybody !\u003c/p\u003e\u003cp\u003eSchool is finished. I am in the village. I don\u0027t have fast internet and I won\u0027t do next competition :(\u003cbr /\u003eBut, I can write new topic with my \u0027potato\u0027 English with no word HELP ( so you can relax and read next part :D ) !\u003c/p\u003e\u003cp\u003eDuring this break I plan to learn a lot of things. First I start with learning C++ . Pascal is great language and help me a lot, but without C++ you can\u0027t do something very fast and good on the competitions (when I had to write some algorithm with graphs (even dfs) or I had to write SET , always i said — NO WAY , GO TO NEXT TASK ). Now I will change it and no more crying for bad results :)\u003c/p\u003e\u003cp\u003eI also plan to learn many graphs and string algorithms ( now a know 4-5 graphs algo. , KMP and hashing ( everything harder I do with hashing), also I know trie but it wasn\u0027t necessary to coding it on any contest ). Normally I plan to do every competition on the summer :D\u003c/p\u003e\u003cp\u003eWhat will you do during vacation ?\u003c/p\u003e\u003cp\u003eSecond part of this blog is about preparing tasks for contest. \u003c/p\u003e\u003cp\u003eMy friend and I prepared one contest, for me it was very interesting and good experience. I hope you like our problems... Sorry for hard div 2 round, next time I\u0027ll give my best to make better contest. I recived a lot of messages about our contest, many messages were grat, but also I recived some insluts. Please, don\u0027t write me it again :) Everything I do because I love programming and this community, maybe I deserved insults , but you don\u0027t talk about my friends, proffesor and country on that way !\u003c/p\u003e\u003cp\u003eThe last few days I invented many new problems ( I believe I have enough problems for 2 contest ). But I will try with my friend , to come up some very hard problems( D, E div 1), for other problems I think I have enough ideas to devise a daily div 2 contest :D Please give me advice, how I can invent hard problems ( I know it isn\u0027t easy and you must know a lot about programming and contests) , but tell me how did you come up your \u0027famous tasks\u0027 ?\u003c/p\u003e\u003cp\u003eAlso, If you have some impressions of our contests or some intresting problems on codeforces , I like to hear it .\u003c/p\u003e\u003cp\u003eAt the end, I will write one my task ( certainly something like this already exist, but I didn\u0027t see it before) :\u003c/p\u003e\u003cp\u003ePROBLEM 1\u003c/p\u003e\u003cp\u003eYou have plane with n points (-10^6\u0026lt;\u003dXi,Yi \u0026lt;\u003d10^6, n\u0026lt;\u003d10^5). You should draw a line which will contain the most points from this set. Print the number of points on this line. (I didn\u0027t solve this task, but I expect you can find some solution lower than O(n^2)).\u003c/p\u003e\u003cp\u003ePROBLEM 2\u003c/p\u003e\u003cp\u003eYou have plane with n points ( -100\u0026lt;\u003dXi,Yi\u0026lt;\u003d100, n\u0026lt;\u003d50). Find minimum number of lines needed to cover all the points . ( For previous problem I had some solution, but for this I can\u0027t find something normal ).\u003c/p\u003e\u003cp\u003eThanks for reading, sorry for Englsih and solve tasks ;) \u003c/p\u003e\u003cp\u003eP.S. I can add more intresting tasks.\u003c/p\u003e\u003c/div\u003e","tags":[]}}