{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1459240759,"rating":0,"authorHandle":"awaken","modificationTimeSeconds":1459241084,"id":44061,"title":"\u003cp\u003eTCO 2015 Round 1A DIV 1 Problem 1000 Points\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003ePlease help me I have spent two days but still cannot solve this problem:\u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003eProblem Statement\u003c/strong\u003e\u003cbr /\u003e \u003cbr /\u003e You have a weighted bipartite graph. Each partition contains n vertices numbered 0 through n-1. You are given the weights of all edges encoded into a vector  A with n elements, each containing n characters. For each i and j, A[i][j] is \u00270\u0027 if there is no edge between vertex i in the first partition and vertex j in the second partition. Otherwise, A[i][j] is between \u00271\u0027 and \u00279\u0027, inclusive, and the digit represents the weight of the corresponding edge.\u003cbr /\u003e\u003cbr /\u003e A perfect matching is a permutation p of 0 through n-1 such that for each i there is an edge (of any positive weight) between vertex i in the first partition and vertex p[i] in the second partition.\u003cbr /\u003e\u003cbr /\u003e Your goal is to have a graph that does not contain any perfect matching. You are allowed to delete edges from your current graph. You do not care about the number of edges you delete, only about their weights. More precisely, you want to reach your goal by deleting a subset of edges with the smallest possible total weight. Compute and return the total weight of deleted edges in an optimal solution.\u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003eLimits\u003c/strong\u003e\u003cbr /\u003e\u003cbr /\u003e Time limit (s): 2.000\u003cbr /\u003e Memory limit (MB): 256\u003cbr /\u003e Stack limit (MB): 256\u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003eConstraints\u003c/strong\u003e\u003cbr /\u003e\u003cbr /\u003e - A will contain exactly n elements.\u003cbr /\u003e - Each element in A will be n characters long.\u003cbr /\u003e - n will be between 1 and 20, inclusive.\u003cbr /\u003e - Each character in A will be between \u00270\u0027 and \u00279\u0027, inclusive.\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["topcoder open","bipartite"]}}