{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1516581907,"rating":0,"authorHandle":"elena","modificationTimeSeconds":1516581988,"id":57272,"title":"\u003cp\u003eПрограмма экзамена\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПрограмма экзамена по дисциплине «Информатика» для студентов, обучающихся по специальности «Фундаментальная математика и механика», 1 курс \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eЭкзамен проводится в форме компьютерного тестирования; в тест могут быть включены как теоретические, так и практические задания по перечисленным темам. \u003c/p\u003e \u003col\u003e   \u003cli\u003eИнформация и сообщение. Сигнал. Сохранение информации при передаче сообщений. Теорема Котельникова.\u003c/li\u003e   \u003cli\u003eИзмерение информации. Вероятностный и объемный подходы.\u003c/li\u003e   \u003cli\u003eКоды и кодирование. Характеристики кода. Постановка задачи кодирования. Кодирование в отсутствие помех.\u003c/li\u003e   \u003cli\u003eРавномерные и неравномерные коды: сравнительный анализ. Принципы выбора метода кодирования.\u003c/li\u003e   \u003cli\u003eПрефиксное кодирование. Принципы построения префиксного кода Код Шеннона-Фано. Оптимальный код (Хаффмана) и первая теорема Шеннона.\u003c/li\u003e   \u003cli\u003eСпособы обеспечения надежной передачи информации при воздействии помех. Код Хэмминга. Вторая теорема Шеннона\u003c/li\u003e   \u003cli\u003eИнформационные и математические модели.\u003c/li\u003e   \u003cli\u003eСистемы счисления. Преимущества позиционных систем счисления. Причины выбора двоичной системы счисления в качестве машинного представления информации.\u003c/li\u003e   \u003cli\u003eМашинное представление целых и вещественных чисел. Особенности машинного представления чисел и машинной арифметики (в сравнении с двоичной системой счисления)\u003c/li\u003e   \u003cli\u003eМашинное представление текстовой, графической и иной информации\u003c/li\u003e   \u003cli\u003eОсновные этапы развития вычислительной техники. Принципы устройства ЭВМ. Взаимосвязь развития аппаратного и программного обеспечения\u003c/li\u003e   \u003cli\u003eПонятие об операционных системах и прикладном программном обеспечении.\u003c/li\u003e   \u003cli\u003eПонятие о сетях. Локальные и глобальные сети. Топология. Адресация.\u003c/li\u003e   \u003cli\u003eПроцессор. Взаимодействие процессора с оперативной памятью и с внешними устройствами.\u003c/li\u003e   \u003cli\u003eПамять. Классификация памяти.\u003c/li\u003e   \u003cli\u003eПринципы функционирования арифметико-логического и запоминающих устройств.\u003c/li\u003e   \u003cli\u003eМеханизм прерываний. Внутренние прерывания. Внешние прерывания. Порты.\u003c/li\u003e   \u003cli\u003eМашинный язык. Структура машинной команды.\u003c/li\u003e   \u003cli\u003eМашинный язык и ассемблеры.\u003c/li\u003e   \u003cli\u003eМашинный цикл. Принципы выполнения программ в компьютере.\u003c/li\u003e   \u003cli\u003eCISC и RISC – архитектуры. Микропрограммирование. Конвейерная обработка команд.\u003c/li\u003e   \u003cli\u003eЛогические вентили. Сумматор. Мультиплексор и другие схемы.\u003c/li\u003e   \u003cli\u003eЛогические вентили. Хранение информации. Триггеры и защёлки.\u003c/li\u003e   \u003cli\u003eОбработка информации. Понятие алгоритма. Свойства алгоритма. Алгоритмизация.\u003c/li\u003e   \u003cli\u003eОсновные алгоритмические конструкции: следование.\u003c/li\u003e   \u003cli\u003eОсновные алгоритмические конструкции: ветвление.\u003c/li\u003e   \u003cli\u003eОсновные алгоритмические конструкции: цикл.\u003c/li\u003e   \u003cli\u003eФормализация понятия алгоритма. Вычислительные модели.\u003c/li\u003e   \u003cli\u003eВычислительные модели. Машина Тьюринга, машина Поста, нормальные алгорифмы Маркова: особенности и связь между этими моделями.\u003c/li\u003e   \u003cli\u003eМашина Тьюринга. Тезис Черча. Реализация машины Тьюринга и исполнение программ на машине Тьюринга.\u003c/li\u003e   \u003cli\u003eАлгоритмически разрешимые и алгоритмически неразрешимые задачи. Частично разрешимые задачи. Примеры алгоритмически неразрешимых и частично разрешимых задач.\u003c/li\u003e   \u003cli\u003eКлассы P и NP. Недетерминированные алгоритмы.\u003c/li\u003e \u003c/ol\u003e\u003c/div\u003e","tags":["exam"]}}