{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1486922044,"rating":28,"authorHandle":"SharifAIChallenge","modificationTimeSeconds":1487079123,"id":50385,"title":"\u003cp\u003eSharif AIChallenge 2017\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThis year, for the second year, Students’ Scientific Chapter of computer engineering department at Sharif University of Technology is holding Artificial Intelligence Challenge, the brand new AI competition for university students.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/0d/ee/0dee7f9d3a69780a32f5471d0a6fb5d782af9120.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" width\u003d\"50%\" /\u003e \u003c/center\u003e\u003cp\u003eAs in the previous year, the competition is consisted of two phases: the online phase which goes on from February 3rd to February 17th and the on-site phase which takes place on March 8th and 9th. University students from all over the world can take part in teams of three and compete with other teams from other universities in the specially designed game to put their skills to a test and win a chance at the on-site round. \u003c/p\u003e\u003cp\u003eThe only prior knowledge needed for this competition is familiarity with one of the supported languages: C++, Java and Python. However, a little bit of knowledge in AI or algorithmic thinking may prove to be handy. The registration process is totally free and is open until the end of this phase. \u003c/p\u003e\u003cp\u003eBy the end of online phase, submitted codes of teams would be graded accordingly and top 48 teams will advance to the on-site round, and as the on-site competition starts, the real battle for AI supremacy begins. Not to mention the prizes!\u003c/p\u003e\u003cp\u003eDon’t forget to sign up for the news, blog and the competition itself, on \u003ca href\u003d\"http://aichallenge.sharif.edu\"\u003ehttp://aichallenge.sharif.edu\u003c/a\u003e and follow us on Twitter and Instagram, @AIChallenge!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e: Due to a mistake, the poster uploaded was not final. It has been updated and is now showing the correct dates for registration and finals. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2\u003c/strong\u003e: The registration has been extended until February 22nd. \u003c/p\u003e\u003c/div\u003e","tags":[]}}