{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1487622130,"rating":53,"authorHandle":"DBradac","modificationTimeSeconds":1487622130,"id":50544,"title":"\u003cp\u003eOut of bounds access\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eEveryone has had a bug in their code because of accessing out of array bounds. However, in some cases, the program will run as expected.\u003c/p\u003e\u003cp\u003eI have two examples from today\u0027s contest: problem B — \u003ca href\u003d\"/contest/768/submission/24829988\" title\u003d\"Submission 24829988 by DBradac\"\u003e24829988\u003c/a\u003e problem C — \u003ca href\u003d\"/contest/768/submission/24831518\" title\u003d\"Submission 24831518 by DBradac\"\u003e24831518\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIn both of these problems, I had stupid bugs. For problem B, it\u0027s possible that the argument k of the function is zero and this line\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eif (ind \u003d\u003d f[k-1]) return (int) (n % 2)\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003ewill access \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ef\u003c/i\u003e[ - 1]\u003c/span\u003e which is undefined.\u003c/p\u003e\u003cp\u003eI have found this bug, and after some stress testing locally and on CodeForces, I decided not to resubmit because it seemed fine.\u003c/p\u003e\u003cp\u003eNow, in problem C, I iterated up to 1029 and the value of \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ei\u003c/i\u003e\u003c/span\u003e \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003exor\u003c/i\u003e\u003c/span\u003e \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ex\u003c/i\u003e\u003c/span\u003e can become larger than the size of the array. However, this is only an issue if that piece of memory is not used by the process and it will result in seg fault.\u003c/p\u003e\u003cp\u003eOtherwise, nothing will be changed because we add zero.\u003c/p\u003e\u003cp\u003eI only found this bug while I was trying to hack someone else\u0027s solution so I couldn\u0027t resubmit and I was pretty sure it was going to fail system tests because locally it resulted in seg fault for some cases.\u003c/p\u003e\u003cp\u003eTo my surprise, both submissions were actually successful, and my F failed (but that\u0027s irrelevant to this post xD) My question is this: what do you usually do when you find a bug like this during the contest and do you stress test your solutions before submitting to prevent it?\u003c/p\u003e\u003c/div\u003e","tags":[]}}