{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1421949655,"rating":9,"authorHandle":"kostya_by","modificationTimeSeconds":1422083700,"id":15951,"title":"\u003cp\u003eЛицейские тренировки 2015. Анонс.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eТрудно в это поверить, но до республиканской олимпиады осталось очень мало наших с вами занятий. Связано это с тем, что сперва я буду отсутствовать довольно продолжительный промежуток времени(29 января — 10 февраля) в Петрозаводске, а затем многие из вас поедут в Москву на серию мероприятий(ЗКШ, очный этап открытой олимпиады). До воскресения я постараюсь составить более-менее внятное расписание и план действий на период подготовки к республиканской олимпиаде.\u003c/p\u003e\u003cp\u003eВ прошлую пятницу состоялся разбор задач областной олимпиады. Те, кто не смог прийти, но хочет разобраться с некоторыми из задач, могут посмотреть электронную версию разбора(\u003ca href\u003d\"http://oi-minsk.id1945.com/city/explain.pdf\"\u003eссылка\u003c/a\u003e).\u003c/p\u003e\u003cp\u003eЗавтра у нас будет небольшое занятие(причиной является тот факт, что у меня на субботу запланирован последний экзамен в БГУ), которое будет состоять из разбора задач заочного этапа открытой олимпиады(\u003ca href\u003d\"https://olympiads.ru/zaoch/2014-15/zaoch/statements-20141224.pdf\"\u003eссылка на условия\u003c/a\u003e), а также разбор задач на деревья, которые вы можете найти в полном списке задач(\u003ca href\u003d\"https://docs.google.com/document/d/1cHQGm3TcsdnTsPWRLejr2oSWb7JMAm6TKQiSZNOi28g/edit#heading\u003dh.ym2vsdft1pj2\"\u003eссылка\u003c/a\u003e, тринадцатая неделя). В частности, у меня есть классное решение на задачу F с заочного этапа, которым я хочу с вами поделиться.\u003c/p\u003e\u003cp\u003eВ связи с тем, что занятий осталось не так много, многократно возрастает важность написания мне личных писем/сообщений в ситуациях, когда вы в чем-то не можете разобраться или что-то решить. Например, будучи в Петрозаводске, я не смогу проводить занятия в лицее, а отвечать на ваши замечательные вопросы, присланные мне на почту или в Skype смогу. Так что советую вам не терять свой шанс что-то у меня спросить, если в этом есть такая необходимость. Напоминаю свои контакты: почта \u003ca href\u003d\"mailto:kostya.sokol.by@gmail.com\"\u003ekostya.sokol.by@gmail.com\u003c/a\u003e, Skype: kostya-by.\u003c/p\u003e\u003cp\u003eВсем удачи!\u003c/p\u003e\u003cp\u003eКонстантин Сокол\u003c/p\u003e\u003c/div\u003e","tags":["лицей бгу","тренировки","анонс"]}}