{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1418051209,"rating":0,"authorHandle":"NoCakeNoCode","modificationTimeSeconds":1418051209,"id":15074,"title":"\u003cp\u003eOnline Judge TLE \u0026amp; MLE Implementation?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eGreetings\u003c/p\u003e\u003cp\u003eFirst I would like to say thanks to those answered my previous blog, their answers were very helpful. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/59/46/594660fba7303df62eb81b880942522150c4884c.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eNow.. in short I\u0027m making an online judge as a graduation project and so far I have finished almost everything except for one last hurdle which is handling TLE and MLE. \u003cstrong\u003eMy priority right now is TLE\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSandbox Server Details:\u003c/strong\u003e \u003cbr /\u003e - Ubuntu 12.04 LT 64-bit\u003cbr /\u003e - Using XAMPP\u003cbr /\u003e - Using AppArmor\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eSo , what I\u0027m doing right now is basically get the source code from a post request and then I proceed to compile and run it using exec and shell_exec commands respectively, everything is working fine so far however I can\u0027t figure out how to implement \u003cstrong\u003eTLE\u003c/strong\u003e handling mechanism.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eRight now I\u0027m testing out some methods to accomplish TLE and to do so I\u0027m running a C program to print out numbers from 1 to 250,000 so.. \u003cstrong\u003ethings I have tried\u003c/strong\u003e :\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e1- Using timeout command \u003ca href\u003d\"http://manpages.ubuntu.com/manpages/precise/man1/timeout.1.html\"\u003ehttp://manpages.ubuntu.com/manpages/precise/man1/timeout.1.html\u003c/a\u003e It works and kills the process after 1 second when I run it on the terminal just fine and the last number it outputs is about 32k however when I use it within shell_exec() it gives me complete output without killing the process.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e2- Using some sleep command associated with a kill $! process , same result as above.\u003cbr /\u003e 3- Changing daemon user to my current user (as I thought it could be a permission issue), same result as above.\u003cbr /\u003e 4- Disabling AppArmor and restarting , same result as above.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eI also googled a lot, I even skipped meals for it believing \u0026quot;I WILL FIND IT AT THIS VERY NEXT MOMENT!\u0026quot; but I can\u0027t seem to figure it out....I really don\u0027t want users to nuke infinite loops on the server so......help x_X\u003c/p\u003e\u003c/div\u003e","tags":["php","ubuntu","tle","time limit exceeded","mle","memory limit"]}}