{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1422363469,"rating":8,"authorHandle":"Nooor","modificationTimeSeconds":1422363469,"id":16050,"title":"\u003cp\u003eHow to write a safe/platform-independent code\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHey codeforces, I have two issues and I need your help in them :\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eLast round \u003ca href\u003d\"//codeforces.com/blog/entry/15930\"\u003eCodeforces Round #287 (Div. 2)\u003c/a\u003e I faced such an odd issue, I solve the first problem and I submit it, luckily \u003ca href\u003d\"//codeforces.com/contest/507/submission/9519933\"\u003emy code\u003c/a\u003e has passed the pretests, then during the system test my code failed at case 30, since the problem A was such an easy, unmistakable problem, I opened the test cases to see where did my code fail, I found that, my code print a 67 elements which actually more than the whole input (whereas the problem was to select some elements from input) . I work on Code::Blocks IDE, which has \u003ccode\u003eg++\u003c/code\u003e compiler, and submit my code at \u003ccode\u003eGNU G++ 4.9.2\u003c/code\u003e compiler on codeforces as I always do, I revised my code, and make sure it\u0027s totally correct, I tried to \u003ca href\u003d\"//codeforces.com/contest/507/submission/9531086\"\u003esubmit it again\u003c/a\u003e at \u003ccode\u003eMicrosoft visual C++ 2010\u003c/code\u003e, and it got AC . Could anyone explain what happened ?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eI tried to solve \u003ca href\u003d\"//codeforces.com/problemset/problem/445/B\"\u003eB. DZY Loves Chemistry\u003c/a\u003e and almost I have the same problem above, my computer correctly produces answers and I got WA on test 4, here is my \u003ca href\u003d\"//codeforces.com/contest/445/submission/9571892\"\u003esubmission\u003c/a\u003e . I debugged my code and checked the array each step I modified it, and all went right, I tried to submit it at another compiler but it still gets WA on test 4, I roughly made sure that, my algorithm/code were absolutely right, but couldn\u0027t realize why that happens \u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eAny tips, tricks, and notes would be appreciated, and I\u0027d be so grateful if someone elaborates what exactly happens to evade it in the next times. Thanks in advance codeforces :\u0026quot;) \u003c/p\u003e\u003cp\u003e(sorry for bothering but I don\u0027t post this, till I ran out of my all attempts to figure out what\u0027s going on in these issues)\u003c/p\u003e\u003c/div\u003e","tags":["safe-code","independent-code"]}}