{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1424128186,"rating":61,"authorHandle":"Zlobober","modificationTimeSeconds":1424129028,"id":16448,"title":"\u003cp\u003eBMSTU Code Cup\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПару дней назад группа мехмата МГУ в контакте репостнула некоторую запись (оригинал — \u003ca href\u003d\"https://vk.com/wall-64913393_2182\"\u003eздесь\u003c/a\u003e)\u003c/p\u003e\u003cp\u003eСодержание записи следующее:\u003c/p\u003e \u003cblockquote\u003e Мы поздравляем тех, кто успешно сдал сессию и замечательно провёл каникулы и тех, кто закрыл очередной семестр в Техносфере. Надеемся, что все успели отдохнуть, а сейчас предлагаем поразмяться!\u003cbr /\u003e  В преддверии олимпиады по спортивному программированию Russian Code Cup 2015 лаборатория Технопарка при поддержке MailRu Group объявляет о проведении первого в истории мини-чемпионата BMSTU Code Cup и приглашает всех желающих принять участие!\u003cbr /\u003e  Квалификационный раунд состоится 22 февраля в 12:00 по Московскому времени.  Вас ждёт три задачи, лучшие 20 попадут в финал и будут бороться за первое место. Финал состоится в тот же день через 2 часа после окончания квалификационного раунда и будет состоять из двух задач. \u003cbr /\u003e  Победитель, занявший первое место, получит денежный приз в размере 15000 руб. Второе и третье места — 10000 и 5000 рублей соответственно.\u003cbr /\u003e  Регистрируйтесь на участие в чемпионате на \u003ca href\u003d\"http://rcc.tech-mail.ru\"\u003ehttp://rcc.tech-mail.ru\u003c/a\u003e \u003c/blockquote\u003e\u003cp\u003e\u003cimg alt\u003d\"Картинка из поста\" src\u003d\"/predownloaded/de/16/de16b6bbacfc6d8768c3e372c9824c34ee78a44a.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eНа первый взгляд, обычная новость о локальном соревновании МГТУ им. Баумана, если бы вот ссылка не вела на сайт, не отличимый от сайта Russian Code Cup. Насколько я могу судить, по этому адресу располагается какая-то дикая мешанина из информации, относившейся к RCC, и информации, относящейся к этому соревнованию (например, время квалификации и финала на BMSTU Code Cup). Например, по ссылке \u0026quot;правила\u0026quot; открываются правила RCC.\u003c/p\u003e\u003cp\u003eБолее того, насколько я могу видеть, никакой информации об этом соревновании в сети нет кроме двух следующих постов ВК (доступны в том числе незалогиненным в соцсеть): \u003ca href\u003d\"https://vk.com/wall-64913393_2182\"\u003eпост1\u003c/a\u003e, \u003ca href\u003d\"https://vk.com/wall-45881160_6374\"\u003eпост2\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eК первой записи в комментариях резонно указывают, что время не самое удачное — в этот же день в то же время проходит OpenCup, гран-при Удмуртии. На что, видимо, кто-то из организаторов (надо сказать, слегка невпопад) отвечает, что в это же время могут быть и региональные олимпиады по программированию, и это дело каждого — выбирать, в чём участвовать.\u003c/p\u003e\u003cp\u003eВозникают вопросы. Действительно ли это доступное для всех мероприятие, в котором может участвовать любой желающий? Если да, то работа по доведению информации о соревновании до аудитории проделана на твёрдую двойку: в сети ни одного упоминания об BMSTU Code Cup, нормальных правил — не найти (только относящиеся к RCC, что явно не актуально), время действительно выбрано не самое удачное.\u003c/p\u003e\u003cp\u003eНепонятно, только ли студенты могут участвовать в этом добре, или все желающие? Если да, то каких вузов?\u003c/p\u003e\u003cp\u003eЕсли же это какой-то закрытый междусобойчик, то тогда непонятно, как это соотносится с \u0026quot;преддверием к RCC\u0026quot;, и зачем говорить, что приглашаются все желающие.\u003c/p\u003e\u003cp\u003eКто-нибудь знает что-нибудь об этом соревновании?\u003c/p\u003e\u003c/div\u003e","tags":["bmstu code cup","rcc","opencup"]}}