{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1511111175,"rating":3,"authorHandle":"himanshukumar660","modificationTimeSeconds":1511111603,"id":55896,"title":"\u003cp\u003eClarification for the question Marco and GCD Sequence in Codeforces Round #447 (Div. 2)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Users,\u003c/p\u003e\u003cp\u003eI had one thing to be clarified and that is related to the question in todays contest #447 (Div. 2). In the question \u003cstrong\u003eMarco and GCD Sequence\u003c/strong\u003e we had to print a final sequence.So, the method i employed for finding the sequence was as followed: \u003c/p\u003e\u003cp\u003eSince i know that \u003ccode\u003e1 ≤ i ≤ j ≤ n\u003c/code\u003e so, that means that the given set includes all the elements from my original sequence, in addition to that the set also includes all the gcd\u0027s obtained for different values for i and j. Thus, i ran a for loop that \u003c/p\u003e \u003cpre\u003e\u003ccode\u003e    for(int i\u003d0;i\u0026lt;n;i++)\n    {\n        if(mv[i]!\u003d0) //just for optimisation, mv(an vector) is the given set\n        for(int j\u003di+1;j\u0026lt;n;j++)\n            {\n                if(hash[gcd(mv[i],mv[j])]!\u003d1) //A hash for finding that if gcd of two numbers doesn\u0027t exist than i would return -1\n                {\n                    cout\u0026lt;\u0026lt;-1\u0026lt;\u0026lt;endl;\n                    return 0;\n                }\n                else\n                     mv[j] \u003d 0;              \n            }\n    }\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eNow if the set contains all the numbers in which for every pair of element a gcd exists in that set, than i would just be printing the original set given to me at the output. After submission, i find that my solution gives an error for \u003cstrong\u003etest case 15\u003c/strong\u003e which says \u003ccode\u003ewrong answer Integer 3021 does not appear in the set, but is produced by the sequence.\u003c/code\u003e. But how is that possible when i am printing the same set given to me at the output. Any kind of help will be appreciated. Thanks in advance. Here is the link to my submission : \u003ca href\u003d\"//codeforces.com/contest/894/submission/32477988\"\u003ehttp://codeforces.com/contest/894/submission/32477988\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codeforces #447","math"]}}