{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1466246686,"rating":92,"authorHandle":"robin_0","modificationTimeSeconds":1466317170,"id":45506,"title":"\u003cp\u003eMy Funniest Experience \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"https://ipsc.ksp.sk/\"\u003eIPSC\u003c/a\u003e is back again after a year. And on the eve of IPSC I can\u0027t forget a memory I made participating in IPSC. Last year I participated in IPSC for the first time. I had just started competitive programming for a while and when I was still in a juvenile state IPSC came. So I did participated in it. This brought such a funny memory in my life I can\u0027t ever forget :v \u003c/p\u003e\u003cp\u003eUnfortunately I am not from CS background so I didn\u0027t know much about algorithms and complexities back then :/ (which I still don\u0027t know much about :3 ) . And this lack of knowledge gave me that experience :V .\u003c/p\u003e\u003cp\u003eSo when I was solving the problems , the first problem was a greedy one and it was easy to solve. But when I was solving the 2nd problem , I being completely novice wrote an O(n^3) algorithm or what I can\u0027t remember properly to solve it.Now for the easy sub problem n was \u0026lt;\u003d50 so it was done in the blink of an eye. Now the funny part came when it was for the hard sub problem . For the hard sub problem n was \u0026lt;\u003d10000. \u003c/p\u003e\u003cp\u003eBut being unaware of time complexities and thinking to myself \u0026quot;Hey it\u0027s not constrained to 1 sec so who cares. How long is it going to take at most maybe 1 minutes or 2. Still no big deal\u0026quot; :V\u003c/p\u003e\u003cp\u003eSo I being confident started executing my code and thought of waiting for a minute or two. \u003c/p\u003e\u003cp\u003eBut 3 minutes passed ... 5 minutes passed ... 10 minutes passed ... 30 minutes passed ... 1 hour passed.\u003c/p\u003e\u003cp\u003eStill my code wasn\u0027t done executing :3 \u003c/p\u003e\u003cp\u003eNow the contest time was going away and I was waiting and waiting. Then I was wondering \u0026quot; This is why in movies we see hackers with so many computers \u0026quot;. On that time I was hoping to have another pc to solve other problems. And I can remember that I was so much motivated to solve I even tried to solve the easy sub problem of another problem by hand :v .\u003c/p\u003e\u003cp\u003eAfter 5 hours the contest was over but still my code was running and running :v Being completely annoyed I terminated it :v \u003c/p\u003e\u003cp\u003eLater I learnt my mistake but still whenever I hear something about IPSC I can\u0027t get the memory of that day out of my mind :v\u003c/p\u003e\u003cp\u003eI don\u0027t know in which way my life will go , in which direction my problem solving career will go. But one thing for sure I\u0027ll never forget this day :v \u003c/p\u003e\u003cp\u003eThank you for reading this long post , I derived pleasure sharing this with you :)\u003c/p\u003e\u003c/div\u003e","tags":["ipsc","funny"]}}