{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1404572430,"rating":108,"authorHandle":"Swistakk","modificationTimeSeconds":1404574168,"id":12950,"title":"\u003cp\u003eIMO vs IOI\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi. Both of those great competitions for high school are upcoming, so this may be a good time to discuss about them and probably make some comparisons.\u003c/p\u003e\u003cp\u003eFirstly, some backstory of my experiences (if you will get bored you can jump to next paragraph :P). When I was in high school I was definitely much more mathematician than algorithmist, I was doing math for my whole life but started algorithmics in high school. I considered algo as a very interesting field and devoted it much time, but math was for me more important and I was simply better at it. I took top spots in math contests when I couldn\u0027t perform well in any algorithmic contest (it was a very often case for me that I solved problem, but received very little points, because of some bugs, because in POI there was very little feedback). In my last year in high school I managed to qualify to the IMO (it would have been a tragedy for me if I wouldn\u0027t have make it) and also to the IOI, which was a big surprise for me. At IMO I did very well in 1st day, but on 2nd day I messed some cases in one problem and got completely stuck in a geometry problem for sth like 3h. Up to high school, I think that I devoted more time to geometry alone than to algorithmics and couldn\u0027t solve problem, which was solved by ~100 other contestants. I was really confident about my math skills and I got an impression like I\u0027m surrounded by loads of really outstanding geniuses (not to mention Teodor Von Burg and Jeck Lim :) ). In final result, despite my really good performance on 1st day, I got 25 pts, 64th place and silver medal. In IOI I solved 3 problems and I considered them as really easy, thought that I didn\u0027t really do anything smart and even more, I messed up bruteforces to problems on 2nd day, because of some childish problems, which could be solved in a second using valgrind/gdb. I got an impression like there were few smart guys on IOI, but most of those people didn\u0027t know really basic stuff. In result I got 360pts, 28th place and silver medal, which was in fact significantly better position than that in IMO, because 28 is much less than 64 and I was just 4/600pts short from gold medal. So comparison of those performances is somehow weird. I was significantly better in math than in algo, on IMO performed rather well (beside receiving 3/7 because of not being careful in functional equation, but that is another long story :P), got stuck on hard problems only and took not that good place, while on IOI I performed not really well, got really stupid bugs, but took much better place. (By the way that is really something weird, but you can go to results of IOI 2012 and find some really outstanding guys, who got really small amount of points, for problem \u0026quot;Rings\u0026quot; which seemed quite easy :P).\u003c/p\u003e\u003cp\u003eAs a conclusion, this might cause some negative feedback, since this is algo site not a math one, but I consider IMO as a much bigger deal than IOI and gold medal on IMO as a significantly bigger achievement than gold medal on IOI. Comparing to CF rating system I think that \u0026quot;rating cut-offs\u0026quot; for IOI medals would be something like 1500/1750/2000, while at IMO it would be something like 1700/2000/2300 if we will treat this as a corresponding math skills to algo skills of people with these ratings. Moreover, on IMO there are often some extremely hard problems, and they are always solved by 10-20 people, while in IOI there are some definitely easier problems which are solved by ~6 people (check Last Supper from IOI 2012). One reason of that is that on IOI you also have to code your solution without a single mistake, but either way it is still a big difference. If you\u0027re disagreeing with me (or agreeing :) ) I invite you to explain your opinion.\u003c/p\u003e\u003cp\u003eBy the way this feeling (in short that IMO \u0026gt;\u0026gt; IOI) was strenghtened by organisations of those events. IMO organisation was really great, we were placed in a really luxury hotel and there were many events like tournaments in a football, table-tennis and many many more, there was a recreation hall where there was a big amount of things to do, karaoke, many games, video games, drums and much more, it is hard to describe how this place was awesome, in short recreation hall \u003d delight overload (and what is most important, I was very surprised by presence of my favorite video game — Pump It Up, you can see me playing here \u003ca href\u003d\"https://fbcdn-sphotos-e-a.akamaihd.net/hphotos-ak-xap1/t1.0-9/46120_4940025175001_299353650_n.jpg\"\u003ehttps://fbcdn-sphotos-e-a.akamaihd.net/hphotos-ak-xap1/t1.0-9/46120_4940025175001_299353650_n.jpg\u003c/a\u003e :D) and IOI organisation was the exact opposite. There were 2 good things on IOI — problems (which is of course the most important thing) and food, but everything else was really bad. There were very little activities we can do, and we were really often forced to wait for an for nothing. Organizers even managed to make a trip to Venice a horrible one, which is a really hard achievement.\u003c/p\u003e\u003c/div\u003e","tags":["imo","ioi"]}}