{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1411412108,"rating":12,"authorHandle":"Michael","modificationTimeSeconds":1411557375,"id":13922,"title":"\u003cp\u003eОткрытое тестирование по программированию ФКН ВШЭ и ШАД\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ начале нового учебного года мы проводили тестирование по программированию наших первокурсников \u003ca href\u003d\"http://cs.hse.ru/\"\u003eфакультета компьютерных наук ВШЭ\u003c/a\u003e в формате контеста на 5 часов. Затем мы проводили на этих же задачах тестирование первокурсников \u003ca href\u003d\"http://shad.yandex.ru/\"\u003eШАДа\u003c/a\u003e этого года, чтобы выделить тех, кому нужно ходить на новый, продвинутый курс алгоритмов. Радует, что за последние годы уровень преподавания Computer Science в некоторых вузах вырос, и есть уже несколько десятков человек, которым можно не слушать наш обычный курс алгоритмов, т.к. они его не только знают, но и могут решать практические задачи.\u003c/p\u003e\u003cp\u003eВсе наши первокурсники протестированы, и теперь мы решили предложить желающим проверить себя, сделав контест открытым. Написать его можно в любой момент по \u003ca href\u003d\"http://contest.yandex.ru/contest/655/enter/\"\u003eссылке\u003c/a\u003e в системе \u003ca href\u003d\"http://contest.yandex.ru/\"\u003eЯндекс.Contest\u003c/a\u003e. Контест виртуальный, продолжительность 5 часов. \u003cstrong\u003eДисклеймер\u003c/strong\u003e: все задачи — баяны, так как цель была проверить знание и умение применять базовые алгоритмы, а не устроить олимпиаду с призами.\u003c/p\u003e\u003cp\u003eМы также публикуем результаты наших первокурсников, чтобы потенциальные абитуриенты, а также студенты других вузов могли сравнить свой уровень с уровнем наших студентов. Конечно, мы публикуем результаты без указания персональных данных, то есть таблица результатов анонимизирована. Замечу, что наши студенты во время написания не могли видеть монитор, то есть не имели подсказок о сложности задач, но мы для простоты расположили задачи по возрастанию сложности.\u003c/p\u003e\u003cp\u003eРезультаты — ниже, но тем, кто хочет честно проверить себя, рекомендую не смотреть их перед участием в соревновании.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://www.hse.ru/ba/ami/test/?__t\u003d1372159\u0026amp;_r\u003d157371411141288.34678\u0026amp;__r\u003dOK\"\u003eРезультаты первокурсников ФКН ВШЭ\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://yadi.sk/d/cHG6byavbc4xD\"\u003eРезультаты первокурсников ШАД\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["фкн","вшэ","шад"]}}