{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1481142166,"rating":15,"authorHandle":"Theodor1000","modificationTimeSeconds":1481377455,"id":48903,"title":"\u003cp\u003eITMO questions\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello! I\u0027m writing this post, hoping that any of you can help me find out some inside information about ITMO university. \u003c/p\u003e\u003cp\u003eI want to study either at a very popular university with a high prestige that will give me a clear advantage at hiring (throughout many other of its advantages), either to a very good university with enough free time scheduled, with very good professors and where I can have the opportunity to ask questions and get answers. Universities like Cambridge, Oxford, MIT fit very well in this typology. From what I have heard, for example, there you can benefit of a very good interactive system so that you can get answers to your questions. \u003c/p\u003e\u003cp\u003eI have recently heard of ITMO. I know that it produced a lot of very good competitive programmers, so, at least in computer science, the theory is taught very well. That\u0027s why I want to know if this university fits in the second type (free time, good professors assigned to a very small group of students), if you are taught other subjects that you won\u0027t need as a software engineer, how much free time you have and what extra-activities does it offer. \u003c/p\u003e\u003cp\u003eI would also want to know, if I consider that this university offers what I want, what are the schooling and accommodation taxes, if it offers scholarships and social aids and what does the application process requires (a language exam and other specific exams for computer science). \u003c/p\u003e\u003cp\u003eAs a summary, I want to know if it worth the effort of learning a new language only to study at this university. Thank you in advance!\u003c/p\u003e\u003c/div\u003e","tags":["itmo","questions"]}}