{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1434992974,"rating":69,"authorHandle":"Michael","modificationTimeSeconds":1435086896,"id":18801,"title":"\u003cp\u003eПроектная работа на факультете компьютерных наук\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eНа \u003ca href\u003d\"http://cs.hse.ru\"\u003eФКН НИУ ВШЭ\u003c/a\u003e я занимаюсь проработкой программы бакалавриата для \u003ca href\u003d\"http://www.hse.ru/ba/ami/\"\u003eПМИ\u003c/a\u003e и курирую проектную работу. Вопрос \u0026quot;стоит ли давать студентам \u0026quot;настоящие\u0026quot; проекты уже с первого года обучения?\u0026quot; стоял перед нами еще на этапе формирования программы. Мы решили, что стоит, и, думаю, не ошиблись. Расскажу о результатах конкурса проектов, который мы провели в конце, и о некоторых проектах участников конкурса. Буду рад, если прокомментируете и расскажете, что происходит в этом направлении в других вузах (в том числе не в России): интересен опыт, который можно применить и у нас.\u003c/p\u003e\u003cp\u003eВсего было примерно 180 студентов, каждый из которых делал один из \u003ca href\u003d\"http://wiki.cs.hse.ru/%D0%9A%D0%B0%D1%82%D0%B5%D0%B3%D0%BE%D1%80%D0%B8%D1%8F:%D0%9F%D1%80%D0%BE%D0%B5%D0%BA%D1%82%D0%BD%D0%B0%D1%8F_%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0\"\u003e53-х\u003c/a\u003e предложенных менторами проектов. Каждый из менторов мог по желанию выдвинуть 1-2 лучших работы из своих студентов (обычно 10 человек на ментора) на конкурс, затем кураторы проектного семинара отобрали 12 финалистов. На самом конкурсе у каждого участника было 7 минут, чтобы изложить суть своего проекта, и несколько минут для ответов на вопросы. В жюри вошли преподаватели факультета, не участвовавшие в проектной работе.\u003c/p\u003e\u003cp\u003eКак прошел финал конкурса — можно посмотреть \u003ca href\u003d\"http://www.youtube.com/watch?v\u003d3cPbHMBJ_9M\"\u003eздесь\u003c/a\u003e, а новость с подробным описанием некоторых из проектов — на \u003ca href\u003d\"http://cs.hse.ru/news/151715219.html\"\u003eсайте факультета\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eОрганизацию конкурса еще будем улучшать, но результаты студентов нас приятно удивили.\u003c/p\u003e\u003cp\u003eПобедитель — Глеб Пособин — начинал делать проект, целью которого было ознакомление с теорией нейронных сетей, а реализовать нужно было персептрон Розенблатта, с возможным последующим развитием. Персептрон у Глеба получился за вечер, так что в итоге он реализовал многослойную (или как сейчас модно говорить глубокую) нейронную сеть и применить ее к реальным данным (известный датасет \u003ca href\u003d\"http://yann.lecun.com/exdb/mnist/\"\u003eMNIST\u003c/a\u003e) для распознавания рукописных цифр на картинках. Глеб также реализовал сверточные нейронные сети, которые особенно хорошо себя проявили в распознавании изображений и не только. Вообще, сейчас это очень горячая тема в науке, т.к. с 2012-го нейросети побеждают все в распознавании изображений, речи, уже в некоторых задачах распознают лучше человека, а недавно с некоторыми оговорками нейросеть научили делать машинный перевод лучше, чем создававшийся пару десятилетий до этого статистический. Для первокурсника реализовать и применить на практике нечто, что сейчас находится на переднем крае науки,- это огромная победа.\u003c/p\u003e\u003cp\u003eПавел Поляков, разделивший второе место, реализовал приближенное и точное решение задачи коммивояжера. Исходное описание проекта \u003ca href\u003d\"https://clck.ru/9WzVf\"\u003eздесь\u003c/a\u003e. В итоге у Павла получилось лучше, чем ожидал ментор, и приближенное решение работает на графе из 100 вершин за пол-секунды и давало погрешность сверху порядка 2-3%, а точное решение на 100 вершинах работает за 1-2 минуты. Кроме алгоритмической части реализован также интерфейс и визуализация графов и получаемых решений.\u003c/p\u003e\u003cp\u003eЕще двое ребят должны были реализовать какую-нибудь свою идею для \u0026quot;умного\u0026quot; устройства, и у одного получились \u003ca href\u003d\"https://www.dropbox.com/sh/2c7tcgwoj9lmv72/AACYeb8mT6z6qI-WoQ1posHCa?dl\u003d0\"\u003eгоночки под Oculus VR\u003c/a\u003e, а у другого — летающий \u0026quot;дракон\u0026quot;, управляемый голосом. Оба смогли продемонстрировать свои программы прямо во время конкурса.\u003c/p\u003e\u003cp\u003eКроме того, на конкурс попали разного рода веб-сервисы — анализирующий инстаграм, \u003ca href\u003d\"http://estimate-apartment.appspot.com/?sum\u003d20113198\u0026amp;underground\u003d132\u0026amp;rooms\u003d3\u0026amp;distance_from_underground\u003d1\u0026amp;time_to_get_to_underground\u003d10\u0026amp;area\u003d90\u0026amp;building_type\u003d3\u0026amp;realty_type\u003d1\u0026amp;expand\u003dtrue\"\u003eцены на квартиры в Москве\u003c/a\u003e, а также \u003ca href\u003d\"http://app.begishev.me/index.html\"\u003eдающий возможность написать что-нибудь на эзотерическом языке программирования или поиграть в набор самописных игр\u003c/a\u003e; лингвистический проект по очистке текстов от обсценной лексики; реализация удаленного вычислительного агента; питоновский WebDAV сервер и библиотека для работы с ним, а также сервис статистического анализа истории рыночных цен финансовых активов.\u003c/p\u003e\u003cp\u003eЗнакомые и коллеги, которым я про это рассказывал, все прониклись: мы в свое время на первом курсе и близко такого не делали.\u003c/p\u003e\u003c/div\u003e","tags":["фкн","вшэ","яндекс","проект","нейронные сети","задача коммивояжера","oculus rift"]}}