{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1512980529,"rating":13,"authorHandle":"arafat_hasan","modificationTimeSeconds":1529136747,"id":56280,"title":"\u003cp\u003euva-tool: A Command Line Based Tool for UVa Online Judge\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eHello, Codeforces!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eDo you get bored doing the tasks listed below while solving problems continuously at Online Judges? I do :-|. \u003c/p\u003e \u003cul\u003e   \u003cli\u003eCopy code from IDE/Editor\u003c/li\u003e   \u003cli\u003eLoad the summit page of OJ\u003c/li\u003e   \u003cli\u003ePaste your code to text area\u003c/li\u003e   \u003cli\u003eSelect language\u003c/li\u003e   \u003cli\u003eWrite problem no/ID\u003c/li\u003e   \u003cli\u003eClick submit button\u003c/li\u003e   \u003cli\u003eCheck verdict\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eHere is a solution for \u003ca href\u003d\"https://uva.onlinejudge.org/\"\u003eUVa Online Judge\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eTo get rid of these problems, early of this year, I had written a \u003ccode\u003eBash\u003c/code\u003e script for submitting solutions at UVa OJ and check verdict directly from my editor, \u003ccode\u003eVIM\u003c/code\u003e. It was working fine. Later, I had converted the script into \u003ccode\u003eC++\u003c/code\u003e and submitted it as my university semester project, I did not want to spend time behind the semester project :p.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://github.com/arafat-hasan/uva-tool\"\u003e\u003cstrong\u003euva-tool\u003c/strong\u003e\u003c/a\u003e has these features now: \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003eLogin and Logout at UVa OJ\u003c/strong\u003e\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eSubmit Problem\u003c/strong\u003e\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003euHunting\u003c/strong\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eAs it works via command line, it can be easily integrate with any other IDEs or Editors. From the very beginning, I have been using it with \u003ccode\u003eVIM\u003c/code\u003e. I find out a way to integrate it with \u003ccode\u003eGeany\u003c/code\u003e, funny way actually, I have no plan to write a \u003ccode\u003eGeany\u003c/code\u003e plug-in.\u003c/p\u003e\u003cp\u003eCurrently, it works only on Linux, I’m thinking of bringing Windows version soon.\u003c/p\u003e\u003cp\u003eAnd one thing, doing this sort of work in C++ is a foolish idea, but I had to earn some credit from my project without any effort (:p) and wanted to kill two birds with one stone. There are three more such tools, two of them written in python and one in node.js. So what? The satisfaction of submitting problem with your own written program is really cool.\u003c/p\u003e\u003cp\u003eGit-hub Link: \u003ca href\u003d\"https://github.com/arafat-hasan/uva-tool\"\u003ehttps://github.com/arafat-hasan/uva-tool\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThank you!\u003c/p\u003e\u003c/div\u003e","tags":["uva","uva-tool","tool","command-line"]}}