{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1424370207,"rating":0,"authorHandle":"burakcetin","modificationTimeSeconds":1448951968,"id":16512,"title":"\u003cp\u003eCaliborn ve Gezegenler\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eSoru Linki: \u003ca href\u003d\"//codeforces.com/problemset/problem/515/E\"\u003ehttp://codeforces.com/problemset/problem/515/E\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEDT:\u003c/strong\u003e 2018\u0027de mezun olacaklar icinden bu soruyu ilk cozen bana gelsin yemek ismarlicam. (Artik alttaki gecerli sanirsam) -Burak Cetin\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEDT:\u003c/strong\u003e 2018\u0027de mezun olacaklar icinden bu soruyu ilk cozen banada gelsin burak ile beraber ikinize yemek ismarlicam. Cozume bakmak yasak kodu kendiniz yazcaniz komple. -bilal\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCaliborn ve Gezegenler\u003c/strong\u003e Caliborn bir bilgisayar oyunu oynayacaktır. Bu oyunda n adet gezegen bir kara deliğin etrafına halka şeklinde dizilmiştir. K\u0027ıncı gezegenden K+1\u0027inci gezegene gitme süresi d_k\u0027dır.(n\u0027inciden 1\u0027inciye d_n). Komşu gezgenler dışındaki gezgenlere direkt olarak gidilememektedir. K\u0027ıncı gezegen için yüzeyden gezegenin merkezine ve gezegenin merkezinden yüzeye ulaşım süresi eşittir ve h_k\u0027dır. Oyun gereği bu gezegenlerden ardışık bir küme kara deliğe düşecektir. Caliborn ise bu olaydan sonra kendi seçtiği iki gezegenin birinden başlayıp gezegenin merkezine inip yüzeye geri çıkacak, sonra diğer gezegene ulaşacak, sonra o gezegenin de merkezine inip çıkacaktır. Gezegenler i ve j ise 2*h_i+(i den j ye yolun toplam süresi)+2*h_j dir. Caliborn\u0027un yapmak istediği şey bu sürenin en fazla kaç olabileceğini bulmaktır çünkü oyunun onun için olabildiğince zorlu geçmesini istemektedir. Oyunun her oynanışında kara deliğe düşen gezegen aralığı farklı olabilmektedir. Caliborn oyunu m kere baştan oynayacaktır ve her seferinde size kara deliğe düşen aralığı söyleyip bu sürenin en fazla kaç olabileceğini soracaktır.\u003c/p\u003e\u003cp\u003eGirdi Biçimi:\u003c/p\u003e\u003cp\u003en gezegen sayısı ve m oyunun kaç kez oynanacağı. (3 ≤ n ≤ 100000, 1 ≤ m ≤ 100000)\u003c/p\u003e\u003cp\u003ed_1, d_2, ..., d_n (1 ≤ d_i ≤ 1000000000) komşu gezegenler arası ulaşım süreleri. \u003c/p\u003e\u003cp\u003eh_1, h_2, ..., h_n (1 ≤ h_i ≤ 1000000000) her gezegen için merkez-yüzey ulaşım süresi.\u003c/p\u003e\u003cp\u003em tane sayı ikilisi a_i,b_i her oynayışta kara deliğe düşecek ilk ve son gezegen. (eğer a_i b_i den büyükse b_i\u0027den n\u0027e ve 1\u0027den a_i ye kadar olan gezegenler düşecektir)\u003c/p\u003e\u003cp\u003eÇıktı Biçimi:\u003c/p\u003e\u003cp\u003eHer oynanış için tanımlanan uzunluğun maksimum değeri.\u003c/p\u003e\u003cp\u003eÖrnek Girdi:\u003c/p\u003e\u003cp\u003e5 3\u003c/p\u003e\u003cp\u003e2 2 2 2 2\u003c/p\u003e\u003cp\u003e3 5 2 1 4\u003c/p\u003e\u003cp\u003e1 3\u003c/p\u003e\u003cp\u003e2 2\u003c/p\u003e\u003cp\u003e4 5\u003c/p\u003e\u003cp\u003eÖrnek Çıktı:\u003c/p\u003e\u003cp\u003e12\u003c/p\u003e\u003cp\u003e16\u003c/p\u003e\u003cp\u003e18\u003c/p\u003e\u003cp\u003eÇözüm: \u003ca href\u003d\"http://paste.ubuntu.com/10312017/\"\u003ehttp://paste.ubuntu.com/10312017/\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["zorluk6","lord english","odullu"]}}