{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1495916545,"rating":-7,"authorHandle":"LORD_tsu__the_IIIrd","modificationTimeSeconds":1495916545,"id":52222,"title":"\u003cp\u003eHelp needed in Maximum Range Sum (segment tree) problem.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi :) I am new to competitive programming and was trying to figure out how segment trees work. I covered the basics of segment tree like the Range minimum query which was pretty trivial. I then,started another problem that bowled me over..SPOJ GSS1 \u003ca href\u003d\"http://www.spoj.com/problems/GSS1/\"\u003eProblem Statement\u003c/a\u003e After trying for some time,I saw the solution...\u003ca href\u003d\"https://pastebin.com/3s43hbY0\"\u003eSolution\u003c/a\u003e\u003c/p\u003e\u003cp\u003eFirst of all,I am a newbie at the moment so I request all the pros to explain me how would someone in layman terms think of taking 4 values (sum,pref,suf,ans) in a tree node instead of just one.. Okay,this one might have been obvious to some experienced players,but my next doubt is the in the function \u0026quot;combine\u0026quot;..In the 5th line..\u003c/p\u003e\u003cp\u003e((res.ans \u003d max (max (l.ans, r.ans), l.suff + r.pref);))\u003c/p\u003e\u003cp\u003ewe are setting ans for the new tree node,by combining the left and right child node.. I am not able to Digest the above mentioned line...can someone prove me that the above mentioned line is actually correct and will work in all the cases..it doesnt looks like it\u0027s going to work for every case(but it is)..I tried to prove it myself but I can\u0027t.... Lastly on line 64.. \u003c/p\u003e\u003cp\u003e((res.pref \u003d res.suff \u003d res.ans \u003d max(-1000000, val);))\u003c/p\u003e\u003cp\u003ewe are setting maxprefix sum as maximum btween -1000000 and val...why don\u0027t we set it to val directly?!\u003c/p\u003e\u003cp\u003eThank you for being patient and helping a newcomer.\u003c/p\u003e\u003c/div\u003e","tags":["segment tree","maximum sum"]}}