{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1500551982,"rating":15,"authorHandle":"Sergii-Right","modificationTimeSeconds":1500551982,"id":53392,"title":"\u003cp\u003eComputer Vision Hackathon in Odesa\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eХакатон по компьютерному зрению соберет 12-13 августа в жемчужной Одессе экспертов машинного зрения, распознавания образов, виртуальной и дополненной реальности. Особенно актуальное событие для автоиндустрии и отраслей, где используют дроны. Организатор CV-хакатона в Одессе — \u003ca href\u003d\"https://www.facebook.com/events/311780309279341\"\u003eHackathon Expert Group\u003c/a\u003e.\u003cbr /\u003e\u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/00/64/0064bd5f9fbcd78433dcfd180279ef44353c5cdd.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003cbr /\u003e Чтобы попасть на хакатон, участникам будет предложена тестовая задача. \u003cstrong\u003eРегистрация претендентов на хакатон открыта до 08.08\u003c/strong\u003e — \u003ca href\u003d\"http://goo.gl/forms/pCWC9ilP728ll5Q62\"\u003egoo.gl/forms/pCWC9ilP728ll5Q62\u003c/a\u003e!\u003cbr /\u003e\u003cbr /\u003e Событие рассчитано на настоящих хакеров — и призы будут соответствующие: рекомендации и предложения собеседования в Google, Facebook, другие выдающиеся компании в областях компьютерного зрения, виртуальной и дополненной реальности, искусственного интеллекта, машинного обучения (#CV, #VR, #AR, #AI, #ML). Также победа в Одесском CV-хакатоне — это серьезная заявка на повышение для своего работодателя, существенная строка в резюме и утверждение себя в качестве авторитетного эксперта. (Ожидаемый уровень участников — Middle/Senior+ или продвинутые Junior со стажем от 1 года.)\u003cbr /\u003e\u003cbr /\u003e Регистрация на хакатон (и предварительный отбор) — обязательна, \u003cstrong\u003e\u003ca href\u003d\"http://goo.gl/forms/pCWC9ilP728ll5Q62\"\u003eформа\u003c/a\u003e открыта до 08.08!\u003c/strong\u003e\u003cbr /\u003e\u003cbr /\u003e Подписывайтесь на событие в Facebook, чтобы быть в курсе событий и обновлений, а также следите за анонсами \u003ca href\u003d\"https://www.facebook.com/events/311780309279341\"\u003eHackathon Expert Group\u003c/a\u003e.\u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003eФормат мероприятия:\u003c/strong\u003e\u003cbr /\u003e  ● на старте партнеры хакатона предложат задачи участникам\u003cbr /\u003e  ● далее — участники в командах решают выбранные задачи при поддержке экспертов\u003cbr /\u003e  ● также на хакатоне будет сессия для демонстрации своих проектов и наработок — шанс услышать мнение продвинутых специалистов в отрасли, получить консультации экспертов и возможное менторство в развитии проекта.\u003cbr /\u003e\u003cbr /\u003e Задачи — актуальные из области CV: распознавание препятствий, разметок и знаков при движении, элементов на изображении и видео, идентификация людей и т.п.\u003cbr /\u003e\u003cbr /\u003e Питание и возможность поспать часок-другой обеспечивается организаторами хакатона.\u003cbr /\u003e\u003cbr /\u003e Адрес проведения хакатона будет сообщен участникам, прошедшим отбор.\u003cbr /\u003e\u003cbr /\u003e Приблизим вместе момент, когда компьютер будет видеть не хуже человека!\u003cbr /\u003e\u003cbr /\u003e Приобщайтесь — будет действительно жарко!\u003cbr /\u003e\u003cbr /\u003e Если Вы или Ваша компания хотите стать партнером, спонсором хакатона или поучаствовать в другом статусе — контактируйте с Taras Panchenko, Hackathon Expert Group.\u003cbr /\u003e\u003cbr /\u003e По всем вопросам обращайтесь к Taras Panchenko, Hackathon Expert Group (Facebook Messenger или Telegram: TarasPanchenko, +380 (63) 107-03-57).\u003cbr /\u003e\u003cbr /\u003e Регистрация: \u003ca href\u003d\"http://goo.gl/forms/pCWC9ilP728ll5Q62\"\u003egoo.gl/forms/pCWC9ilP728ll5Q62\u003c/a\u003e\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["hackathons","hackathon expert group","computer vision"]}}