{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1463601955,"rating":212,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1463625216,"id":44950,"title":"\u003cp\u003eACM-ICPC World Finals 2016: First Days\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThe Finals of ACM-ICPC 2016 in full swing! Teams and organizers gathered in Thailand. The weather is fine — heavy showers at nights, hot days. The rainy season is in action. Here it is about two a.m. now, but as I absolutely can not sleep, I decided to share my impressions and photos from the first two days of the main event.\u003c/p\u003e\u003cp\u003eThis year, the teams\u0027 resettlement delivers certain inconveniences — teams and coaches live in the same hotel, and all the other members of the delegation live in another. The first hotel (Le Meridien), is probably a bit better — own way out to the ocean and pool make everybody to envy those who lives in the Mövenpick (yes, like an ice cream).\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/86/e0/86e02cb98f11678f42eb4c01779c6bea100e96ba.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003eLe Meridien, photo from the official hotel website\u003c/small\u003e \u003c/center\u003e\u003cp\u003eBuses ply between hotels, you need an hour to go. A bit uncomfortable that the buses do not run every day, or at least not always, only as scheduled. The leading part of the teams, the team from Saratov State University as well, arrived on May, 15. The teams settled rooms with three beds. As always the absence of a normal room ceiling light is the \u0026quot;happiness\u0026quot; for us. Instead, we have several night-lamps and lamps, which give no more than gloom. After the flight, I failed the quest \u0026quot;turn off the light\u0026quot;, so I went to bed just de-energized the whole room by pulling the card from the \u0026quot;switcher\u0026quot; at the door. The next morning I found air conditioning and lighting control console near the bed.\u003c/p\u003e\u003cp\u003eMy daughter really liked the pool. At first unusually warm water upset me, but I quickly got used to it. But the ocean was not for swimming — my several attempts to swim came to nothing, waves are big and unpleasant and the rescuer rushed to rescue. By the way he did not want to go into the water, so begged from the shore me to get out.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/9e/36/9e36a18697a3dc6e7280b0b1bd704bf9096ea103.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003eLe Meridien, photo from the official hotel website\u003c/small\u003e \u003c/center\u003e\u003cp\u003eThe whole day of May 16th was set for recreation, thanks to the organizers! Of course, many of the teams quickly got bad sunburn, but most agreed that it was worth it. The food at the hotel was quite familiar, though sometimes it was very pungent. Having tried some pungent pork I did not feel the taste of food and portrayed the dragon during two hours.\u003c/p\u003e\u003cp\u003eThe 17th of May began with IBM\u0027s performances. This event is traditionally called IBM TechTrek and lasts for two hours. Not all presentations were interesting for participants, but this year, IBM did its best. Presentations were short and lively, people joked and showed a demo. Everything was stylized to the \u0026quot;Star Wars\u0026quot; — IBM employees were actors for a little. We talked a lot about the possibilities of Watson, Deep Learning, IoT, and other trendy things. In general, as always we told how to change the world and create the future.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/3d/3d/3d3dd1dca38dd3fb962c29597989dd5ce9775b6d.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003eYes, it is the IBM TechTrek\u003c/small\u003e \u003c/center\u003e\u003cp\u003eThen, all the participants were taken to an amusement park FantaSea on the same minivans (there were about 60 of them) — it was the opening in the park. All minivans lined up in one long strip, which was fun to watch.\u003c/p\u003e\u003cp\u003eThe park has a lot of entertainment and shopping pavilions, but the main point of interest — is, of course, the Theater \u0026quot;Palace of the Elephants\u0026quot;. There was the opening. An interesting design of the room pleased — the stage was surrounded by a tropical interior of plants and trees.\u003c/p\u003e \u003cpre\u003e\u0026lt;center\u0026gt;\u003c/pre\u003e\u003cp\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/04/dc/04dc715dddfb5a57c5d4d39eb663f0913fd95f2b.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003eFantaSea, the sight on the Theater \u0026quot;Elephant Palace\u0026quot;\u003c/small\u003e \u003c/p\u003e\u003cp\u003eThe opening contained not many performances of local bands, there were a lot of words and the presentations of various awards for many years of contribution. Andrew \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/andrewzta\" title\u003d\"Grandmaster andrewzta\"\u003eandrewzta\u003c/a\u003e Stankevich \u0026amp;mdash, the coach of ITMO went up on the stage too. It turns out that this year his teams took place in the final for the 15th time! Andrew, surely, became the youngest winner of Senior Coach Award. Very cool!\u003c/p\u003e \u003cpre\u003e\u0026lt;center\u0026gt;\u003c/pre\u003e\u003cp\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/37/8a/378a4f38f519d53c8814e310f7958691a87dfe1e.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003eAndrew \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/andrewzta\" title\u003d\"Grandmaster andrewzta\"\u003eandrewzta\u003c/a\u003e Stankevich gets Senior Coach Award\u003c/small\u003e \u003c/p\u003e\u003cp\u003eThe swimmer with a pipe which is a masked symbol of this year \u0026amp;mdash really cheered everybody. Apparently, he could see a little in his suit, so we saw a lot of funny moments — he gets up on the stage where he shouldn\u0027t be, and does not understand the requests to move, then with a leisurely walk he runs into the scenery under the laughter of the hall.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/de/fa/defa28aa93f9b1cbf9bb754abc5d12a81694052f.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003eThe swimmer with a pipe didn\u0027t understand  where to look\u003c/small\u003e \u003c/center\u003e\u003cp\u003eOf course, long presentations, lots of official and honoured people from ACM-ICPC on the opening made many people tired. But then there was a great supper, where everybody talked enough and recuperated. I remember the unusual soup with something like dumplings of unknown origin.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/c0/a2/c0a29bff1e684746d386de817fb2fe362b48808e.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003eThe teem ICPCLive discusses last details of the broadcast during the  festive supper\u003c/small\u003e \u003c/center\u003e\u003cp\u003eImmediately after the supper, we can take a walk in the park, buy souvenirs and visit elephants: it was possible to ride, or just feed them.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/14/e2/14e2eddf5c0b1b6caab706f598fb161bb510edca.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003eA total of 60 bahts — and five elephants were saved from starvation \u003c/small\u003e \u003c/center\u003e\u003cp\u003eThen a great show with the elephants, acrobats, magicians and dancers began. It was truly interesting supplied — We all liked it! Unfortunately, there was no possibility to make pictures — all equipment was confiscated . All the gadgets were collected and piled into doubtful boxes. Then all gadgets were returned safe and sound.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/49/70/4970024473ad0c153b92941d02395ca799e27109.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003e The show, photos were found in tne Internet \u003c/small\u003e \u003c/center\u003e\u003cp\u003eThe 18 of May was entirely devoted to the practice rounds. Already at 7 a.m. all of us were taken to the venue of the event — to the local sports arena. We were waiting for the beginning of the events for a long time — about two hours. Traditionally there were two practice rounds — \u0026quot;the dress rehearsal\u0026quot; and a practice round. The dress rehearsal takes place entirely with strict start according to the rules of the finals and looks like a real competition for the compilation of problems from previous finals (exception in the rules — coaches allowed to come into the room). 6 problems were given. The MSU team won, deciding all the problems for a little more than an hour. Good luck to him tomorrow!\u003c/p\u003e\u003cp\u003eThen there was a dinner, organizers answered the questions of participants — and the practice round again. However, many teams did not go on it or went from it pretty quickly.\u003c/p\u003e\u003cp\u003eNow all participants sleep (I hope). Tomorrow it will be exciting and interesting as usual. Good luck to them!\u003c/p\u003e\u003c/div\u003e","tags":["acm","acm-icpc","world finals","2016"]}}