{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1511991537,"rating":40,"authorHandle":"ThunderStruct","modificationTimeSeconds":1512687653,"id":56071,"title":"\u003cp\u003eCodeforces Customizable Contests/Scoreboard\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi people!\u003c/p\u003e\u003cp\u003eI recently published a platform to host custom Codeforces contests. This was a personal project I worked on (as a contribution to an introductory undergraduate course I TA\u0027d) to serve as a means of hosting mock ACM competitions for training purposes\u003c/p\u003e\u003ch3\u003eFeatures\u003c/h3\u003e\u003cp\u003eSo far, it has been used in no less than 10 contests, which helped with enhancing it and adding more useful features, including:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eAuto-updating scores\u003c/li\u003e   \u003cli\u003eBlind time\u003c/li\u003e   \u003cli\u003eVarying problem weights/points (an option to manually set the more difficult problems to yield a higher score)\u003c/li\u003e   \u003cli\u003eCancelling certain submissions\u003c/li\u003e   \u003cli\u003eVerifying which of the entered problems were solved by the given user handles (could be used to ensure none of the contest problems was pre-solved before the contest)\u003c/li\u003e   \u003cli\u003eLogging a detailed report of the given handles, showing their submissions\u0027 details in a certain time-frame (or all time)\u003c/li\u003e   \u003cli\u003eCopying/Loading a contest using a compressed string (to help setup the same contest across multiple rooms/computers)\u003c/li\u003e   \u003cli\u003eColor-coded scoreboard indicating first submissions, accepted answers, and attempts\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003eScoring\u003c/h3\u003e\u003cp\u003eCurrently, the scoring system works as follows:\u003c/p\u003e \u003col\u003e   \u003cli\u003eEach individual problem has it\u0027s own linear-based time penalty. The way it works is by calculating how many points should be lost per minute if the problem points are to be \u003cem\u003ehalved\u003c/em\u003e by the end of the contest (since both the contest duration and problem points are variable)\u003c/li\u003e   \u003cli\u003eAll penalties/bonuses are in terms of \u003cstrong\u003etime\u003c/strong\u003e (minutes)\u003c/li\u003e   \u003cli\u003eEach wrong answer results in a 10 minutes penalty (10 minutes\u0027 worth of points)\u003c/li\u003e   \u003cli\u003eProgram efficiency adds bonus points; 20 minutes for a 15ms time-consumed submission\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eThis scoring formula can be changed/customized. I tried to think of a fair way to cover all grounds, but it could be flawed (if that\u0027s the case, please suggest ways to improve it)\u003c/p\u003e\u003ch3\u003eFinally...\u003c/h3\u003e\u003cp\u003eI open-sourced this \u003ca href\u003d\"https://github.com/ThunderStruct/ACM-Scoreboard\"\u003eproject\u003c/a\u003e to allow people to contribute and modify it to suit their needs. The README markdown contains a fairly thorough documentation of all the tools available and some helpful tips for customization and contribution.\u003c/p\u003e\u003cp\u003eIt\u0027s also hosted \u003ca href\u003d\"http://www.thunderstruct.com/acm-scoreboard/\"\u003ehere\u003c/a\u003e for convenience.\u003c/p\u003e\u003ch5\u003eUpdate\u003c/h5\u003e\u003cp\u003ePlease note that all updates and changes made to the platform are logged and documented on \u003ca href\u003d\"https://github.com/ThunderStruct/ACM-Scoreboard\"\u003eGitHub\u003c/a\u003e. PRs are more than welcome and feel free to request features or suggest improvements via GitHub issues or \u003ca href\u003d\"mailto:mohamedshahawy@aucegypt.edu\"\u003emailing me\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codeforces tools","scoreboard","custom contests","mock contests","acm","programming websites","thunderstruct"]}}