{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1422976316,"rating":54,"authorHandle":"bearf","modificationTimeSeconds":1424894718,"id":16188,"title":"\u003cp\u003eICL\u002715 — 15 марта (квоты опубликованы; ГП Карелии в силе)\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e Все заинтересованные в приезде команды, участвующие в OpenCup, но не заполнившие регистрационную форму — пожалуйста, сделайте это до \u003cstrong\u003eполуночи с 24 на 25 февраля\u003c/strong\u003e. После этого прием заявок будет закрыт. Предварительные таблицы с результатами будут выложены завтра (24 февраля) утром, окончательные — после прекращения приема заявок.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e Доступны \u003ca href\u003d\"https://docs.google.com/spreadsheets/d/1Bvy7XE0zQFX7T8Bf9lvhZ9XwXoVKMhfcoBHswTJdLO4/edit?usp\u003dsharing\"\u003eпредварительные результаты\u003c/a\u003e. В них пока не включены команды, принимавшие участие во втором Гран-при, но не участвующие в OpenCup.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e \u003ca href\u003d\"https://docs.google.com/spreadsheets/d/1Bvy7XE0zQFX7T8Bf9lvhZ9XwXoVKMhfcoBHswTJdLO4/edit?usp\u003dsharing\"\u003eРезультаты отбора опубликованы\u003c/a\u003e. Команды, прошедшие в основной тур, пожалуйста, заполните \u003ca href\u003d\"https://docs.google.com/forms/d/1PMYSXcKvsKxfaiuX4dIFz_w5mr10g4ssAfcdw6U_9GQ/viewform\"\u003eанкету команды\u003c/a\u003e (1 шт.) и \u003ca href\u003d\"https://docs.google.com/forms/d/18IqwaAEZ2GJxgzg0UZhjVbDFIpb5YNTMREFcktOKa4Q/viewform\"\u003eанкету участника\u003c/a\u003e (3 шт.) до 1 марта включительно.\u003c/p\u003e\u003cp\u003e\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003c/p\u003e\u003cp\u003e15 марта в Казани пройдет ежегодный (уже 15-й) открытый командный турнир по программированию среди студентов и школьников Республики Татарстан. В этом году, как и ранее, мы собираемся принять около 40-45 команд.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/89/a3/89a3295f6ef253a12049ee38822d47057c78048d.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eОбновлено\u003c/strong\u003e Команда может состоять из трех студентов (кроме \u0026quot;ветеранов\u0026quot; ACM-движения) либо школьников. Отбор команд будет производиться на основе Гран-при \u003cstrong\u003eКарелии\u003c/strong\u003e (15 февраля) и Гран-при Удмуртии (22 февраля) в рамках \u003ca href\u003d\"http://opencup.ru\"\u003eОткрытого кубка по программированию\u003c/a\u003e. Если вы уже участвуете в OpenCup — милости просим. Если ничего о нем не знаете — мы вышлем вам логин и пароль, а в день самого отбора (или ранее) опубликуем ссылку для входа в соревнование. Зарегистрироваться на отбор вы можете через \u003ca href\u003d\"https://docs.google.com/forms/d/1qWKOrGbM74L9lPC92Gxv9AWk0Fat6-kPAHU0MkRB8qQ/viewform\"\u003eспециальную форму\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eКак обычно, \u003cstrong\u003eпроживание участников и питание оплачиваются компанией-организатором\u003c/strong\u003e, АйСиЭл КПО-ВС.\u003c/p\u003e\u003cp\u003eВ программе — первый день с открытием, пробным туром, экскурсиями и (на сладкое) развлекательным туром в уже знакомом формате (условий нет, есть только тесты, которые выдаются по одному каждую минуту).\u003c/p\u003e\u003cp\u003eВторой день полностью посвящен 5-часовому контесту, разбору задач и вручению призов. Стеклянного дождя на закрытии в этот году не будет, потому что мы переезжаем в высотный корпус Казанского федерального университета. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eОбновлено\u003c/strong\u003e Опубликована информация по размерам квот и отбору. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eОбновлено\u003c/strong\u003e Отбор среди студентов из-за пределов Татарстана производится в первом дивизионе. Отбор среди всех прочих команд — во втором дивизионе Открытого кубка. Частные случаи (например, школьная команда, выступающая в первом дивизионе) рассматриваются отдельно по согласованию с оргкомитетом. От одной школы в основные соревнования Турнира ICL может пройти не более одной команды; однако, допускается участие команд, составленных из учащихся разных школ, т.е. сборных.\u003c/p\u003e\u003cp\u003eОт одного ВУЗа в основные соревнования Турнира ICL может пройти:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eВУЗ Татарстана – не более 4 команд;\u003c/li\u003e   \u003cli\u003eВУЗ из-за пределов Татарстана – не более 2 команд.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eНа основной тур без отбора приглашаются по две команды от К(П)ФУ и КНИТУ-КАИ как от ВУЗов-организаторов. На эти команды не распространяются правило \u0026quot;4(2) команды от ВУЗа\u0026quot;. Победители прошлого года участвуют в отборочном туре наравне с другими командами.\u003c/p\u003e\u003cp\u003eПо результатам отбора первоначально выбирается не более 36 лучших команд:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eСтуденческие команды Татарстана – отбирается не более 4 из каждого Гран-При;\u003c/li\u003e   \u003cli\u003eШкольные команды Татарстана – отбирается не более 6 из каждого Гран-При;\u003c/li\u003e   \u003cli\u003eСтуденческие команды из-за пределов Татарстана – отбирается не более 5 из каждого Гран-При;\u003c/li\u003e   \u003cli\u003eШкольные команды из-за пределов Татарстана – отбирается не более 3 из каждого Гран-При.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eЖюри может по своему усмотрению заполнить несколько вакантных (оставшихся после отбора или освободившихся в результате отказа) мест заявками, отданными учебным заведениям, команды которых показали высокие результаты на командных соревнованиях по программированию российского и мирового уровня.\u003c/p\u003e\u003cp\u003eВ виду того, что турнир ориентирован на популяризацию IT среди студентов и школьников Татарстана, жюри может заполнить оставшиеся места командами Татарстана, вне зависимости от их участия в отборочном туре. Однако, предпочтение при этом отдается командам, участвовавшим в отборе и занявшим более высокие места.\u003c/p\u003e\u003cp\u003eДалее команды, участвовавшие в отборочном туре, показавшие хорошие результаты, но не прошедшие в основной тур, группируются в две корзины:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eA: школьные команды из-за пределов Татарстана;\u003c/li\u003e   \u003cli\u003eB: студенческие команды из-за пределов Татарстана;\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eоставшиеся свободными места последовательно заполняются командами из корзин A, B, A, B, A и так далее.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eКоманда, прошедшая в основные соревнования, должна\u003c/strong\u003e:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eв срок до 28 февраля заполнить анкету подтверждения участия (одна на команду);\u003c/li\u003e   \u003cli\u003eв срок до 28 февраля заполнить анкету участника (на каждого из членов команды).\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eСсылки на анкеты будут опубликованы по окончании отбора.\u003c/p\u003e\u003c/div\u003e","tags":["icl","казань","gp of tatarstan"]}}