{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1475253765,"rating":195,"authorHandle":"ahmed_aly","modificationTimeSeconds":1514713642,"id":47442,"title":"\u003cp\u003eMore new and hopefully helpful ladders on A2OJ\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI always wanted to make something like a guide for anyone who wants to be better at competitive programming. But I believe that I\u0027m not experienced enough to make this guide.\u003c/p\u003e\u003cp\u003eSo, here is what I did and I hope it will be helpful to many of you:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eOut of more than 80,000 rated Codeforces users, I selected just 700 of them who satisfied the following conditions:\u003c/li\u003e \u003c/ul\u003e \u003col\u003e   \u003cli\u003eOver the period of 1-2 years, their rating increased step by step more than 600 points in total (their graph looks linear in a period of 1-2 years with increment of more than 600 points).\u003c/li\u003e   \u003cli\u003eThey participated in at least 20 rated contests.\u003c/li\u003e   \u003cli\u003eThey solved at least 150 problems in practice in this period.\u003c/li\u003e \u003c/ol\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eFor each rating range, interestingly I found many common problems solved by these users when their rating was in that range. I found the most 100 solved problems in that rating range.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eI created a ladder for each range, and the problems inside it are sorted based on an accurate difficulty level I calculated.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eI believe if someone manages to solve (or at least understands the solution from someone else or the editorial) all these problems, they will notice some significant improvements in their skills and rating.\u003c/p\u003e\u003cp\u003eYou can find the ladders at the top here: \u003ca href\u003d\"https://a2oj.com/ladders\"\u003ehttps://a2oj.com/ladders\u003c/a\u003e\u003c/p\u003e\u003cp\u003eAlso please share this with anyone who might be interested.\u003c/p\u003e\u003cp\u003eP.S. I know that a ML model might do a better job, but the reason why I didn\u0027t do this, because I didn\u0027t have enough data.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e[Edit] I created more ladders, you can read about that and other new feature \u003ca href\u003d\"//codeforces.com/blog/entry/56795\"\u003ehere\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":["a2oj","a2 online judge","a2oj ladders","ladders"]}}