{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1500387055,"rating":48,"authorHandle":"misis","modificationTimeSeconds":1503049529,"id":53357,"title":"\u003cp\u003eVisionHack is coming\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003eMISiS coach team is speaking. This time we want to tell you about an unusual event. This year MISiS together with Cognitive Technologies holds \u003cstrong\u003ean international hackathon on Computer Vision and Artificial Intelligence — VisionHack\u003c/strong\u003e. It starts very soon — \u003cstrong\u003eon July, 21\u003c/strong\u003e. \u003c/p\u003e\u003cp\u003eWhat this hackathon will be about? Which problems will be offered to participants?\u003c/p\u003e\u003cp\u003eHackathon focuses on designing autonomous cars and developing software for this kind of cars. Participants will be offered a \u003cstrong\u003ereal-life problem\u003c/strong\u003e which occurs in designing autonomous cars. In particular, you will need to identify objects of the road framework (such as road signs and traffic lights) in images or short videos. You will never regret participating in this event as you will spend time solving \u003cstrong\u003eexciting problems\u003c/strong\u003e, gaining \u003cstrong\u003enew knowledge\u003c/strong\u003e, improving your coding skills and competing with teams from top-ranking universities. This is indeed not an overstatement — teams from \u003cstrong\u003eThe Massachusetts Institute of Technology (MIT), The University of Arizona (UA), the University of Science and Technology Beijing (USTB), Polytechnic University of Catalonia (UPS)\u003c/strong\u003e have already confirmed their participation. In addition, \u003cstrong\u003ethe prize pool will be over 35000$\u003c/strong\u003e which will definitely make the competition more thrilling.\u003c/p\u003e\u003cp\u003eIt is important that solutions will be assessed by \u003cstrong\u003ean online judge system\u003c/strong\u003e and only later participants will demonstrate their programs to the jury.\u003c/p\u003e\u003cp\u003eWe welcome teams consisting of \u003cstrong\u003e3 to 5 members\u003c/strong\u003e. Any undergraduate, postgraduate students and even school students can participate. You can also participate in the distance round individually and find teammates for the final round later. \u003c/p\u003e\u003cp\u003eHackathon consists of two rounds:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003ethe distance round (round 1) takes place from \u003cstrong\u003eJuly 21 to August 27\u003c/strong\u003e. At the end of round 1 best-performing teams will be admitted to round 2.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003ethe final round (round 2) takes place from \u003cstrong\u003eSeptember 10 to September 14\u003c/strong\u003e in the House-Commune of MISiS. Accommodation in the House-Commune, coffee, pizzas, energy drinks and a working place will be provided for \u003cstrong\u003eall participants\u003c/strong\u003e, including Moscow residents.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eFor more information see \u003ca href\u003d\"http://visionhack.misis.ru/\"\u003ehttp://visionhack.misis.ru/\u003c/a\u003e. We hope that you will participate in the event. May the best team win. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/3f/17/3f179e6cd021e6bd1a8ba3e4aebba9bb5376d30d.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}