{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1429800601,"rating":155,"authorHandle":"Egor","modificationTimeSeconds":1429812908,"id":17541,"title":"\u003cp\u003eBayan 2015: Introduction\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi there!\u003c/p\u003e\u003cp\u003eAs you probably know this is the second time Bayan opens it\u0027s programming competition to international coders. 2 years ago I participated myself and ended up taking 3rd place. This time around I\u0027ll be your blogger.\u003c/p\u003e\u003cp\u003eIn this first post I want to give you some useful tips and links to know more about Iran and, if you won trip to Iran, what would you need to know.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://en.wikipedia.org/wiki/Iran\"\u003eIran\u003c/a\u003e is a country with very rich history. Through the ages it participated in Greco-Persian wars, accepted Islam, was under Shah rule and now known as Islamic Republic of Iran since revolution in 1979.\u003c/p\u003e\u003cp\u003eTehran, capital of Iran, is modern city, but with a lot of historic places throughout the city, like palaces of last Iranian Shahs, which is now \u003ca href\u003d\"http://en.wikipedia.org/wiki/Niavaran_Palace_Complex\"\u003emuseum complex\u003c/a\u003e or \u003ca href\u003d\"http://en.wikipedia.org/wiki/Grand_Bazaar,_Tehran\"\u003eGrand Bazaar\u003c/a\u003e, both of which contestants visited 2 years ago.\u003c/p\u003e\u003cp\u003eAs for food, get ready for some tasteful \u003ca href\u003d\"http://en.wikipedia.org/wiki/Iranian_cuisine\"\u003eIranian cuisine\u003c/a\u003e. I\u0027d especially recommend lamb kebab.\u003c/p\u003e\u003cp\u003eNow, if you want to use your usual websites like Facebook while in Iran I\u0027d recommend to take care of VPN service in advance. There are many options around Internet.\u003c/p\u003e\u003cp\u003eFinally if you want to stay online while on the go in Tehran I\u0027d recommend visit \u003ca href\u003d\"http://prepaid-data-sim-card.wikia.com/wiki/Iran\"\u003ethis page\u003c/a\u003e about SIM-cards and data plans in Iran (refer to comment section).\u003c/p\u003e\u003c/div\u003e","tags":["bayan"]}}