{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1482444858,"rating":124,"authorHandle":"tehqin","modificationTimeSeconds":1482452298,"id":49253,"title":"\u003cp\u003eAlgorithms Live! Episode 0\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces! Some of you may be interested in a new live talk show on algorithms in competitive programming. Often I find, when competitive programmers get together, the discussions are interesting. Unless you are in a training group, these kinds of conversations only seem to happen at training camps or contests themselves. I believe a talk show will be another good place to capture such discussions.\u003c/p\u003e\u003cp\u003eI suppose I should introduce myself. Hello! My name is Matt Fontaine and I\u0027m teaching faculty at the University of Central Florida. I\u0027ve been involved in programming contests for many years but behind the scenes. For example I\u0027ve helped judge the North American Invitational Programming Contest and been the cow artist for USACO. I love teaching algorithms and I hope that some of you will find my talk show useful.\u003c/p\u003e\u003cp\u003eThe first broadcast will take place at 9pm tomorrow (December 23rd) in my timezone, but you can find the time in your timezone \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dAlgorithms+Live%21+Episode+0+-+Fenwick+Trees\u0026amp;iso\u003d20161223T21\u0026amp;p1\u003d867\"\u003ehere\u003c/a\u003e. The first two broadcasts will be hosted at this time, but adjustments will be made based on interest and guest availability. :) The broadcast will take place \u003ca href\u003d\"https://www.youtube.com/watch?v\u003dkPaJfAUwViY\"\u003ehere\u003c/a\u003e as a YouTube live stream and will be available for later viewing. The YouTube channel for the show is available \u003ca href\u003d\"https://www.youtube.com/channel/UCBLr7ISa_YDy5qeATupf26w\"\u003ehere\u003c/a\u003e. I\u0027ve also started a \u003ca href\u003d\"http://algorithms-live.blogspot.com/\"\u003eblog\u003c/a\u003e to help organize the show.\u003c/p\u003e\u003cp\u003eThis week I will cover an elegant data structure popular in competitive programming, the Fenwick Tree (also known as a binary indexed tree or BIT). I believe this data structure is a good starting place given both its elegance and its commonplace in contests. If you want to understand how this data structure works, this episode is for you!\u003c/p\u003e\u003cp\u003eIn future weeks I\u0027ll be covering a variety of topics. Sometimes I\u0027ll review a problem I find interesting or an algorithmic technique useful in contests. I hope to invite guests on future episodes to discuss techniques and problems they find interesting. Please suggest guests you would like to see on the show!\u003c/p\u003e\u003c/div\u003e","tags":["fenwick tree","talk show","algorithms"]}}