{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1495513904,"rating":77,"authorHandle":"shahidul_brur","modificationTimeSeconds":1495515761,"id":52130,"title":"\u003cp\u003eCodechef Snackdown 2017 Qualification Round and my feelings after solving all !!!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIt is one of the most happiest and excited moment in my coding life !!\u003c/p\u003e\u003cp\u003eSolved all the problems of Codechef SnackDown 2017 Contest (Qualification Round) !!\u003c/p\u003e\u003cp\u003eNow our team rank is 1 (combined).\u003c/p\u003e\u003cp\u003eI am unable to express my excitement and how much fun I have got by solving the last problem !!\u003c/p\u003e\u003cp\u003eToday I had an mid term exam. But till yesterday, we solved 2 problems out of 4, still there was two unsolved problems. Azad Abul Kalam sir told us to solve the rest. Sakib vai also inspired me.\u003c/p\u003e\u003cp\u003eThen I try to solve the third one. In my first attempt I solved that problem.\u003c/p\u003e\u003cp\u003eSince I had a mid term exam today, I thought to skip the last one. So I just read that problem and came out from the contest.\u003c/p\u003e\u003cp\u003eBut from the time of reading the last problem, only this thinking was running in my head, \u0026quot;How to solve this?\u0026quot;. I just couldn\u0027t give attention to anything else. Whatever I was trying to do, just this thinking was making me mad. I couldn\u0027t do a single math for today\u0027s exam. In the mean time the exam was cancelled !\u003c/p\u003e\u003cp\u003eEven when I was sleeping, I was trying to solve the problem in my dream !!\u003c/p\u003e\u003cp\u003eAfter wake up in the morning, I was just singing a song of Nachiketa Chokraborty. Suddenly an idea came to my mind !! I was attempting to brush my teeth. I said to my dearest one that I got an idea. She said me to solve the problem first then to brush teeth.\u003c/p\u003e\u003cp\u003eI sit in front of my laptop to solve the problem, then implement my idea and submit my code. But got \u0027wrong answer\u0027 verdict. Then started to debug my code and found two big mistakes in my code. Then I correct my code and submit it.\u003c/p\u003e\u003cp\u003eThen the moment came !! Yeeeesssss, this time my code is ACCEPTED !!!\u003c/p\u003e\u003cp\u003eAfter solving this problem, I just can\u0027t express my feelings on \u0027how much fun I have got\u0027 ! I just shouted in my highest loud and jumped over my bed !!!\u003c/p\u003e\u003cp\u003eThe most important part was that when I first read the problem, I thought that it is out of my level and can\u0027t solve it. But finally I solved the problem ! I just made it true that if anyone tries his best, doesn\u0027t give up, works with full confidence, then he can do it.\u003c/p\u003e\u003c/div\u003e","tags":["codechef","codechef snackdown 2017","feelings","crazyness"]}}