{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1458330262,"rating":43,"authorHandle":"Xellos","modificationTimeSeconds":1458338308,"id":43865,"title":"\u003cp\u003eSpoiler tag\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eis here! Finally, solutions can be spoilered!\u003c/p\u003e\u003cp\u003eFor example, my solution to F from \u003ca href\u003d\"/contest/645\" title\u003d\"Чемпионат КРОК 2016 - Отборочный Раунд\"\u003eЧемпионат КРОК 2016 - Отборочный Раунд\u003c/a\u003e:\u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eWe need LaTeX in spoilers, too.\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/4b/0d/4b0d851451367a44c99b7451dd68f5da6c61953a.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eOkay, seriously now.\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eThe first observation is that for a fixed set of species, the max. number of farms is the GCD of their a_i (we can say c_j\u003da_{N+j}). So we want the sum of GCDs over all K-element subsets. \u003c/p\u003e\u003cp\u003eThe second observation is that this sum for the first x+1 species \u003d sum for the first x species + number of K-1-element subsets containing the x-th species. In order to recalculate it, we only need to find out the number of K-1-element subsets such that their numbers and a_x have GCD equal to g for each divisors g of a_x (obviously, that GCD can\u0027t be a non-divisor of a_x); let\u0027s call the number of such subsets for given x p(g), then the answer in step x+1 \u003d answer in step x + sum gp(g).\u003c/p\u003e\u003cp\u003eIt\u0027s much easier to calculate the number of K-1-element subsets whose GCD is a multiple of g; let\u0027s call that number P(g). We\u0027ll get to that later, it\u0027s more important to show how to get p-s from P-s.\u003c/p\u003e\u003cp\u003eWe\u0027ll calculate p-s in the order of decreasing g. At first, let\u0027s take p(g)\u003dP(g); we need to subtract the subsets whose GCD is strictly bigger than g and a multiple of g. Since we calculated p(g\u0027) for all g\u0027 \u0026gt; g already, we can just subtract all p(g\u0027) such that g\u0027 \u0026gt; g is a multiple of g. However, we need to list divisors for all numbers anyway, so it\u0027s simpler to subtract p(g\u0027) from all p-s of proper divisors of g\u0027 right after calculating it.\u003c/p\u003e\u003cp\u003eThe time complexity of this is O(number of pairs g | g\u0027 | a_x). The maximum number of such pairs can be found easily if we know divisor lists; it\u0027s 8505 for a_x \u0026lt;\u003d 10^6. We don\u0027t need any modulos there, so that\u0027s manageable.\u003c/p\u003e\u003cp\u003eNow to computing P(g). If there are M_g species with numbers divisible by g, then P(g)\u003d{M_g over K-1}. Since M \u0026lt;\u003d N+Q, we can precompute factorials and their modular inverses, which allows us to compute P(g) in O(1) time.\u003c/p\u003e\u003cp\u003eComputing M_g is very similar to p-s from P-s: when the number of species with f flowers (an analogy of P) increases by 1, M_d for all d|f (which is an analogy of p) increases by 1.\u003c/p\u003e\u003cp\u003eWe also need divisor lists; for them, we can use a simplified sieve of Erathostenes. There are O(Alog{A}) divisors, where A\u003d10^6 and the maximum number of divisors of one number \u0026lt;\u003d A is D ~ 300, which means the total time complexity is O((N+Q)(D+8500)+Alog{A}), where the constant next to D is larger than the one next to 8500 due to modulos and more stuff to compute.\u003c/p\u003e\u003cp\u003eThis may be too slow; to speed it up, we can use the fact that we don\u0027t need online processing for the first N added flowers.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eUPD: Hell yeah, finals! I\u0027ll just leave \u003ca href\u003d\"http://webm.host/ef6c0/\"\u003ethis\u003c/a\u003e here.\u003c/p\u003e\u003c/div\u003e","tags":["spoiler","tag","andstuff"]}}