{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1508745040,"rating":47,"authorHandle":"harniver","modificationTimeSeconds":1518786340,"id":55348,"title":"\u003cp\u003eioIT — Open Contests\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/1d/8a/1d8a9e44363c7b3b6893eafb76a8947578658cbd.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eFor the first time, the \u003cem\u003eInternational Olympiads in Informatics in Teams\u003c/em\u003e (with the official participation of Italy, Romania and Russia) will be mirrored into online contests. These contests, of a \u003cstrong\u003elower\u003c/strong\u003e difficulty level than those of the IOI, are intended for teams of 4 contestants from the same high school. However, everyone is welcome to participate to the mirror contests, especially if you are considering to join officially the ioIT in the future! More specifically, we allow:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eseveral teams from the same school (also in the official contest)\u003c/li\u003e   \u003cli\u003eteams participating only in some contests (also in the official contest)\u003c/li\u003e   \u003cli\u003echanges in team members\u003c/li\u003e   \u003cli\u003eteams of students from different schools\u003c/li\u003e   \u003cli\u003esmaller teams\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe mirror contests timing will be USACO-like: it will be open for 24 hours but you will be able to compete for up to \u003cstrong\u003e3 hours\u003c/strong\u003e (you can decide when to \u0026quot;start\u0026quot; your time window, after the login). Participation will be available upon registration to the Italian trainings website (localized also in English): please do it in advance as it may be impossible during the contest! The problem statements will be available in \u003cstrong\u003eEnglish\u003c/strong\u003e only, and the languages allowed are C, C++ and Pascal. Every contest will consist of \u003cstrong\u003e7 problems\u003c/strong\u003e (see \u003ca href\u003d\"https://ioi.team\"\u003ehttps://ioi.team\u003c/a\u003e for further information).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNote:\u003c/strong\u003e you can decide when to start your 3 hour time window, but remember that the contest will end 24 hours after the start of the official contest regardless of your time window!\u003c/p\u003e\u003cp\u003eIf you want to participate, you must:\u003c/p\u003e \u003col\u003e   \u003cli\u003eVisit the training website: \u003ca href\u003d\"https://training.olinfo.it\"\u003ehttps://training.olinfo.it\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eClick \u0026quot;Sign up\u0026quot; (if you haven\u0027t already done it previously)\u003c/li\u003e   \u003cli\u003eFill out the form and then confirm\u003c/li\u003e   \u003cli\u003eVisit the contest list: \u003ca href\u003d\"https://training.olinfo.it/contests\"\u003ehttps://training.olinfo.it/contests\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eClick on the \u003cstrong\u003eOIS2018 -- \u0026lt;round\u0026gt;\u003c/strong\u003e list entry\u003c/li\u003e   \u003cli\u003eLog in with the same username and password you used to sign up\u003c/li\u003e   \u003cli\u003eIf the login is successful you will be ready to participate, just wait for the contest to start! (and maybe save the page in your bookmarks, so that you can quickly get back to it when the contest begins)\u003c/li\u003e   \u003cli\u003eWhen the contest starts, you will see a red button. Click it when you want to start your 3 hour time window!\u003c/li\u003e   \u003cli\u003eThe ranking for each contest will be available at \u003ca href\u003d\"https://squadre.olinfo.it/ranking2\"\u003ehttps://squadre.olinfo.it/ranking2\u003c/a\u003e only \u003cstrong\u003ewhen each contest ends\u003c/strong\u003e\u003c/li\u003e   \u003cli\u003eThe tasks will also be available for training in \u003ca href\u003d\"https://training.olinfo.it/#/tasks/1?tag\u003dois\"\u003ehttps://training.olinfo.it\u003c/a\u003e few days after the contests\u003c/li\u003e   \u003cli\u003eGood luck and have fun!\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eThe schedule of the contests is the following (starting times in the \u003ca href\u003d\"https://www.timeanddate.com/time/zone/italy\"\u003eCEST/CET time zone\u003c/a\u003e):\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003ePractice:\u003c/strong\u003e from oct. 23 to oct. 27 (whole days)\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eRound 1:\u003c/strong\u003e oct. 30 @ 15:00\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eRound 2:\u003c/strong\u003e nov. 28 @ 15:00\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eRound 3:\u003c/strong\u003e dec. 20 @ 14:30\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eRound 4:\u003c/strong\u003e jan. 25 @ 14:30\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eFinals:\u003c/strong\u003e feb. 16 @ 17:30\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eWe hope that you will join us or encourage your students to do so!\u003c/p\u003e\u003cp\u003eGiorgio Audrito (on behalf of the Italian ioIT organizers)\u003c/p\u003e\u003c/div\u003e","tags":["open contest","team contests","ioi","italy"]}}