{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399081813,"rating":-19,"authorHandle":"reign88","modificationTimeSeconds":1399081813,"id":12099,"title":"\u003cp\u003ebecause they can not participate\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eto others. Shortly after the case was investigated, Li City sacked.Henan migrant workers from workers in Beijing for 20 years, children in Beijing from kindergarten to junior high school, but was told that the move can only apply for enrollment in secondary vocational schools, and high school can not be reported. April 28, because they can not participate equally in the entrance examination in Beijing household registration in Henan, Shandong and Beijing\u0027s eight non-nationals middle school students, the Beijing Xicheng District administrative complaint filed by the Beijing Municipal Commission of Education court. Reporter\u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-90-c-10.html\"\u003enike air max 90 venta online\u003c/a\u003e  learned yesterday, they filed a suit in the court notice of its complement other materials on May 4.Experience | in Beijing from kindergarten to junior high school, when the move was \u0026quot;stuck\u0026quot;Chen Hui (a pseudonym) in Beijing workers 20 years, residence in Xinyang, Henan, 14-year-old son from nursery school to start is in Beijing, between 2011-2014, in the middle school high school student in Beijing, with Beijing official school and will graduate this year junior high school. But when you sit in high school, high school enrollment system does not apply to children or wife to provide the appropriate procedures, registration website shows \u0026quot;candidates after children or wife raised their studies online application and the qualification can apply for the category school.\u0026quot; In other words, his children can apply for vocational schools, and can not apply for an ordinary high school.Reporter Query Beijing Education Examination \u0026quot;issued in 2014 in Beijing, China Merchants work notice\u0026quot; found that non-city residence of the candidates, to distinguish between the different enrollment under different circumstances, \u003c/p\u003e\u003cp\u003e\u0026quot;Taiwanese children\u0026quot;, \u0026quot;post-doctoral children\u0026quot;, \u0026quot;army children \u0026quot;, etc., may apply for an ordinary high school without Beijing official residence, qualified candidates Children of Migrant Workers may apply for secondary vocational schools, but does not have to apply for an ordinary high school qualifications.\u0026quot;I think it is unfair to our children, this distinction is clear discrimination.\u0026quot; After consulting a lawyer, Chen Hui and the other seven parents jointly developed an administrative complaint. Complaint that the defendant acts illegal, a violation of the plaintiff\u0027s equal right to education, the requirements apply high school in Beijing.Feedback | Interim Policy apply only children or wife vocational28 pm, Chen Hui with the screen name \u0026quot;Forgotten Rangers Beijing migrant workers,\u0026quot; the matter sent to microblogging, as of 14:00 yesterday, forwarded more than 1600.Congress suspected of criminal how to do Yesterday, \u0026quot;the Standing Committee of Guangzhou Municipal People\u0027s Congress\u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-90-c-10.html\"\u003enike air max 90 baratas\u003c/a\u003e  on behalf of the license to take certain measures restricting personal freedom and implementation of the provisions of the Criminal Justice (draft)\u0026quot; submitted to the twenty-eighth session of the fourteenth session of the Standing Committee for consideration, Congress expressly provided for representative to take the measures to be licensed, and by the Standing Committee of the permission for the arrest or on behalf of a criminal trial, nor restrictions on behalf of liberty. In the case of flagrante delicto detention representative, within 24 hours of the Standing \u003c/p\u003e\u003cp\u003eCommittee should serve a written report. Ma Ying-jeou to finalize major changes in party personnel, new North Mayor Chu, Taichung Mayor Jason Hu, Taipei Mayor Hau Lung-bin and three people will take over the party vice-chairman, means the party will expand the decision-making circles, it is tantamount to start 2016 Blues succession layout.Before November 2013 will be held in early Kuomintang all generations, let alone the party who took over as vice-chairman three voices, when news came to light was denied, on the one hand is the 2014 election of mayors seven in three \u0026quot;municipalities\u0026quot; undetermined candidate Ma Ying-jeou does not want 2016 \u0026quot;presidential\u0026quot; big battle ahead bit staged; Second, three possible successors Mesozoic everyone is party election, if into the CPC Central Committee, the lame horse in danger; Third, Ma questioned last September. \u0026quot; Legislative Yuan \u0026quot;Wang Jin said the case involved judicial off, Ma Wangzheng fight continued spread, Rola Hao Lijiang three people into the decision-making core, equal to deadlift three candidates take sides.Ma Ying-jeou in the anti-trade protests clothes, filed on April 15, 16 party for reform and the Central Standing Committee will be reported in Zhongshan, stressed people should be reviewed, including his own \u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-1-c-1.html\"\u003enike air max 1 comprar\u003c/a\u003e  behalf that he had realized that his public support for the long-term at low exhaust irresolute facts, but also on behalf of his understanding of \u0026quot;lame\u0026quot; come early, decision-making mechanisms must be expanded to show the sincerity of the next two years, the policy will be able to ride through.Ma Ying-jeou April 27 invited 15 mayors meet to discuss party policies and make consensus decisions nuclear power plant, is expanding through the decision-making mechanism within the party system, now let Hao Lijiang three people into the party decision-making mechanism. On the one hand declaring \u0026quot;the era of the horse,\u0026quot; the major polic\u003c/p\u003e\u003c/div\u003e","tags":[]}}