{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1525230619,"rating":-4,"authorHandle":"AaronSwartz","modificationTimeSeconds":1525230619,"id":59205,"title":"\u003cp\u003eDP ADVANCED\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi everyone, someone can help me with these exercise, they are from CP3, but I can\u0027t handle them \u003cbr /\u003e I\u0027ll really appreciate it if you could help me \u003cbr /\u003e \u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eExercise 3.5.2.5\u003c/strong\u003e: Suppose we add one more parameter to this classic 0-1 Knapsack problem. \u003cbr /\u003e Let Ki denote the number of copies of item i for use in the problem. Example: n \u003d 2,\u003cbr /\u003e V \u003d {100, 70}, W \u003d {5, 4}, K \u003d {2, 3}, S \u003d 17 means that there are two copies of item 0 \u003cbr /\u003e with weight 5 and value 100 and there are three copies of item 1 with weight 4 and value\u003cbr /\u003e 70. The optimal solution for this example is to take one of item 0 and three of item 1, with\u003cbr /\u003e a total weight of 17 and total value 310. Solve new variant of the problem assuming that\u003cbr /\u003e 1 ≤ n ≤ 500, 1 ≤ S ≤ 2000, n ≤ Sum(Ki) ≤ 40000! Hint: Every integer can be written as a \u003cbr /\u003e sum of powers of 2. \u003cbr /\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eExercise 3.5.2.6\u003c/strong\u003e: The DP TSP solution shown in this section can still be slightly enhanced\u003cbr /\u003e to make it able to solve test case with n \u003d 17 in contest environment. Show the required\u003cbr /\u003e minor change to make this possible! Hint: Consider symmetry!\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eExercise 3.5.2.7\u003c/strong\u003e: On top of the minor change asked in Exercise 3.5.2.5, what other\u003cbr /\u003e change(s) is/are needed to have a DP TSP solution that is able to handle n \u003d 18 (or even\u003cbr /\u003e n \u003d 19, but with much lesser number of test cases)?\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}