{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1460751431,"rating":32,"authorHandle":"shef_2318","modificationTimeSeconds":1460751431,"id":44376,"title":"\u003cp\u003eInvitation to April Clash 2016\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi everyone!\u003c/p\u003e\u003cp\u003eI\u0027d like to invite you to participate in \u003ca href\u003d\"https://www.hackerearth.com/april-clash-16/\"\u003eApril Clash\u003c/a\u003e on \u003ca href\u003d\"https://www.hackerearth.com/\"\u003eHackerEarth\u003c/a\u003e. Contest is scheduled on April, 16. Contest duration is 24 hours, so we hope it will be possible to find comfortable time for everyone in any timezone :) Check your \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dApril%20Clash%20%2716\u0026amp;iso\u003d2016-04-16T01:30:00\u0026amp;p1\u003d64\"\u003etime\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThere will be six tasks in a problemset. Five of them are standard algorithmic problems with partial solutions allowed — you get points for every test that your solution passed. And the last task is an approximate problem — your score for this task depends on how good your solution is comparing to current best solution.\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/kostya_by\" title\u003d\"Гроссмейстер kostya_by\"\u003ekostya_by\u003c/a\u003e is author of this problemset. Check out his problems on Codechef and Hackereath to make sure that he is able to provide good problems :)\u003c/p\u003e\u003cp\u003eAs you might guess I worked on this contest as a tester and that was nice:) In our opinion several tasks will be not too hard for beginners (don\u0027t give up and show your best with partial scoring — even very naive solution may give you some points; and 24 hours should be enough for you to read all problems and find some tasks which you can solve). \u003c/p\u003e\u003cp\u003eAt the same time we are pretty sure that some tasks will be decent challenges for experienced contestants too. But if you think that classic part of problemset is easy — the approximate problem is waiting for you :) \u003c/p\u003e\u003cp\u003eAlso we want to thank \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/belowthebelt\" title\u003d\"Эксперт belowthebelt\"\u003ebelowthebelt\u003c/a\u003e for handling all technical aspects of contest preparation. \u003c/p\u003e\u003cp\u003eThe problem statements will be provided in English and Russian. \u003c/p\u003e\u003cp\u003eAs usual, here is one more reason for you to participate in this contest:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTop5 of leaderboard will grab some nice prizes:\u003c/strong\u003e\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003e$100 Amazon gift card + HackerEarth T-shirt\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e$80 Amazon gift card + HackerEarth T-shirt\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e$50 Amazon gift card + HackerEarth T-shirt\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eHackerEarth T-shirt\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eHackerEarth T-shirt\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eGood luck to everybody — let\u0027s have fun :)\u003c/p\u003e\u003c/div\u003e","tags":["hackerearth","clash","april"]}}