{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1420807057,"rating":8,"authorHandle":"Izot_NNSTU","modificationTimeSeconds":1420807282,"id":15673,"title":"\u003cp\u003eПогашение долгов за минимальное число транзакций\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eСтолкнулся с задачкой, которую легко переформулировать в терминах олимпиадного программирования. Уверен, такое решалось 100000 раз, но я что-то не придумал быстро элегантного решения (теряются навыки ACM) :)\u003c/p\u003e\u003cp\u003e\u003ccode\u003en\u003c/code\u003e друзей посидели в кафе и расплатились не оставив ни копейки чаевых. Кто-то заплатил больше, чем он должен, кто-то меньше. Теперь друзьям надо рассчитаться друг с другом, при этом передавая деньги из рук в руки наименьшее число раз.\u003c/p\u003e\u003cp\u003eФормально так: есть \u003ccode\u003en\u003c/code\u003e целых чисел (балансы друзей), сумма этих чисел равна \u003ccode\u003e0\u003c/code\u003e. За ход можно взять пару чисел и прибавить произвольное целое число к первому числу этой пары, при этом отняв от второго.\u003c/p\u003e\u003cp\u003e\u003ccode\u003en1, n2 -\u0026gt; n1\u0027\u003dn1+k, n2\u0027\u003dn2-k\u003c/code\u003e\u003c/p\u003e\u003cp\u003eЗадача — за наименьшее число ходов превратить все числа в 0.\u003c/p\u003e\u003cp\u003eНе смог убедить себя, что жадный алгоритм работает :)\u003c/p\u003e\u003cp\u003eЕдинственное, что придумал — пролить макспоток минимальной стоимости через граф с истоком, стоком, слоем должников и слоем кредиторов, где каждый должник соединен с каждым кредитором ребром с пропускной способностью бесконечность. При этом функция стоимости будет странная — 1 если по ребру течет какой-то поток и 0 в противном случае. Вообще не уверен, что алгоритм нахождения потока будет работать с такой функцией.\u003c/p\u003e\u003cp\u003eКороче говоря, я уверен, что это какая-то стандартная задача. Кто напомнит как такое решать?\u003c/p\u003e\u003cp\u003eКстати, задача становится немного интереснее, если добавить ограничение на номинал купюр, которые есть у друзей.\u003c/p\u003e\u003c/div\u003e","tags":["поток","игра"]}}