{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1470648414,"rating":56,"authorHandle":"mihnevsev","modificationTimeSeconds":1470648414,"id":46465,"title":"\u003cp\u003eЛетняя школа в Ужгороде\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eМне удалось собрать мнения нескольких участников, обзвонить тренеров которые там были, пообщаться с одесситами и нельзя было не написать про школу в Ужгороде. Я так понял, что было много недостатков, много треша, но как минимум одно стоит отметить, школа состоялась и асм движение от этого больше выиграло, чем проиграло. Огромный респкет и уважуха Мицце А.В., честно не ожидали такого, хотя по славам тех с кем я общался, было похоже что его несколько подставили не дав нужного количества помощников.\u003c/p\u003e\u003cp\u003eНо школа таки да, состоялась. Лекторы были как у нас говорят далеко не всегда лекторами, особо понравился Женя Запорожец, который ещё не забронзовел как львовские хлопци, особенно Васяра. Как говорится, первое впечатление редко обманчиво, но я как только вижу его фото или вживую так и плюнуть и отвернуться, настолько он вызывает антипатию. Но возможно это только у меня такая реакция. А так в Ужгороде все не так плохо, хотелось бы приехать зимой, может Мицца решится зимой провести, когда не так жарко. Опять понял, что был т.Мисюра –ещё одна противная личность, на покой его пора отправить, а он все молодится, мне всегда когда я слушал его «выступления» на трибунах в Виннице, хотелось пообщаться его студентами, неужели им нравится как он мямлит, как глотает слова и как кривляется, строив из себя суперспеца в АСМ. Вообщем как я и говорил раньше т.Мисюра сейчас уже больше тормозит олимпиадное движение в Украине, чем развивает.\u003c/p\u003e\u003cp\u003eГоворить что-то на трибуне и что-то организовывать, это как у нас говорят, две большие разницы. Поэтому организаторам спасибо, гоните только от себя подальше Васяр и т.Мисюр!\u003c/p\u003e\u003c/div\u003e","tags":["ужгород","летняя школа"]}}