{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1405090741,"rating":-7,"authorHandle":"Chameleon","modificationTimeSeconds":1405090741,"id":13014,"title":"\u003cp\u003eIdea about more useful interface for users\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHow about create new pdf-files of new contests with text of problems ? \u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d\u003d For whom it will be useful: 1. For all users who have bad internet. 2. For users who use subway in Ukraine and Russia it will be extremely useful solve problems using gadgets or printouts. 3. For users who have desktops and can\u0027t solve problems in the schools or other organisations. 4. Just for users who would like to program more, but don\u0027t have enough time to sit opposite \u0026quot;blue screen\u0026quot;.\u003c/p\u003e\u003ch1\u003eHow it can be done ?\u003c/h1\u003e \u003col\u003e   \u003cli\u003eIt can be a pdf-file that will be create after ending of contests, but it isn\u0027t a good idea because of buying new servers it is quite expensive.\u003c/li\u003e   \u003cli\u003eIt can be a program where we will be click the contest and it will be download in the pdf-format file this solving would be better, I think.\u003c/li\u003e   \u003cli\u003eOr many others variants how to do that.\u003c/li\u003e \u003c/ol\u003e\u003ch1\u003eWhy we should do that ?\u003c/h1\u003e \u003col\u003e   \u003cli\u003eFirst of all, it will be useful for users.\u003c/li\u003e   \u003cli\u003eAs I know it doesn\u0027t create anywhere on the same websites yet. So it can be new feature of the Codeforces.\u003c/li\u003e   \u003cli\u003eAnd I think level of beginners will be higher because they will have chance to solve problems whenever they want to.\u003c/li\u003e \u003c/ol\u003e\u003c/div\u003e","tags":["organizational","idea","features"]}}