{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1490452035,"rating":217,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1490557093,"id":51208,"title":"\u003cp\u003eCodeforces × Harbour.Space Education Rounds 2017/2018\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces!\u003c/p\u003e\u003cp\u003eI am pleased to announce a long term partnership with Harbour.Space University and Codeforces.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/4d/30/4d302d046253a2b01c7dc593cf2a91cbd71d3974.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eHarbour.Space is supporting the return of a new series of educational rounds on Codeforces! \u003c/p\u003e\u003cp\u003eThey will take place with the regularity of ~2 times per month with the first round on \u003ca href\u003d\"http://timeanddate.com/worldclock/fixedtime.html?day\u003d27\u0026amp;month\u003d3\u0026amp;year\u003d2017\u0026amp;hour\u003d17\u0026amp;min\u003d35\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003e14:35 UTC, 27th of March, 2017\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eEducation Rounds Rules:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eScholarships to study Data Science, Computer Science and Cybersecurity in Barcelona for best performing participants, courtesy of Harbour.Space University (more details later!);\u003c/li\u003e   \u003cli\u003eClassic Duration: 1.5 — 2.5 hours;\u003c/li\u003e   \u003cli\u003eThe goal is rather to practice and to educate, than to compete;\u003c/li\u003e   \u003cli\u003eNot only problems, but also exercises can be used;\u003c/li\u003e   \u003cli\u003eUseful, even well-known ideas can be reused in order to introduce them to a wide range of participants;\u003c/li\u003e   \u003cli\u003eUnrated (perhaps only for now);\u003c/li\u003e   \u003cli\u003eWe will conduct them in the ACM-ICPC mode;\u003c/li\u003e   \u003cli\u003eThe results that are obtained after the end of the round, are preliminary;\u003c/li\u003e   \u003cli\u003eAfter the end of the round will be a 24-hour period of open hacks — any visitor of Codeforces may try to hack any complete solution to a problem of the last round (either from a contest, or from practice), the source code of hacking solution is available (you can copy the text and, for example, stress it);\u003c/li\u003e   \u003cli\u003eAll successful hacks from the previous item will be added to the official test set and after as long as 24 hours after the end of the round retesting of all complete solutions will be made;\u003c/li\u003e   \u003cli\u003eOnly after the final standings based on improved test data, the results are final;\u003c/li\u003e   \u003cli\u003eOur ability to process such problems are limited, so actually the test suites from the jury are expected to end up incomplete — we are looking forward to your hacks!\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIn February I had a new and wonderful experience of coaching top teams at the \u003ca href\u003d\"//codeforces.com/blog/entry/48905\"\u003eBarcelona ACM-ICPC Bootcamp\u003c/a\u003e hosted by \u003ca href\u003d\"http://harbour.space/\"\u003eHarbour.Space University\u003c/a\u003e. I was really impressed by the university, participating teams and fellow coaches from our community such as \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Endagorion\" title\u003d\"Legendary grandmaster Endagorion\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eE\u003c/span\u003endagorion\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/GlebsHP\" title\u003d\"International Grandmaster GlebsHP\"\u003eGlebsHP\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Michael\" title\u003d\"Candidate Master Michael\"\u003eMichael\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Jacob\" title\u003d\"Grandmaster Jacob\"\u003eJacob\u003c/a\u003e and \u003ca class\u003d\"rated-user user-black\" href\u003d\"/profile/snarknews\" title\u003d\"Unrated, snarknews\"\u003esnarknews\u003c/a\u003e that were also there.\u003c/p\u003e\u003cp\u003e\u003ciframe allowfullscreen\u003d\"\" frameborder\u003d\"0\" height\u003d\"315\" src\u003d\"https://www.youtube.com/embed/ykhEUajq9Ng\" width\u003d\"560\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003cp\u003eDuring the bootcamp it became clear to me that Harbour.Space University is a new type of university that’s reinventing the university experience. It is a modern, adaptable and flexible university that is doing amazing things in preparing talented students for careers in \u003ca href\u003d\"http://harbour.space/courses/computer-science\"\u003eComputer Science\u003c/a\u003e, \u003ca href\u003d\"http://harbour.space/courses/data-science\"\u003eData Science\u003c/a\u003e and \u003ca href\u003d\"http://harbour.space/courses/cyber-security\"\u003eCyber Security\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAll of their programs are developed in collaboration with the industry and are taught by the top professionals in the respective fields such as \u003ca href\u003d\"http://harbour.space/Faculty/Data-science/Victor-Kantor\"\u003eViktor Kantor\u003c/a\u003e, \u003ca href\u003d\"http://harbour.space/Faculty/Computer-Science/Edith-Elkind\"\u003eEdith Elkind\u003c/a\u003e, \u003ca href\u003d\"http://harbour.space/Faculty/Computer-Science/Alexander-Kulikov\"\u003eAlexander Kulikov\u003c/a\u003e, \u003ca href\u003d\"http://harbour.space/Faculty/Computer-Science/Alex-Dainiak\"\u003eAlex Dainiak\u003c/a\u003e, \u003ca href\u003d\"http://harbour.space/Faculty/Data-science/Sergey-Nikolenko\"\u003eSergey Nikolenko\u003c/a\u003e, \u003ca href\u003d\"http://harbour.space/Faculty/Data-science/Deepa-Gupta\"\u003eDeepa Gupta\u003c/a\u003e and many others. I am delighted to be joining Harbour.Space fantastic faculty. Together we are developing a series of courses on competitive programming in addition to the bi-annual ACM ICPC Bootcamp that will be hosted by the university in Barcelona.\u003c/p\u003e\u003c/div\u003e","tags":["educational rounds","harbourspace"]}}