{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1428536624,"rating":367,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1428570324,"id":17330,"title":"\u003cp\u003eCodeforces: two months after the 5th anniversary (Feb.-Mar., 2015)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eIt is only a day before the end of \u003ca href\u003d\"/5years\"\u003ethe fundraising campaign dedicated to the 5th anniversary of Codeforces\u003c/a\u003e. We are glad and grateful for your help and support. We are working hard to justify your and our own expectations.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFor those who are not accustomed to rush, remember that you still have a little time to join \u003ca href\u003d\"/5years/supporters\"\u003ethe remarkable list of our friends\u003c/a\u003e — help us and get a gift from the Codeforces team!\u003c/p\u003e\u003cp\u003eWhen summing up, of course, we mostly want not to count money, but to assess progress and the work done. I looked at all of our commits to Codeforces and Polygon, and made a digest of changes.\u003c/p\u003e\u003cp\u003eI did not include to the digest improvements in the depths of system\u0027s backend (although stability progress should be visible), infrastructure jobs, org. work around the championships — but, believe me, there were many items too.\u003c/p\u003e\u003cp\u003eAnd here is the list of our achievements for about two months after anniversary.  \u003c/p\u003e\u003ch3\u003eCodeforces\u003c/h3\u003e \u003cul\u003e   \u003cli\u003eImproved blogs functionality: you can view your post revisions, compare them, revert a post to specific revision.\u003c/li\u003e   \u003cli\u003eNow we use OAuth 2 for Google-accounts, we used Google as OpenID provider before.\u003c/li\u003e   \u003cli\u003eImproved flexibility of a registration process to rounds, which made it possible to support a variety of registrations to different VK Cup 2015 rounds.\u003c/li\u003e   \u003cli\u003eSupported detailed judgement report on sample tests available during a round. It was used on VK Cup 2015 Wildcard 1. We are thinking how we can use it on typical rounds.\u003c/li\u003e   \u003cli\u003eImproved contest manager interface to show more details about contest progress.\u003c/li\u003e   \u003cli\u003eImplemented policies to restrict private messages to avoid abuse.\u003c/li\u003e   \u003cli\u003eSupported team ratings (based on members ratings) and members ratings adjustments after a team contest.\u003c/li\u003e   \u003cli\u003eImplemented smooth dynamic problem scores with 250 points steps.\u003c/li\u003e   \u003cli\u003eImproved logic to show countdowns in the sidebar. Previously, it was easier to confuse the end of the registration and the start of the contest.\u003c/li\u003e   \u003cli\u003eImproved mails about new comment: supported locale of a comment. Previously, it was possible to follow the link, and do not see the comment.\u003c/li\u003e   \u003cli\u003eNow you can delete a comment in a few minutes after its publication.\u003c/li\u003e   \u003cli\u003eSupported search by contest name in Gym/Mashups.\u003c/li\u003e   \u003cli\u003eNew pages to show rating changes after a round. Separate page with friends.\u003c/li\u003e   \u003cli\u003eNow practice submissions are hidden during a virtual participation.\u003c/li\u003e   \u003cli\u003ePagination in Gym/Mashups.\u003c/li\u003e   \u003cli\u003eImplemented stuff to support crowdfunding campaigns. If we remove contests and problems from Codeforces, it will turn into kickstarter.\u003c/li\u003e   \u003cli\u003eBetter support of teams: now it is possible to delete a team.\u003c/li\u003e   \u003cli\u003eAdded records about problem locks in history of participation (by double click in standings table).\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003ePolygon\u003c/h3\u003e \u003cul\u003e   \u003cli\u003eSupported verification of a problem (including when you build a package) — to make a mistake preparing a problem has become even more difficult.\u003c/li\u003e   \u003cli\u003eSupported multiple programming languages and the ability to choose a language when uploading source files.\u003c/li\u003e   \u003cli\u003eAdded feature to upload checker/validator/interactor on its tab (now not only from the Files tab).\u003c/li\u003e   \u003cli\u003eImplemented feature to display the status of problem on row of table with problems.\u003c/li\u003e   \u003cli\u003eImproved support for contest tutorials — you can now download PDF/HTML with all tutorials.\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003eContests\u003c/h3\u003e \u003cul\u003e   \u003cli\u003eHosted 16 rounds, including rounds with prizes jointly with partner companies: \u0026quot;Rockethon 2015\u0026quot;, \u0026quot;ZeptoLab Code Rush 2015\u0026quot;. Also \u0026quot;VK Cup 2015\u0026quot; is in full swing.\u003c/li\u003e   \u003cli\u003eAdded about 50 new contests (some in Russian only, sorry) to the Gym. Some of them was prepared by the Codeforces team, some of them by community.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThank you for your attention, do not go far — will be so much more interesting.\u003c/p\u003e\u003cp\u003eMike Mirzayanov\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","5 years"]}}