{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1475393400,"rating":233,"authorHandle":"Nickolas","modificationTimeSeconds":1475393400,"id":47478,"title":"\u003cp\u003ee-maxx translation news + Hacktoberfest \u003d T-shirts!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eA quick update on the status of e-maxx translation project.\u003c/p\u003e\u003cp\u003eFirst, I\u0027m excited to announce that I\u0027ve joined \u003ca href\u003d\"https://github.com/e-maxx-eng/e-maxx-eng/\"\u003ee-maxx in English\u003c/a\u003e team as an admin! From practical point of view this means that I can review and accept pull requests and help with the issues arising during the contribution process. Feel free to contact me if you have questions. And if I encounter anything outside of my expertise, I can always ping \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/RodionGork\" title\u003d\"Expert RodionGork\"\u003eRodionGork\u003c/a\u003e directly :-)\u003c/p\u003e\u003cp\u003eSecond, October is a particularly good month for contributions to e-maxx translation, as well as for open source contributions in general. \u003ca href\u003d\"https://hacktoberfest.digitalocean.com/\"\u003eHacktoberfest\u003c/a\u003e is back this year, and they are giving away t-shirts to anyone who makes 4 pull requests to any GitHub-hosted projects between October 1st and 31st.\u003c/p\u003e\u003cp\u003eWe don\u0027t have an explicit list of issues to work on, but there are two basic kinds of contribution we\u0027re looking for:\u003c/p\u003e \u003col\u003e   \u003cli\u003eTranslations of articles (obviously :-)).\u003c/li\u003e   \u003cli\u003ePractice problems for already translated articles — these are the problems at online judges on which the described algorithm can be practiced. See \u003ca href\u003d\"http://e-maxx-eng.appspot.com/geometry/circle-circle-intersection.html\"\u003ecircle-circle intersection\u003c/a\u003e article for an example.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/46774\"\u003eHere\u003c/a\u003e is a recent post by \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/RodionGork\" title\u003d\"Expert RodionGork\"\u003eRodionGork\u003c/a\u003e about technical improvements in contributions process.\u003c/p\u003e\u003cp\u003eSo if you have at any point considered contributing to e-maxx translation, now is the time to do it :-)\u003c/p\u003e\u003c/div\u003e","tags":["e-maxx","english","open source"]}}