{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1523440727,"rating":59,"authorHandle":"Golovanov399","modificationTimeSeconds":1523448210,"id":58868,"title":"\u003cp\u003eA static page for drawing hexagonal grids\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone,\u003c/p\u003e\u003cp\u003eAbout 7 months ago I \u003ca href\u003d\"//codeforces.com/blog/entry/54122\"\u003eposted\u003c/a\u003e here about a tool for converting some rectangular grid cell coordinates into a sort of interactive picture. \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/AlexDmitriev\" title\u003d\"Grandmaster AlexDmitriev\"\u003eAlexDmitriev\u003c/a\u003e \u003ca href\u003d\"//codeforces.com/blog/entry/54122?#comment-381829\"\u003eproposed\u003c/a\u003e to make the same for hexagonal grids. Personally for me drawing hexagons during the contest is a pleasure, but it takes time and it\u0027s definitely a good idea to make such tool. Yesterday I remembered about this and made it, so \u003ca href\u003d\"https://golovanov399.github.io/grid/hex_grid_draw.htm\"\u003ewelcome\u003c/a\u003e. Here are some \u003ca href\u003d\"https://www.google.ru/search?q\u003dsite%3Acodeforces.com+hexagon\"\u003euse cases\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eWhen you proceed, you should see something like this:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/a3/93/a393fb3f223638336daa4633a32b686fd49d5a59.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThis tool does almost the same as the rectangular one, but there are some differences:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003e\u003ccode\u003eShow axis directions\u003c/code\u003e checkbox. The most useless checkbox, it just shows you the axis for the used coordinate system without even labeling them.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ccode\u003eShow coordinates\u003c/code\u003e checkbox. Writes a pair of coordinates in each cell.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ccode\u003eShow cell under cursor\u003c/code\u003e. If in the previous version cursor revealed coordinates of the cell which it was over, here it highlights this cell. However, it has some limits, read further.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ccode\u003eShow grid\u003c/code\u003e. Shows cell borders. Here is where the evilest evil hides. You see, drawing a rectangular grid of size \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e × \u003ci\u003em\u003c/i\u003e\u003c/span\u003e requires drawing \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eO\u003c/i\u003e(\u003ci\u003en\u003c/i\u003e + \u003ci\u003em\u003c/i\u003e)\u003c/span\u003e lines. Here is a different story. To draw a hexagonal grid of size about \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e × \u003ci\u003em\u003c/i\u003e\u003c/span\u003e one should draw \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eO\u003c/i\u003e(\u003ci\u003enm\u003c/i\u003e)\u003c/span\u003e segments. Of course they can be decomposed into \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eO\u003c/i\u003e(\u003ci\u003en\u003c/i\u003e + \u003ci\u003em\u003c/i\u003e)\u003c/span\u003e (intersected) paths, but I\u0027m not sure whether it will reduce the drawing time (however, it\u0027ll reduce the number of \u003ccode\u003e.beginPath()\u003c/code\u003e commands, but I don\u0027t know if it\u0027s so slow in js). This is why there is a size threshold after which grid drawing may take a long, and one can unmark this checkbox to draw only needed cells (of course in \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eO\u003c/i\u003e(\u003ci\u003etheircount\u003c/i\u003e)\u003c/span\u003e). It\u0027s especially annoying if one moves his mouse over a big grid which is being redrawn after each move (yes, maybe after a while I will not erase everything but repaint only the cell under cursor), so if the bounding box is big enough, one can see an icon with a cursor and a cell crossed out. This means that the cell under your cursor will not be highlighted independently of the previous checkbox. It\u0027s made in order to make this ugly performance less visible for users.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eMaybe (not very likely) some new functionality will be added. You can copy and modify any code you\u0027ll find.\u003c/p\u003e\u003c/div\u003e","tags":["grid","tool","visualizer","hexagons"]}}