{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1424779997,"rating":516,"authorHandle":"dreamoon","modificationTimeSeconds":1432885085,"id":16599,"title":"\u003cp\u003eIf you ask me how to improve your algorithm competition skill, I will give you the link of this blog.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIn recent one year, I don\u0027t know why but there are many people sending messages to me for asking similar problems. So I decide to create this blog.\u003c/p\u003e\u003cp\u003eIn the beginning, I must say, you may feel disappointed after reading this blog. Because I don\u0027t have any special tips. My study method has wasted me many many time.\u003c/p\u003e\u003cp\u003eThere are some basic points I think you have known.\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003ePractice, practice, and practice.\u003c/strong\u003e I take so many time to think and solve problems. I think I do it 5 hours a day on average.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003eMake friends with many awesome people.\u003c/strong\u003e I know many awesome people. For example, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/arosusti\" title\u003d\"Master arosusti\"\u003earosusti\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/kelvin\" title\u003d\"Grandmaster kelvin\"\u003ekelvin\u003c/a\u003e, peter50216(\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/0O0o00OO0Oo0o0Oo\" title\u003d\"International Grandmaster 0O0o00OO0Oo0o0Oo\"\u003e0O0o00OO0Oo0o0Oo\u003c/a\u003e), \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/seanwu\" title\u003d\"Candidate Master seanwu\"\u003eseanwu\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Shik\" title\u003d\"Grandmaster Shik\"\u003eShik\u003c/a\u003e, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/takaramono\" title\u003d\"Master takaramono\"\u003etakaramono\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/tmt514\" title\u003d\"Grandmaster tmt514\"\u003etmt514\u003c/a\u003e, ... If I have some problems that I can\u0027t solve in few weeks, I can almost get solution from my friends.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eThen I say what I do for training myself.\u003c/p\u003e\u003cp\u003eWhen I do problems. There are two possible order for choosing problem.\u003c/p\u003e \u003col\u003e   \u003cli\u003eStart from most people solved one.\u003c/li\u003e   \u003cli\u003eSolve consecutive Numbers of problems and try to solve all of them.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eI don\u0027t know which one is best. But I often change the strategy. And when I feel I can\u0027t solve problems anymore from a judge. I will find a new judge and continue to do the same thing.\u003c/p\u003e\u003cp\u003eIn fact, I think the order of doing problems is not important for me. When I read and solve 90% problems from a judge. Will you think the order of solving be important? I really don\u0027t know how to choose order is best for me. So I do almost the problems.\u003c/p\u003e\u003cp\u003eList some judges I use.(In fact, There are many Taiwanese judges I solved not listing in following because they don\u0027t open for all people.)\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/\"\u003eCodeforces\u003c/a\u003e. I think Codeforces is the best judge recently. It\u0027s easy to use and contain editorial for most problems.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca href\u003d\"http://community.topcoder.com/tc\"\u003eTopcoder\u003c/a\u003e. Topcoder have many awesome problems. Even I sometimes think problems of 250 pt are also beautiful. It contain Editorial for most problems, too. (\u003ca href\u003d\"http://community.topcoder.com/tc?module\u003dProblemArchive\"\u003eYou can find problems here.\u003c/a\u003e|\u003ca href\u003d\"http://apps.topcoder.com/wiki/display/tc/Algorithm+Problem+Set+Analysis\"\u003eYou can find editorial here.\u003c/a\u003e)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca href\u003d\"http://acm.sgu.ru/\"\u003esgu\u003c/a\u003e I think sgu is the hardest judge. It contain many problems with unusual skill.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca href\u003d\"http://acm.timus.ru/\"\u003eTimus\u003c/a\u003e There are many hard contest in the judge. I think it\u0027s good for group training.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca href\u003d\"http://projecteuler.net\"\u003eProjectEuler\u003c/a\u003e There are many good \u003cstrong\u003emath\u003c/strong\u003e problems in this website. After you solve a problem, you also can see how other people solve it in forum.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eI think the feel between practice and competition is quite different. So sometimes I will random choose some problems from a judge to form a problemset and set time limit for training myself. But now Codeforces have function of virtual contest. We can simply do the same thing in Codeforces.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eI don\u0027t choose problems by their topic. On the contrary, I study topic when I occur a problem that I cannot solve it.\u003c/strong\u003e Then I will ask my friends whether the problem is related to some topic or google it.\u003c/p\u003e\u003cp\u003eI usually read AC code of other people even I can solve it. Sometimes we can found a totally different solutions, better time complexity solutions, or short solutions.\u003c/p\u003e\u003cp\u003eI don\u0027t study from specific websites or resources, either. I will google each thing from google respectively.\u003c/p\u003e\u003cp\u003eThat\u0027s all what I do for studying algorithm.\u003c/p\u003e\u003c/div\u003e","tags":[]}}