{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1482499123,"rating":0,"authorHandle":"Nekrolm","modificationTimeSeconds":1484948549,"id":49274,"title":"\u003cp\u003eРазбор задач 17.12.16\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch2\u003eЗадача A\u003c/h2\u003e\u003cp\u003eСортируем друзей по возрастанию денег. Ставим оба указателя (p1, p2) на начало последовательности.\u003c/p\u003e \u003col\u003e   \u003cli\u003eДвигаем p2, пока разность между деньгами друзей под указателем p1 и p2 меньше d, накапливая сумму и обновляя ответ.\u003c/li\u003e   \u003cli\u003eВычитаем друга под указателем p1 из суммы и сдвигаем p1 на единицу.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eПовторяем шаги 1-2, пока один из указателей не дойдет до конца последовательности.\u003c/p\u003e\u003ch2\u003eЗадача B\u003c/h2\u003e\u003cp\u003eЗаводим multiset (либо map — для подсчета) Ставим оба указателя на начало последовательности.\u003c/p\u003e \u003col\u003e   \u003cli\u003eдвигаем p2, пока multiset пустой или разность между минимальным и максимальным элементом в нем равна единице, обновляем ответ и закидываем элемент под p2 во множество.\u003c/li\u003e   \u003cli\u003eВыкиываем элемент под p1 из множества (один!!! экземпляр) и сдвигаем p1 единицу.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eПовторяем шаги 1-2, пока один из указателей не дойдет до конца последовательности.\u003c/p\u003e\u003cp\u003eЗамечание: нужно быть осторожным, когда ответ — суффикс последовательности. Решить проблему можно многими способами. Самый простой — дописать в конец последовательности число -1;\u003c/p\u003e\u003ch2\u003eЗадача C\u003c/h2\u003e\u003cp\u003eСтроим две последовательности (отсортированные по возрастанию). Первая (s1) — позиции всех вхождений слова heavy Вторая (s2) — позиции всех вхождений слова metal\u003c/p\u003e\u003cp\u003eСтавим по одному указателю (p1, p2) на каждую из последовательностей:\u003c/p\u003e \u003col\u003e   \u003cli\u003eПока s2[p2] \u0026lt; s1[p1], сдвигаем p2\u003c/li\u003e   \u003cli\u003eДобавляем к ответу расстояние [p2, s2.end() )\u003c/li\u003e   \u003cli\u003eСдвигаем p1\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eПовторяем, пока не закончится хотя бы одна последовательность.\u003c/p\u003e\u003cp\u003eПодумайте, почему так будут подсчитаны все пары.\u003c/p\u003e\u003cp\u003eЗамечание: может быть удобным отсортировать последовательности по убыванию и поставить указатели на их концы.\u003c/p\u003e\u003ch2\u003eЗадача D.\u003c/h2\u003e\u003cp\u003eУказатели pl, pr ставятся на границы диапазона. \u003cspan class\u003d\"tex-span\"\u003e[ - 2·10\u003csup class\u003d\"upper-index\"\u003e9\u003c/sup\u003e,  + 2·10\u003csup class\u003d\"upper-index\"\u003e9\u003c/sup\u003e]\u003c/span\u003e и сдвигаются к значениям \u0026quot;вопросов\u0026quot; в зависимости от полученных ответов. Если в какой-то момент pl \u0026gt; pr, то ответ — Impossible.\u003c/p\u003e\u003ch2\u003eЗадача E\u003c/h2\u003e\u003cp\u003eПостроим для каждой строки последовательность \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003es\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e\u003c/sub\u003e\u003c/span\u003e — номера столбцов, в которых есть единица. Пусть l, r — номера первого и последнего столбца с единицей в данной строке (нумерация с нуля), тогда в последовательность \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003es\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e\u003c/sub\u003e\u003c/span\u003e дополнительно добавляются значения m+l и r-m, чтобы учесть возможность циклического сдвига. \u003c/p\u003e\u003cp\u003eПеребираем номер столбца \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ej\u003c/i\u003e\u003c/span\u003e: для каждой строки -\u0026gt; находим бинарным поиском в последовательностях \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003es\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e\u003c/sub\u003e\u003c/span\u003e ближайшие к \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ej\u003c/i\u003e\u003c/span\u003e элементы. берем сумму расстояний и обновляем ответ.\u003c/p\u003e\u003cp\u003eЗамечание: ближайшие к \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ej\u003c/i\u003e\u003c/span\u003e элементы в последовательностях можно искать без бинарного поиска, используя технику двух указателей. Будет один \u0026quot;первый\u0026quot; указатель, перебирающий индексы столбцов, и много \u0026quot;вторых\u0026quot; указателей, продвигающихся каждый по своей последовательности \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003es\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e\u003ci\u003ei\u003c/i\u003e\u003c/sub\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}