{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1504996158,"rating":388,"authorHandle":"Ahmad1","modificationTimeSeconds":1505036115,"id":54436,"title":"\u003cp\u003eMy graduation project: Badminton Playing Robot\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone,\u003c/p\u003e\u003cp\u003eI have been a permanent participant in competitive programming for many years now. I have been participating in ACM-ICPC for 3 years now, and managed to qualify for the world finals 2017.\u003c/p\u003e\u003cp\u003eNow that I have graduated from the department of Computer and Automation Engineering in Damascus University, I want to share with you my graduation project: badminton playing robot. In this project I used many algorithms that I learned from competitive programming (such as BFS, LIS and of course a lot of geometry).\u003c/p\u003e\u003cp\u003eWe used LIS to filter noise data of shuttle detection and BFS,DFS to implement Indoor Location System for robot tracking and queries like sum of sub-rectangle in an array, and we didn\u0027t use any libraries for image processing.\u003c/p\u003e\u003cp\u003eI’m so glad that I managed to use the techniques I learned from competitive programming in my project. I\u0027m also delighted that I was able to prove wrong those who say that competitive programming isn’t applicable in practical life, since I wouldn’t have been able to do all of this without my experience in ACM and competitive programming.\u003c/p\u003e\u003cp\u003eBadminton playing robot: Flying object detection, tracking and interception in real time \u003ca href\u003d\"https://www.youtube.com/watch?v\u003dECZxJFbRK5Y\u0026amp;feature\u003dyoutu.be\"\u003eproject video on youtube\u003c/a\u003e \u003c/p\u003e\u003cp\u003eI hope you check and enjoy this demo me and my graduation project team made on the basic ideas in our robot. Please feel free to write comments. I will be more than happy to answer any of your questions as well.\u003c/p\u003e\u003cp\u003eThis project was ceated by Me \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Ahmed\" title\u003d\"Candidate Master Ahmed\"\u003eAhmed\u003c/a\u003e, Majd Wardeh \u003ca class\u003d\"rated-user user-green\" href\u003d\"/profile/MajdWardeh\" title\u003d\"Pupil MajdWardeh\"\u003eMajdWardeh\u003c/a\u003e and Omar Aljubbah \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/Omarjh\" title\u003d\"Specialist Omarjh\"\u003eOmarjh\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":[]}}