{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1417623157,"rating":11,"authorHandle":"albertg","modificationTimeSeconds":1417683522,"id":14985,"title":"\u003cp\u003eCodeforces Round #281 (Div. 2) Editorial\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"/contest/493/problem/A\" title\u003d\"Codeforces Round 281 (Div. 2)\"\u003e493A - Vasya and Football\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWe need 2 arrays — for the first and second team, in which we must save \u0026quot;status\u0026quot; of the player — is he \u0026quot;clear\u0026quot;, yellow carded or sent off. Then while inputing we must output the players name if he wasn\u0027t sent off, and after the event he must be sent off.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"/contest/493/problem/B\" title\u003d\"Codeforces Round 281 (Div. 2)\"\u003e493B - Vasya and Wrestling\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWe need to vectors in which we will save points of first and second wrestlers, and two int-s, where we will save who made the last technique and what is the sum of all the numbers in the input. If the sum is not zero, we know the answer. Else we pass by the vectors, checking are there respective elements which are not equal. If yes — then we know the answer, else everything depends on who made the last technique.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"/contest/493/problem/C\" title\u003d\"Codeforces Round 281 (Div. 2)\"\u003e493C - Vasya and Basketball\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWe need an array of pairs — in each pair we save the distance and the number of team. Then we sort the array. Then we assume that all the throws bring 3 points. Then we pass by the array and one of our numbers we decrease on 1 (which one — it depends on the second element of array). Then we compare it with our answer. In the end — we print our answer. \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"/contest/493/problem/D\" title\u003d\"Codeforces Round 281 (Div. 2)\"\u003e493D - Vasya and Chess\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIf n is odd, then black can win white doing all the moves symetric by the central line. Else white can win putting his queen on (1,2) (which is the lexicographicly smallest place) and play symetricly — never using the first row.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"/contest/493/problem/E\" title\u003d\"Codeforces Round 281 (Div. 2)\"\u003e493E - Vasya and Polynomial\u003c/a\u003e\u003c/p\u003e\u003cp\u003eLet\u0027s discuss 2 case. 1) t!\u003d1 и 2) t\u003d1.\u003c/p\u003e\u003cp\u003e1) If our function is not constant (n\u0026gt;\u003d1) than a is greater all the coefficients, so the only polynom can be the number b — in the a-ary counting system. We must only check that one and constant function.\u003c/p\u003e\u003cp\u003e2)if t\u003d1 must be careful:\u003c/p\u003e\u003cp\u003ein case 1 1 1: the answer is inf,\u003c/p\u003e\u003cp\u003ein case 1 1 n: the answer is 0\u003c/p\u003e\u003cp\u003ein case 1 а а^x(x-integer, x\u0026gt;0): the answer is 1\u003c/p\u003e\u003cp\u003ein the other cases P(1) is greater than other coefficients.\u003c/p\u003e\u003c/div\u003e","tags":[]}}