{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1459412866,"rating":46,"authorHandle":"mfv","modificationTimeSeconds":1461862702,"id":44110,"title":"\u003cp\u003eОлимпиадное программирование с нуля на Java\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e1 апреля 2016 начинаются занятия \u0026quot;Олимпиадное программирование с нуля на Java\u0026quot;.\u003c/p\u003e\u003cp\u003eЕсли у Вас есть знакомые\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eшкольники, не умеющие программировать, но желающие научиться;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eшкольники, имеющие базовые знания в области программирования, желающие получить знания и навыки, которые помогут достойно выступить на муниципальном этапе Всероссийской олимпиады школьников по информатике,\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eсообщите им пожалуйста об этом проекте. Участие в занятиях бесплатно.\u003c/p\u003e\u003cp\u003eПонимание, что из себя представляют занятия, можно получить, посмотрев \u003ca href\u003d\"https://cloud.mail.ru/public/ECiT/HbyvMxUq8\"\u003eархив 6 занятий, проходивших в феврале 2016\u003c/a\u003e. Итогом тех занятий было проведение \u003ca href\u003d\"//codeforces.com/blog/entry/23604\"\u003eExperimental Educational Round: VolBIT Formulas Blitz\u003c/a\u003e на Codeforces.\u003c/p\u003e\u003cp\u003e1 апреля 2016 будет перезапуск проекта, то есть вначале будут разбираться те же темы, что и в феврале, правда, более углублённо, далее перейдём к следующим темам.\u003c/p\u003e\u003cp\u003eТемы, которые будут разобраны: целочисленная и вещественная арифметика, условия, циклы, массивы, строки.\u003c/p\u003e\u003cp\u003eЗанятия будут проходить в виде вебинаров. Планируемое расписание вебинаров: 3 раза в неделю — понедельник, среда, пятница, с 14:30 до 15:30 по Москве. В курсе, который был в феврале, занятия, бывало, растягивались до 2 часов, потому что нужно было заданные темы пройти за ограниченное количество занятий, в новом курсе планируется придерживаться регламента более жёстко.\u003c/p\u003e\u003cp\u003eВебинары предполагается проводить 8 недель весной с 1 апреля по 25 мая 2016, а также 10 недель осенью со 2 сентября по 9 ноября 2016.\u003c/p\u003e\u003cp\u003eПосле каждого вебинара будет доступна запись.\u003c/p\u003e\u003cp\u003eИнформация о вебинарах публикуется на странице \u003ca href\u003d\"https://vk.com/ol_prog_0\"\u003ehttps://vk.com/ol_prog_0\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЗаписи вебинаров выкладываются на канал YouTube \u003ca href\u003d\"https://www.youtube.com/channel/UCwZIfY8SZvct6_nYkjmODrg\"\u003ehttps://www.youtube.com/channel/UCwZIfY8SZvct6_nYkjmODrg\u003c/a\u003e\u003c/p\u003e\u003cp\u003eТакже записи вебинаров выкладываются в облако mail.ru \u003ca href\u003d\"https://cloud.mail.ru/public/M5Wa/g13ej8rKF\"\u003ehttps://cloud.mail.ru/public/M5Wa/g13ej8rKF\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЗанятия проводить буду я, Меньшиков Фёдор Владимирович,\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eавтор книги \u003ca href\u003d\"http://e-maxx.ru/bookz/files/menshikov.djvu\"\u003e\u0026quot;Олимпиадные задачи по программированию\u0026quot;\u003c/a\u003e,\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eучастник финала студенческого чемпионата мира по программированию 2003,\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eтренер порядка десяти победителей и призёров заключительных этапов Всероссийской олимпиады школьников по информатике и ВКОШП,\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eна текущий момент независимый тренер (репетитор) по олимпиадному программированию.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":["объявление","курсы","с нуля","java"]}}