{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1524677430,"rating":4,"authorHandle":"Black_Red_Grape","modificationTimeSeconds":1524677430,"id":59104,"title":"\u003cp\u003eCross Section and Ellipse. Need Help!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eCan any ellipse be represented as a diagonal half cross section of a cylinder? By \u0026quot;diagonal half cross section\u0026quot; I mean if a plane cuts the cylinder through these 3 points: a point from the top circle, the centre, and the diametrically opposite point of the first point. I know there are 2 cases of this, but right now I can\u0027t provide a picture of the case I want from the two. Sorry for that. I want the case where the plane cuts the curved surface of the cylinder, not the plane surfaces on both sides. I hope you understand.\u003c/p\u003e\u003cp\u003eIf the answer is yes, that any ellipse can be represented like this, then can\u0027t we measure the perimeter of the ellipse from this? Because the distance between the point from the top circle and the diametrically opposite point should be measured by applying the pythagorean formula, right? Because the cylinder can be opened and can be made into a rectangle. Am I right? I think I am wrong somewhere. But I don\u0027t know where. I\u0027ve searched and found out that there\u0027s no exact formula for calculating the perimeter of an ellipse.\u003c/p\u003e\u003cp\u003eSorry that I can\u0027t make it more understandable :( If you have difficulty understanding what I am asking, you may go to the links below and maybe you will get the idea which I am talking about.\u003c/p\u003e\u003cp\u003eYou can check the figures \u003ca href\u003d\"https://www.quora.com/How-do-you-calculate-the-cross-section-area-of-cylinder\"\u003ehere\u003c/a\u003e. Though I don\u0027t want the cross section area, I want the perimeter.\u003c/p\u003e\u003cp\u003eAnd maybe \u003ca href\u003d\"https://math.stackexchange.com/questions/123022/distance-across-cylinder\"\u003ethis\u003c/a\u003e and \u003ca href\u003d\"https://math.stackexchange.com/questions/1276701/calculating-the-shortest-route-around-cylinder\"\u003ethis\u003c/a\u003e to get what I wanted by diagonal half cross section.\u003c/p\u003e\u003cp\u003eThanks in advance...\u003c/p\u003e\u003c/div\u003e","tags":[]}}