{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1498615845,"rating":101,"authorHandle":"rick_sanchez_c-137","modificationTimeSeconds":1498622993,"id":52949,"title":"\u003cp\u003eJury\u0027s solution proved incorrect by counter example, what if it wasnt?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eWubalubadubdub!\u003c/p\u003e\u003cp\u003eToday the jury solution for \u003ca href\u003d\"//codeforces.com/contest/819/problem/A\"\u003eproblem A\u003c/a\u003e (div1a/div2c) was proved incorrect by a hack from a contestant. But what if it wasn\u0027t? Maybe this would be unnoticed by everyone. Maybe for ever. Does this mean that there are other problems such as this one in which the problematic test cases weren\u0027t found?\u003c/p\u003e\u003cp\u003eThe input in this case were pretty small, only 4 positive numbers, two of which were bounded by 12. One can only wonder about other problems, maybe with more complex test cases, maybe solved by a smaller sample of people, that are erroneously considered easy or correct. Maybe the outputs are correct for the considered input bounds, but the proof in the editorial isn\u0027t. Maybe there isn\u0027t a correct proof, just the coincidence that a certain algorithm gives correct output in every case.\u003c/p\u003e \u003cpre\u003eI can only conclude that the lack of proof that competitve programming instigates can be dangerous. When someone fails to solve a problem as fast as the majority of others they may belive that they are overthinking, that others see that the obvious solution in a matter of seconds, when, in fact, it is just a generalized incorrect human intuition built to perform well in this kind of competitions. \n\nMaybe we lie too often to ourselves that we undestand a problem. \n\nPerhaps the editorials should be what they should be, proofs. But what do I know? I am just a slave in the universe inside yours. In a commedy show. Or maybe you are inside mine? And therefore, your existance is a lie. Or isn\u0027t it? It can\u0027t be a lie, afterall, everyone agrees otherwise.\u003c/pre\u003e\u003c/div\u003e","tags":[]}}