{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1413089243,"rating":30,"authorHandle":"RodionGork","modificationTimeSeconds":1413089243,"id":14232,"title":"\u003cp\u003eHow to land a Rocket?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI found this \u0026quot;ancient\u0026quot; computer game browsing through an old book:\u003c/p\u003e\u003cp\u003ePlayer is controlling the rocket approaching the Moon. Current height and speed are reported along with the mass of remaining fuel.\u003c/p\u003e\u003cp\u003ePlayer can specify how many fuel should be fed to engines for each next 10-seconds period.\u003c/p\u003e\u003cp\u003eThe goal is to land the rocket with the speed not exceeding safe small value (say, \u003ccode\u003e10 m/s\u003c/code\u003e).\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"Crash landing of the rocket\" src\u003d\"/predownloaded/81/a7/81a796ed74c31d892a04d0fdce44e16f5d41b028.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThe physics is obvious enough. New height and speed are reported each 10 seconds, so the height is decreased by roughly \u003ccode\u003espeed * 10 sec\u003c/code\u003e and speed is changed also according to gravity and working engines.\u003c/p\u003e\u003cp\u003eI liked the idea and readily converted it into exercise for my site and also added javascript \u0026quot;demo\u0026quot; to play it:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href\u003d\"http://www.codeabbey.com/index/task_view/safe-landing\"\u003eGame demo and more thorough explanations\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThen I started playing the game myself... Well, it appeared tricky!!!\u003c/p\u003e\u003cp\u003eSometimes I burned too much fuel before reaching the surface, the rocket lost the speed (or even started climbing up), then began free falling and crashed.\u003c/p\u003e\u003cp\u003eAnd sometimes I was too hesitant to burn the fuel in time so I crashed with tanks still containing more fuel than I could use (because burning rate is limited by \u003ccode\u003e100 kg / second\u003c/code\u003e).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSo I came to the question which I currently could not answer:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eWhich algorithm could help to calculate optimal burning rate settings (for a chain of 10-second periods) so that the rocket lands with safe speed and, additionally, maximum possible fuel left?\u003c/p\u003e\u003c/div\u003e","tags":["rocket fuel","simulation"]}}