{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1507974671,"rating":-42,"authorHandle":"-Wave-","modificationTimeSeconds":1507974671,"id":55177,"title":"\u003cp\u003eProgramming languages of reds and why we need more diversity\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI was considering trying to use Python on Codeforces, so I wanted to find a top rated contestant who uses Python as their main language. \u003cstrong\u003eTurns out no red contestant uses Python as their main language\u003c/strong\u003e. \u003ca href\u003d\"https://gist.github.com/IAmWave/01603900db33d38a17c553c78d40076e\"\u003eI compiled this list of who uses which language.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eNot surprisingly, C++ dominates — about 95% reds use it:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eC++:    262\nJava:   12\nPython: 3\nC#:     1\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003e\u003cem\u003eNote that all three Python users were actually just messing around with the language recently, but they use C++ as their primary language. See the gist to see who uses which language + which compiler/version.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eI think this is a shame, because there are many wonderful languages that simply don\u0027t get used because people fear they are slower than C++. Many problems are designed in a way that requires careful optimization even in C++ and are simply not solvable in other languages.fr\u003c/p\u003e\u003cp\u003eI think having execution time multiplied by a constant that differs per-language would be are a reasonable solution to penalize C++ and Java. \u003ca href\u003d\"https://www.hackerrank.com/environment\"\u003eHackerrank already does this.\u003c/a\u003e If Codeforces, the most popular platform, started doing this, it could help getting the competitive programming community out of the C++ feedback loop: \u003cstrong\u003eeverybody supports C++ because everybody uses C++ because everybody supports C++\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eAnother way of solving the problem is to use the open-data format, which is obviously not an option for Codeforces, but \u003ca href\u003d\"https://www.go-hero.net/jam/17/round/0\"\u003eGoogle Code Jam statistics\u003c/a\u003e illustrate that there is a demand for other languages as well.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eGetting out of the C++ loop would help getting more people in the community because they wouldn\u0027t be forced to learn C++ (not the easiest of languages) just to stand a chance. If more people started using different languages, they would have more support, resources, tutorials etc. -- think of how every tutorial on an algorithm, technique or trick is currently written in C++. For sure having implementations of crucial algorithms in something like Python would help a lot as well, if only because of how approachable it is compared to C++.\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":["programming","languages","c++","python","red","grandmaster"]}}