{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1466234634,"rating":57,"authorHandle":"Labib666","modificationTimeSeconds":1466234634,"id":45502,"title":"\u003cp\u003eJOI Open Contest 2016\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eLooks like the Japanese Olympiad in Informatics (JOI) Open Contest is going to take place in less than 24 hours. The \u003cstrong\u003efirst round\u003c/strong\u003e will be held on \u003cstrong\u003eJune 19, 2016: 04:00-09:00 (UTC/GMT)\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eYou can access the contest from this page: \u003ca href\u003d\"http://cms.ioi-jp.org/open-2016/index.html\"\u003ehttp://cms.ioi-jp.org/open-2016/index.html\u003c/a\u003e \u003cbr /\u003e\u003cbr /\u003eAccording to this \u003ca href\u003d\"http://cms.ioi-jp.org/open-2016/index.html\"\u003elink\u003c/a\u003e:\u003c/p\u003e\u003cp\u003e\u0026quot;This is an IOI-like open competition for students at schools for secondary education. The main purpose of this contest is to give an opportunity to Japanese delegations and candidates of delegations for training and practice. But the contest itself is open to everybody. Everybody is welcome to attend JOI Open Contest 2016!\u003c/p\u003e\u003cp\u003eThe duration of the contest is 5 hours. The same contests are held twice (Round 1 and Round 2). Contestants can participate in one of Round 1 or Round 2 according to their time zone. After Round 2 finishes, we will open the judging server for one day. Interested contestants can improve and resubmit their solutions by themselves.re held twice (Round 1 and Round 2).\u003c/p\u003e\u003cp\u003eRegistration will be open before each contest. A link to the registration page will appear on this \u003ca href\u003d\"http://cms.ioi-jp.org/open-2016/index.html\"\u003epage\u003c/a\u003e about 30 minutes before the beginning of each contest. Contestants can register on the contest site by themselves from the right before the beginning of each contest until the end of it.\u003c/p\u003e\u003cp\u003eNo prizes will be given to the contestants.\u0026quot;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eContest duration\u003c/strong\u003e\u003cbr /\u003e 5 hours\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe number of tasks\u003c/strong\u003e\u003cbr /\u003e 3 tasks\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLanguage\u003c/strong\u003e\u003cbr /\u003e English, Japanese\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRound 1\u003c/strong\u003e\u003cbr /\u003e Sunday, June 19, 2016\u003cbr /\u003e 13:00-18:00 +0900 (JST)\u003cbr /\u003e 04:00-09:00 (UTC/GMT)\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRound 2 (tasks for Round 1 and Round 2 are the same)\u003c/strong\u003e\u003cbr /\u003e Sunday, June 19, 2016\u003cbr /\u003e 19:00-24:00 +0900 (JST)\u003cbr /\u003e 10:00-15:00 (UTC/GMT)\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["joi","ioi","2016","contest"]}}