{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1411149364,"rating":10,"authorHandle":"kostya_by","modificationTimeSeconds":1411149364,"id":13868,"title":"\u003cp\u003eВторая неделя. Упражнения.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДублирую текст письма, разосланного всем, кто был на лекции.\u003c/p\u003e \u003chr /\u003e\u003cp\u003eВсем привет. Сегодня вы поприсутствовали на втором занятии.\u003c/p\u003e\u003cp\u003eУпражнений на первой неделе оказалось очень много, так что на этой их будет не очень много.\u003c/p\u003e\u003cp\u003eДля начала, чтобы вам было проще дорешать первую партию упражнений, я покидаю сюда свои исходники на наиболее сложные задачи:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e1. Hotel - http://pastie.org/9576078\n2. Lights - я не нашел, но Юра ее уже сдал. Юра, если тебе на сложно, то пришли его в эту почтовую ветку.\n3. Фибоначчи -  http://codeforces.com/contest/446/submission/7085627\n4. Задача про подчиненных - ее уже сдал Глеб. Так что к тебе, Глеб, такая же просьба: скинь код в эту ветку.\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eНадеюсь, исходники помогут тем, кто хочет разобраться в том, как решать задачи с прошлой недели.\u003c/p\u003e\u003cp\u003eЧто касается гробов — код задачи с codejam можно взять тут: \u003ca href\u003d\"http://pastie.org/9576099\"\u003ehttp://pastie.org/9576099\u003c/a\u003e. Я использовал дополнительную динамику для переходов между разными монстрами, в которых целится башня. Надеюсь, разберетесь. \u003c/p\u003e\u003cp\u003eА теперь самое интересное — новые упражнения!\u003c/p\u003e\u003cp\u003eУпражнения:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e1. http://codeforces.ru/problemset/problem/282/E - задача про поиск двух элементов с максимальным ксором.\n2. Областная олимпиада 2012 года, задача Конкурс - задача про подмаски\n3. http://codeforces.com/contest/383/problem/E - тоже задача про подмаски\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eГробы:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e1. http://www.codechef.com/problems/SEAARC\n2. http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1699\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eКак обычно, по всем вопросами или в скайп(kostya-by), или пишите прямо в это ветку.\u003c/p\u003e\u003cp\u003eНапоминаю, что я жду от Юры и Глеба исходники(если им не жалко).\u003c/p\u003e\u003cp\u003eВсем спасибо и удачи! \u003c/p\u003e\u003c/div\u003e","tags":["упражнения","лицей бгу"]}}