{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1486718578,"rating":13,"authorHandle":"Lance_HAOH","modificationTimeSeconds":1487044099,"id":50344,"title":"\u003cp\u003eBuy maximum number of unique items given limited budget\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI am trying to solve an algorithmic problem that is described as follows:\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eThere are K types of items and 2 supermarkets. Each selling all K types of items but at different prices. Please find the maximum number of unique items that can be bought given that we can spend only X dollars in supermarket 1 and Y dollars in supermarket 2.\u003c/p\u003e\u003cp\u003eBounds:\u003c/p\u003e\u003cp\u003e1 \u0026lt;\u003d K \u0026lt;\u003d 2000\u003cbr /\u003e 1 \u0026lt;\u003d X, Y \u0026lt;\u003d 10000\u003c/p\u003e\u003cp\u003eExample:\u003c/p\u003e\u003cp\u003eK \u003d 5, X \u003d 6, Y \u003d 12\u003c/p\u003e\u003cp\u003eSupermarket 1 (We have 6 dollars): \u003c/p\u003e\u003cp\u003eType 1: 5\u003cbr /\u003eType 2: 1\u003cbr /\u003eType 3: 5\u003cbr /\u003eType 4: 6\u003cbr /\u003eType 5: 3 \u003c/p\u003e\u003cp\u003eSupermarket 2 (We have 12 dollars):\u003c/p\u003e\u003cp\u003eType 1: 3\u003cbr /\u003eType 2: 5\u003cbr /\u003eType 3: 4\u003cbr /\u003eType 4: 6\u003cbr /\u003eType 5: 7 \u003c/p\u003e\u003cp\u003eIn this case, the optimal answer would be 4 because we can buy item types 1 and 2 in supermarket 1, item types 3 and 4 in supermarket 2.\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eProblem source: \u003ca href\u003d\"http://dunjudge.me/analysis/problems/1174/\"\u003ehere\u003c/a\u003e\u003c/p\u003e\u003cp\u003eI have interpreted it as a coin change problem where one must collect the maximum number of different denominations. Hence, I don\u0027t think that a greedy algorithm can work here (since it fails for coin change). More precisely, if one sorts the 2 item lists according to item-price pairs, it would clearly fail since one type of item may be very expensive in both lists.\u003c/p\u003e\u003cp\u003eThe next method of my list is to use DP. But, I think DP might be too slow.\u003c/p\u003e\u003cp\u003eCould anyone please advise me on a better solution to solve this problem?\u003c/p\u003e\u003cp\u003eEdit:\u003c/p\u003e\u003cp\u003eI managed to solve the problem thanks to \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/data_h\" title\u003d\"International Grandmaster data_h\"\u003edata_h\u003c/a\u003e and \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Narenji58\" title\u003d\"Grandmaster Narenji58\"\u003eNarenji58\u003c/a\u003e\u0027s help in the comments. The complete solution can be found \u003ca href\u003d\"https://ideone.com/c3nc8Q\"\u003ehere\u003c/a\u003e\u003c/p\u003e\u003cp\u003eOnce again, thanks a lot for all your help!\u003c/p\u003e\u003c/div\u003e","tags":["dynamic programming","optimization"]}}