{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1502280822,"rating":-45,"authorHandle":"gutkrutz","modificationTimeSeconds":1502280822,"id":53762,"title":"\u003cp\u003eИнтервью С Победителеями NEERC2016\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПоздравляю чемпионов 21 полуфинала NEERC — команду SPb State University 1 в составе Игоря -XraY- Пышкина, Айдара aid Сайранова, Станислава ershov.stanislav Ершова :)\u003c/p\u003e\u003cp\u003eПоздравляю и все команды, прошедшие на финал! Затаив дыхание смотрела, как вы радуетесь :) Впереди много работы — тренируйтесь и все получится! После церемонии награждения удалось поболтать с Игорем: — Привет! Поздравляю с победой :) Пару слов о прошедшем контесте. — Довольно тяжело сегодня прошел контест. В какой-то момент показалось, что уже все, у нас нет никаких шансов на первое место, и мы реально боялись за результаты. Но в какой-то момент все поменялось неожиданно. — Этот момент был ближе к началу или концу? — Ближе к концу. Мы сдали задачу B, с которой у всех были проблемы. Это была задача с подвохом, и мало кто ее сдал в результате. — Какая у вас была стратегия? — У нас есть Cтас, который со мной участвовал в прошлом году. Он в основном решает, пишет задачи, которые ему нравятся. А всякие задачи, которые более сложные технически, мало кому нравятся, мы пишем с Айдаром. Решаем все вместе — у нас в команде все умеют решать задачи и это прекрасно. — Как проходят ваши тренировки? — У нас есть три тренировки в неделю в СПбГУ, пишем пятичасовой контест. Еще мы ходим с Айдаром где-то раз в неделю в ИТМО на тренировки, которые проводит Андрей Станкевич. — Разборы есть? — После контеста мы друг с другом общаемся и обсуждаем то, что произошло. Бывают интересные и неожиданные задачи — их имеет смысл обсуждать. Остальные все стандартные. — Какие планы на вечер? — Сейчас гулять пойдем, веселиться. Тренер команд Андрей Лопатин тоже рассказал интересного: — Как вы проводите тренировки, подбираете контесты для ребят? — Бывают контесты, которые собраны из большого количества сложных задач. Обязательная составляющая — это дорешивание. Есть блицы, которые составлены из задач совсем простых и средней сложности. Бывают просто старые хорошие контесты, которые полезны на мой взгляд. Достаточно часто бывают выборки сложных задач. Зависит от текущей ситуации, того что происходит. В двух словах сложно описать. — Вы принимаете участие в разборе? — Ну мы обсуждаем некоторые теоретические моменты, которые нужно. В основном мы, конечно, стараемся, чтобы ребята сами дорешивали задачи. Если почему-то это не получается, тогда да — мы начинаем искать знания либо мои, либо моих коллег, которые нужно получить для того, чтобы эта задача решалась. — А есть среди команд новичков девушки? :) Какой процент? — Есть девушки, да. Только, к сожалению, на полуфинале нет команд с девушками. На четвертьфинале человек 10 из 32 команд было точно, может даже и больше. — Спасибо за общение, поздравляю вас с победой! :)\u003c/p\u003e\u003c/div\u003e","tags":[]}}