{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1402236785,"rating":107,"authorHandle":"yeputons","modificationTimeSeconds":1402238084,"id":12609,"title":"\u003cp\u003eTestexe for testing systems: say \u0027no\u0027 to extra large static arrays!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eEveryone knows a problem with native executables on Windows: if it tries to allocate very large static arrays (or something similar that causes problems \u003cem\u003eduring the loading\u003c/em\u003e), then the testing system may mark the submission as \u0027it killed our system\u0027 and report nothing to the participant. Say, in Testsys it caused Failed To Test (and no feedback to the participant), on Codeforces it caused Denial of Judgement, and PCMS2 still has this problem. Example submission:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eint data[(int)2.1e9 / sizeof(int)];\nmain() {}\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eIf one is familiar with process creation on Windows, it\u0027s obvious what to do: try to run the solution right after compilation and report Compilation Error with report in case of invalid executable. It looks like noone except me have the time to do this and \u003ca href\u003d\"http://pastebin.com/JgW7C78k\"\u003ehere\u003c/a\u003e is my utility, which already serves on Codeforces. If you have your own testing system, you\u0027re welcome to run this application after compilation to check an executable for validness (you can just copy-paste the code directly into your judging module, too). After that you will be able to report incidents to the user and drop hints about extra large arrays existance.\u003c/p\u003e\u003cp\u003eNo user code is being running during the check: process is fully suspended by the OS after successfull loading and before any instructions are run (it\u0027s what the \u003ccode\u003eCREATE_SUSPENDED\u003c/code\u003e parameter is responsible for).\u003c/p\u003e\u003c/div\u003e","tags":["testing","testing system","windows","win32","denial of judgement","testexe"]}}