{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1467174323,"rating":165,"authorHandle":"decoder123","modificationTimeSeconds":1467379827,"id":45736,"title":"\u003cp\u003eHow do people manage both?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI have seen many competitive programmer who are working in different companies. I am just thinking how do they get time to practice the coding? I mean there are lots of topic to learn and lots of things to work on ....\u003c/p\u003e\u003cp\u003eWell there are some of them who are already better when they entered into the Job, so at least they don\u0027t need to learn new things but I guess everyone needs some time to workout. But there is other people who also learned after getting into a job I guess.. and also there is a social life in which even if someone doesn\u0027t want to attend he/she had to sometimes. Also there are always a deadline to meet in a company work schedule.\u003c/p\u003e\u003cp\u003eI will be really glad if you people (Codeforces community) share your experience on this regard. Please if possible also provide the company name in which you belong. \u003c/p\u003e\u003cp\u003eThe key things I guess everyone wants to know is :-\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eHow much time you get after end of the day for learning or practice or learning+practice?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003ewhat is your work hour in company?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIs it stressful to do what you do?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIs it possible to become a neat competitive programmer like that (I mean doing CP and job both)?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eHow is your social life? // what I want to ask is How do you cope up with? \u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eFeel free add to your experience on this regards. Take care everyone and thanks. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eI thought I would see many answers. There are so many awesome coders who are maintaining both so efficiently. Don\u0027t know why any of them was not interested in answering it here. If I had the chance to meet with them I would do that for sure. Anyway if any of those coders want to tell their way of working ..feel free to message me. I will let other users know (not disclosing the name of course) about their experience if they wish me to do it. Thanks to all people who has read and answered this post.\u0026quot;\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e** None of them seemed to answer. Any coder from any organization may feel free to share their experience on any of the question. It will be helpful to many fellow coders joining the software Industry or Job life.\u0026quot;\u003c/p\u003e\u003c/div\u003e","tags":["coding competition","job","learning","coding time"]}}