{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1456826254,"rating":0,"authorHandle":"Auster","modificationTimeSeconds":1456826254,"id":43477,"title":"\u003cp\u003eВнутренний этап олимпиады по программированию 01.03.2016\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДля идентификации вас в будущем, ОБЯЗАТЕЛЬНО оставьте в данном посте в качестве комментария свои ФИО, курс (школу), группу (класс).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eВНИМАНИЕ\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eДля решения задачи требуется, чтобы она прошла все тесты. Частичные решения положительно не влияют на результат (только негативно). За каждую неудачную посылку вам начисляется штрафное время в размере 20 минут. После успешной сдачи задачи к штрафному времени прибавляется текущая по счету минута соревнования. Участники ранжируются по количеству сданных задач, при равенстве — по штрафному времени (у кого меньше, у того выше место).\u003c/p\u003e\u003cp\u003eВывод в решении нужно производить на консоль. Выводить нужно именно то, что вас просят и ничего лишнего. Если в задаче вам необходимо вывести одно число, то выводите его, а не, например, строчку вида \u0026quot;Otvet \u003d 7\u0026quot;. Проверяющая система не увидит это число и выдаст вердикт либо \u0026quot;неправильный ответ\u0026quot;, либо \u0026quot;неправильный формат вывода\u0026quot;. Тоже самое касается печати комментариев перед вводом данных, типа \u0026quot;Vvedite x \u003d \u0026quot; и фиктивных считываний, оставленных в конце программы. Проверить решение на правильность ввода\\вывода можно, предварительно запустив код во вкладке \u0026quot;Запуск\u0026quot;.\u003c/p\u003e\u003cp\u003eОтправлять на проверку нужно файл исходного кода (*.cpp, *.cs, *.py, *.pas и т.п.) или копировать в окно отправки код из вашей среды разработки. Следите за тем, чтобы в вашем исходном коде (особенно это касается тех, кто пишет на C++) не были подключены файлы, которые содержатся локально на вашем компьютере (например stdafx.h).\u003c/p\u003e\u003cp\u003eСоревнование начнется в 15:40 и будет длиться 180 минут. GLHF!\u003c/p\u003e\u003c/div\u003e","tags":[]}}