{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1525877632,"rating":410,"authorHandle":"CodeforcesIsRuined","modificationTimeSeconds":1525877632,"id":59361,"title":"\u003cp\u003eCodeforces is destroying itself...\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI am well aware that this post will get a lot of backlash due to the controversial topic I am going to write about. That is why I have opened this fake id. Sorry Mike.\u003c/p\u003e\u003cp\u003eYou all know what is happening right now in Codeforces. All on a sudden, lots of changes have happened. Purple guys are considered rated in div2, div3 is introduced for cyan and lower guys. Then there is this lowering of yellow region down to 2100. Lot to absorb at once.\u003c/p\u003e\u003cp\u003eWhat surprised me the most is that all these things happened pretty abruptly. Some purple guy thought that they should be considered rated in div2 and then some agreed and opposed. The next thing we know is that Mike literally agreed to all the things the purple guy proposed without even considering the opposition of others. Looks like he was biased.\u003c/p\u003e\u003cp\u003eTwo rounds have taken place, one div2 and the other is div3. Suddenly, people who barely reached blue are now more than mid blue! And people who were barely purple, are now mid purple or even more. Same is for yellow. This is ridiculous that you can be a \u0027master\u0027 only by solving 4 problems in div2! I have always regarded (and many other people, too) that being master in Codeforces is hard achieved thing in general. But now, you can reach master by competing with people way lower than your capability. This is even true for me. My color is something right now that I don\u0027t really deserve.\u003c/p\u003e\u003cp\u003eThen there is this issue of lowering the lower bound of yellow region. You do good enough in div2 being almost purple, and voila, you are now a master.\u003c/p\u003e\u003cp\u003eLet me give some adjectives to Mike\u0027s decision. This whole new atmosphere is ridiculous, outrageous and harmful for the community. Simply, this decision is bad. Codeforces is lowering its standards.\u003c/p\u003e\u003cp\u003eI know I have offended so many people by this post. And this will go down to the earth with negative votes. I am extremely sorry for that. But these thoughts had to be spoken out loud.\u003c/p\u003e\u003cp\u003eThanks for reading. And thanks for ruining Codeforces.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","div2","div3","codeforcesisruined"]}}