{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1432467095,"rating":79,"authorHandle":"KAP","modificationTimeSeconds":1432475588,"id":18073,"title":"\u003cp\u003eUniversities.meteor.com: отзывы об университетах: если у вас есть вопросы \u0026quot;куда поступать\u0026quot; или ответы на такие вопросы\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e[TLDR: заходите на \u003ca href\u003d\"http://universities.meteor.com\"\u003euniversities.meteor.com\u003c/a\u003e, оставляйте там отзывы о своих университетах и читайте отзывы других пользователей.]\u003c/p\u003e\u003cp\u003eНа codeforces, да и в других местах, регулярно возникают вопросы \u0026quot;куда поступать\u0026quot;, \u0026quot;расскажите про университет\u0026quot; и т.п. Это зачастую выливается в длительное обсуждение, но потом подобные обсуждения теряются в глубинах сайта и оставляют мало полезной информации на будущее. Более того, такие обсуждения, как правило, затрагивают только один университет (в лучшем случае — сравнивают два университета), и обычно покрывают лишь весьма ограниченный список тем из того, что хотят знать абитуриенты.\u003c/p\u003e\u003cp\u003eЧтобы исправить эту проблему, я сделал сайт \u003ca href\u003d\"http://universities.meteor.com\"\u003euniversities.meteor.com\u003c/a\u003e .\u003c/p\u003e\u003cp\u003eЕсли вы — студент или выпускник, заходите на этот сайт, логиньтесь через вКонтакт и оставляйте отзывы о своем университете/факультете/кафедре* (добавляйте университет, если его еще не добавили до вас). На сайте развитая система категорий и подсказок, показывающая, о чем стоит писать. Если вам кажется, что все, что вы можете сказать про университет — это одно-два предложения, то вы ошибаетесь!\u003c/p\u003e\u003cp\u003eЕсли вы — школьник или абитуриент, то заходите на сайт, логиньтесь через вКонтакт и читайте отзывы об интересующих вас университетах/факультетах/кафедрах*.\u003c/p\u003e\u003cp\u003eНезависимо от того, кто вы, вы можете комментировать уже имеющиеся отзывы. Автор отзыва при этом получит уведомление на email (если укажет его у себя в профиле на сайте) и во вКонтакт (если вКонтакт не заблокирует несколько коряво сделанную систему уведомлений). Надеюсь, что это позволит получить достаточно живые дискуссии.\u003c/p\u003e\u003cp\u003eЕсли у вас есть какие-то комментарии по сайту, пишите здесь. В частности, если вы хотите добавить какие-то категории, темы, то пишите. Если сайт получит популярность, я думаю добавить отдельный подраздел \u0026quot;предметы\u0026quot; (в каждом университете), чтобы можно было бы подробнее описывать, какие предметы есть и какие впечатления об их преподавании.\u003c/p\u003e\u003cp\u003eКод сайта доступен под AGPL, если найдутся желающие, можете писать pull request\u0027ы.\u003c/p\u003e\u003cp\u003eНа данный момент на сайте есть уклон в сторону программистов-олимпиадников среднего и высокого уровня (в первую очередь он проявляется в том, что есть отдельный раздел про ACM), но для аудитории codeforces, думаю, именно это в первую очередь и интересно.\u003c/p\u003e\u003cp\u003eИтак, еще раз:\u003c/p\u003e\u003ch1\u003e\u003ca href\u003d\"http://universities.meteor.com\"\u003euniversities.meteor.com\u003c/a\u003e\u003c/h1\u003e \u003chr /\u003e\u003cp\u003e*На сайте и в этом посте я использую термин \u0026quot;университет\u0026quot; для обозначения достаточно \u0026quot;однородных\u0026quot; учебных образований — то, про что имеет смысл оставлять отзыв. Обычно это будет факультет, но может быть и кафедра, и университет целиком. Грубо говоря, это то, что школьник может ответить на вопрос \u0026quot;куда поступаешь?\u0026quot;. Например, вряд ли вы сможете написать осмысленный отзыв про МГУ целиком, но вряд ли также абитуриентов будет сильно интересовать тонкие различия между кафедрами ВМК МГУ. Поэтому на сайте имеет смысл писать именно отзывы про ВМК МГУ. Но с другой стороны, КТ ИТМО — это ярко выраженная отдельная кафедра, поэтому имеет смысл писать отзывы именно о КТ. С третьей стороны, насколько я понимаю, в АУ один осмысленный факультет, поэтому можно писать отзыв целиком про АУ. В дальнейшем, возможно, сделаю иерархическую структуру \u0026quot;университетов\u0026quot;\u003c/p\u003e\u003cp\u003eP.S. Как здесь в блоге сделать так, чтобы [cut] был между абзацами?\u003c/p\u003e\u003c/div\u003e","tags":["университет","куда поступать","вуз","поступление","итмо или спбгу","вмк или вшэ"]}}