{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1490924202,"rating":-20,"authorHandle":"HARRYPOTTER0","modificationTimeSeconds":1490932330,"id":51336,"title":"\u003cp\u003eInvitation to TCS Codevita 2017\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi guys .. CodeVita — the global coding contest by TCS is now in its 6th year. The CodeVita journey began in 2012 with the aim of promoting Programming-As-A-Sport, and has touched many milestones since then. In 2014 was the first time we opened the contest globally and last year we had registrations from 40 plus nations. Its popularity with the student community peaked last year when we saw 2,61,000 plus registrations and also secured a place in the Limca Book of Records.\u003c/p\u003e\u003cp\u003eHope you too had great fun participating in previous seasons of CodeVita. With season 6 we are looking at it getting better, more challenging and super exciting. This season CodeVita is an individual contest. Unlike the other seasons it will not be a team contest. The contest will comprise of several rounds of coding. To participate in CodeVita, one needs to register on the Campus Commune portal.\u003c/p\u003e\u003cp\u003eThere will be 3 main rounds to the contest.\u003c/p\u003e\u003cp\u003eRound 1: there will be various regional/zonal rounds. This will be conducted in 3 phases between Jul – Aug 2017, across India. We will map the student to the region/zone based on the location of their college. Details of zonal mapping and the exact time-lines will be communicated subsequently.\u003c/p\u003e\u003cp\u003eRound 2: Top performers from the zonal rounds will move to round 2. Top performers from round 2 have the opportunity to move to the Grand Finale, The list of Finalists is compiled only after all regional rounds across the globe are completed\u003c/p\u003e\u003cp\u003eGrand Finale: To be held in one of the TCSL offices in India. Top 3 contestant will be declared as winners of the contest. Winners (Top 3 contestants) will receive a total cash prize of USD 20,000. We will be extending internships and offers to top coders from the contest, we are looking at making upto 2000 offers this year\u003c/p\u003e\u003cp\u003e**** \u003ca href\u003d\"https://campuscommune.tcs.com/en-in/intro/view_blog/step-by-step-guide-for-registration-to-codevita\"\u003elink to register\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}