{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1475071264,"rating":75,"authorHandle":"gKseni","modificationTimeSeconds":1475091380,"id":47396,"title":"\u003cp\u003eУчреждена именная стипендия для двукратного чемпиона ICPC от Тинькофф Банк\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eНа \u003ca href\u003d\"http://news.ifmo.ru/ru/university_live/achievements/news/6052/\"\u003eновостном портале ИТМО\u003c/a\u003e появилась заметка об именной стипендии для Геннадия \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e Короткевича:\u003c/p\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e \u003cimg src\u003d\"/predownloaded/03/b9/03b96292aef83d57b5abbcbf295cc2559f64c146.png\" style\u003d\"float: right;margin: 0 0 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e Основатель Тинькофф Банка Олег Тиньков учредил первую именную стипендию для двукратного чемпиона мира по программированию и магистранта Университета ИТМО Геннадия Короткевича. Данную стипендию победитель многочисленных олимпиад и соревнований будет получать ежемесячно до конца обучения в вузе. Как объяснил сам Олег Тиньков, он и его команда желают и впредь поддерживать самых одаренных и талантливых студентов. \u003cbr /\u003e\u003cbr /\u003e «Молодые люди должны учиться и думать о знаниях, а не о деньгах. Поэтому мы готовы поддерживать лучших студентов, в том числе и финансово, и надеемся, что эта стипендия станет хорошим стимулом для других. А самых талантливых разработчиков и программистов после вуза мы приглашаем в команду „Тинькофф“!», — подчеркнул Олег Тиньков. \u003cbr /\u003e\u003cbr /\u003e В рамках кампании по поиску лучших IT-специалистов Тинькофф Банк проводит встречи со студентами вузов России. В апреле этого года Олег Тиньков встретился со студентами Университета ИТМО, где в формате вопрос-ответ рассказал о себе, своем деле и обсудил вопросы социальной ответственности бизнеса. После встречи предприниматель объявил о готовности Тинькофф Банка выплачивать ежемесячную стипендию студенту, который достиг значительных успехов в сфере IT не только в России, но и в мире. Таковым стал Геннадий Короткевич, магистрант Университета ИТМО, двукратный чемпион ACM ICPC и целого ряда значимых для мира информационных технологий соревнований. \u003cbr /\u003e\u003cbr /\u003e «Сейчас за таланты идет всемирная битва не только между университетами, но и между ведущими IT-компаниями мира, — отметил заведующий кафедрой технологии программирования Университета ИТМО Анатолий Шалыто. — Наша кафедра и вуз выступают за сохранение в университете лучших студентов, чтобы они впоследствии могли передавать свои знания таким же талантливым ребятам. Нам помогали и помогают наши знаменитые выпускники, а также компании JetBrains, Яндекс, Mail.Ru, Devino Telecom, „Транзас“. Благодаря этому на кафедре „Компьютерные технологии“ на постоянной основе работают трое чемпионов мира по программированию — Павел Маврин, Максим Буздалов и Артем Васильев, призеры чемпионатов мира Георгий Корнеев и Андрей Станкевич — тренер, обеспечивший шесть побед команд Университета ИТМО на одном из самых престижных чемпионатов мира по программированию ACM ICPC. Многосторонняя помощь позволяет студентам и преподавателям кафедры достигать результатов мирового уровня. Мы рады, что число партнеров, которые нас поддерживают, пополнилось Тинькофф Банком во главе с Олегом Тиньковым». \u003cbr /\u003e\u003cbr /\u003e Напомним, что Геннадий Короткевич с 2008 по 2012 год завоевывал золотые медали на международной олимпиаде школьников по информатике, трижды становился абсолютным победителем соревнования. Будучи студентом Университета ИТМО, Геннадий — дважды чемпион Facebook Hacker Cup, трижды — победитель Google Code Jam уже три года подряд. Кроме того, молодой человек побеждал в 2014 и 2016 году на Russian Code Cup, а также в Яндекс. Алгоритм — в 2010, 2013, 2014, 2015 годах. В 2013 и 2015 годах Геннадий Короткевич в составе команды Университета ИТМО стал чемпионом международной студенческой олимпиады по программированию ACM ICPC. В этом году он окончил бакалавриат и поступил в магистратуру Университета ИТМО. \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003e\u003ca href\u003d\"http://news.ifmo.ru/ru/profile/13/\"\u003eПолина Полещук\u003c/a\u003e\u003c/i\u003e \u003c/p\u003e\u003cp\u003eОднако в Facebook заведующий кафедрой технологии программирования Университета ИТМО \u003ca href\u003d\"http://www.ifmo.ru/ru/viewperson/94/shalyto_anatoliy_abramovich.htm\"\u003eАнатолий Шалыто\u003c/a\u003e оставил интригующий комментарий:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/b3/15/b3156c4a419d7f333b988a4435c063915655c607.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eЖалко подробностей нет.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news","итмо","стипендия"]}}