{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1437830767,"rating":33,"authorHandle":"Alex_KPR","modificationTimeSeconds":1437898186,"id":19426,"title":"\u003cp\u003eVK Cup 2015: in progress\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi everybody!\u003c/p\u003e\u003cp\u003e\u003cimg height\u003d\"50%\" src\u003d\"/predownloaded/a3/62/a3627b86dbd6163cf9a26ae34a49ea51e60d8e42.jpg\" style\u003d\"float: right;margin: 8.0px;max-width: 100.0%;max-height: 100.0%;\" width\u003d\"50%\" /\u003e\u003c/p\u003e\u003cp\u003eThe VK Cup is in full action down here!\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Zlobober\" title\u003d\"Grandmaster Zlobober\"\u003eZlobober\u003c/a\u003e \u003ca href\u003d\"//codeforces.com/blog/entry/19425\"\u003ehas already given a quick look\u003c/a\u003e at the main activity of the guys who got to warm summer St.Petersburg yesterday and checked in the luxurous Courtyard Marriott hotel. Yes, the program is eventful and madly entertaining: yesterday they walked on the rooftops in the heart of the cultural capital of Russia. Today they had lunch on a little ship during a tour along rivers and canals. Besides, the weather has been really good to us!\u003c/p\u003e\u003cp\u003eThis time, all the serious events take place opposite the Kazan Cathedral in coworking with VK, in the freedom space. And the morning started with a crazy test round with two spectacular problems, where the first problem was a quiz problem with ten test questions. SobolevTeam achieved a landslide victory. They used a cool idea: according to the Codeforces contest rules, hacks show the contestant\u0027s response. The most important thing here is the expected valid result. That\u0027s why the team quickly sent and blocked their solution and in the end, didn\u0027t submit the problem :P. But their hacks helped them to quickly find the correct responses and then they hacked everybody whose response does not match the correct one. And what do we have in the end? 19 successful hacks!\u003c/p\u003e\u003cp\u003e\u003cimg height\u003d\"50%\" src\u003d\"/predownloaded/4d/19/4d19fb87280738fcedb5c259f2eb7b0a79ea0abf.jpg\" style\u003d\"float: left;margin: 8.0px;max-width: 100.0%;max-height: 100.0%;\" width\u003d\"50%\" /\u003e\u003c/p\u003e\u003cp\u003eDuring the tour the guys had fun reaching for metallic structures of bridges and feasted on tasty food. The most responsible ones studied the rules of the forthcoming CodeGame, thinking through non-trivial strategies. Oh yes, right now the CodeGame Coding phase is in progress!\u003c/p\u003e\u003cp\u003eThe guys need to think through the strategy of controlling a battle mage: collect heal and mana potions, cast all sorts of stuff correctly. I love such game-based events as it is a great opportunity to get used to the work place and get our hands working. \u003d)\u003c/p\u003e\u003cp\u003eIn the evening, after a small tour around the VK office, the participants will have a TechTalk with the developers and a CodeGame Show that will determine the team with the most effective mage-controlling strategy.\u003c/p\u003e\u003cp\u003eLet\u0027s follow the updates on the event together!\u003c/p\u003e\u003c/div\u003e","tags":[]}}