{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1429767574,"rating":54,"authorHandle":"fushar","modificationTimeSeconds":1429979174,"id":17533,"title":"\u003cp\u003eTLX Open Contest Beta Round #1 — Invitation\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi all,\u003c/p\u003e\u003cp\u003eThis year, Indonesia is hosting \u003ca href\u003d\"http://apio2015.org/\"\u003eAsia-Pacific Informatics Olympiad 2015\u003c/a\u003e. For this competition, we will use our brand new contest system called \u003ca href\u003d\"https://competition.ia-toki.org/\"\u003eTLX\u003c/a\u003e. We have been using TLX intensively for Indonesian training camps and so far we have been very satisfied and no major problems were encountered.\u003c/p\u003e\u003cp\u003eNow, we would like to conduct a real-time test for international usage. So, we invite you to take part in \u003cstrong\u003eTLX Open Contest Round #1\u003c/strong\u003e. Here are the details:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eSaturday, April 25 20.00 UTC+7 — 23.00 UTC+7 (3 hours) \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dTLX+Open+Contest+Beta+Round+%231\u0026amp;iso\u003d20150425T20\u0026amp;p1\u003d108\u0026amp;ah\u003d3\"\u003etimeanddate\u003c/a\u003e.\u003c/li\u003e   \u003cli\u003eYou have to register to TLX (there is an SSO login system), and then register to the contest.\u003c/li\u003e   \u003cli\u003eContest registration closes 5 minutes before contest \u003cstrong\u003eends\u003c/strong\u003e.\u003c/li\u003e   \u003cli\u003eIOI-style, 3 problems. There will be subtasks. For this testing round, we will be using past Indonesian olympiad problems.\u003c/li\u003e   \u003cli\u003eAvailable languages are C, C++11, and Pascal.\u003c/li\u003e   \u003cli\u003eFull scoreboard will be available.\u003c/li\u003e   \u003cli\u003eFull feedback for each submission.\u003c/li\u003e   \u003cli\u003eYou may submit clarifications on the first hour of the contest.\u003c/li\u003e   \u003cli\u003eThere is a 20 submissions limit per problem per contestant.\u003c/li\u003e   \u003cli\u003eNote: all times shown on TLX are in UTC+7 (Jakarta time).\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eFor APIO 2015 contestants, you may want to participate in this contest as a warm-up for the real contest. For all students, you may want to participate in this contest as a warm-up for IOI 2015.\u003c/p\u003e\u003cp\u003eThere is already a practice contest round for TLX contest system that you can use before the real contest round.\u003c/p\u003e\u003cp\u003eThanks!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPDATE\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThanks for participating! We\u0027re sorry for typos in problem statements -- we made some errors when importing the old problems from their PDFs to the systems.\u003c/p\u003e\u003cp\u003eThe problems have been added to the practice contest. Feel free to upsolve!\u003c/p\u003e\u003cp\u003eAlso, we would like to hear your comments on the contest system. Please do give some feedback on this thread!\u003c/p\u003e\u003cp\u003eThanks,\u003c/p\u003e \u003cul\u003e   \u003cli\u003eAPIO 2015 organizers \u0026amp; TLX developers\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":["apio2015"]}}