{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1418192351,"rating":328,"authorHandle":"Bredor","modificationTimeSeconds":1418192351,"id":15093,"title":"\u003cp\u003eЦФ — мечты сбываются!\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДобрый день, кодефорсез! Недавно произошло очень важное для меня событие. Год назад я был таким же человеком, как и любой из вас — среднестатистическим дрыщем. Время свое я проводил за игрой в танки и незамысловатой перепиской в контактике. Однако, все изменилось в один ничем не примечательный день, когда на запрос \u0026quot;2 g 1 cup\u0026quot; мой поисковик выдал мне ccылку на некий \u0026quot;r c cup\u0026quot;. я случайно прошел по ней и оказался в месте, кардинально изменившем мою жизнь. Как вы уже могли догадаться, этим сайтом был кодфорс. После этого я начал тренироваться, решать задачи. К сожалению, уже через пару месяцев это перестало быть мне интересно, так как для сдачи даже самой сложной задачи мне требовалось не более 3 минут и 48 секунд, поэтому я несколько разочаровался. На некоторое время я совсем перестал заходить на сайт и вновь вернулся к своим обыденным занятиям — танкам, турникам и посиживанию на мдк. Как-то раз я накатил несколько больше, чем стоило, и мне пришло озарение. Я понял, что мое призвание — делиться с остальными своим жизненным опытом и наставление молодых. Я тотчас же начал встревать во все подряд обсуждения, но, увы, мои старания не были оценены по достоинству:( \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/e6/ae/e6ae6e3a1db20ce2b43c4d5c47697a2986f8348d.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e Сообщество не приняло мои мысли. Тем не менее я, несмотря ни на что, продолжил попытки довести до сообщества свои идеи, проводя все свое свободное время в обсуждениях. Танки, телки, яжка - все смеркло перед моей великой целью стать похожим на акул пера и рыцарей клавиатуры из верха таблицы по вкладу. Старание, труд, и конечно, желание помочь начинающим программистам на сайте сделали свое дело:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/d4/2e/d42e114b256174ec1674c648932cf484807b1d92.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eЭто очень важно для меня — быть признанным сообществом. Всего год назад я был простым дрищем, а маска Гая Фокса была для меня лишь детской игрушкой. Сегодня я уже вполне серьезный программист, на которого на улице оборачиваются все встреченные телки, а еще я могу гордиться своим статусом настоящего философа и наставителя. Дерзайте и вы! Тащите контесты, как я, просвещайте неопытных пользователей! Кодефорсез — мечты сбываются!\u003c/p\u003e\u003c/div\u003e","tags":["батя","топ10","философия","про","радость","мечты сбываются"]}}