{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1497766080,"rating":206,"authorHandle":"sevens","modificationTimeSeconds":1497766968,"id":52712,"title":"\u003cp\u003eCompetitive Programmers\u0027 Dilemma\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello guys,\u003c/p\u003e\u003cp\u003eI decided to use a fake account for this post. I want to talk about a problem I am facing, which I guess might be common among many people in this community.\u003c/p\u003e\u003cp\u003eI am a junior year student in university and I am doing a summer internship at a reputed tech company. I find my job tremendously boring; Most of my day to day work is reading lots of documentation and implementing things. The hardest part of work is to make sure my code sits well within the existing framework. \u003c/p\u003e\u003cp\u003eI don\u0027t find this job exciting at all, but it pays really well. I have student loans and I pay them off by doing such internship every year. My past internships have been equally boring. My question to you is, what would you suggest to someone like me for the future?\u003c/p\u003e\u003cp\u003eTo give some context, I am a mediocre competitive programmer. My actual CodeForces rating is around 1900-2000 and I haven\u0027t gone to ICPC World Finals or IOI. Even outside the competitive programming world, my problem-solving skills are very mediocre. However, I am very interested in algorithms and mathematics. I would like to do research (PhD) after university, but I don\u0027t think I am smart enough.\u003c/p\u003e\u003cp\u003eI can see two possibilities for myself:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eGet high paying job as software developer. Accept the fact that it is boring.\u003c/li\u003e   \u003cli\u003eTry research (Probably fail and lose years).\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIs there any other option? What should I do?\u003c/p\u003e\u003c/div\u003e","tags":[]}}