{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1440619469,"rating":0,"authorHandle":"Eran","modificationTimeSeconds":1443188234,"id":19990,"title":"\u003cp\u003eСезон 2015-2016. Открытие.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e Для интересующихся. Финал ВКОШП будет проходить 12-13 декабря.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eКраткий анонс.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eЛето приближается к концу, и уже через неделю начнётся новый учебный год. А это значит, что скоро начнутся и олимпиады, которые мы все так ждём.\u003c/p\u003e\u003cp\u003eКонкретно сейчас я постараюсь сделать акцент на командной олимпиаде, первый тур которой пройдёт уже в октябре. А потому в группе в ближайшее время начнут появляться тренировки, рассчитанные на прорешивание командой.\u003c/p\u003e\u003cp\u003eЭта информация особенно актуальна для тех, кто рассчитывает попасть на ВКОШП — заключительный этап командной олимпиады, который пройдёт в Санкт-Петербурге. Также напоминаю, что в этом году квота будет составлять 4 команды от Саратовской и Самарской областей.\u003c/p\u003e\u003cp\u003eПланируете попасть в Питер? Начинайте готовиться уже сейчас! :)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e В раздел тренировок добавлена \u003ca href\u003d\"//codeforces.com/group/a4S4I425KW/contest/100599\"\u003eМосковская командная олимпиада школьников по программированию 2014, лига A (старшая лига)\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e В раздел тренировок добавлена \u003ca href\u003d\"//codeforces.com/group/a4S4I425KW/contest/100600\"\u003eМосковская командная олимпиада школьников по программированию 2014, лига B (младшая лига)\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e В раздел тренировок добавлена \u003ca href\u003d\"//codeforces.com/group/a4S4I425KW/contest/100132\"\u003eВсероссийская командная олимпиада школьников по программированию 2012-2013\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e В раздел тренировок добавлена \u003ca href\u003d\"//codeforces.com/group/a4S4I425KW/contest/100043\"\u003eВсероссийская командная олимпиада школьников по программированию 2010-2011\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e В раздел тренировок добавлена \u003ca href\u003d\"//codeforces.com/group/a4S4I425KW/contest/100715\"\u003eБонусная командная олимпиада (16 мая 2015 года)\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}