{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1460311275,"rating":16,"authorHandle":"marat.snowbear","modificationTimeSeconds":1460311275,"id":44287,"title":"\u003cp\u003eHow to create a gym contest in Polygon with statements as attachments?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI was trying to add yesterday Google Code Jam qualification round to the gym and decided this time to avoid typing in statements myself and print them from website to PDF and attach to the contest. I thought that I\u0027ll be able to create a contest with statements in attachments easily and get contest like \u003ca href\u003d\"/gym/100965\"\u003e2009-2010 Petrozavodsk Winter Training Camp, Moscow SU Unpredictable + SE + old ST Contest\u003c/a\u003e for example. It turned out that I have no idea how do that.\u003c/p\u003e\u003cp\u003eWhat I did:\u003c/p\u003e \u003col\u003e   \u003cli\u003eCreated regular contest in Polygon with checkers, tests, solutions, etc but with no statements.\u003c/li\u003e   \u003cli\u003eCreated a gym contest and added polygon contest\u0027s descriptor through FTP.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eThis creates a contest but there are two issues about it:\u003c/p\u003e\u003cp\u003eFirst of all I had no idea how to attach PDF statements. Eventually I was able to do that using Codeforces Contest Wizard in update mode using a link in gym contest. This Java tool is not that intuitive to use but I was able to upload my PDF document eventually and specify that this is English statements. Is there easier/better/other way to do that?\u003c/p\u003e\u003cp\u003eSecondly, my problems in gym have no name, usually I specify the names as part of the statement in the Polygon but since I had no statements in Polygon I had no names as well. I tried using Contest Wizard to solve this issue as well but the only way I think I found to do that requires uploading all problem data (checker/tests/etc) which I\u0027m not going to change and don\u0027t want to bother getting that again assuming that Polygon already created everything. \u003c/p\u003e\u003cp\u003eIf somebody wants to help me with that I can give an access to the gym contest, but I would be grateful for an advice as well.\u003c/p\u003e\u003c/div\u003e","tags":["polygon","gym","statements"]}}