{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1434518438,"rating":36,"authorHandle":"LuaXD","modificationTimeSeconds":1434519414,"id":18633,"title":"\u003cp\u003eCurious Codeforces bug.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eToday I was taking part of a virtual Codeforces round ( \u003ca href\u003d\"//codeforces.com/contest/218\"\u003eCF 218Div 2\u003c/a\u003e ). At the time of solving problem C I thought of a Union Find Disjoint Set Data Structure, I coded it and submitted such code. Since it was a virtual round, I immediately got the WA verdict, nevertheless I was sure that the idea was correct. So I made some unimportant changes, submitted again and got the AC verdict.\u003c/p\u003e\u003cp\u003eThe thing is, when the round was over, I wanted to know what was wrong with my first submitted code. I opened the log which shows information for each test case to see what happened, but the log info for that case was blank (View the submission \u003ca href\u003d\"/contest/218/submission/11613966\" title\u003d\"Submission 11613966 by LuaXD\"\u003e11613966\u003c/a\u003e).\u003c/p\u003e\u003cp\u003eI was very saddened to see that the usual WA message wouldn\u0027t show up (wrong answer 1st numbers differ — expected: \u00271\u0027, found: \u00273\u0027). So I decided to copy my code and resubmit.\u003c/p\u003e\u003cp\u003eThe resubmission verdict was AC. Both submissions are literally the same. As you can see, one has got a WA verdict and the other has got an AC. This are the two submissions: \u003ca href\u003d\"/contest/218/submission/11613966\" title\u003d\"Submission 11613966 by LuaXD\"\u003e11613966\u003c/a\u003e and \u003ca href\u003d\"/contest/218/submission/11614370\" title\u003d\"Submission 11614370 by LuaXD\"\u003e11614370\u003c/a\u003e\u003c/p\u003e\u003cp\u003eHas this ever happened to any of you? It seems like a very odd bug and I can\u0027t figure out why it happened. It is literally a WA verdict for no reason\u003c/p\u003e\u003c/div\u003e","tags":[]}}