{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1498323919,"rating":-3,"authorHandle":"iamurhater","modificationTimeSeconds":1498323919,"id":52879,"title":"\u003cp\u003eTCS Mockvita Questions\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eTwo days ago,I attempted TCS Mockvita contest and couldn\u0027t get to any solution during the contest to two problems.Even after the contest,I am unable to solve them.Can anyone help me out? The questions are:-\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQuestion 1.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eConsecutive Prime Sum Some prime numbers can be expressed as Sum of other consecutive prime numbers. For example 5 \u003d 2 + 3 17 \u003d 2 + 3 + 5 + 7 41 \u003d 2 + 3 + 5 + 7 + 11 + 13 Your task is to find out how many prime numbers which satisfy this property are present in the range 3 to N subject to a constraint that summation should always start with number 2. Write code to find out number of prime numbers that satisfy the above mentioned property in a given range. Input Format: First line contains a number N Output Format: Print the total number of all such prime numbers which are less than or equal to N. Constraints: 2\u0026lt;N\u0026lt;\u003d12,000,000,000 Sample:\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/6a/70/6a709b85ec6f9e213354a77ab4185b9832c0f0ab.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQuestion 2.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFootball League Table Statement : All major football leagues have big league tables. Whenever a new match is played, the league table is updated to show the current rankings (based on Scores, Goals For (GF), Goals Against (GA)). Given the results of a few matches among teams, write a program to print all the names of the teams in ascending order (Leader at the top and Laggard at the bottom) based on their rankings. Rules: : A win results in 2 points, a draw results in 1 point and a loss is worth 0 points. The team with most goals in a match wins the match. Goal Difference (GD) is calculated as Goals For (GF) — Goals Against (GA). Teams can play maximum of two matches against each other — Home and Away matches respectively Ranking is decided as follows Team with maximum points is ranked 1 and minimum points is placed last Ties are broken as follows Teams with same points are ranked according to Goal Difference(GD). If Goal Difference(GD) is same, then team with higher Goals For is ranked ahead If GF are same, the teams should be at the same rank but they should be printed in case-insensitive alphabetic according of the team names. More than 2 matches of same teams, should be considered as Invalid Input A team can\u0027t play matches against itself, hence if team names are same for a given match, it should be considered Invalid Input Input Format: First line of input will contain number of teams (N) Second line contains names of the teams (Na) delimited by a whitespace character Third line contains number of matches (M) for which results are available Next M lines contain a match information tuple {T1 T2 S1 S2}, where tuple is comprised of the following information • T1 — Name of the first team • T2 — Name of the second team • S1 — Goals scored by the first team • S2 — Goals scored by the second team Output Format: Team names in order of their rankings, one team per line OR Print \u0026quot;Invalid Input\u0026quot; where appropriate. Constraints: 0\u0026lt; N \u0026lt;\u003d10,000 0\u0026lt;\u003dS1,S2 Example: Consider 5 teams Spain, England, France, Italy and Germany with the following fixtures: Match 1: Spain vs. England (3-0) (Spain gets 2 points, England gets 0) Match 2: England vs. France (1-1) (England gets 1 point, France gets 1) Match 3: Spain vs. France (0-2) (Spain gets 0 points, France gets 2)\u003c/p\u003e\u003cp\u003eTable 1. Points Table after 3 matches\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/71/dd/71dddb6c4c04641310d62b81a5a3588f840d4398.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eSince, Italy and Germany are tied for points, goals difference is checked. Both have same, so, Goals For is checked. Since both are same. Germany and Italy share the 4th rank. Since Germany appears alphabetically before Italy, Germany should be printed before Italy. Then the final result is: France Spain England Germany Italy Sample: \u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/6d/9f/6d9fe4ba4301638f99f8226423c540cf946de9f1.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003ePS:This is my first time asking a question on Codeforces,Kindly regret if you find any mistakes\u003c/p\u003e\u003c/div\u003e","tags":["prime numbers","sorting"]}}