{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1455920111,"rating":39,"authorHandle":"tweety","modificationTimeSeconds":1455921657,"id":43225,"title":"\u003cp\u003eCool tricks using Matrix Exponential\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI\u0027m going to share with you some cool applications of matrix exponential that I learned recently.\u003c/p\u003e\u003ch4\u003eApplication 1: Counting the number of ways for reaching a vertex\u003c/h4\u003e \u003cp\u003eYou are given an unweighted directed graph (may contain multiple edges) containing N vertices (1 \u0026lt;\u003d N \u0026lt;\u003d 200) and an integer b (1 \u0026lt;\u003d b \u0026lt;\u003d 10^9). You are also given Q queries (1 \u0026lt;\u003d Q \u0026lt;\u003d 10^5). For each query you are given two vertices u and v and you have to find the number of ways for reaching vertex v starting from u after exactly b steps. (A step is passing through an edge. Each edge may be passed multiple number of times).\u003c/p\u003e \u003ch5\u003eSolution\u003c/h5\u003e \u003cp\u003eLet M1 be a matrix where M1[i][j] equals the number of edges connecting vertex i to vertex j. Let M2 be M1 raised to the power of b (M1^b). Now for any pair u and v, the number of ways for reaching vertex v starting from u after b steps is M2[u][v].\u003c/p\u003e\u003cp\u003ePractice problem: \u003ca href\u003d\"//codeforces.com/contest/621/problem/E\"\u003e621E\u003c/a\u003e \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003c/p\u003e\u003ch4\u003eApplication 2: Shortest path with a specified number of steps\u003c/h4\u003e \u003cp\u003eYou are given a weighted graph containing N vertices (1 \u0026lt;\u003d N \u0026lt;\u003d 200) and an integer b (1 \u0026lt;\u003d b \u0026lt;\u003d 10^9). You are also given Q queries (1 \u0026lt;\u003d Q \u0026lt;\u003d 10^5). For each query you are given two vertices u and v and you have to find the minimum cost for reaching vertex v starting from u after exactly b steps. (A step is passing through an edge. Each edge may be passed multiple number of times).\u003c/p\u003e \u003ch5\u003eSolution\u003c/h5\u003e \u003cp\u003eLet M1 be a matrix where M1[i][j] equals the cost of passing the edge connecting i to j (infinity if there is no edge). Let M2 be M1 raised to the power of b (but this time using the \u003ca href\u003d\"https://en.wikipedia.org/wiki/Min-plus_matrix_multiplication\"\u003edistance product\u003c/a\u003e for multiplication). Now for any pair u and v, the minimum cost for reaching vertex v starting from u after b steps is M2[u][v].\u003c/p\u003e \u003cp\u003ePractice problem: \u003ca href\u003d\"//codeforces.com/problemset/problem/147/B\"\u003e147B\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003c/p\u003e\u003ch4\u003eApplication 3: Nth Fibonacci number in O(log n)\u003c/h4\u003e \u003cp\u003eYou are given Q (1 \u0026lt;\u003d Q \u0026lt;\u003d 10^5) queries. For each query you are given an integer N (1 \u0026lt;\u003d N \u0026lt;\u003d 10^9) and you are to find the Nth number in the Fibonacci sequence.\u003c/p\u003e \u003ch5\u003eSolution\u003c/h5\u003e \u003cp\u003eI won\u0027t copy-paste anything, you can read about it \u003ca href\u003d\"http://kukuruku.co/hub/algorithms/the-nth-fibonacci-number-in-olog-n\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e \u003c/p\u003e\u003cp\u003eIn case you don\u0027t know how to multiply matrices, you can read about it \u003ca href\u003d\"https://www.mathsisfun.com/algebra/matrix-multiplying.html\"\u003ehere\u003c/a\u003e. After you know how to multiply matrices you can easily calculate the power of a matrix in O(log n) just like you do with integers.\u003c/p\u003e \u003cp\u003eAny corrections/suggestions/additions are welcome.\u003c/p\u003e \u003cp\u003eAnd please point out any English mistakes or sentences that can be improved. :D\u003c/p\u003e\u003c/div\u003e","tags":["tutorial","matrix","matrix exponentiation"]}}