{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1522940692,"rating":38,"authorHandle":"Lil.Morty","modificationTimeSeconds":1522949723,"id":58748,"title":"\u003cp\u003eДобавление третьего дивизиона в Codeforces!\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДоброй ночи/рассвета/утра/дня/заката/вечера/ночи, Codeforces! Сегодня я хотел бы обсудить такую проблему как добавление третьего дивизиона в Codeforces.\u003c/p\u003e\u003cp\u003eКак вы могли уже давно многие заметить, на платформе, которой мы пользуемся, есть рейтинг. В зависимости от рейтинга каждый пользователь относиться к определённому дивизиону. Первый дивизион от 1900 и выше, второй дивизион ниже 1900. Эта система уже действует довольно давно, и за это время на Codeforces стало приходить все больше и больше пользователей. На данный момент в первом дивизионе находиться 3086 пользователей, во втором — 35736 пользователей. По-моему, такое соотношение в дивизионах очень большое и я хотел бы предложить на обсуждение такую тему, как добавление нового дивизиона. И яхочу предоставить некоторые плюсы, которые вижу в этом предложении:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eЯ думаю, что не секрет, что люди, которые находятся в первом дивизионе, создают новые аккаунты и тем самым опускают на соревнованиях людей, имеющих рейтинг примерно 1900. Тем самым они дают меньше шансов пользователям перейти в первый дивизион. К примеру, я предоставлю таблицу Educational Codeforces Round 41. В ней наглядно видно, что все пользователи созданы за пару часов до соревнования и показанные результаты относятся к пользователям из первого дивизиона.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"https://lh3.googleusercontent.com/-fJNyoZb4goA/WsY3k2rjwKI/AAAAAAAAAK0/j2tq0_6HxJkC__XrJ-z3048r0tDVRWXjQCJoC/w530-h151-n-rw/%25D0%2591%25D0%25B5%25D0%25B7%25D1%258B%25D0%25BC%25D1%258F%25D0%25BD%25D0%25BD%25D1%258B%25D0%25B9.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e \u003cul\u003e   \u003cli\u003eБудут раунды, которые направлены на третий дивизион. Это есть плюсом в нескольких аспектах. Во-первых, люди, которые находятся во втором дивизионе, могут создавать не очень тяжелые задачи. Тем самым они потренируются в создании раундов. Я сам создаю сейчас раунд и лично для меня было бы полезным потренироваться прежде чем создавать раунд на сложные задачи. Во-вторых, это конечно есть люди, которые хотят научиться программировать и начинают с данной платформы и, по-моему, не все начинающие программисты могут справиться с набором задач даже во втором дивизионе. При этом при наличии нового дивизиона, им будет намного проще познакомиться с платформой и научиться решать даже самые банальные задачи.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eКак по мне, эти плюсы есть корректными и я бы хотел услышать Ваше мнение на счет этой темы. И если кто-то из более высокопоставленных пользователей донесет эту информацию администраторам Codeforces, то я буду очень рад.\u003c/p\u003e\u003c/div\u003e","tags":[]}}