{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1398719704,"rating":0,"authorHandle":"BorN","modificationTimeSeconds":1398719704,"id":12036,"title":"\u003cp\u003eОдна задача на составление словаря\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДоброго всем времени суток!\u003c/p\u003e\u003cp\u003eНе столь давно во время отборочно-тренировочных занятий команды Украины перед Международной лингвистической олимпиадой был озвучен ряд довольно интересных задач на составление словарей. Что они из себя представляют? В общем случае задача такого плана формулируется следующим образом:\u003c/p\u003e\u003cp\u003e\u003cem\u003eНеобходимо составить словарь слов так, чтобы асимптотически минимизировать время поиска слова в нем, которое определенной характеристикой.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eПример: Необходимо составить словарь слов так, чтобы асимптотически минимизировать время поиска строки в нем, полностью совпадающей с строкой на входе. Очевидно, в таком случае неплохим вариантом будет стандартный словарь, в котором слова отсортированы в алфавитном порядке (тогда алгоритмом бинарного поиска мы за логарифмическое время от количества слов найдем нужную статью) (хотя на самом деле это не оптимальный вариант, но об этом чуть позже).\u003c/p\u003e\u003cp\u003eПозже мы решили, что операцию открытия страницы с заданным номером или статьи с заданным номером мы можем выполнять за константное время. В таком случае словарь из примера можно оптимизировать, задав функциональную зависимость между строкой и номером статьи, которая ей соответствует (или, если говорить по-людски, посчитать хеш). Тогда мы сможем искать слово за время, пропорциональное длине слова, что уже несколько круче. В принципе, используя этот подход (хеширование входных данных) может помочь нам составить необходимый словарь для любой такой задачи так, чтобы ответ искался за время, пропорциональное размеру входных данных. Поэтому всплыла еще одна характеристика — размер словаря.\u003c/p\u003e\u003cp\u003eСобственно, задача, которая и спровоцировала небольшой холивар, формулируется так:\u003c/p\u003e\u003cp\u003e\u003cem\u003eНеобходимо составить словарь слов так, чтобы асимптотически минимизировать время поиска слова в нем, которое подходит под заданную маску.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eП.С. маска — строка из символов алфавита + специального символа (скажем, \u0026quot;?\u0026quot;), который можно заменить на любую одну букву из алфавита. П.П.С. так как задачу оптимизации времени мы вроде как решили, предлагаю вам подумать над тем, как можно ужать размеры словаря так, чтобы особо не терять во времени.\u003c/p\u003e\u003c/div\u003e","tags":["словари","лингвистика","теория","информатика"]}}