{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1485323426,"rating":89,"authorHandle":"l_Love_KFC","modificationTimeSeconds":1485411728,"id":50003,"title":"\u003cp\u003eЧерный список Codeforces или антиспам\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет! Недавно мой ящик сообщений в Codeforces решил сделать бум(как и моя пятая точка). Не знаю почему, но в моем так сказать кругу общения появилась тенденция закидывать меня спамом, причем не самым качественным. За последнюю неделю у меня накопилось более 40 сообщений вида \u0026quot;ахахахахахахаахаха\u0026quot;. Скриншоты прилагаются(это не баг, я просто замазал аккаунты спамеров):\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/13/37/13376e3b0089a4f010a17db9b95bb56fd8c39bf2.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/39/22/3922be101ade54df0b591e21a25e611cdc878ac0.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eТакже, был случай случайного сообщения, отправленного мне непреднамеренно. Автор сообщения поспешил извиниться:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/8e/2a/8e2a0e3454bf7bbff3a228d5d463cd59957215ad.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eПонятно, что это все безобидные(нет) шутки моих знакомых, но этот инцидент натолкнул меня на некоторые интересные мысли. Так у меня появилась идея о том как можно улучшить систему сообщений в Codeforces. Так как тут есть система сообщений, было бы разумно добавить систему черного списка, дабы защитить людей от неблагоприятных пользователей и их сообщений. Случай с письмом, отправленным мне случайно гораздо более редкий, но и от таких случаев можно было бы избавиться, например разрешать присылать вам сообщения только определенным людям. Также неплохо было бы добавить возможность удаления ненужных сообщений. Я понимаю, что Codeforces не является социальной сетью, но если уж добавили систему друзей и сообщений, то надо добавить ее полностью. Возможно это не самая масштабная проблема, но именно наличие таких мелочей и делает Codeforces лучше. Надеюсь этот пост не будет проигнорирован и дойдет в нужные руки. Всем спасибо за внимание!\u003c/p\u003e\u003cp\u003eP.S Прошу не банить тех, кто спамил меня, я не держу зла на них. ;)\u003c/p\u003e\u003c/div\u003e","tags":["черный список","спам","личные сообщения","почтовый ящик"]}}