{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1413890729,"rating":5,"authorHandle":"hexor","modificationTimeSeconds":1413891300,"id":14376,"title":"\u003cp\u003eLightoj 1415 \u0026amp; UVa 12440\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eN trees were planted on a side of a long straight road. In the other side there are farms, industries etc. The market price of these trees is huge now. Some greedy people want to cut these trees down and want to be millionaires. They got the permission from the Govt. decoying that they would develop the area. You published this fact in the web and millions raised their voices against this conspiracy.\u003c/p\u003e\u003cp\u003eYou gathered the information of the trees and found the type and height of all trees. For simplicity, you represented them as integers. You want to find the overall price of the trees. To find the price, the following method is used.\u003c/p\u003e\u003cp\u003e1) The trees are first partitioned into groups with the condition that, types of two trees will not be similar in a group. A group can only be formed using contiguous trees.\u003c/p\u003e\u003cp\u003e2) The price of a group is equal to the height of the tallest tree.\u003c/p\u003e\u003cp\u003e3) The overall price is the summation of prices of all groups.\u003c/p\u003e\u003cp\u003eNow you want to find the minimum possible price of the trees in this scheme and show the Govt. that even though you calculated the minimum possible price, it\u0027s actually huge.\u003c/p\u003e\u003cp\u003eCan anyone help me?\u003c/p\u003e\u003cp\u003e\u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eN\u003c/i\u003e(1≤\u003ci\u003eN\u003c/i\u003e≤2 * 10\u003csup class\u003d\"upper-index\"\u003e5\u003c/sup\u003e)\u003c/span\u003e\u003c/p\u003e\u003cp\u003elinks: \u003ca href\u003d\"http://lightoj.com/volume_showproblem.php?problem\u003d1415\"\u003eLightoj 1415\u003c/a\u003e and \u003ca href\u003d\"http://http://uva.onlinejudge.org/index.php?option\u003dcom_onlinejudge\u0026amp;Itemid\u003d8\u0026amp;page\u003dshow_problem\u0026amp;problem\u003d3871\"\u003eUVa 12440\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["lightoj","uva","segment tree"]}}