{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1511930869,"rating":0,"authorHandle":"elena","modificationTimeSeconds":1514118892,"id":56055,"title":"\u003cp\u003eЗадачи на использование циклов — часть II\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПродолжаем изучать циклы. В этой подборке у всех задач есть одна особенность: нужно организовывать чтение данных в цикле. Как это делать — подробно рассматривалось в примере, приведённом в предыдущем разделе. \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eЗадача 1787 \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1787\"\u003eПоворот на Мегу\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЗадача 1910 \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1910\"\u003eРуины титанов: сокрытый вход\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЗадача 1567 \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1567\"\u003eSMS-спам\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЗадача 1581 \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1581\"\u003eРабота в команде\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЗадача 1925 \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1925\"\u003eО заслуге британских учёных\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЗадача 1636 \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1636\"\u003eШтрафное время\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЗадача 1935 \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1935\"\u003eСлёзы утопленников\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЗадача 1902 \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1902\"\u003eНео-Венеция\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЗадача 1642 \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1642\"\u003eОдномерный лабиринт\u003c/a\u003e\u003c/p\u003e\u003cp\u003eЗадача 1510 \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1510\"\u003eПорядок\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e \u003cstrong\u003eНекоторые небесполезные советы\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eВ задаче 1787 может быть очень полезно попробовать модифицировать первый тест из условия методом \u0026quot;поменять местами элементы во второй строке\u0026quot;. Подумайте, изменится ли при этом ответ, и если да — то как.\u003c/p\u003e\u003cp\u003eЗадача 1910 очень похожа на пример, разобранный в предыдущем разделе. Только максимум, который нужно найти, теперь состоит из трех элементов.\u003c/p\u003e\u003cp\u003eВ задаче 1567 может оказаться удобно использовать оператор switch (возможно, примеры его использования будут добавлены). \u003c/p\u003e\u003cp\u003eПри решении задачи 1581 может оказаться полезной идея подсчета количества максимальных элементов из примера в предыдущем разделе.\u003c/p\u003e\u003cp\u003eЕсли возникают проблемы при решении задачи 1925, полезно ещё раз посмотреть, как вычислялась сумма последовательности элементов в примере из предыдущего раздела.\u003c/p\u003e\u003cp\u003eЗадача 1636, кажется, требует просто внимательности. Особенно при чтении последнего абзаца условия.\u003c/p\u003e\u003cp\u003eА вот при решении задачи 1935 придётся подумать, как разместить объекты оптимальным образом. \u003c/p\u003e\u003cp\u003eПеред тем, как писать программу для решения задачи 1902, вероятно, потребуется выписать несложную формулу. Ну и вспомнить самую первую задачу \u003ccode\u003eA+B\u003c/code\u003e, в которой мы работали не с целыми, а с вещественными числами.\u003c/p\u003e\u003cp\u003eВозможно, когда вы будете решать задачу 1642, стоит нарисовать схему лабиринта.\u003c/p\u003e\u003cp\u003eЗадача 1510 имеет в своей основе (относительно известную) математическую головоломку. Быть может, будет полезно рассмотреть несколько примеров, в которых банкноты будут перечисляться в различном порядке.\u003c/p\u003e\u003c/div\u003e","tags":["java","циклы"]}}