{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1525949458,"rating":111,"authorHandle":"Harbour.Space","modificationTimeSeconds":1526393991,"id":59379,"title":"\u003cp\u003eSpecial High Schooler’s Online test — Maths \u0026amp; Computer Science\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/8e/4c/8e4c7729f183b18cbe5453fff28d3ec0dd9e37a6.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHarbour.Space University\u003c/strong\u003e, \u003cstrong\u003ethe International Tournament of Young Mathematicians (ITYM)\u003c/strong\u003e and \u003cstrong\u003eMoscow Institute of Physics and Technology (MIPT)\u003c/strong\u003e are proud to announce a special high schooler\u0027s online test, \u003cstrong\u003eMay 26th\u003c/strong\u003e at \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dMath+%26+CS+Online+test+\u0026amp;iso\u003d20180526T17\u0026amp;p1\u003d166\"\u003e\u003cstrong\u003e15.00 CET Time\u003c/strong\u003e\u003c/a\u003e. The test will gauge your level in both maths and computer science and give a chance to win two weeks in a math and computer science summer camp for gifted youth \u003ca href\u003d\"http://in.harbour.space/tech-scouts?utm_source\u003dCodeforces\u0026amp;utm_medium\u003dOnline_Test\"\u003e\u003cstrong\u003eTech Scouts\u003c/strong\u003e\u003c/a\u003e, taught in English for ages 12-18, held 16-29 of July in Barcelona, Spain.\u003c/p\u003e\u003cp\u003eYou can take part in the online test if all the following conditions are met:\u003c/p\u003e \u003col\u003e   \u003cli\u003eBetween the ages of 12 to 18,\u003c/li\u003e   \u003cli\u003eHave not graduated high school,\u003c/li\u003e   \u003cli\u003eEligible to take part in IOI/IMO 2019.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eThe top performers of the online contest will be invited for a personal interview to demonstrate understanding of the problems solved during the contest. After the test, the \u003cstrong\u003e100 most successful performers\u003c/strong\u003e will be interviewed, and the top will be awarded a full tuition waiver to attend the advanced level of the Technical Track of \u003cstrong\u003eTech Scouts\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTech Scouts\u003c/strong\u003e is designed to lay out the foundation of knowledge in mathematics and computer science for the next phase of higher learning. During a two-week intensive training, the students will follow a college level curriculum and discover their passions by getting to know one of Europe’s leading institutions in design, entrepreneurship and technology.\u003c/p\u003e\u003cp\u003eIn order to register for the contest, please fill out this \u003ca href\u003d\"https://harbourspace.typeform.com/to/VSH5t8\"\u003etype form\u003c/a\u003e before 11.59pm \u003cstrong\u003eMay 24\u003c/strong\u003e. All participants of the contest will get a 25% discount promo code to attend \u003cstrong\u003eTech Scouts\u003c/strong\u003e.\u003c/p\u003e\u003ch2\u003e\u003ca href\u003d\"https://harbourspace.typeform.com/to/VSH5t8\"\u003e\u003cstrong\u003eRegister\u003c/strong\u003e\u003c/a\u003e\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e For those of you who cannot meet the required conditions, but would still like to participate, please fill out \u003ca href\u003d\"https://harbourspace.typeform.com/to/Uvkycn\"\u003ethis form\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2\u003c/strong\u003e As many of you have informed us of the date coinciding with Google Code Jam round 2, we are moving the date by one week. The new date is May 26. Thank you, everyone!\u003c/p\u003e\u003c/div\u003e","tags":[]}}