{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1408724180,"rating":12,"authorHandle":"zholnin","modificationTimeSeconds":1409251600,"id":13491,"title":"\u003cp\u003eСтранное письмо от Гугла\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eХотелось спросить — был ли Google замечен в рассылках \u0026quot;полуавтоматических\u0026quot; \u0026quot;шаблонных\u0026quot; писем с предложением пообщаться по поводу работы и прислать резюме? Может быть по какой-то выборке из участников Google Codejam?\u003c/p\u003e\u003cp\u003eЯ бы никогда в таком Google не заподозрил, но мне пришло какое-то странное письмо, озаглавленное \u0026quot;Engineering opportunities in Google\u0026quot;.\u003c/p\u003e\u003cp\u003eС точки зрения источника происхождения у меня особых сомнений нет, реальный человек и действительно работает над поиском персонала в Google. Странно письмо тем, что мне особенно хвастаться на программистском поприще нечем, поэтому для себя я сей факт могу объяснить только тем, что попал в какую-то выборку (может быть случайно).\u003c/p\u003e\u003cp\u003eДа, на письмо я ответил миролюбиво и позитивно, но больше никаких сообщений не получал (уже больше недели), что тоже намекает либо на какую-то ошибку, либо на \u0026quot;массовый\u0026quot; характер рассылки.\u003c/p\u003e\u003cp\u003eНу и да — для полноты картины — Google уважаю, но работа у меня хорошая уже есть. И я по образованию не программист, хотя и \u0026quot;люблю это дело\u0026quot; (что в принципе указано во всех возможных профилях, которые на меня легко накопать в сети).\u003c/p\u003e\u003cp\u003eУ кого-то были подобные случаи?\u003c/p\u003e\u003cp\u003eUPDATE:\u003c/p\u003e\u003cp\u003eВ целом ситуация понятна, потрясает объем \u0026quot;выкапываемой породы\u0026quot; в поисках \u0026quot;бриллиантов\u0026quot;, раз уж даже до меня докопались. :) С точки зрения способа коммуникации — с учётом того, что в письме сразу упоминалось некое первичное общение и направлено оно было конкретному человеку, правила делового этика предполагают, что они должны ответить, хотя бы формальной отпиской — \u0026quot;спасибо за CV, если что-то интересное будет — мы с вами свяжемся\u0026quot;. Так что don\u0027t be evil, Google, буду ждать ;)\u003c/p\u003e\u003cp\u003eUPDATE2:\u003c/p\u003e\u003cp\u003eЧерез полторы недели ко мне вернулись пообщаться, так что Google не evil. В качестве комментария — похоже они не только смотрят на занятое место, но и на постояноство результатов — т.е. попадание в определённую группу (видимо те самые 3,000) два года подряд. Всем удачи и (кто этого хочет) писем от Гугла. :)\u003c/p\u003e\u003c/div\u003e","tags":["google","job"]}}