{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1519391986,"rating":-9,"authorHandle":"i_am_nothing","modificationTimeSeconds":1519392077,"id":57993,"title":"\u003cp\u003eneed some hints :lightoj 1254\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"http://www.lightoj.com/volume_showproblem.php?problem\u003d1254\"\u003ehttp://www.lightoj.com/volume_showproblem.php?problem\u003d1254\u003c/a\u003e how can i solve this problem?please need some help;\u003c/p\u003e\u003cp\u003eMichael Scofield has just broken out of the prison. Now he wants to go to a certain city for his next unfinished job. As you are the only programmer on his gang, he asked your help. As you know that the fuel prices vary in the cities, you have to write a code to help Scofield that instructs him where to take the fuel and which path to choose. Assume that his car uses one unit of fuel in one unit of distance. Now he gives you the starting city s where he starts his journey with his car, the destination city t and the capacity of the fuel tank of his car c, the code should find the route that uses the cheapest fuel cost. You can assume that Scofield\u0027s car starts with an empty fuel tank.\u003c/p\u003e\u003cp\u003eInput Input starts with an integer T (≤ 5), denoting the number of test cases.\u003c/p\u003e\u003cp\u003eEach case starts with a line containing two integers n (2 ≤ n ≤ 100) and m (0 ≤ m ≤ 1000) where n denotes the number of cities and m denotes the number of roads. The next line contains n space separated integers, each lies between 1 and 100. The ith integer in this line denotes the fuel price (per unit) in the ith city. Each of the next m lines contains three integers u v w (0 ≤ u, v \u0026lt; n, 1 ≤ w ≤ 100, u ≠ v) denoting that there is a road between city u and v whose length is w.\u003c/p\u003e\u003cp\u003eThe next line contains an integer q (1 ≤ q ≤ 100) denoting the number of queries by Scofield. Each of the next q lines contains the request. Each request contains three integers: c s t (1 ≤ c ≤ 100, 0 ≤ s, t \u0026lt; n) where c denotes the capacity of the tank, s denotes the starting city and t denotes the destination city.\u003c/p\u003e\u003cp\u003eOutput For each case, print the case number first. Then for each query print the cheapest trip from s to t using the car with the given capacity c or \u0027impossible\u0027 if there is no way of getting from s to t with the given car.\u003c/p\u003e\u003cp\u003eSample Input Output for Sample Input 1\u003c/p\u003e\u003cp\u003e5 5\u003c/p\u003e\u003cp\u003e10 10 20 12 13\u003c/p\u003e\u003cp\u003e0 1 9\u003c/p\u003e\u003cp\u003e0 2 8\u003c/p\u003e\u003cp\u003e1 2 1\u003c/p\u003e\u003cp\u003e1 3 11\u003c/p\u003e\u003cp\u003e2 3 7\u003c/p\u003e\u003cp\u003e2\u003c/p\u003e\u003cp\u003e10 0 3\u003c/p\u003e\u003cp\u003e20 1 4\u003c/p\u003e\u003cp\u003eCase 1:\u003c/p\u003e\u003cp\u003e170\u003c/p\u003e\u003cp\u003eimpossible\u003c/p\u003e\u003c/div\u003e","tags":[]}}