{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1426744398,"rating":5,"authorHandle":"chaitan94","modificationTimeSeconds":1426786837,"id":17021,"title":"\u003cp\u003eSurprise Language Contest: An invitation\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u0026quot;Surprise is the greatest gift which life can grant us.\u0026quot; — Boris Pasternak\u003c/p\u003e\u003cp\u003eHey coders!\u003c/p\u003e\u003cp\u003eAre you ready for something challenging? Something adventurous? This year, FLUXUS — IIT Indore \u0026amp; Programming Club, IIT Indore are introducing a new type of contest: the Surprise Language Programming Contest. Here, unlike a regular programming contest, you will only be able to use one language, which will be announced 15 mins before the contest. So be ready to compete, you might even learn a whole new language along the way!\u003c/p\u003e\u003cp\u003eContest link: \u003ca href\u003d\"https://www.hackerrank.com/surprise-language\"\u003ehttps://www.hackerrank.com/surprise-language\u003c/a\u003e\u003c/p\u003e\u003cp\u003eDo share it with your friends who are interested :D\u003c/p\u003e\u003cp\u003eFurther, we\u0027ll be announcing a list of 10 languages three days before the contest on our \u003ca href\u003d\"https://www.facebook.com/events/1410390572601671/\"\u003eFacebook event page\u003c/a\u003e, out of which one will be the language in the contest.\u003c/p\u003e\u003cp\u003eI Prize: Rs. 1,000 in Cash + T Shirt + Goodies\u003c/p\u003e\u003cp\u003eNext four prizes (2-5): T-Shirt + Goodies\u003c/p\u003e\u003cp\u003eNext five prizes (6-10): T-Shirt\u003c/p\u003e\u003cp\u003ePrizes are only for Indians. But, I hope others will still participate as this contest is more of a fun event than for prizes :)\u003c/p\u003e\u003cp\u003eFinally, don\u0027t forget to register at \u003ca href\u003d\"http://fluxus.in/register.php\"\u003ehttp://fluxus.in/register.php\u003c/a\u003e as Prizes are only applicable to users with a Fluxus-ID\u003c/p\u003e\u003cp\u003eFor more details / contact details, visit: \u003ca href\u003d\"http://fluxus.in/event.php/SurpriseLanguage\"\u003ehttp://fluxus.in/event.php/SurpriseLanguage\u003c/a\u003e\u003c/p\u003e\u003cp\u003eNote: Though our aim was to create a contest like SLR\u0027s of codeforces, but since it is the first time we are conducting such a contest, it will be a bit different than those contests. Here we will be using fairly common language, and will be more beginner friendly.\u003c/p\u003e\u003c/div\u003e","tags":["surprise language","fluxus","iit indore","hackerrank"]}}