{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1509973206,"rating":69,"authorHandle":"savinova","modificationTimeSeconds":1509976132,"id":55617,"title":"\u003cp\u003eОтчет о деятельности фонда Botan Investments за октябрь + рассказ о NEC и лигах ICPC\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003eВ октябре в грантовой программе фонда Виктора Шабурова \u003cstrong\u003eBotan Investments\u003c/strong\u003e приняли участие 20 вузов. Также в этом месяце есть один новый участник — это Университет Иннополис (Казань). Нескольким вузам удалось привлечь к тренировкам более тридцати студентов: это ТПУ (Томск), КФУ (Казань) и СГУ (Саратов). Больше всего тренировок в октябре провели в ТПУ и КФУ.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBotan Investments\u003c/strong\u003e выступил спонсором четвертьфинала Южного подрегиона в Саратове и отборочного этапа (⅛) ACM ICPC в Хабаровске.\u003c/p\u003e\u003cp\u003eВ нашей \u003ca href\u003d\"https://vk.com/botaninvestments\"\u003eгруппе ВК\u003c/a\u003e вышло два новых поста Михаила \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik\" title\u003d\"Master MikhailRubinchik\"\u003eMikhailRubinchik\u003c/a\u003e Рубинчика, посвященных социальной ответственности вузов в АСМ: \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_263\"\u003eо будущем АСМ\u003c/a\u003e и \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_265\"\u003eо помощи сообществу\u003c/a\u003e. А сегодня — рассказ от Михаила о финалах лиг и о том, что станет с NEERC: \u003c/p\u003e\u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e Всем привет! \u003cbr /\u003e\u003cbr /\u003e Позавчера прошли последние четвертьфиналы NEERC. Или правильнее теперь говорить NEC? Но обо всём по порядку. Последние четвертьфиналы прошли, чуть больше чем через месяц будет полуфинал. А значит, есть время пофлудить в комментах :) \u003cbr /\u003e\u003cbr /\u003e Этой весной на финале объявили об изменениях в правилах отбора. Сразу скажу: не переживайте, Билл Паучер (директор финала) сказал, что планирует окончательно ввести их только к 2026 году. У нас пока изменилось только одно: картинка на главной neerc.ifmo.ru. \u003cbr /\u003e\u003cbr /\u003e В этом году на финале Билл рассказал об изменениях и их причинах. Кратко суть такова: Финал ACM ICPC — это крутой фестиваль, праздник, на который все стремятся. Самые крутые чуваки со всего мира съезжаются в одно место, команды сидят на одной большой площадке в свете софитов перед камерами, живут бесплатно в хороших отелях в режиме всё включено. Ну и путешествуют благодаря тому, что финал проводится каждый год в разных странах. \u003cbr /\u003e\u003cbr /\u003e Число спортивных программистов в мире и на финале стабильно параллельно росли, усилиями директоров финала. Так происходило в течение многих лет. Но сейчас, по мнению Билла, финал вырос настолько (около 130 команд), что дальше уже некуда, а число спортивных программистов продолжает расти. Поэтому Билл сказал: нужно больше финалов. \u003cbr /\u003e\u003cbr /\u003e Как именно это будет реализовано? Организаторы хотят, чтобы помимо мирового финала появились финалы лиг. Лига по сути — это множество стран. К посту прикреплена картинка с текущим разбиением на лиги. Всего сейчас девять лиг, в перспективе каждая лига должна начать проводить свой финал лиги, который является клоном финала. А лучшие команды (около 15) из каждой лиги проходят на мировой финал. \u003cbr /\u003e\u003c/p\u003e\u003cbr /\u003e \u003ccenter\u003e \u003cdiv style\u003d\"width: 70.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/8f/1c/8f1c512156ffbf7f95eb4aa2ec939e36f8617465.jpg\" style\u003d\"width: 60.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e \u003c/center\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e \u003cem\u003e\u0026quot;Так на карте NEERC — это лига Северной Евразии. Выходит, для нас вообще ничего не изменится\u0026quot;.\u003c/em\u003e Этот тезис довольно популярен, но он не совсем правилен. Я сам изначально поверил ему, а потом понял, что не всё так прозрачно. Поэтому далее я хочу немного поспорить с этим тезисом. \u003cbr /\u003e\u003cbr /\u003e Билл сам приводил NEERC как пример единого контеста для большой территории, по результатам которого напрямую отбираются команды на финал, отсюда и родился такой тезис. Но на самом деле здесь много нюансов: \u003cbr /\u003e\u003cbr /\u003e \u003cem\u003e1. А в финал лиги тоже выходит не более одной команды от вуза?\u003c/em\u003e \u003cbr /\u003e\u003cbr /\u003e Это явно не прозвучало, но Билл много раз повторял, что финалы лиги должны быть устроены как мировой финал. Соответственно, для нас тут скорее всего будет значительное изменение. \u003cbr /\u003e Мне кажется, что будет разумно отбирать не более двух команд от вуза. Потому что нужен какой-то компромисс между тем, что есть сейчас на отборах, и тем, как это происходит на финале. \u003cbr /\u003e\u003cbr /\u003e \u003cem\u003e2. А сколько раз можно участвовать в финале лиги?\u003c/em\u003e \u003cbr /\u003e\u003cbr /\u003e Билл ничего не предлагал, но лига Северной Америки (США + Канада) предложила не более трех попыток на финал лиги. Поскольку с Северной Америкой у Билла самые плотные контакты, есть основание предполагать, что Билл согласен и скорее всего введёт это правило. \u003cbr /\u003e У нас сейчас и в четвертьфинале, и в полуфинале пять попыток. Поэтому тут снова изменение. \u003cbr /\u003e\u003cbr /\u003e \u003cem\u003e3. Наш полуфинал проходит на четырёх площадках. Поэтому он точно не похож на финал лиги :)\u003c/em\u003e \u003cbr /\u003e\u003cbr /\u003e Здесь явно произойдет изменение. Всех участников нужно будет везти в один город, садить на одну площадку и т.д. \u003cbr /\u003e\u003cbr /\u003e \u003cem\u003e4. А можем ли мы все 300 команд принять на одной большой площадке?\u003c/em\u003e \u003cbr /\u003e\u003cbr /\u003e Тут будет та же проблема, что и с финалом, который на границе в 130 команд упёрся в потолок (сложно влезать на стадионы, расселять участников и т.д.). Поэтому нужно сокращать число мест на финале лиги. \u003cbr /\u003e\u003cbr /\u003e \u003cem\u003e5. Ну и вдогонку к предыдущему пункту: у нас на полуфинале участники не получали бесплатных гостиниц, трансфера и прочего. То есть финал лиги сейчас — это просто площадка контеста с кучей компьютерных классов + сцена.\u003c/em\u003e \u003cbr /\u003e\u003cbr /\u003e Такой финал лиги уже совсем не похож на фестиваль и праздник :) То есть, чтобы обеспечить уровень, достойный мирового финала, нужно снижать число команд в финале лиги. \u003cbr /\u003e\u003cbr /\u003e \u003cem\u003e6. Ок, а как тогда быть с квотами четвертьфиналов?\u003c/em\u003e \u003cbr /\u003e\u003cbr /\u003e Если мы хотим оставить всё как есть и просто уменьшить финал лиги, то нам придётся раза в два уменьшать квоты четвертьфиналов. А это противоречит стремительному росту четвертьфиналов, который наоборот говорит о том, что квоты стоит повышать (и по факту сейчас их повышают). \u003cbr /\u003e Если же действительно сокращать квоты четвертьфиналов, то не то что мировой финал, а даже финал лиги станет недостижим для многих профессионалов. Сейчас даже у любителей есть возможность выбраться на финал лиги. \u003cbr /\u003e\u003cbr /\u003e \u003cem\u003e7. А что делать, если мы хотим и хороший маленький финал лиги сделать, и квоты четвертьфиналам не урезать?\u003c/em\u003e \u003cbr /\u003e\u003cbr /\u003e Тут вывод один. Наш NEERC совершенно не является финалом лиги по своей сути. Единственное, чем он похож — это один общий монитор отбора. Поэтому NEERC и не должен превращаться в финал лиги. Финал лиги — это новое мероприятие, которое должно появиться у нас к 2026 году. А вот NEERC должен стать отбором к нему. \u003cbr /\u003e\u003cbr /\u003e Сейчас я подытожу то, как вижу финал лиги Северной Евразии, и детализирую некоторые моменты: \u003cbr /\u003e\u003cbr /\u003e 1. NEERC (наверное нужно будет переименовать, ведь мы не входим теперь в лигу Европы) не должен уменьшаться. А с учётом роста четвертьфиналов он даже должен вырасти хотя бы до 500 команд. \u003cbr /\u003e\u003cbr /\u003e 2. Финал лиги — это новое мероприятие, которое нужно создать. На нём должно быть немного команд, причём не больше двух от вуза. Скажем, 60 команд, среди которых не менее 40 — это первые команды вузов по результатам NEERC. \u003cbr /\u003e\u003cbr /\u003e 3. Финал лиги, как и мировой финал, должен быть крутым, пафосным мероприятием на единой площадке. \u003cbr /\u003e\u003cbr /\u003e 4. В идеале финал лиги должен перемещаться по странам Северной Евразии. А единая команда организаторов, как и на финале, должна каждый год проводить конкурс среди host\u0027ов, выбирать лучшего и помогать ему в проведении. \u003cbr /\u003e\u003cbr /\u003e 4.1. Либо подойдёт какое-то очень крутое место, куда всем будет интересно поехать. Например, Сочи :) \u003cbr /\u003e\u003cbr /\u003e 5. Большое число площадок — не проблема для NEERC, но не укладывается в концепт финала лиги. У многих вузов станет на одну поездку больше (+финал лиги), поэтому нужно максимально удешевить поездку на NEERC. Например, открыть пару дополнительных площадок в местах, где четвертьфиналы \u003cem\u003eне\u003c/em\u003e проходят (распределяем нагрузку на организаторов), чтобы ездить стало ближе. Например, в Иннополисе, Тюмени и Хабаровске. \u003cbr /\u003e\u003cbr /\u003e Кажется, что если мы не будем придерживаться такого плана, то случится одно из двух: 1) у других лиг будут пафосные финалы, а у нас нет (не факт, что Билл вообще разрешит такой вариант) 2) финал лиги станет маленьким и недоступным ни для кого, кроме горстки супер-профи. Т.е. у очень многих команд последним контестом в сезоне станет четвертьфинал. \u003cbr /\u003e\u003cbr /\u003e Я ещё никак не затронул вопрос о том, какие должны быть задачи на NEERC, финале лиги и четвертьфиналах во всех вариантах развития событий :) Буду рад услышать мысли по этому поводу в комментариях. \u003cbr /\u003e\u003cbr /\u003e Ну и вообще, любые дополнения, критику и другие мнения тоже хочется услышать. 2026 не так далёк, как кажется, и вводимые изменения будут сильно влиять на всё наше сообщество. Поэтому не поленитесь и опишите свою позицию. Начните прямо сейчас ;) \u003c/p\u003e\u003c/div\u003e","tags":["виктор шабуров","botan investments"]}}