{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1496555187,"rating":-19,"authorHandle":"gauti786","modificationTimeSeconds":1496556748,"id":52372,"title":"\u003cp\u003eWhat am I Missing? ( is it Brain?? )\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eUVA 11264 Coin Collector Our dear Sultan is visiting a country where there are n di erent types of coin. He wants to collect as many di erent types of coin as you can. Now if he wants to withdraw X amount of money from a Bank, the Bank will give him this money using following algorithm.\u003c/p\u003e\u003cp\u003ewithdraw(X) {\u003c/p\u003e \u003cpre\u003eif( X \u003d\u003d 0) return;\n\nLet Y be the highest valued coin that does not exceed X.\n\nGive the customer Y valued coin.\n\nwithdraw(X-Y);\u003c/pre\u003e\u003cp\u003e}\u003c/p\u003e\u003cp\u003eNow Sultan can withdraw any amount of money from the Bank. He should maximize the number of di erent coins that he can collect in a single withdrawal.\u003c/p\u003e\u003cp\u003eInput First line of the input contains T the number of test cases. Each of the test cases starts with n (1 ≤ n ≤ 1000), the number of di erent types of coin. Next line contains n integers C1, C2, ..., Cn the value of each coin type. C1 \u0026lt; C2 \u0026lt; C3 \u0026lt; ... \u0026lt; Cn \u0026lt; 1000000000. C1 equals to 1.\u003c/p\u003e\u003cp\u003eOutput For each test case output one line denoting the maximum number of coins that Sultan can collect in a single withdrawal. He can withdraw in nite amount of money from the Bank.\u003c/p\u003e\u003cp\u003eSample Input 2 6 1 2 4 8 16 32 6 1 3 6 8 15 20\u003c/p\u003e\u003cp\u003eSample Output 6 4\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://uva.onlinejudge.org/external/112/11264.pdf\"\u003ehttps://uva.onlinejudge.org/external/112/11264.pdf\u003c/a\u003e\u003c/p\u003e\u003cp\u003e############################################################################\u003c/p\u003e\u003cp\u003eWhenever I look at this problem and I realise that, we can withdraw any amount of money, and we want to maximize the number of different coins we can get from bank. Then why not, just sum up all the different coins available from bank, and use that as the amount to withdraw. This way, the constraints are followed (as amount can be any value), the answer always comes to be Entire coins set!\u003c/p\u003e\u003cp\u003eWhat am i missing? (is it Brain??) \u003c/p\u003e\u003c/div\u003e","tags":["uva","unable to understand","#help"]}}