{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1476982867,"rating":7,"authorHandle":"brucewayne123","modificationTimeSeconds":1476982968,"id":47895,"title":"\u003cp\u003eamritapuri practice round on amritaicpc.cloudcontest.org\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003ehi everyone! i was trying this problem HENRY:- Henry and Lost Ranges\u003c/p\u003e\u003cp\u003eHenry is a curious little boy. He likes to play around with numbers. One day, he defined a fun ction f for natural numbers such that: f(X) \u003d largest prime factor of X , where X \u0026gt; 1 For example: f(2) \u003d 2\u003c/p\u003e\u003cp\u003ef(3) \u003d 3\u003c/p\u003e\u003cp\u003ef(75) \u003d 5\u003c/p\u003e\u003cp\u003eNow, Henry selected two integers A and B ( A ≤ B ) and counted all numbers X between A and B (both inclusive) such that f(X) \u003d K . He found out that there are N such numbers. After that Henry went for playing. When he returned home, he found out that he had forgotten the upper limit of range i.e. the integer B . However, he remembers all other numbers i.e. A , K and N .\u003c/p\u003e\u003cp\u003eHenry wants to find out B as soon as possible. Can you help him finding it ?\u003c/p\u003e\u003cp\u003eNote:\u003c/p\u003e\u003cp\u003e● If there are multiple possible values of B , output the least value out of those.\u003c/p\u003e\u003cp\u003e● It is assured that the input will be in such a way that final value of B will be within the range of long long int .\u003c/p\u003e\u003cp\u003eInput\u003c/p\u003e\u003cp\u003eFirst line of input contains T , the number of test cases. The only line of each test case contains three integers A , K and N .\u003c/p\u003e\u003cp\u003eOutput\u003c/p\u003e\u003cp\u003eFor each test case, output a single line containing the integer B .\u003c/p\u003e\u003cp\u003eConstraints\u003c/p\u003e\u003cp\u003e● 1 ≤ T ≤ 5\u003c/p\u003e\u003cp\u003e● 2 ≤ A ≤ 10 9\u003c/p\u003e\u003cp\u003e● 2 ≤ K ≤ 11 and K is a prime number\u003c/p\u003e\u003cp\u003e● 0 ≤ N ≤ 152319\u003c/p\u003e\u003cp\u003eExample\u003c/p\u003e\u003cp\u003eInput:\u003c/p\u003e\u003cp\u003e5 3 2 4\u003c/p\u003e\u003cp\u003e5 3 4\u003c/p\u003e\u003cp\u003e4 5 4\u003c/p\u003e\u003cp\u003e5 7 4\u003c/p\u003e\u003cp\u003e3 11 4\u003c/p\u003e\u003cp\u003eOutput:\u003c/p\u003e\u003cp\u003e32\u003c/p\u003e\u003cp\u003e18\u003c/p\u003e\u003cp\u003e20\u003c/p\u003e\u003cp\u003e28\u003c/p\u003e\u003cp\u003e44\u003c/p\u003e\u003cp\u003eExplanation\u003c/p\u003e\u003cp\u003eIn the first case, least value of B such that there are exactly 4 numbers having largest prime factor as 2 in range [3,B] will be 32 (the 4 numbers are 4, 8, 16, 32 ).\u003c/p\u003e\u003cp\u003eIn the second case, least value of B such that there are exactly 4 numbers having largest prime factor as 3 in range [5,B] will be 18 (the 4 numbers are 6, 9, 12, 18 ).\u003c/p\u003e\u003cp\u003eIn the third case, least value of B such that there are exactly 4 numbers having largest prime factor as 5 in range [4,B] will be 20 (the 4 numbers are 5, 10, 15, 20 ).\u003c/p\u003e\u003cp\u003eIn the fourth case, least value of B such that there are exactly 4 numbers having largest prime factor as 7 in range [5,B] will be 28 (the 4 numbers are 7, 14, 21, 28 ).\u003c/p\u003e\u003cp\u003eIn the fifth case, least value of B such that there are exactly 4 numbers having largest prime factor as 11 in range [3,B] will be 44 (the 4 numbers are 11, 22, 33, 44 ).\u003c/p\u003e\u003cp\u003emy solution:- \u003ca href\u003d\"http://pastebin.com/VccNHSwz\"\u003ehttp://pastebin.com/VccNHSwz\u003c/a\u003e since k is \u0026lt;\u003d 11 hence we have primes 2,3,5,7,11 only.. for a particular k i need to check only the numbers formed with combinations of all prime numbers\u0026lt;\u003dk for example.. if k\u003d5 then 2^a*3^b*5^c where c\u0026gt;\u003d1 and a\u0026gt;\u003d0 and b\u0026gt;\u003d0.. so i precomputed all such numbers for all k in \u0026lt;\u003d100000000 then i applied lower_bound to find the least b i am getting wrong answer although i think i have handled overflows correctly! please someone help me understand my mistake! PS:- code is lengthy because but very easy to understand\u003c/p\u003e\u003c/div\u003e","tags":["number theory"]}}