{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1499442159,"rating":26,"authorHandle":"MikhailRubinchik.ru","modificationTimeSeconds":1499443771,"id":53161,"title":"\u003cp\u003eШкольникам, которые хотят прокачаться\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет! \u003c/p\u003e\u003cp\u003e[В этом посте будет рассказ об очередном лагере по олимпиадной информатике :) \u003ca href\u003d\"https://vk.com/ural_sp_school?w\u003dwall-148268394_9\"\u003eЯ уже хочу\u003c/a\u003e]\u003c/p\u003e\u003cp\u003eЯ занимаюсь подготовкой студентов и школьников к соревнованиям по спортивному программированию уже около 12 лет. Но в основном всё это время я занимался студентами. С этого года хочу более активно заняться школьниками. \u003c/p\u003e\u003cp\u003eКонечно заниматься я буду этим не один, а вместе большой команда организаторов, преподов, вожатых в Екатеринбурге. Один из основных пунктов нашего плана — создание лагерей по олимпиадной информатике. \u003c/p\u003e\u003cp\u003eУже осенью или зимой мы запустим первый лагерь. Нам важно понять, нужно ли нам сразу два лагеря или всего один. И если один, то какие даты лучше выбрать. \u003c/p\u003e\u003cp\u003eЛагерь в ноябре будет ориентирован на подготовку ко ВКОШП для самых сильных и к муниципальному этапу ВсОШ для более новичков. Лагерь в январе будет ориентирован на подготовку к региональному этапу ВсОШ. \u003c/p\u003e\u003cp\u003eМы пока не можем сказать точную стоимость, но наша цель не заработать на родителях, а как можно дешевле научить как можно большее число детей. Поэтому пока опрос не включает денег. Отвечайте на него, считая, что лагерь для вас бесплатен (или почти бесплатен). \u003c/p\u003e\u003cp\u003eЕсли вы не из Свердловской области, после голосования укажите, пожалуйста, ваш регион в комментарии. \u003c/p\u003e\u003cp\u003eP.S. участие в опросе не означает заявку в лагерь, мы просто хотим оценить степень интереса к лагерям, чтобы принять решение.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://vk.com/ural_sp_school?w\u003dwall-148268394_9\"\u003eХочу в лагерь.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eНу и вступайте в группу, мы там будем рассказывать о лагерях, кружках, олимпиадах и не только :)\u003c/p\u003e\u003c/div\u003e","tags":[]}}