{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1485129990,"rating":97,"authorHandle":"PeterASteele","modificationTimeSeconds":1485130030,"id":49947,"title":"\u003cp\u003eDiv1 Exiting Contest After Registering\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI greatly enjoy solving problems on codeforces in preparation for ICPC contests. The codeforces rating system is fun, and at Virginia Tech, we have a website that uses the codeforces API to rank members of our team. I say this to establish how much I enjoy training on the codeforces platform, and that I do not mean to insult Mike or the codeforces team.\u003c/p\u003e\u003cp\u003eAt the bottom of Div1 there is a frustrating phenomenon: If a user does not submit, rating is not computed. At first thought, this seems well-intentioned. It would be quite unfortunate for a user to register and forget, and lose rank as a result. But the side effects of this are too great. The side effect is that if you do not solve problem A quickly, it is better not to submit. Over 1/3rd of the people who register take advantage of this during contest, and it is quite frustrating for low div1 members.\u003c/p\u003e\u003cp\u003eThis effect was quite pronounced this last contest, and \u003cstrong\u003eout of 650+ people registering, only 391 made a submit\u003c/strong\u003e. Of those people, nearly all made a submit early on the first problem. The ELO system continues to work, but only among people who already think they have a good chance at doing well.\u003c/p\u003e\u003cp\u003eThis last contest, 370 people out of 391 solved problem A and problem B. Only 2 people failed to solve both A and B problems. This is not because A and B were trivial; they were not (see div2 results for the same problem). As a result of so many people leaving the contest, it makes it extremely hard to maintain a rank without leaving during your own bad contests. \u003cstrong\u003eAs more people do this, it snowballs. It becomes more and more punishing NOT to leave the contest if you don\u0027t have a perfect start.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe fix is simple: \u003cstrong\u003eMake people lose rank if they register and do not submit.\u003c/strong\u003e Late registration has a delay for submits, but this could be increased to ~30 minutes to reduce the chances of people abusing late registration to jump in the contest if they like the first problem.\u003c/p\u003e\u003c/div\u003e","tags":[]}}