{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1499945694,"rating":84,"authorHandle":"Dmitry_Egorov","modificationTimeSeconds":1501835728,"id":53274,"title":"\u003cp\u003eVKCup 2к17: Хочешь работать в VK?\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003eТретий год подряд мы проводим VKCup, давая возможность молодым талантам проявить себя. Как человеку, 4 года участвовавшему в олимпиадах по программированию и дошедшему до чемпионства мира ACM ICPC, мне знакомо присущее олимпиадам разнообразие ярких эмоций. Но жизнь олимпиадами не ограничивается и после окончания университета (а многие и до этого) начинают искать работу (или разбирать накопившиеся офферы и приглашения) и зачастую не находят интересных задач, а компании жалуются на то, что с олимпиадниками невозможно работать, а их код никто не может понять и поддерживать.\u003c/p\u003e\u003cp\u003eНо пока Google сочиняет один доклад за другим о том, что олимпиадники работают хуже, у нас, в VK, мы уже много лет используем наши уникальные способности придумывать и реализовывать эффективные алгоритмы и структуры данных для решения прикладных задач. Все базы данных VK написаны олимпиадниками. Всего 7 человек отвечают за хранение и обработку данных сотен миллионов пользователей в \u003ca href\u003d\"https://www.similarweb.com/top-websites\"\u003e5 по величине сайте мира\u003c/a\u003e. У нас работают 4 чемпиона мира (кроме меня это еще \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/PavelKunyavskiy\" title\u003d\"International Grandmaster PavelKunyavskiy\"\u003ePavelKunyavskiy\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/qwerty787788\" title\u003d\"International Grandmaster qwerty787788\"\u003eqwerty787788\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/niyaznigmatul\" title\u003d\"International Grandmaster niyaznigmatul\"\u003eniyaznigmatul\u003c/a\u003e). Только за прошлый год, параллельно с решением текущих задач, мы полностью переделали с нуля систему хранения личных сообщений, лайков и новостей, позволившие компании одновременно расширить функционал сайта и сэкономить миллионы долларов.\u003c/p\u003e\u003cp\u003eХочешь работать с петабайтами данных, создавать системы, выдерживающие миллионы запросов в секунду, экспериментировать с алгоритмами машинного обучения? Ты уверен в своих силах, тебе есть 18 лет и ты готов к переезду в Санкт-Петербург? Ты ищешь работу на полную занятость с гибким графиком? Тогда заполни до 1-го августа \u003ca href\u003d\"#\"\u003eформу (закрыта)\u003c/a\u003e. Мы больше рассчитываем пополнить олимпиадниками ряды разработчиков баз данных и команды машинного обучения и больших данных, но нам нужны и специалисты практически всех технических направлений — от фронтенда и мобильной разработки до админов.\u003c/p\u003e\u003cp\u003eДмитрий Егоров, руководитель отдела разработки баз данных.\u003c/p\u003e\u003c/div\u003e","tags":["vk","vkcup","vkcup 2017"]}}