{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1457043218,"rating":54,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1457563179,"id":43553,"title":"\u003cp\u003eТехнокубок: олимпиада по программированию для школьников\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/technocup-2016-banner.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eВ 16:00 (московское время) 4 марта 2016 г. Mail.Ru Group совместно с МФТИ, МГТУ им. Н. Э. Баумана и Codeforces запускает Технокубок — первую совместную олимпиаду по программированию для школьников. На кону — дополнительные баллы при поступлении в престижные технические вузы России и ценные призы.\u003c/p\u003e\u003cp\u003eСразиться за звание самого талантливого молодого программиста приглашаются учащиеся средних образовательных учреждений. Кроме того, любой желающий сможет попробовать свои силы в решении сложных и интересных задач в разделе Тренировок после онлайн-раундов.\u003c/p\u003e\u003ch3\u003eОрганизаторы олимпиады\u003c/h3\u003e\u003cp\u003e\u003ca href\u003d\"https://mipt.ru/\" title\u003d\"Московский физико-технический институт\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/mipt-logo.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003cbr /\u003e \u003csmall\u003eМосковский физико-технический институт\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://www.bmstu.ru/\" title\u003d\"Московский Государственный Технический Университет им. Н. Э. Баумана\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/bmstu-logo.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003cbr /\u003e \u003csmall\u003eМосковский Государственный Технический Университет им. Н. Э. Баумана\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://it.mail.ru/\" title\u003d\"IT.Mail.Ru\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/itmailru-logo.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003cbr /\u003e \u003csmall\u003eIT.Mail.Ru\u003c/small\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/\" title\u003d\"Codeforces\"\u003e\u003cimg src\u003d\"/predownloaded/26/ea/26ea5e302c92ac6af3552f05b98f0117b6cd4317.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003cbr /\u003e \u003csmall\u003eCodeforces\u003c/small\u003e\u003c/p\u003e\u003cp\u003eПобедители и призеры олимпиады будут определены по результатам очного этапа, который будет проведен в Москве.\u003c/p\u003e\u003ch3\u003eЭтапы соревнования\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003eОзнакомительные раунды\u003c/strong\u003e \u003cbr /\u003e \u003cstrong\u003e21 марта 00:00 — 23 марта 17:00, 24 марта 00:00 — 26 марта 11:00\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eУ участников олимпиады будет возможность ознакомиться с платформой Codeforces. Для участия в онлайн-этапе, решение задач ознакомительного раунда не обязательно.\u003c/p\u003e\u003cp\u003e**Отборочный (онлайн) этап ** \u003cbr /\u003e \u003cstrong\u003e23 марта 18:00 — 20:00, 26 марта 10:00 — 12:00\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eПользователи могут участвовать как и в первом, так и во втором онлайн-раунде. Лучшие 150 участников каждого из онлайн-раундов будут приглашены к участию в заключительном этапе, но не более 45% от общего числа участников раунда. До 5 апреля приглашенные в заключительный этап должны подтвердить желание и возможность участия в нем. В случае отсутствия подтверждения, жюри может пригласить следующего участника по результатам соответствующего онлайн-раунда.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eЗаключительный (очный) этап в МГТУ им. Н. Э. Баумана и МФТИ\u003c/strong\u003e \u003cbr /\u003e \u003cstrong\u003e17 апреля\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eЗаключительный этап будет проходить очно на площадках вузов. Участники, прошедшие онлайн-этап, побывают в лучших технических вузах страны и смогут получить ответы на вопросы по поводу поступления. Награждение пройдет в тот же день в офисе Mail.Ru Group, для победителей и призеров будет организован трансфер с площадок вузов. Победители и призеры олимпиады познакомятся со специалистами крупнейшей IT-компании в России, а также узнают про возможности карьерного роста в IT-сфере для абитуриентов МФТИ и МГТУ им. Н. Э. Баумана. Проживание и проезд осуществляется за счет участников. При наличии возможности по решению Оргкомитета возможна частичная оплата расходов на проживание. Для остальных мы подберем рекомендации по проживанию за невысокую цену близ площадок вузов.\u003c/p\u003e\u003ch3\u003eПризы\u003c/h3\u003e\u003cp\u003eДополнительные баллы в МФТИ и МГТУ им. Н. Э. Баумана:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eПобедителям (диплом I степени) — 8 баллов\u003c/li\u003e   \u003cli\u003eПризерам (диплом II, III степени) — 6 баллов\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eВсего будут награждены не более трети участников заключительного этапа.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eЦенные призы:\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e   \u003cli\u003e1 место iPad mini 2 + Технокубок\u003c/li\u003e   \u003cli\u003e2 место iPod nano\u003c/li\u003e   \u003cli\u003e3 место iPod shuffle\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eРегистрация начнется в 16:00 (московское время) 4 марта на сайте: \u003ca href\u003d\"https://it.mail.ru/technocup/\"\u003ehttps://it.mail.ru/technocup/\u003c/a\u003e\u003c/p\u003e\u003cp\u003eСразитесь за звание самого талантливого молодого программиста и за право стать первым обладателем Технокубка!\u003c/p\u003e\u003cp\u003eОлимпиада проходит по правилам раундов Codeforces.\u003c/p\u003e\u003cp\u003eЧемпионат Технокубок входит в число инициатив Mail.Ru Group, направленных на развитие российской IT-отрасли и объединённых ресурсом It.Mail.Ru. Платформа It.Mail.Ru создана для тех, кто увлекается IT и стремится профессионально развиваться в этой сфере. Проект объединяет чемпионаты Russian AI Cup, Russian Code Cup и Russian Developers Cup, образовательные проекты Технопарк в МГТУ им. Баумана, Техносфера в МГУ им. М.В. Ломоносова и Технотрек в МФТИ. Кроме того, на It.Mail.Ru можно с помощью тестов проверить свои знания по популярным языкам программирования, узнать важные новости из мира IT, посетить или посмотреть трансляции с профильных мероприятий и лекции на IT-тематику.\u003c/p\u003e\u003cp\u003e\u003csmall\u003e*Дополнительные баллы могут получить учащиеся 8 – 11-х классов образовательных учреждений. Действие льготы — 4 года.\u003c/small\u003e\u003c/p\u003e\u003c/div\u003e","tags":["технокубок","мгту им баумана","мфти","mail.ru"]}}