{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1522233899,"rating":88,"authorHandle":"Lil.Morty","modificationTimeSeconds":1522314227,"id":58605,"title":"\u003cp\u003eПроведение отборов на Всеукраинскую олимпиаду.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДобрый день, я хочу Вам рассказать про то, как проводятся отборы на Всеукраинскую олимпиаду по информатике в г.Киев. Отборы на IV (Всеукраинский) этап проводятся по следующему принципу . Всего есть 7 туров, в неделю проходит 1 — 2 тура. В каждом туре по 2 — 3 задачи. Всего отборы длятся около месяца. И вот мы подошли к самому, по моему мнению, неприятному. Во-первых, все задачи на туры заранее известны также как и авторские коды вместе с разборами. Во-вторых задачи проходят тестирования на системе STS или KGrader (ссылку на эти системы оставлю в конце). Теперь я опишу все приколы этой системы:\u003c/p\u003e \u003col\u003e   \u003cli\u003eУ Вас на каждую задачу есть только одна засылка.\u003c/li\u003e   \u003cli\u003eВывод лишнего перехода на следующую строку дает половину от полученых баллов (апеллировать это нельзя).\u003c/li\u003e   \u003cli\u003eОтсутствие перехода на следующую строк дает половину от полученых баллов (апеллировать это нельзя).\u003c/li\u003e   \u003cli\u003eНеобходимо указать название компилятора в первой строке (апеллировать это можно).\u003c/li\u003e   \u003cli\u003eЕсли Вы неправильно назвали файл с кодом или неправильно написали названия подключаемых файлов — 0 баллов (апеллировать это нельзя).\u003c/li\u003e   \u003cli\u003eСтарый компилятор.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eКак по мне, все эти факты являются некорректными. Потому что эти отборы показывают не уровень программирования, а способность запоминать решения.\u003c/p\u003e\u003cp\u003eВсе ссылки на систему тестирования и задачи оставлю ниже. Будет интересно прочитать Ваши мнения. Спасибо за внимание.\u003c/p\u003e\u003cp\u003eЗадачи отборочно-тренировочных сборов команды города Киева в IV этапа Всеукраинской ученической олимпиады по информатике: \u003ca href\u003d\"http://www.kievoi.ippo.kubg.edu.ua/kievoi/index1.html\"\u003ehttp://www.kievoi.ippo.kubg.edu.ua/kievoi/index1.html\u003c/a\u003e\u003c/p\u003e\u003cp\u003eCистема тестирования : \u003ca href\u003d\"http://www.kievoi.ippo.kubg.edu.ua/kievoi/index.html\"\u003ehttp://www.kievoi.ippo.kubg.edu.ua/kievoi/index.html\u003c/a\u003e\u003c/p\u003e\u003cp\u003eТакже оставлю топ самых \u0026quot;любимых\u0026quot; задач:\u003c/p\u003e\u003cp\u003eХимия:\u003ca href\u003d\"http://www.kievoi.ippo.kubg.edu.ua/kievoi/train/9.html\"\u003ehttp://www.kievoi.ippo.kubg.edu.ua/kievoi/train/9.html\u003c/a\u003e\u003c/p\u003e\u003cp\u003eВечеринка:\u003ca href\u003d\"http://www.kievoi.ippo.kubg.edu.ua/kievoi/train/6.html\"\u003ehttp://www.kievoi.ippo.kubg.edu.ua/kievoi/train/6.html\u003c/a\u003e\u003c/p\u003e\u003cp\u003eСемья:\u003ca href\u003d\"http://www.kievoi.ippo.kubg.edu.ua/kievoi/train/13.html\"\u003ehttp://www.kievoi.ippo.kubg.edu.ua/kievoi/train/13.html\u003c/a\u003e\u003c/p\u003e\u003cp\u003eТакже решил добавить порядок проведения этих отборов и 3 этапа в котором все подробно описывается : \u003ca href\u003d\"http://www.kievoi.ippo.kubg.edu.ua/kievoi/order.html\"\u003ehttp://www.kievoi.ippo.kubg.edu.ua/kievoi/order.html\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}