{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1408918871,"rating":17,"authorHandle":"gojira","modificationTimeSeconds":1409175064,"id":13532,"title":"\u003cp\u003eRockethon 2014: US Schools edition\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone,\u003c/p\u003e\u003cp\u003eWe are happy to announce that Rocket Fuel Inc. will be hosting a programming competition for the students of US universities. The contest was prepared by Alex Ruff and me, Eldar Bogdanov. Besides challenging problems the contest offers prizes and T-shirts for top performers. Rocket Fuel is very excited about this event and the students that will participate, and will be reaching out to those who are close to graduation with our job opportunities.\u003c/p\u003e\u003cp\u003eThe contest will take place on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dRockethon+2014%3A+US+Schools+edition\u0026amp;iso\u003d20140928T12\u0026amp;p1\u003d224\u0026amp;ah\u003d3\"\u003eSunday, September 28\u003c/a\u003e at 12PM PST. You will have 3 hours to solve 6 problems of varying difficulty. Each of these problems will feature one or two subproblems. Each subproblem will be worth a fixed amount of points. The ties between contestants with the same score will be broken by penalty time which is computed similar to ACM scoring system. (See the first comment to this post for details.)\u003c/p\u003e\u003cp\u003eYou can take a look at the problems from our previous open contest at \u003ca href\u003d\"//codeforces.com/contest/391\"\u003ehttp://codeforces.com/contest/391\u003c/a\u003e. You can also submit solutions for them to get familiar with Codeforces platform. See \u003ca href\u003d\"//codeforces.com/help\"\u003eCodeforces FAQ\u003c/a\u003e for general instructions.\u003c/p\u003e\u003cp\u003eThe contest is individual, which means that a contestant can not discuss the problems and their solutions during the contest. (Needless to say, submitting someone else\u0027s code also breaks the rules.) However, it is permitted to use prewritten code, i.e., any code you have written prior to this contest or any code, even not authored by you, that was publicly available before that start of the contest.\u003c/p\u003e\u003cp\u003eThe top 50 contestants will receive T-shirts. The top 3 will receive 16GB iPad Airs.\u003c/p\u003e\u003cp\u003eWe hope you will enjoy the contest! We look forward to working with some of you in the future. In the meanwhile, we\u0027ll try to respond to any questions about our company or this competition in the comments.\u003c/p\u003e\u003c/div\u003e","tags":["rockethon","rocket fuel"]}}