{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1525885200,"rating":220,"authorHandle":"MakeRussiaGreatAgain","modificationTimeSeconds":1526058229,"id":59365,"title":"\u003cp\u003eFlash, уходи\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет. Я решил ещё раз поднять тему Flash Player в контексте его использования на Codeforces для взломов.\u003c/p\u003e\u003cp\u003eЭту тему уже \u003ca href\u003d\"/blog/entry/6814\"\u003eподнимали\u003c/a\u003e \u003ca href\u003d\"/blog/entry/19230\"\u003eнеоднократно\u003c/a\u003e, \u003ca href\u003d\"/blog/entry/4103\"\u003eдавно\u003c/a\u003e и \u003ca href\u003d\"/blog/entry/55582\"\u003eне очень\u003c/a\u003e. Все ответы администрации сводились к двум утверждениям: что Flash работает и что систему, основанную на Flash, трудно обойти. Оба эти утверждения ‒ ложь.\u003c/p\u003e\u003cp\u003eВ последнее время я несколько раз пытался смотреть код других участников во время контеста, и у меня не разу не получилось. Каждый раз показывалось что-то \u003ca href\u003d\"/blog/entry/56691?#comment-403966\"\u003eтакое\u003c/a\u003e. При этом я использовал последнюю версию Flash. При этом процесс \u003ccode\u003eplugin-container\u003c/code\u003e, в котором работает Flash, падал с необработанным исключением (SIGSEGV). Это то, что может произойти, если, например, решение задачи на C++ выходит за границы массива. Видимо, Flash Player по качеству кода недалеко ушёл от таких решений.\u003c/p\u003e\u003cp\u003eПри таком качестве кода не удивительно, что у Flash плохо с безопасностью. \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Штаб, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e, конечно, \u003ca href\u003d\"/blog/entry/19230?locale\u003dru#comment-241080\"\u003eскажет\u003c/a\u003e, что уязвимости есть не только в Flash. Но если в Chrome или Firefox найдут уязвимость, которая будет активно эксплуатироваться, то Google и Mozilla выпустят обновление как можно быстрее, а Adobe (как и Microsoft) будут ждать до следующего планируемого выпуска патчей (патчи выпускаются \u003ca href\u003d\"https://en.wikipedia.org/wiki/Patch_Tuesday\"\u003eво второй вторник каждого месяца\u003c/a\u003e). Кроме того, использование Flash добавляет все его уязвимости к тем, что уже есть в браузере (это одна из причин, по которой браузеры отказываются от поддержки вообще всех плагинов, а не только Flash).\u003c/p\u003e\u003cp\u003eВ общем, как я уже написал, Flash небезопасен. Flash не работает ‒ по крайней мере, под Linux. Из-за лицензионных ограничений, Flash под Linux нельзя скачать из репозитория, нужно качать и ставить обновления вручную (но это не важно, так как он всё равно не работает). Можно, конечно, специально для взломов использовать виртуальную машину с Windows (там Flash работает), но это неудобно. Я считаю, что необходимость в подобных действиях для полноценного участия в контестах ‒ свинство со стороны администрации.\u003c/p\u003e\u003cp\u003eДаже когда Flash работает, основанный на нём интерфейс для чтения кода, мягко говоря, оставляет желать лучшего. Код приходится читать в окошке посередине экрана, набранный корявым шрифтом, а прокрутка ‒ это вообще извращённый садизм. Да чтоб тот, кто это поделие придумал, до конца жизни писал код только через такой же интерфейс!\u003c/p\u003e\u003cp\u003eИ наконец: \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Штаб, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e почему-то считает, что новички для того, чтобы нарушить правила, с лёгкостью \u003ca href\u003d\"/blog/entry/6814?locale\u003dru#comment-124364\"\u003eустановят\u003c/a\u003e Firebug, но при этом не додумаются установить декомпилятор для Flash. Так вот: декомпиляторы для Flash существуют, их легко найти, и первый же найденный декомпилятор легко декомпилирует Flash-файлы с Codeforces. И я удивлюсь, если ещё никто ни разу не копировал чужой код через функцию взлома. Впрочем, если это и так, то это скорей говорит о честности участников.\u003c/p\u003e\u003cp\u003eТеперь к главному. Я изучил, как работают Flash-файлы с Codeforces и, в частности, как они расшифровывают решения. Я собираюсь выложить эту информацию, чтобы показать, что «защита» на основе Flash не имеет преимуществ перед «защитой» на основе Javascript, и таким образом подтолкнуть администрацию к тому, чтобы отказаться от Flash. Также я сделал расширение для Chrome и Firefox, которое позволяет читать код без Flash. Его я тоже собираюсь выложить. Так или иначе, я избавлю себя и других участников от необходимости держать Flash ради Codeforces. Других сайтов, где без Flash что-то не работает, я не встречал уже давно.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e Продолжение: \u003ca href\u003d\"/blog/entry/59401\"\u003eПочему Codeforces не нужен Flash\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","flash"]}}