{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1423480331,"rating":16,"authorHandle":"magieNoire","modificationTimeSeconds":1425376479,"id":16292,"title":"\u003cp\u003eWeekly training #2: Dynamic Programming\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone, I hope you had a nice weekend. As promised, today we will start a new training. It is a bit unusual, it will last 2 weeks this time -- be prepared to strive in this round, and its main theme is Dynamic Programming. The number of problems this time is \u003cem\u003eastronomical\u003c/em\u003e, just work at your own paces, we can add few more days if needed :)\u003c/p\u003e\u003cp\u003eBig thanks to these gentlemen, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/RedNextYears\" title\u003d\"Candidate Master RedNextYears\"\u003eRedNextYears\u003c/a\u003e and \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/PrinceOfPersia\" title\u003d\"Candidate Master PrinceOfPersia\"\u003ePrinceOfPersia\u003c/a\u003e, for helping me setting this round (Applause to them please).\u003c/p\u003e\u003cp\u003eYou can find \u003cstrong\u003eall problems\u003c/strong\u003e \u003ca href\u003d\"http://www.a2oj.com/Contest.jsp?ID\u003d15675\"\u003ehere\u003c/a\u003e. \u003cbr /\u003e (Thank you again \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/RedNextYears\" title\u003d\"Candidate Master RedNextYears\"\u003eRedNextYears\u003c/a\u003e)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNote:\u003c/strong\u003e As usual you can discuss problems here.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNote:\u003c/strong\u003e If you know some good resources about dynamic programming techniques, share them with us.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNote:\u003c/strong\u003e Topcoder is a good resource for dynamic programming problems. The reason we didn\u0027t include them here, is that there is no way of adding them to the scoreboard and thus will ruin the contest\u0027s atmosphere. However, I\u0027ll try to compile some good problems separately in another sheet and give them to you as a bonus at the end of this contest. Problem propositions are welcome in here.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLet the Party Begins\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e After 3 weeks the contest has ended. I hope you enjoyed the problems. Please, share with us your experiences.\u003cbr /\u003e Also, I won\u0027t be available the upcoming two weeks. In the meantime try to read about graph theory, as it will be our main theme in the next training.\u003c/p\u003e\u003c/div\u003e","tags":["training","dynamic programming"]}}