{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1464292444,"rating":34,"authorHandle":"reflexfps","modificationTimeSeconds":1464293320,"id":45074,"title":"\u003cp\u003eIs it worth practicing math contest problems?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThere is lots of evidence that doing well in math contests helps significantly in programming contests. \u003c/p\u003e\u003cp\u003eSomeone else asked a similar question on another page, where one of the comments (\u003ca href\u003d\"//codeforces.com/blog/entry/18149?#comment-230597\"\u003ehttp://codeforces.com/blog/entry/18149?#comment-230597\u003c/a\u003e) says:\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u0026quot;People able to do well in mathematical competitions do perform well and have a big boost when it comes to competitive programming not because of their knowledge of specific theorems, but because they are able of conducting logical and precise reasoning.\u0026quot;\u003c/em\u003e\u003c/p\u003e\u003cp\u003eThat same page includes references to several top competitive programmers who improved relatively quickly because of their strong math background.\u003c/p\u003e\u003cp\u003eHere\u0027s another link (\u003ca href\u003d\"https://community.topcoder.com/tc?module\u003dStatic\u0026amp;d1\u003dfeatures\u0026amp;d2\u003d070805\"\u003ehttps://community.topcoder.com/tc?module\u003dStatic\u0026amp;d1\u003dfeatures\u0026amp;d2\u003d070805\u003c/a\u003e) where \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Легендарный гроссмейстер Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e says at one point: \u003c/p\u003e\u003cp\u003e\u003cem\u003e\u0026quot;I think that two main keys to programming challenges are training and thinking. You have to solve a lot of problems to become really successful, but you also need to have good math knowledge and the ability to solve uprising problems. Mathematical puzzles and olympiad problems, for example, can help develop it very well.\u0026quot;\u003c/em\u003e\u003c/p\u003e\u003cp\u003eI personally did math contests throughout my school years (I am attending university now), but I never did significantly well in them (the best I did was in 12th grade when I qualified for the AIME, for anyone who knows what that is). So my question is: \u003cstrong\u003eIs is worth supplementing practice for programming contests with practicing math contest problems?\u003c/strong\u003e Would your problem solving ability improve any faster if you practiced math contest problems, or would it be more efficient to practice programming problems only?\u003c/p\u003e\u003c/div\u003e","tags":[]}}