{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1437151950,"rating":2,"authorHandle":"Murtazo.Ali","modificationTimeSeconds":1437151950,"id":19291,"title":"\u003cp\u003eHappy Eid al-Fitr — الفطر‎ عيد \u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eEid Mubarak to everyone my Muslim and nonMuslim friends!!!\u003c/p\u003e\u003cp\u003eAlternative terms.\u003c/p\u003e\u003cp\u003eEid al-Fitr goes by various alternative terms in English, including:\u003c/p\u003e\u003cp\u003eFastbreaking Eid\u003c/p\u003e\u003cp\u003eSweet Festival\u003c/p\u003e\u003cp\u003eRamadan feast\u003c/p\u003e\u003cp\u003eFeast of Fasting\u003c/p\u003e\u003cp\u003eBajram\u003c/p\u003e\u003cp\u003eLesser Eid\u003c/p\u003e\u003cp\u003eSmaller Eid\u003c/p\u003e\u003cp\u003eSmall Eid\u003c/p\u003e\u003cp\u003eMinor feast\u003c/p\u003e\u003cp\u003eEid al-Saghir\u003c/p\u003e\u003cp\u003eSugar Feast\u003c/p\u003e\u003cp\u003ePractices by country.\u003c/p\u003e\u003cp\u003eSaudi Arabia Eid al-Fitr is celebrated with great pomp in Saudi Arabia. Saudis decorate their homes and prepare sumptuous meals for family and friends.\u003c/p\u003e\u003cp\u003eEid festivities in Saudi Arabia may vary culturally depending on the region, but one common thread in all celebrations is of generosity and hospitality. First, it is common Saudi tradition for families to gather at the patriarchal home after the Eid prayers. Before the special Eid meal is served, young children will line up in front of each adult family member, who dispense money as gifts to the children. Family members will also typically have a time where they will pass out gift bags to the children. These bags are often beautifully decorated and contain candies and toys.\u003c/p\u003e\u003cp\u003eMany shopkeepers will show their generosity at Eid providing free Eid gifts with each purchase. For example, during Eid, many of the chocolate shops will give each customer who buys a selection of candies a free crystal candy dish with their purchase.\u003c/p\u003e\u003cp\u003eIn the spirit of Eid, many Saudis go out of their way to show their kindness and generosity. It is common for even complete strangers to greet one another at random, even by occupants of vehicles waiting at stop lights. Sometimes even toys and gifts will be given to children by complete strangers.\u003c/p\u003e\u003cp\u003eIt is also traditional in some areas for Saudi men to go and buy large quantities of rice and other staples and then leave them anonymously at the doors of those who are less fortunate. Also, in some areas in the middle of Saudi Arabia, such as Al Qassim, it\u0027s a common tradition that during Eid morning and after the Eid prayer people will put large rugs on one of streets of their neighborhood and each household will prepare a large meal where these meals will be shared by all neighbours, it\u0027s also a common practice that people will swap places to try more than one kind of meal.\u003c/p\u003e\u003cp\u003eIn the major cities in Saudi Arabia, every night there are huge fireworks shows.\u003c/p\u003e\u003cp\u003eTurkey\u003c/p\u003e\u003cp\u003eTerminology\u003c/p\u003e\u003cp\u003eIn Turkey, nation-wide celebrated holidays are referred to as bayram, and Eid al-Fitr is referred to as both Şeker Bayramı (\u0026quot;Bayram of Sweets\u0026quot;) and Ramazan Bayramı (\u0026quot;Ramadan Bayram\u0026quot;).\u003c/p\u003e\u003c/div\u003e","tags":[]}}