{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1480786845,"rating":90,"authorHandle":"gKseni","modificationTimeSeconds":1480791244,"id":48819,"title":"\u003cp\u003eNEERC 2016: Первый день, пробный тур\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет! Подошел к концу первый день 21 полуфинала NEERC.\u003c/p\u003e\u003cp\u003eУтром во время регистрации участники, тренеры, организаторы и гости пили бесплатный кофе от \u003ca href\u003d\"http://www.aimtech.com/\"\u003eAIM Tech\u003c/a\u003e, делали смешные снимки в фотобудке от \u003ca href\u003d\"https://corp.mail.ru/ru/\"\u003eMail.Ru Group\u003c/a\u003e, а \u003ca href\u003d\"https://www.worldquant.com/home/\"\u003eWorldQuant\u003c/a\u003e раздавали яркие термокружки с трубочкой. Особый интерес у участников вызвал квест от Яндекса.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/ce/ec/ceec83577bbc9b97be15bc1fdf983a626c5baad8.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eЛидия \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/lperovskaya\" title\u003d\"Expert lperovskaya\"\u003elperovskaya\u003c/a\u003e Перовская рассказала о подготовке мероприятия и наборе волонтеров:\u003c/p\u003e\u003cp\u003e— Давно начали готовиться?\u003cbr /\u003e— Непрерывная подготовка идет последние полгода — постоянная текучка разных дел. Основная работа, конечно, проводится в последние недели две перед мероприятием.\u003c/p\u003e\u003cp\u003e— Не обошлось без волонтеров. Это студенты ИТМО?\u003cbr /\u003e— Есть студенты — причем первокурсников среди волонтеров около 30%. Есть и люди, которые уже давно выпустились. У волонтеров несколько ролей — кто-то на регистрации, кто-то обслуживает холлы, в которых проводятся контесты, есть пресс-служба. \u003c/p\u003e\u003cp\u003e— А как же пары?\u003cbr /\u003e— Мы заранее договариваемся с преподавателями. Более того, волонтеры заранее знают, что в дни мероприятия они находятся весь день на месте, не планируют личных дел и не надеются убежать пораньше. Волонтеры проходят сразу несколько мероприятий, поэтому к полуфиналу уже имеют достаточный опыт. Плюс я никогда не оставлю неопытного волонтера одного — как правило на точке есть один ответственный опытный волонтер и еще несколько ребят — работы много. \u003c/p\u003e\u003cp\u003e— Как награждаете волонтеров?\u003cbr /\u003e— Каждому, конечно, выдаются подарочки. Важно, что материально мы никогда никого не поощряем — только памятные футболки, дипломы, благодарности.\u003c/p\u003e\u003cp\u003e— Волонтером ведь интересно быть, потому что можно попробовать себя в разных ролях.\u003cbr /\u003e— Кстати редко люди меняют у нас профиль. Может только один раз — если человек был на регистрации и понял, что спал меньше всех. Или стоял в холле и понял, что хочется более авральной работы. Есть одна девушка, которая прошла три профиля — она очень крутая. Мы с ней сначала роли придумываем, проходим сами, а потом набираем волонтеров на эту роль.\u003c/p\u003e\u003cp\u003e— Здорово, что вы сначала проходите этот путь сами.\u003cbr /\u003e— Разумеется, это важно.\u003c/p\u003e\u003cp\u003eЦеремонию открытия вела Лида. \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e отметил, что у нее это вышло круче, чем у ведущих, которые были прошлый год. И так думает не один он:\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/ef/36/ef36fab4352d1c96197cb9f8b4b4a54e3407f760.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/center\u003e\u003cp\u003eВо время церемонии открытия сказали слова благодарности организаторам полуфинала, спонсорам. Алексей Федоров, говоря о том, что навыки олимпиадного программирования пригодятся и в работе, привел интересный пример из ежедневной практики компании Одноклассники — хранение и быстрая обработка графа дружбы всех участников социальной сети. А в твиттере он написал:\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/47/c9/47c9c9b153ac68f8339b50c2d1197e2c850c7ea0.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/center\u003e\u003cp\u003eФедор Царев, WorldQuant, сказал, что сам сначала был на полуфинале в качестве участника, потом в жюри, а сейчас в качестве спонсора. Призывал ребят продолжать свой путь в будущем — не ограничиваться только участием. \u003c/p\u003e\u003cp\u003eПеред выражением благодарности членам жюри, Лида задала вопрос залу: «Без кого не обойдется полуфинал?» Одним из ответов из зала был вариант: «Без Олега Христенко». Зал поддержал бурными аплодисментами.\u003c/p\u003e\u003cp\u003eБыло два выступления вокального ансамбля — три девушки в чудесных платьях зажигали как могли. Думаю, одинаковые платья смотрелись бы эффектнее. Одна из песен, которую они исполнили — IOWA «Мама» — интересно разложили на голоса. \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/ba/e8/bae85efe76e758c8e5bd3ba9558c9a8b5b7336c4.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eОсобый интерес у участников вызвало выступление чирлидерш университета ИТМО. Мальчики шептались, что в тайне хотели бы видеть поддержку девчонок прямо во время контеста :) \u003c/p\u003e\u003cp\u003eПосле перерыва на обед, волонтеры проводили команды на места, где их ждал компьютер, на котором и завтра будут работать ребята, тетради от Яндекса и наклейки Codeforces ;) Кстати, посмотрите как они смотрятся хорошо: \u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/5d/d1/5dd18d35b53a36a4e6284ceb5208b1d6b1246ab4.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eСтратегии поведения на пробном туре у команд разные. Команда Moscow Institute of Physics and Technology 1, Константин \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/zemen\" title\u003d\"International Grandmaster zemen\"\u003ezemen\u003c/a\u003e Семенов, Иван \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ifsmirnov\" title\u003d\"International Grandmaster ifsmirnov\"\u003eifsmirnov\u003c/a\u003e Смирнов, Артем \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Arterm\" title\u003d\"Grandmaster Arterm\"\u003eArterm\u003c/a\u003e Жук, золотые медалисты прошлого года, делятся:\u003c/p\u003e\u003cp\u003e— Вы выкладываетесь на отборном туре?\u003cbr /\u003e— Зависит от количества задач. Если их 15, то только легенькие, если три — то все. Сейчас были задачи вида a + b, поэтому сдали все.\u003c/p\u003e\u003cp\u003e— Есть у вас какой-то любимый тип задач?\u003cbr /\u003e— (Артем) Наверное нет, раньше были, сейчас нравятся задачи в которых есть новые идеи, в которых код мало писать, много думать.\u003cbr /\u003e— (Константин) Я соглашусь — где мало код писать.\u003cbr /\u003e— (Иван) Я скорее нет. Люблю задачи, в которых надо много сидеть, доводить и аккуратно прорабатывать идеи.\u003c/p\u003e\u003cp\u003e— Есть традиции в команде?\u003cbr /\u003e— Сегодня у каждого свой бейдж, что странно. Обычно меняемся ими. Особого порядка нет, как попадется.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/0f/8d/0f8dcd86fceba89bcd812a00cada7c72ca9acb9e.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003csmall\u003eИван \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ifsmirnov\" title\u003d\"International Grandmaster ifsmirnov\"\u003eifsmirnov\u003c/a\u003e Смирнов, Артем \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Arterm\" title\u003d\"Grandmaster Arterm\"\u003eArterm\u003c/a\u003e Жук, Константин \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/zemen\" title\u003d\"International Grandmaster zemen\"\u003ezemen\u003c/a\u003e Семенов\u003c/small\u003e \u003c/center\u003e\u003cp\u003eРезультаты пробного тура доступны \u003ca href\u003d\"http://neerc.ifmo.ru/information/standings.html\"\u003eздесь\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eСтранно, что команда Eurasian National University named L.N. Gumilev 3 сдала задачи на 18, 30 и 38 секундах. Кажется, в одном из мест проведения полуфинала условия задач можно было прочитать заранее. Скрестим пальцы, чтобы завтра такого не случилось.\u003c/p\u003e\u003cp\u003eПосле завершения контеста зашла в столовую ИТМО пообедать. Особенно понравился мне клубничный компот! :) Пообщалась с одним из волонтеров. Михаил волонтерил в пресс-службе:\u003c/p\u003e\u003cp\u003e— Первый раз на полуфинале?\u003cbr /\u003e— Да, и очень жалею, что не удалось в прошлом году. В этот раз появилась возможность, и я сказал себе: «Почему бы и нет!». Занимался ведением группы Вконтакте. Помимо того, что пишу, помогаю с другими вопросами организации, если есть необходимость.\u003c/p\u003e\u003cp\u003e— Можешь оценить сколько ребят в прессе?\u003cbr /\u003e— Человек 7, если не ошибаюсь — три фотографа и те, кто пишут. Есть глава пресс-службы — у нее хранятся в голове задачи для каждого из нас.\u003c/p\u003e\u003cp\u003e— Будешь волонтером в следующем году?\u003cbr /\u003e— Если моя работа понравится, то конечно да. Сам участвовал в олимпиадах немного. Сейчас могу заниматься тем, что мне нравится и пропагандировать олимпиадное движение тем самым. Здорово осознавать себя частью такого мероприятия.\u003c/p\u003e\u003cp\u003eХотела сегодня познакомиться с Андреем Станкевичем — искала весь день и не нашла. Ходят слухи, что он заболел. Желаю скорейшего выздоровления! С настоящим Андреем сфоткаться не удалось, зато вышло с картонным :)\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/02/e8/02e89abae70ec0490e98a0659ba6d074efbd4e78.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eУдачи всем завтра. Верьте в свои силы и выжмите по максимуму! \u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news","neerc"]}}