{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1431362984,"rating":150,"authorHandle":"ComradePetr","modificationTimeSeconds":1431626114,"id":17837,"title":"\u003cp\u003eАкадемический университет: бакалавриат\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp style\u003d\"text-align: justify;\"\u003e Я учусь на первом курсе бакалавриата по направлению информатики Санкт-Петербургского \u003ca href\u003d\"http://spbau.ru/\"\u003e\u003cb\u003eАкадемического университета\u003c/b\u003e\u003c/a\u003e Российской академии наук (СПбАУ). Здесь действительно \u003ci\u003eинтересно\u003c/i\u003e и \u003ci\u003eувлекательно\u003c/i\u003e учиться. Я попробую рассказать об обучении в АУ и о том, почему мне нравится здесь. \u003c/p\u003e \u003ch3\u003eЧто можно почитать?\u003c/h3\u003e \u003cp style\u003d\"text-align: justify;\"\u003eКраткую историю университета можно \u003ca href\u003d\"https://ru.wikipedia.org/wiki/%D0%A1%D0%B0%D0%BD%D0%BA%D1%82-%D0%9F%D0%B5%D1%82%D0%B5%D1%80%D0%B1%D1%83%D1%80%D0%B3%D1%81%D0%BA%D0%B8%D0%B9_%D0%B0%D0%BA%D0%B0%D0%B4%D0%B5%D0%BC%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9_%D1%83%D0%BD%D0%B8%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D1%82%D0%B5%D1%82_%E2%80%94_%D0%BD%D0%B0%D1%83%D1%87%D0%BD%D0%BE-%D0%BE%D0%B1%D1%80%D0%B0%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D1%8B%D0%B9_%D1%86%D0%B5%D0%BD%D1%82%D1%80_%D0%BD%D0%B0%D0%BD%D0%BE%D1%82%D0%B5%D1%85%D0%BD%D0%BE%D0%BB%D0%BE%D0%B3%D0%B8%D0%B9_%D0%A0%D0%90%D0%9D\"\u003eпрочитать\u003c/a\u003e на Википедии. Чуть дополню: где-то в 2008 году появляется магистратура по информатике, в 2014 году проводится первый набор на бакалавриат по двум направлениям: информатика и физика. Набрали 25 информатиков и 24 физика, в 2015 году планируется набрать по 30 человек на каждое из направлений.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eРома Колганов учится на втором курсе магистратуры АУ, в прошлом году он написал пост для абитуриентов. Несмотря на то, что о бакалавриате тогда было известно совсем не всё (ведь его тогда вообще ещё не было), он смог очень неплохо передать атмосферу и перенести его знания о магистратуре на обучение в бакалавриате. Не соглашусь с ним в том, что «буков вышло чертовски много»: заметка получилась очень хорошей по соотношению информационного наполнения к её длине — никакой «воды». Пост состоит из двух частей: \u003ca href\u003d\"https://vk.com/wall7892706_1176\"\u003eпервой\u003c/a\u003e и \u003ca href\u003d\"https://vk.com/wall7892706_1188\"\u003eвторой\u003c/a\u003e.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eМой пост имеет смысл читать после прочтения Роминого: я постараюсь не дублировать то, что написано там, а уточнить некоторые детали о бакалавриате и рассказать о собственных впечатлениях после года обучения.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eЕщё можно прочитать прошлогодний \u003ca href\u003d\"https://vk.com/wall5333_2186\"\u003eотзыв\u003c/a\u003e Серёжи Копелиовича (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Burunduk1\" title\u003d\"Гроссмейстер Burunduk1\"\u003eBurunduk1\u003c/a\u003e); сейчас Серёжа не учится в магистратуре, зато преподаёт у нас (первого курса бакалавров-информатиков АУ) курс алгоритмов.\u003c/p\u003e \u003ch3\u003eЧему учат?\u003c/h3\u003e \u003cp style\u003d\"text-align: justify;\"\u003eПервые два года бакалавры учатся по общей программе, затем идёт разделение на три направления: \u003cb\u003eComputer Science (CS)\u003c/b\u003e, \u003cb\u003eSoftware Engineering (SE)\u003c/b\u003e, \u003cb\u003eAlgorithmic Bioinformatics (BI)\u003c/b\u003e. На \u003ca href\u003d\"http://mit.spbau.ru/\"\u003eсайте\u003c/a\u003e кафедры математических и информационных технологий можно найти общее описание направлений и программы обучения бакалавров.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eРасскажу про то, как проходил у нас первый семестр. У нового набора могут отличаться преподаватели; более того, планы здесь нестатичны, так что могут частично отличаться даже некоторые предметы.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003e\u003ca href\u003d\"https://vk.com/doc4647642_390015405\"\u003eРасписание\u003c/a\u003e занятий в нашем первом семестре. Главная мысль: на всех предметах (и на лекциях, и на практиках) интересно; нет унылых пар, на которые непонятно, зачем ходить.\u003c/p\u003e \u003cul\u003e \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003e\u003cb\u003eОсновы дискретной математики и математической логики\u003c/b\u003e (\u003ca href\u003d\"http://mit.spbau.ru/lecturers/ицыксон-дмитрий-михайлович\"\u003eИцыксон Д. М.\u003c/a\u003e): содержательные \u003ca href\u003d\"https://vk.com/doc4647642_390029447\"\u003eлекции\u003c/a\u003e (хотя это всего лишь вводный курс), хорошие задачи на практиках. Практики проходят в формате, напоминающем маткружок: студенты рассказывают у доски решения задач, над которыми они думали дома.\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003e\u003c/p\u003e\u003cp style\u003d\"text-align: justify;\"\u003e\u003cb\u003eПродвинутые алгоритмы\u003c/b\u003e (Копелиович С. В.): крутой \u003ca href\u003d\"https://vk.com/doc4647642_390028831\"\u003eкурс\u003c/a\u003e Серёжи Копелиовича — это очень насыщенные лекции, практики с теоретическими задачами, домашние задания с теоретическими (решения оформляют письменно, например, в TeX) и практическими (сдают в контест) задачами.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003e\u003cb\u003eБазовые алгоритмы\u003c/b\u003e (\u003ca href\u003d\"http://mit.spbau.ru/lecturers/куликов-александр-сергеевич\"\u003eКуликов А. С.\u003c/a\u003e): общий с физиками несложный курс лекций; планируется, что у нового набора в курсе алгоритмов не будет ни общих пар с физиками, ни такого разделения материала.\u003c/p\u003e  \u003cp\u003eУже есть \u003ca href\u003d\"http://acm.math.spbu.ru/~sk1/mm/au-lections/plan16.pdf\"\u003eпрограмма\u003c/a\u003e курса алгоритмов на два семестра  для нового набора.\u003c/p\u003e \u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003e\u003cb\u003eАлгебру\u003c/b\u003e (\u003ca href\u003d\"http://www.pdmi.ras.ru/pdmi/staff/максим-александрович-всемирнов\"\u003eВсемирнов М. А.\u003c/a\u003e) и \u003cb\u003eматематический анализ\u003c/b\u003e (\u003ca href\u003d\"http://www.math.spbu.ru/user/aih/\"\u003eХрабров А. И.\u003c/a\u003e) ведут преподаватели СПбГУ. Материал — уровня как минимум не ниже матобеса матмеха. Вообще, эти предметы не являются какими-то «вспомогательными», им уделяется большое внимание; для студентов, не занимавшихся серьёзно раньше математикой, эти предметы являются особенно непростыми. Лекции по алгебре и матану читаются на весь поток: и информатикам, и физикам.\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003e\u003cb\u003eПарадигмы и языки программирования\u003c/b\u003e (\u003ca href\u003d\"http://mit.spbau.ru/~krinkin\"\u003eКринкин К. В.\u003c/a\u003e): вводный курс с забавными заданиями, в котором поизучали Python и ООП, попробовали Haskell, многопоточность, СУБД.\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003e\u003cb\u003eUNIX\u003c/b\u003e (\u003ca href\u003d\"http://mit.spbau.ru/lecturers/кузнецов-антон-михайлович\"\u003eКузнецов А. М.\u003c/a\u003e): вводный курс в Linux и всякие полезные штуки (вроде регулярных выражений).\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003e\u003cb\u003eФизика\u003c/b\u003e (Шендерович И. Е.): изначально были объединённые лекции с физиками (читал лектор из Политеха) две пары в неделю; в конце сентября информатиков отделили, оставили одну пару физики в неделю и поставили другого преподавателя; потом и вовсе было принято решение о сокращении пар физики у информатиков до одного года (двух семестров). Изменения останутся в силе и для нового набора. С новым лектором пары стали гораздо динамичнее, но насколько хорошим является такое сильное сокращение часов физики — непонятно.\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003e\u003cb\u003eИстория\u003c/b\u003e, на мой взгляд, не получилась какой-то сверхинтересной (хотя и унылой её назвать нельзя). Идёт один семестр.\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003e\u003cb\u003eФизкультура\u003c/b\u003e: есть секции футбола, волейбола, бассейн, тренажёрный зал. Зачёт ставится по 80% посещений исходя из двух занятий в неделю; в первом семестре физкультуры были нулевыми парами и расчёт был из одного занятия в неделю — но к 8–8:30 приходить в универ может быть неприятно, поэтому сейчас физкультура стоит в расписании как обычная пара. Зачесть могут какую-то стороннюю спортивную секцию, и, кажется, даже оплатить половину стоимости её посещения.\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eЕсть ещё \u003cb\u003eC++\u003c/b\u003e (\u003ca href\u003d\"https://www.lektorium.tv/speaker/2936\"\u003eЛинский Е. М.\u003c/a\u003e) и \u003cb\u003eанглийский язык\u003c/b\u003e — из названий вполне понятно, о чём это.\u003c/p\u003e\u003c/li\u003e  \u003c/ul\u003e \u003cp style\u003d\"text-align: justify;\"\u003eПервый семестр закончился сессией, в которую было шесть экзаменов: по дискретной математике, два по алгоритмам (по базовой и продвинутым частям), по матану, алгебре и C++.\u003c/p\u003e \u003ch5\u003eКачество\u003c/h5\u003e \u003cp style\u003d\"text-align: justify;\"\u003eКонечно, бывают какие-то претензии к конкретным предметам, самые серьёзные из которых — плохая согласованность лекций и практик, затянутые лекции — и какие-то более мелкие. Всё это заметно (лично для меня) ещё и потому, что есть желание (как со стороны администрации, так и с моей), чтобы всё было максимально круто. Думаю, бо́льшая часть претензий в большинстве универов были бы восприняты как придирки, которые были бы никому не интересны.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eНесколько раз за семестр рассылается анонимная анкета, в которой можно оценить качество преподавания каждого из предметов, написать свои претензии или предложения. Что-то исправляется, переделывается, что-то — (пока?) нет.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eВ общем, для меня сейчас на данный момент нет предметов, про которые можно сказать, что они преподаются «плохо» или даже «удовлетворительно».\u003c/p\u003e \u003ch5\u003eОсобенности\u003c/h5\u003e \u003cp style\u003d\"text-align: justify;\"\u003eНа лекциях задают вопросы, что нехарактерно для больших университетов (так как у нас меньше студентов). Тут палка о двух концах: с одной стороны, это может помочь понять материал, с другой — может тормозить лекцию.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eНа большинстве пар отмечают посещаемость. Если много пропускать, со студентом могут захотеть поговорить по этому поводу (а могут и не говорить, зависит от запущенности случая, в том числе и успеваемости) — но у нас в целом принято ходить на все пары: конечно, бывают какие-то пропуски, но людей, которые систематически не ходят на какие-то пары, практически нет.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eВо втором семестре у нас появилось что-то вроде курсового проекта: преподаватели предлагают темы проектов, надо выбрать одну из них и сделать за семестр (естественно, общаясь с преподавателем). Примеры тем: работа с MindWave, Kinect, сравнения структур данных, сделать некоторое количество ACM-задач, различные проекты от биоинформатиков (грубо говоря, нужно что-то сделать с данными или структурами, имеющими достаточно специфичный вид и большой объём), сделать плагин для Chrome, блокирующий нежелательные новости и т. д.. Альтернативой проекту для любителей CS являлся кружок по теоретической информатике, на котором учёные из этой области (\u003ca href\u003d\"https://ru.wikipedia.org/wiki/Гирш,_Эдуард_Алексеевич\"\u003eГирш Э. А.\u003c/a\u003e, \u003ca href\u003d\"http://logic.pdmi.ras.ru/~dmitrits/\"\u003eИцыксон Д. М.\u003c/a\u003e, \u003ca href\u003d\"http://logic.pdmi.ras.ru/~kulikov/\"\u003eКуликов А. С.\u003c/a\u003e, \u003ca href\u003d\"https://ru.wikipedia.org/wiki/Матиясевич,_Юрий_Владимирович\"\u003eМатиясевич Ю. В.\u003c/a\u003e, \u003ca href\u003d\"https://ru.wikipedia.org/wiki/Шень,_Александр_Ханиевич\"\u003eШень А. Х.\u003c/a\u003e, \u003ca href\u003d\"http://kadm.imkn.urfu.ru/pages.php?id\u003dshur\"\u003eШур А. М.\u003c/a\u003e) рассказывали разные интересные вещи.\u003c/p\u003e \u003ch3\u003eКого учат?\u003c/h3\u003e \u003cp style\u003d\"text-align: justify;\"\u003eНа наш первый курс набрали одного победителя IOI (он же победитель финала ACM ICPC), двух победителей и девять призёров РОИ, призёра Всероса по математике, победителя Всеукраинской олимпиады по информатике; остальные 11 человек поступили по дипломам победителей и призёров олимпиад первого уровня. 17 из 25 набранных человек были в ЛКШ.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eПосле первого семестра от нас ушёл в другой вуз один человек, в течение второго семестра пришло 3 студента из ИТМО.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eПолные правила поступления в этом году лучше прочитать на \u003ca href\u003d\"http://mit.spbau.ru/admission\"\u003eсайте\u003c/a\u003e, но если кратко, для поступающих \u003ci\u003eвне конкурса\u003c/i\u003e они выглядят так:\u003c/p\u003e \u003cul\u003e \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eВ любом случае нужен аттестат. Обращаю внимание, что вы не получите аттестат в школе, если не сдадите обязательные экзамены ЕГЭ.\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eДипломы призёров и победителей Межнара и Всероса по математике и информатике дают поступление, результаты ЕГЭ при этом вообще не нужны.\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eДипломы победителей олимпиад первого уровня по математике и информатике дают поступление при получении на ЕГЭ по соответствующему предмету не менее 80 баллов.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e \u003cp style\u003d\"text-align: justify;\"\u003eВ прошлом году список зачисленных закончился на первых нескольких призёрах олимпиад первого уровня, тогда они тоже имели преимущественное право поступления, из них выбрали тех, у кого выше суммарный за три предмета балл ЕГЭ. В этом году призёры таких олимпиад поступают по общему конкурсу (хотя какие-то дополнительные баллы этот диплом даёт); кроме того, мест больше — сейчас набирают 30 человек.\u003c/p\u003e \u003ch3\u003eНагрузка\u003c/h3\u003e \u003cp style\u003d\"text-align: justify;\"\u003eНа мой взгляд, рассказы про невероятную нагрузку несколько преувеличены.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eУчимся 5 дней в неделю. Не более четырёх пар в день с приличными перерывами между парами (пары начинаются каждые два часа — 10:00, 12:00, … — а идут полтора или чуть больше) не создают перенапряжения; к тому же, как было сказано выше, пары в целом интересные, день получается хорошо наполненным.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eДомашние задания: их задают, никакого чрезмерного объёма нет. Бывают какие-то редкие большие задания, но их всего несколько за семестр. Это не значит, что нагрузки совсем нет, просто она в более или менее нормальном количестве.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eУ нас есть люди, которые не занимались олимпиадным программированием или математикой — им тяжелее, особенно поначалу, но это потихоньку сглаживается. Нет никаких зверств вида «не сдал — вылетел». Если заниматься, разбираться, то проблем быть не должно.\u003c/p\u003e \u003ch3\u003eСтипендия\u003c/h3\u003e \u003cul\u003e \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eСтипендия от университета — до 5 тысяч рублей в месяц.\u003c/p\u003e\u003c/li\u003e \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eСтипендия от спонсоров — до 8 тысяч рублей (в первом семестре была до 5).\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp style\u003d\"text-align: justify;\"\u003eЭти две стипендии зависят от результатов обучения студента. Планировалось, что они будут как-то зависеть даже от текущих результатов в течение семестра (рейтинга), однако на текущий момент они пересчитываются только по результатам сессии. Стипендию получают только студенты, сдавшие (учитывая пересдачи) сессию без троек. Какую именно стипендию получает студент, зависит от количества четвёрок; кроме того, например, пересданная тройка на пятёрку ценится ниже, чем пятёрка с первой попытки. Сдача зимней сессии на все пятёрки с первой попытки давала стипендию в 13 тысяч рублей.\u003c/p\u003e \u003cul\u003e \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003e\u003ca href\u003d\"http://knvsh.gov.spb.ru/contests/view/104/\"\u003eСтипендия\u003c/a\u003e от правительства Санкт-Петербурга — 5 тысяч рублей в месяц в течение года, возможно продление на второй курс при хороших результатах. Эта стипендия считалась стипендией для призёров Всероса, однако АУ подал заявки на всех студентов, и бо́льшая их часть получает эту стипендию (даже те, у кого только дипломы олимпиад I уровня).\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eСоциальная стипендия для иногородних — 3 тысячи рублей в месяц.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e \u003ch3\u003eACM\u003c/h3\u003e \u003cp style\u003d\"text-align: justify;\"\u003eACM-движением занимается Серёжа Копелиович. Тренировка проводится раз в неделю (обычно по субботам), два раза никто особенно не хочет — всё-таки получается уже перенагрузка. АУ — небольшой университет, а это значит, что нет большой конкуренции за выход в полуфинал/финал. Поездки оплачивают: команды АУ в этом году ездили на сборы в Петрозаводске и в Урозеро (это под Петрозаводском), магистры ездили на чемпионат Урала и в Таганрог, летом мы поедем на финал Challenge 24 (Будапешт), а команда магистров — на финал ACM ICPC. Тем не менее нельзя сказать, что денег совсем неограниченное количество: например, в Петрозаводске команды ИТМО и СПбГУ жили в гостинице, а наши — в общаге.\u003c/p\u003e \u003ch3\u003eРасположение, общежитие, медицина\u003c/h3\u003e\u003cp style\u003d\"text-align: justify;\"\u003e\u003ca href\u003d\"https://old.maps.yandex.ru/?um\u003d7XvQUQdduOGDKH4YMKa5vnmAHTLIYnef\u0026amp;l\u003dmap\"\u003eКарта\u003c/a\u003e, на которой изображены все важные объекты. Пешком: от метро до АУ 10 минут, от общаги до АУ 15 минут, от общаги до метро 15 минут (две остановки на транспорте). \u003c/p\u003e\u003cp style\u003d\"text-align: justify;\"\u003eУсловия в общаге хорошие: только после ремонта, достаточно просторные комнаты, все нынешние первокурсники живут по 1-2 человека (кажется, есть комнаты на 3-4). Туалет с душем в комнате, на этаже есть кухня (там холодильник, плита), стиральные машины и сушилки. Есть место, где можно оставить велосипед. Из минусов: нет интернета (но его всё обещают провести; в самом универе интернет есть) и слишком хорошая слышимость.\u003c/p\u003e \u003cp style\u003d\"text-align: justify;\"\u003eУ студентов есть возможность прикрепиться к поликлинике и больнице РАН (тем, кто из Питера, для этого необходимо открепиться от районной поликлиники). Поликлиника, вроде, хорошая (в больнице не был), есть две особенности: нет возможности вызвать врача на дом; почти все врачи по записи (кроме срочных случаев) на неделю-две вперёд. От общаги до поликлиники 10 минут пешком (одна остановка). Кроме того, всех прикрепляют к студенческой поликлинике (№76), в неё тоже можно обращаться.\u003c/p\u003e \u003ch3\u003eАдминистрация и бюрократия\u003c/h3\u003e \u003cp style\u003d\"text-align: justify;\"\u003eНад нами, кроме преподавателей, есть всего три человека:\u003c/p\u003e \u003cul\u003e \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eкуратор (это один из преподавателей — у нас Кузнецов А. М.), к нему можно обращаться по всяким вопросам, он сообщает нам информацию;\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eзам. директора по учебной работе и зав. кафедрой \u003ca href\u003d\"http://www.spbau.ru/main/person\u0026amp;personId\u003d21\"\u003eОмельченко А. В.\u003c/a\u003e, сообщает информацию более глобальную, типа планов на следующий семестр;\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eсотрудница учебного отдела Петрова А. Л., занимающаяся вопросами бакалавриата. В учебном отделе решаются вопросы всяких документов, бумажек, приписки к поликлинике и прочее. Вообще, бюрократия минимальна — видимо, её берёт на себя учебный отдел.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e \u003ch3\u003eПодводные камни\u003c/h3\u003e \u003cul\u003e \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eЕсли для вас учёба является второстепенной вещью, наверное, вам здесь может не понравиться. В том числе, если для вас гораздо приоритетнее ACM.\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eЗдесь нет студенческих организаций и, соответственно, нет движухи, которую они могут создавать. Организовывать свой досуг надо самим (мы, например, какое-то время собирались в общаге и играли в настолки).  \u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eЕсть ощущение, что обучение сильно зависит от того, кто наберётся на поток: от уровня людей, от рабочего настроя.\u003c/p\u003e\u003c/li\u003e  \u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eДинамичность: вас могут раздражать изменения в планах на следующие семестры, а иногда и прямо по ходу (вроде нашей физики).  \u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp style\u003d\"text-align: justify;\"\u003eЛекции по разным предметам могут читаться с очень разной скоростью. Вас могут раздражать либо слишком объёмные лекции, либо, наоборот, медленные, которые могут к тому же растягиваться за счёт задаваемых студентами вопросов.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e \u003ch3\u003eИтого\u003c/h3\u003e \u003cp style\u003d\"text-align: justify;\"\u003eЗдесь может быть интересно широкому кругу интересующихся программированием и/или математикой сильных в этих областях людей: можно пойти и в сторону промышленного программирования, и в сторону теоретической информатики, и заняться биоинформатикой. И что бы вы ни выбрали, у вас будет хорошая как математическая, так и программистская база.\u003c/p\u003e\u003c/div\u003e","tags":["ау","выбор вуза","вуз","бакалавриат"]}}