{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1503400955,"rating":39,"authorHandle":"misis","modificationTimeSeconds":1503400955,"id":53995,"title":"\u003cp\u003eКоды и замки, или летние сборы МИСиС по спортивному программированию\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет! С вами снова команда тренеров НИТУ “МИСиС” :)\u003c/p\u003e\u003cp\u003eC 29 июля по 13 августа прошли очередные летние сборы команд НИТУ “МИСиС” по спортивному программированию. Уже в третий раз сборы проводились совместно с ГрГУ им. Янки Купалы в прекрасном городе Гродно (Беларусь). \u003c/p\u003e\u003cp\u003eКак рассказывалось в одном из предыдущих постов, МИСиС каждый год организует закрытые сборы для своих студентов, программа которых специально составляется в зависимости от уровня подготовки участников .В этом годы в рамках сборов НИТУ “МИСиС” проводились занятия лишь для команд младшего дивизиона. Всего в сборах приняло участие 13 студентов МИСиС и ГрГУ им. Янки Купалы. Каждый день наши студенты слушали лекции на темы, которые им обязательно понадобятся на соревнованиях, например, динамика, теория графов и дерево отрезков. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/d8/5a/d85ab4449a5a81573c5c2d633c1036af8602e5d6.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e После каждой лекции студентам давался набор задач на прочитанную тему и 3 часа времени, чтобы эти задачи решить. По окончанию контеста проводился разбор задач, на котором рассказывались правильные решения, а также обсуждались типовые ошибки.\u003c/p\u003e\u003cp\u003eОднако в Гродно наши студенты не только учились, ведь за две недели сборов у них было два выходных. На первый выходной была организована экскурсия по замкам Белоруссии, которая заняла весь день. В ходе поездки мы посетили Мирский и Несвижский замки, которые являются туристическими жемчужинами Беларуси. Также, на обратном пути, наш автобус останавливался около развалин Новогрудского замка. К сожалению, в наши дни от него сохранились лишь части башен, а ведь когда-то здесь была столица княжества Литовского. В итоге, день получился очень насыщенным, и наши студенты вернулись довольные, но очень уставшие. \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/f6/f2/f6f20d9f1a3b1f756437fb30faadb99c8143cef8.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eВторой выходной проходил на природе и по-настоящему состоял лишь из отдыха. Наша группа выехала в Поречье (Гродненская область), где были организованы шашлыки, а также находится прекрасное озеро, где можно не только купаться, но и встретить диких уток и лебедей.\u003c/p\u003e\u003cp\u003eСтоит отметить, что даже в выходные и после занятий наши студенты не только отдыхали, но и старательно дорешивали задачи, которые не смогли или не успели решить на контестах. Можно с уверенностью сказать, что сборы Гродно 2017 прошли успешно, и мы с удовольствием еще не раз поедем в этот замечательный и дружелюбный город.\u003c/p\u003e\u003c/div\u003e","tags":[]}}