{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1502093300,"rating":41,"authorHandle":"MikhailRubinchik.ru","modificationTimeSeconds":1502119144,"id":53729,"title":"\u003cp\u003eМодные лозунги в IT\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет! \u003c/p\u003e\u003cp\u003eЕсть некоторое количество \u0026quot;продающих лозунгов\u0026quot; для IT-специальностей универов и IT-компаний. \u003c/p\u003e\u003cp\u003eНаиболее яркий пример такого использования я видел на Московском Фестивале Спортивного Программирования. Там был замечательный рекламный плакат компании Никс. Он тут девушками немного закрыт:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/9e/72/9e729125df88f009517420b40082adc05f52fc42.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eНо в целом суть понятна: Big Data, Data Mining и пара языков.\u003c/p\u003e\u003cp\u003eСам плакат целиком сходу не нагуглил, но по частям его можно собрать из этого поста (мысленно совмещая части и убирая девушек) \u003ca href\u003d\"http://www.nix.ru/computer_hardware_news/hardware_news_viewer.html?id\u003d192425\"\u003ehttp://www.nix.ru/computer_hardware_news/hardware_news_viewer.html?id\u003d192425\u003c/a\u003e\u003c/p\u003e\u003cp\u003eА ещё за эту весну было несколько постов, написанных с целью привлечения абитуриентов. Как минимум два из них набрали не меньше 100 лайков, так что думаю, что их заметил не только я :) \u003c/p\u003e\u003cp\u003eВот пара скринов из подобных постов: \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/7f/8d/7f8daf56c51070559e9ed84af34b8c0cd3d64809.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/8e/1f/8e1ffb25b439676d9c26329925a5f915aff06a65.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eВсе эти слова часто выглядят как магические заклинания, на которые бездумно бегут абитуриенты и будущие сотрудники :) А правда ли бегут? Или может бегут, но обдуманно? \u003c/p\u003e\u003cp\u003eЧтоб попробовать ответить на эти вопросы, я решил для начала получить список из всех слов подобного типа. Поэтому обращаюсь к вам за помощью: пишите, пожалуйста, в комментарии все подобные слова, которые не учтены в моём посте.\u003c/p\u003e\u003cp\u003eА именно нужны ответы на вопросы:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eКакие подобные заклинания вам приходилось слышать?\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПо каким коротким словосочетаниям вы сами искали/планируете искать универ/работу? \u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПо каким заклинаниям на универ/компанию клюют или клевали ваши знакомые?\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eИз постов выше можно увидеть следующие: биоинформатика, машинное обучение, нейронные сети, системы искусственного интеллекта, анализ данных, эволюционные алгоритмы, большие данные, data mining (не умею это переводить, или это и есть анализ данных? Русскоязычная статья википедии не переводит этот термин в заголовке \u003ca href\u003d\"ru.wikipedia.org/wiki/Data_mining\"\u003ehttp://ru.wikipedia.org/wiki/Data_mining\u003c/a\u003e ). \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD из комментариев:\u003c/strong\u003e Deep Learning\u003c/p\u003e\u003cp\u003eБуду очень признателен, если вы найдёте время и добавите пару заклинаний в комментариях :) Заранее спасибо!\u003c/p\u003e\u003cp\u003eP.S. Обещаю, если будет достаточно новых заклинаний, сделать после отдельный пост о том, где, кто и как их использует и на сколько это просто заклинания или просто адекватное описание реальности :)\u003c/p\u003e\u003c/div\u003e","tags":[]}}