{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1480293947,"rating":40,"authorHandle":"rocker3011","modificationTimeSeconds":1480299368,"id":48665,"title":"\u003cp\u003eProblem with skipped submissions \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eWell hello there, i just want to start with that i am really sad about this situation and want to let you know guys about it, so i don\u0027t usually compete in Codeforces since i like ACM format better , however since i want to be a better coder as an individual i decided to push myself into Codeforce\u0027s contests in a schedule basis, so i would compete in every contest i could while solving problems in the platform to see how much i can push myself to accomplish my goal which right now is be a way better coder than i am right now. \u003c/p\u003e\u003cp\u003eMy situation is as follows, in \u003ca href\u003d\"/contest/740\" title\u003d\"Codeforces Round 381 (Div. 2)\"\u003eCodeforces Round #381 (Div. 2)\u003c/a\u003e i did a good perfomance solving problem A (which gave me RTE in post tests) and B, i couldn\u0027t find a way to solve problem C, however i found out problem D was exactly a problem i already solved, so i decided to just copy and paste my code (since it didn\u0027t even had any twists) obviously this solution was AC. I was pumped since i could see my graph go a little bit up, after a while i got \u0026quot;skipped\u0026quot; in the contest. So obviously i was being targeted as a cheater, guilty before proven innocent i guess. Well after that and multiple talks with \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e he told me that me and multiple other users were going to get those stats reversed if we did nothing wrong, well for me nothing happened, i guessed maybe copying and pasting a code that is mine is against the rules.\u003c/p\u003e\u003cp\u003eHere is the comment i posted on that contest forum: \u003ca href\u003d\"//codeforces.com/blog/entry/48547?#comment-326625\"\u003ehttp://codeforces.com/blog/entry/48547?#comment-326625\u003c/a\u003e\u003c/p\u003e\u003cp\u003eLong story short i didn\u0027t get my stats reversed, and this shady user named \u003ca class\u003d\"rated-user user-gray\" href\u003d\"/profile/_underr\" title\u003d\"Newbie _underr\"\u003e_underr\u003c/a\u003e had indeed messed with a lot of people. I decided to just keep going with my life and prepare to the new contest. \u003c/p\u003e\u003cp\u003eSo new contest arrived: \u003ca href\u003d\"/contest/735\" title\u003d\"Codeforces Round 382 (Div. 2)\"\u003eCodeforces Round #382 (Div. 2)\u003c/a\u003e , i solved only two problems A and B, since C and D were kinda mathy and i was more than happy to see simple problems crush me so i can be better, i decided to give them a try in upsolving. But guess what? my entire participation in this contest was once again \u0026quot;Skipped\u0026quot;, i think there is a guy with a multiaccount just copying and pasting people submissions in their room in another account so they can rise up in ranking. This issue is huge and i am having a really bad time with it since i can\u0027t follow up my progress on the page because everytime i am participating i am getting flagged as a cheater.\u003c/p\u003e\u003cp\u003eI just did this to say to the people that is having this issue that is not only happening to them, and let the community know what is happening, i have never cheated on a contest in my life and i usually look up for the outline instead of the code if i can\u0027t solve the problem, i really want to get better and of course that goal would be impossible if i cheat.\u003c/p\u003e\u003cp\u003eThanks for reading and i hope this time this situation is addressed as it should be, best regards.\u003c/p\u003e\u003cp\u003eEdit: I believe i found out the problem, since i was coding in ideone probably there is someone just sitting there waiting for codes to pop up and copy/paste them, can you recommend me a simple IDE for problem solving on windows? i tried geany once and didn\u0027t work well but maybe i was a bit lazy with it, i don\u0027t want this to keep happening.\u003c/p\u003e\u003c/div\u003e","tags":["contests","codeforces","problem","community"]}}