{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1522833836,"rating":0,"authorHandle":"legendjohn9999","modificationTimeSeconds":1522833836,"id":58718,"title":"\u003cp\u003eИнтересная задача из e-olymp, нужно помощь.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"https://www.e-olymp.com/ru/contests/7949/problems/66445\"\u003eЛинк\u003c/a\u003e\u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eЗадача\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eВы главный разработчик в компании грузоперевозок Нурлаш и КО inc. Компании требуется, чтобы вы написали новый функционал для сортирующего робота. Робот контролирует n отсеков, последовательно пронумерованных от 1 до n, и может выполнять два типа операций:\u003c/p\u003e\u003cp\u003eДобавить контейнер с номером C в каждый отсек с L-го по R-ый\u003c/p\u003e\u003cp\u003eУбрать последний контейнер из каждого отсека с L-го по R-ый\u003c/p\u003e\u003cp\u003eНомер контейнера — целое положительное число не превышающее 10^9. Вам даны операции в том порядке в котором их выполнял робот. Требуется определить, для каждого отсека, контейнер с каким номером является последним в нем после выполнения всех операций.\u003c/p\u003e\u003cp\u003eВходные данные Первая строка содержит два числа — n, m (1 ≤ n, m ≤ 10^5), количество отсеков и количество операций соответственно. Далее в m строках содержится по три числа L, R и C (1 ≤ L ≤ R ≤ 10^5, 0 ≤ C ≤ 10^9), описание операций. Если C \u003d 0, то это операция второго типа, иначе — первого.\u003c/p\u003e\u003cp\u003eВсе числа целые и в строках разделены ровно одним пробелом. Также гарантируется, что не будет операций допускающих удаление из пустых отсеков.\u003c/p\u003e\u003cp\u003eВыходные данные Выведите в единственной строке n чисел, разделенных пробелом. Первое число — номер последнего контейнера в первом отсеке, второе — во втором, и т.д. Если отсек пуст, выведите 0.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eSample tests\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003einput: 5 3 1 5 1 2 4 0 4 5 10\u003c/p\u003e\u003cp\u003eoutput: 1 0 0 10 10\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e","tags":[]}}