{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1517076173,"rating":138,"authorHandle":"Laggy","modificationTimeSeconds":1519816754,"id":57376,"title":"\u003cp\u003eCodeforces Virtual Contests Picker — Lets You Pick Contests That (You and Friends) Never Attempted\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHad you ever thought about doing some contests virtually with your teammates or friends? If you had then, you know how hard it could be to find a contest that none of you had attempted. Well, not anymore. \u003c/p\u003e\u003cp\u003eThe Virtual Contests Picker gives you a list of 6 random contests (if available) that a group of handles had \u003cstrong\u003enever\u003c/strong\u003e attempted. \u003c/p\u003e\u003cp\u003eThis is part of the algo-chan project (\u003ca href\u003d\"//codeforces.com/blog/entry/52778\"\u003eKnow more about it from this post\u003c/a\u003e) \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHow does it work:\u003c/strong\u003e You need to type in the chat \u003ccode\u003e!cf vc div1/2 0 \u0026quot;handle1 handle2 handle3...\u0026quot;\u003c/code\u003e.\u003c/p\u003e\u003cp\u003eBecause every group has certain needs you can limit the contests to div1 or div2 and you can choose the minimum number of problems that should be included in the contests. \u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003eSo the general syntax is:\u003c/strong\u003e\u003cbr /\u003e \u003ccode\u003e!cf vc div min_count \u0026quot;list of space separated handles\u0026quot;\u003c/code\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHow to use:\u003c/strong\u003e\u003cbr /\u003e\u003cbr /\u003e\u003c/p\u003e\u003cul\u003e \u003cli\u003eRefer to the link above.\u003c/li\u003e \u003cli\u003eJoin the server.\u003c/li\u003e \u003cli\u003eUse the command explained in this post.\u003c/li\u003e \u003cli\u003eProfit.\u003c/li\u003e \u003c/ul\u003e \u003cbr /\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/2d/e5/2de5550d77899dee6e8a295ce5990eae4d93b8bb.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e \u003cbr /\u003e Right now it supports all codeforces contests except gym. But rest assured, gym will soon be supported. Hopefully in a few days.\u003cbr /\u003e\u003cbr /\u003e I hope you like this little addition to the server and if you have any suggestions for this or for a new feature just let it out.\u003c/div\u003e","tags":["virtual contests","picker","algo-chan"]}}