{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1401996249,"rating":29,"authorHandle":"oxygen3","modificationTimeSeconds":1401996375,"id":12569,"title":"\u003cp\u003eInterview with Jeff Donahoo — 5 questions to the Executive Director of the World Programming Championship.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/c7/08/c708566f320d314d8fec59dfed1d8780a3313f2d.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e-This year ICPC finalists will come to Russia for the second time. What determined the choice of the organizing committee to hold the final in Ekaterinburg? And what were your most remarkable impressions during your visit to the city?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e-A successful World Finals must be in the right place at the right time. Ekaterinburg is definitely the right place, because it is the home of universities like UrFU. Ural Federal University has been a champion of ICPC students for many years, hosting outstanding regional contests and the Open Ural Championship. The overwhelming support for an ICPC World Finals by the Ekaterinburg community makes 2014 the right year.\u003c/p\u003e\u003cp\u003eEkaterinburg is an amazing city where universities, community, and industry work together to achieve greatness. From our first scouting visit, it was obvious that a spectacular World Finals was supported by all. This spirit of cooperation will leave a lasting impression on all participants.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e-The ICPC is becoming more and more popular in the world. Do organizers plan to change any of the rules? For example, what about the cap for the number of university teams? Isn’t it too little: that is, one team from each university?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e-ICPC seeks to include the most students from the most universities of the world. To provide the maximum opportunity for promotion to the World Finals, the ICPC continues to limit the number of teams from each university.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e-You have organized the championship since 1999. What is the hardest part of your work? And what brings you the greatest satisfaction?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e-The greatest satisfaction comes from working with the world\u0027s best volunteers to provide opportunity for the students of computing to push the limits of what they can accomplish.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e- In one of his interviews, William Poucher said that the greatest final would take place in Ekaterinburg. As acting executive director would you agree with these words? Or is each final interesting and unique in its own way?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e-There are always two challenges at each World Finals. The students compete for bragging rights of being the best of the best of the best. The ICPC Community, which includes the host, faces the challenge of showing the best hospitality of any World Finals to all participants. Given a champion like UrFU, I\u0027m certain that the 2014 World Finals will be the best ever experienced.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e-Is there anything in particular you would like to wish for the participants in 2014?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFor all of the 2014 World Finals participants, I wish to thank you for your hard work volunteering, coaching, supporting, and practicing. For the contestants, I wish you a focus and calm that allows you to perform at the very best of your abilities.\u003c/p\u003e\u003cp\u003ePhoto by Bob Smith\u003c/p\u003e\u003cp\u003eSourse \u003ca href\u003d\"http://www.icpc2014.ru/en/about/news/18\"\u003ehttp://www.icpc2014.ru/en/about/news/18\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}