{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1426693646,"rating":51,"authorHandle":"RussianCodeCup","modificationTimeSeconds":1426694684,"id":17013,"title":"\u003cp\u003eRussian Code Cup 2015\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет! \u003c/p\u003e\u003cp\u003eИдет регистрация на крупнейшую в России открытую ежегодную олимпиаду по спортивному программированию Russian Code Cup 2015. Первый квалификационный тур состоится уже в субботу, 28 марта, в 18-00 и продлится 2 часа.\u003c/p\u003e\u003cp\u003eRussian Code Cup – это возможность для русскоязычных программистов со всего мира проверить свои силы и продемонстрировать мастерство, решая оригинальные задачи различной сложности, а также заявить о себе экспертному IT-сообществу. Олимпиада проходит в три этапа: квалификационные раунды, отборочный тур и финал, на каждом из которых участникам олимпиады предлагается от четырех до восьми разноплановых задач. Задания и техническую часть соревнования обеспечивают специалисты Mail.Ru Group и эксперты Университета ИТМО – соорганизатора Russian Code Cup.\u003c/p\u003e\u003cp\u003eКвалификационные и отборочный раунды пройдут на сайте Russian Code Cup. Первый квалификационный раунд состоится \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?day\u003d28\u0026amp;month\u003d3\u0026amp;year\u003d2015\u0026amp;hour\u003d18\u0026amp;min\u003d0\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003e28 марта в 18:00\u003c/a\u003e, второй – 25 апреля в 12:00, третий – 31 мая в 13:00. Причем программисты, не прошедшие квалификацию с первого или второго раза, могут попробовать свои силы в следующих раундах. В отборочный тур, назначенный на 13:00 14 июня, пройдут 200 лучших участников из каждого квалификационного раунда. А 50 программистов, преодолевших «сито» отбора, померятся силами в финале, который состоится в 19 сентября 2015 года. Форма и время проведения финала будут объявлены после 1 июня. Победитель Russian Code Cup получит главный приз – 300 тысяч рублей; участник, занявший второе место, — 150 тысяч рублей; приз за третье место – 90 тысяч рублей, обладатели 4-10 места получат по 30 тысяч рублей. Кроме того, призы достанутся всем участникам, дошедшим до финала.\u003c/p\u003e\u003cp\u003eДля того чтобы принять участие в Russian Code Cup, нужно зарегистрироваться на сайте \u003ca href\u003d\"http://russiancodecup.ru/\"\u003ehttp://russiancodecup.ru/\u003c/a\u003e (регистрация будет открыта до начала третьего квалификационного раунда).\u003c/p\u003e\u003cp\u003eПодробнее о чемпионате, правилах и призах и читайте на сайте \u003ca href\u003d\"http://russiancodecup.ru\"\u003ehttp://russiancodecup.ru\u003c/a\u003e, по всем вопросам обращайтесь на \u003ca href\u003d\"mailto:russiancodecup@corp.mail.ru\"\u003erussiancodecup@corp.mail.ru\u003c/a\u003e\u003c/p\u003e\u003cp\u003eПриглашаем всех русскоязычных участников сообщества Codeforces принять участие в Russian Code Cup 2015 и хотим со своей стороны поздравить Codeforces с 5-летием! Мы воспользовались возможностью поддержать Codeforces переводом в $1000. Нам приятно внести свой вклад в будущее платформы. Желаем Codeforces новых рекордов и достижений!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"//assets.codeforces.com/images/rcc/RCC.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}