{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1509887190,"rating":116,"authorHandle":"dalex","modificationTimeSeconds":1509887211,"id":55596,"title":"\u003cp\u003eBeauty of problem statements\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eSome weeks ago I read a Quora answer by \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/I_love_Tanya_Romanova\" title\u003d\"Grandmaster I_love_Tanya_Romanova\"\u003eI_love_Tanya_Romanova\u003c/a\u003e (\u003ca href\u003d\"https://www.quora.com/Why-do-a-lot-of-successful-competitive-programmers-not-participate-actively-on-CodeChef-but-participate-often-on-sites-like-TopCoder-and-Codeforces/answer/Bohdan-Pryshchenko\"\u003elink\u003c/a\u003e). The 4th paragraph attracted me, here is it\u0027s short content:\u003c/p\u003e \u003cblockquote\u003e   \u003cblockquote\u003e\u003cp\u003eThere are jokes about these typical problem statements: “Little Rohit got an array as a birthday present”. I’m also not getting why these trashy statements should be writtten instead of formal model of the task. It is awesome to have fictional statement when it makes sense, or when it comes from real life; it is at least funny to have stuff like problems I mentioned above. And I know that some of the platforms I mentioned are requiring problems with fictional statements and say that formal models are bad. Well, OK, “Parents asked little Chandan to perform following operations…”. May I go to some other site and solve normal problems, please? That’s a matter of taste — but for me this kind of statements is something that makes strong negative impression, and I think I’m not the only one.\u003c/p\u003e   \u003c/blockquote\u003e \u003c/blockquote\u003e\u003cp\u003eI also don\u0027t like statements where characters were added just because there were no characters originally. You read such statement and think: \u0026quot;Why do they added this Alice with her birthday present? It has nothing to do with the problem\u0026quot;.\u003c/p\u003e\u003cp\u003eI think there must be some rules that authors should use when they write a problem statement:\u003c/p\u003e \u003col\u003e   \u003cli\u003eIf the problem comes from real life or from some situation that may appear in real life / fiction book / computer game — use the original statement. Those who will solve this problem will be clearly understand what\u0027s going on.\u003c/li\u003e   \u003cli\u003eIf the problem originally had the formal statement (e.g. you have an array and you have to answer some queries, you have an array and you have to find a subarray with maximal xor / and / or, and so on): use formal statement.\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eNever\u003c/strong\u003e introduce a setting if the problem originally had formal statement.\u003c/li\u003e \u003c/ol\u003e\u003c/div\u003e","tags":["statements"]}}