{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1457103244,"rating":1,"authorHandle":"Slamur","modificationTimeSeconds":1457152127,"id":43570,"title":"\u003cp\u003eСовсем небольшой Java-туториал\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eJava (не путать с JavaScript!) — язык программирования высокого уровня.\u003c/p\u003e\u003cp\u003e1) Установка Java\u003c/p\u003e\u003cp\u003eКак вы знаете (или не знаете еще), но компьютер работает с машинными кодами. Самый близкий язык к ним — это ассемблер и некоторые языки напрямую компилируются в него. Но Java слишком понтовая, чтобы компилиться в ассемблер, поэтому она компилируется в специальный байт-код, который исполняется специальной виртуальной машиной jvm (java virtual machine, кэп с вами). Соответственно, просто для запуска Java-программ вам достаточно установить на компьютер jre (java runtime environment) последней версии (сейчас уже 8-ая). Но для разработки вам JRE будет недостаточно и надо поставить себе JDK (Java Development Kit), который включает в себя в том числе JRE. Качается это с сайта оракла по первой ссылке в гугле (cпециально проверил, с первой!). \u003cbr /\u003e\u003c/p\u003e\u003cp\u003e2) Установка среды разработки\u003c/p\u003e\u003cp\u003eСуществуют 3 основные среды разработки для программирования на Java (блокноты всякие-разные не считаются, они просто подсвечивают синтаксис!) (да, их можно настроить на компиляцию и запуск, но это уже выходит за рамки текущего курса).\u003c/p\u003e \u003cul\u003e   \u003cli\u003eNetBeans — оракловая среда, довольно неудобная, лучше не надо пытаться.\u003c/li\u003e   \u003cli\u003eEclipse — среда, разрабатываемая изначально при поддержке Intel, а теперь просто разрабатываемая большим опенсорсным сообществом. К ней существует тонна плагинов (ну типа Firefox в мире браузеров). Для ее установки достаточно скачать с сайта архив, там папка, в которой уже все лежит, процесса установки как такового нет.\u003c/li\u003e   \u003cli\u003eIntellijIdea — среда, разрабатываемая российской компанией JetBrains. Считается мега-пупер-крутой, супер-умная (реально так), но для новичка может быть слишком перегруженной. Также полная версия платная (еще и по подписке).\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eДля начала советую поставить Eclipse, его ставить просто и быстро, разобраться в нем тоже несложно.\u003c/p\u003e\u003cp\u003e3) Первый запуск и настройка среды под олимпиадки\u003c/p\u003e\u003cp\u003eЯ юзаю Eclipse, поэтому буду рассказывать про нее (если вам надо настроить Idea, подойдите лично, разберемся).\u003c/p\u003e\u003cp\u003eПри запуске вам будет предложено выбрать workspace — папку, где будут создаваться и храниться все файлы (можно поставить галочку, чтобы среда не спрашивала каждый раз). \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка с выбором workspace\" src\u003d\"/predownloaded/76/b7/76b7d56d0ee7f2a665f30a5ddbf1c1f18fcd10ee.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eПри первом запуске вам будет показано типа \u0026quot;приветственное окошко\u0026quot;, которое можно просто закрыть, ничего интересного.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка с первозапуском\" src\u003d\"/predownloaded/2e/c1/2ec19eb6af2351b669aaae9113604b21c5df2902.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eВы увидите главное окно среды. Окна Task View и Outline можно смело закрыть.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка с outline\" src\u003d\"/predownloaded/0c/92/0c92096f4443aa876164b0dc22645e9af3f57676.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eВнизу обычно расположена консоль в одной из вкладок внизу, при запуске программы там будет красная квадратная кнопка, означающая \u0026quot;стоп\u0026quot;. Чтобы ее показать, надо выбрать Window — Show View — Console.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка с console\" src\u003d\"/predownloaded/2f/04/2f049bbf9d4bc2aada44bb5b11a908b2565294d8.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e4) Написание простейшей программы.\u003c/p\u003e\u003cp\u003eПозже мы еще донастроим среду, сейчас давайте создадим свою первую программу на Java.\u003c/p\u003e\u003cp\u003eДля начала создадим Java Project (File — New — Java Project). Проект — это место, где лежат файлы исходных кодов, в одном проекте может быть много файлов различных.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка с созданием проекта\" src\u003d\"/predownloaded/32/aa/32aa8dc936f3e4ddb69366bbac50aad5ecddd457.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eПосле его создания проект показывается слева в окошке Package Explorer.\u003c/p\u003e\u003cp\u003eВ проекте создадим новый файл исходного кода (New — Class, нужен именно Java class)\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка с созданием класса\" src\u003d\"/predownloaded/82/0c/820cab22bdd582228ca1f756197182c76e521ec3.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eВот так выглядит среда после создания нашего первого файла с кодом.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка с открытым файлом кода\" src\u003d\"/predownloaded/bb/db/bbdbf711cc8d4ec7f197ff5ce31250849dfcea89.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eДля начала запилим программу, которая решает задачу \u0026quot;1000. A + B\u0026quot; на \u0026lt;acm.timus.ru\u0026gt;: считать два целых числа и вывести их сумму. Для запуска программы надо сверху нажать \u0026quot;Run\u0026quot; (зеленый кружок с треугольником).\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка после запуска приложения\" src\u003d\"/predownloaded/47/de/47de841b9e7cb54742c174b71e35fc2724b83c8a.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eПока вам может показаться, что я написал кучу магии, но скоро вы поймете прекрасно, что и почему тут происходит. Вот ссылка на данный код с небольшими комментариями по коду:\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/G9kuaFmw\"\u003eСсылка на код \u0026quot;A + B\u0026quot;\u003c/a\u003e\u003c/p\u003e\u003cp\u003eМожете отправить данный код на \u003ca href\u003d\"http://acm.timus.ru\"\u003eacm.timus.ru\u003c/a\u003e и проверить, что эта штука реально работает ;)\u003c/p\u003e\u003cp\u003e5) Основные штучки для решения задач на Java\u003c/p\u003e\u003cp\u003eДля изучения основ Java советую пройти быстрый курс по ссылке \u003ca href\u003d\"https://www.codecademy.com/learn/learn-java\"\u003eТыц\u003c/a\u003e (огромное спасибо Анастасии за предоставленную ссылку ^_^).\u003c/p\u003e\u003cp\u003eПосле того, как вы это пройдете, посмотрите, а после изучения попробуйте запустить код по приведенной ниже ссылке:\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/LDx1gm7r\"\u003eКод с нереальным количеством магии (прошу, прочитайте все комментарии, умоляю!)\u003c/a\u003e\u003c/p\u003e\u003cp\u003eНу точнее как — можете пройти самые основы, а потом смотреть параллельно. Я запихал в код все, что только вспомнил, что может пригодиться при решении задач.\u003c/p\u003e\u003cp\u003eP.S. при запуске она выводит много инфы для наглядности, лучше сначала прочитайте код с комментариями.\u003c/p\u003e\u003cp\u003eЕсли будут вопросы или что — сразу пишите, не бойтесь.\u003c/p\u003e\u003cp\u003eP.P.S. Список удобных хоткеев для Eclipse:\u003c/p\u003e \u003col\u003e   \u003cli\u003eCtrl + Space — \u0026quot;умное дополнение\u0026quot;\u003c/li\u003e   \u003cli\u003eCtrl + 1 — при нажатии на ошибке/предупреждении показывает список возможных решений\u003c/li\u003e   \u003cli\u003eAlt + Shift + R — переименовать переменную/метод/класс везде сразу\u003c/li\u003e   \u003cli\u003eAlt + Shift + S — список всяких \u0026quot;быстрых\u0026quot; действий (посмотрите сами, что там есть)\u003c/li\u003e   \u003cli\u003eCtrl + M — развернуть на полный экран/вернуть обратно\u003c/li\u003e   \u003cli\u003eCtrl + F — поиск/замена в файле (для поиска по проекту поищите в менюшках)\u003c/li\u003e   \u003cli\u003eCtrl + N — меню создания нового элемента\u003c/li\u003e   \u003cli\u003eCtrl + F11 — запуск\u003c/li\u003e   \u003cli\u003eF11 — запуск в режиме отладки\u003c/li\u003e \u003c/ol\u003e\u003cp\u003e6) \u0026lt;Бонус\u0026gt; Отладка программы\u003c/p\u003e\u003cp\u003eЧасто случается такое, что ваша программа не работает (или работает не так, как надо) (такое будет случаться почти всегда, ухахаха ^_^). Для поиска ошибки вы можете воспользоваться режимом отладки. В этом режиме вы можете пошагово пройтись по выполняемому коду и посмотреть, что происходит и какие значения в разных местах принимают ваши параметры методов.\u003c/p\u003e\u003cp\u003eЗаранее добавим режим работы \u0026quot;Debug\u0026quot; (в правом верхнем углу надо нажать на кнопочку с \u0026quot;+\u0026quot; и выбрать Debug в списке) — откроется вот такой вид окна:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка с ненастроенным Debug\" src\u003d\"/predownloaded/c1/c7/c1c767405b8e9b01e137126e3bd5def3ff188d69.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eЗакроем вкладку \u0026quot;Outline\u0026quot;, \u0026quot;Breakpoints\u0026quot; и \u0026quot;Servers\u0026quot;, они нам не нужны. \u0026quot;Variables\u0026quot; мы растянем на всю правую сторону, а \u0026quot;Debug\u0026quot; мы сузим до полоски сверху и нажмем на \u0026quot;-\u0026quot; на ней (закрывать нельзя ее ни в коем случае). \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка c настроенным Debug\" src\u003d\"/predownloaded/fc/29/fc29ca8233218dc1c6d4b935af74d8707f46cb03.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eДля начала вам надо поставить как минимум одну точку останова в программе, чтобы отладчик вообще остановился и позволил вам пошагово идти. Это делается двойным кликом слева от строчки, там появится \u0026quot;точка\u0026quot;.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка с поставленной точкой останова\" src\u003d\"/predownloaded/b4/b1/b4b11bf37fc7c1ad1c6d0594a425e785c8a27dc9.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eПосле запуска в режиме Debug (\u0026quot;жучок\u0026quot; рядом с кнопкой Run) программа остановится на первой точке останова (если требуется до этого что-то ввести с клавы — то она сначала потребует ввод, по сути она просто исполняет программу). Справа можно увидеть текущие значения переменных (глобальные переменные надо смотреть в подпункте \u0026quot;this\u0026quot;)\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка с остановкой на точке останова\" src\u003d\"/predownloaded/8f/4a/8f4ae17a4a3485e889d6371c6ff29c557174be1a.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e(Если выведется непонятное окно с инфой Debug — тупо кликните вне его, оно свернется).\u003c/p\u003e\u003cp\u003eНа F6 происходит переход на следующую строку, а по F5 — переход с заходом в функцию (см. скриншоты ниже)\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка перед входом в функцию\" src\u003d\"/predownloaded/90/4d/904d29ef767edb80f5e67864ca5fddcb3f69033a.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eПосле нажатия F5 мы перешли в функцию, а не на следующую строку в том коде:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка после входа в функцию\" src\u003d\"/predownloaded/01/ff/01ffc5000703f490f4701e7f0861731cb352b0ee.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eF7 делает выход из текущей функции, F8 — запускает не пошаговое выполнение до ближайшей точки останова (или до завершения программы)\u003c/p\u003e\u003cp\u003eВсе эти кнопки расположены вверху (они активны только при открытом окне Debug, поэтому его нельзя закрывать):\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"картинка с выделенными кнопками перехода\" src\u003d\"/predownloaded/f1/a8/f1a87edefc7332f8607603bbd69584d6171feab2.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["java","not javascript ;)","tutorial"]}}