{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1427475897,"rating":886,"authorHandle":"viktork","modificationTimeSeconds":1428164971,"id":17154,"title":"\u003cp\u003eZeptoLab Code Rush 2015\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003e\u003cb\u003e\u003ci\u003eThe problems were suggested by users \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/roosephu\" title\u003d\"International master roosephu\"\u003eroosephu\u003c/a\u003e and \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/sunayuki\" title\u003d\"Master sunayuki\"\u003esunayuki\u003c/a\u003e. The great help in preparing was provided by \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Aksenov239\" title\u003d\"Candidate Master Aksenov239\"\u003eAksenov239\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/GlebsHP\" title\u003d\"International Grandmaster GlebsHP\"\u003eGlebsHP\u003c/a\u003e and Codeforces team. ZeptoLab Team did its best while working on statements.\u003c/i\u003e\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003e\u003ci\u003eThe round will use smoother dynamic problem scores with 250 points steps.\u003c/i\u003e\u003c/b\u003e\u003c/p\u003e\u003cp\u003eIn 2014 we hosted our \u003ca href\u003d\"/zeptolab2014\"\u003efirst programming contest\u003c/a\u003e together with Codeforces, and we liked it!\u003c/p\u003e\u003cp\u003eLet me shortly remind you how it was. The contest consisted of 6 problems, 2.5 hours were given to solve (you can have a look at the problems of the previous year and try to solve them \u003ca href\u003d\"/contest/436\"\u003ehere\u003c/a\u003e).\u003c/p\u003e\u003cp\u003eOf course, even on a purely coding event we stayed true to ourselves, so all problems were designed based on our games, and, of course, we illustrated them with care:\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/zepto2015/pics2014.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eZepto Code Rush 2014 broke the existing Codeforces record of round popularity. Also we were glad to read a positive feedback about problems. By the way, the first three places were taken by developers from Russia. Some of them even came to pick up the prizes at the office, where they had a mini-tour and the highlight of the program: of course, the game in a giant Cut The Rope and our standard corporate \u0026quot;going green\u0026quot; welcome kit at the entrance (we call \u0026quot;going green\u0026quot; a welcome kit, full of fun gizmos of our corporate green color). \u003c/p\u003e\u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/zepto2015/photo2014.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003e\u003ca href\u003d\"/profile/WhiteCrow\"\u003eSomebody\u003c/a\u003e got even luckier: they stayed for more than just a tour and they still amaze us with their professional achievements. Here\u0027re some thoughts from one of them, Grisha \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/WhiteCrow\" title\u003d\"Expert WhiteCrow\"\u003eWhiteCrow\u003c/a\u003e Nazarov:\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eI first came for the candies (just kidding), but if I share experiences now — what\u0027s especially important is that I can be myself here to the end. Zeptolabians are tolerant of my oddities and appreciate me as a person. In addition, Zeptolab leaders set goals, taking into account the abilities of each developer, including me. And when the head is also \u0026quot;into\u0026quot; algorithms, I can realease my potential. In the end I became a sort of client-side back-end developer, which, in fact, I wanted in the first place. Yes, I know some of the data structures that are unlikely to come in handy in Zeptolab soon (they would be more useful, for example, in developing a search engine); I almost never use this part of my knowledge in my daily routine. But these skills are useful to me on the internal algorithmic contests :) What I can say about Working moments: my last task was to improve packaging of atlases in preparing of game resources – a well-known NP-hard problem. I managed to make significant progress: to improve the famous algorithms, the best in 2013 in a variety of metrics. As a result, the memory consumption in all our game projects decreased by megabytes. With the appetite of our artists, I think it\u0027s not for long :) Maybe we\u0027ll publish my work in one of the next conferences. Overall, sports programming skills are highly valued here, and this, in my experience, is what isn\u0027t appreciated enough in other companies.\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eAnd this post is made to inform you, dear algorithm lovers, that: \u003cstrong\u003eZepto Code Rush 2015 starts on \u003ca href\u003d\"http://timeanddate.com/worldclock/fixedtime.html?day\u003d4\u0026amp;month\u003d4\u0026amp;year\u003d2015\u0026amp;hour\u003d19\u0026amp;min\u003d30\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003eSaturday, April, 4, 16:30 (UTC)\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eWe are working on problems for the contest and ready, but we are ready to announce cool prizes!\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/zepto2015/prizes-en.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eYou cannot get a vest like that in other ways besides taking part in the contest. The vests are great!\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/zepto2015/jacket.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eAnd as usual, the person who shows good results in the competition, will be able to get a job in our company by a simplified scheme. You can read about ZeptoLab on \u003ca href\u003d\"http://zeptolab.com\"\u003eour official website\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e \u003c/p\u003e\u003ccenter\u003e \u003ca href\u003d\"/zeptolab2015/apply\" style\u003d\"background-color: rgb(91,183,91);font-size: 20.0px;color: white;text-decoration: underline;padding: 6.0px;border-color: rgb(75,167,75);\"\u003eWant to apply to ZeptoLab?\u003c/a\u003e \u003c/center\u003e \u003cbr /\u003e\u003cp\u003eZeptoLab Code Rush 2015 will use \u003ca href\u003d\"/blog/entry/4088\"\u003estandard Codeforces rules\u003c/a\u003e, it will be a rated round for the both divisions.\u003c/p\u003e\u003c/div\u003e","tags":["zeptolab","om nom","zepto code rush 2015"]}}