{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1429050683,"rating":26,"authorHandle":"NYanushkevich","modificationTimeSeconds":1429664273,"id":17405,"title":"\u003cp\u003eХакатон для школьников EduGames at CROC\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем, кто хочет \u003cstrong\u003eразрабатывать свои игры!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e24-26 апреля в офисе КРОК пройдет джем-хакатон для школьников старших классов EduGames at CROC, посвященный обучающим играм.\u003c/p\u003e\u003cp\u003eЧто такое хакатон: это «марафон программистов», где небольшие команды сообща работают над решением какой-либо проблемы. А в нашем случае это не только программисты, но и геймдизайнеры и художники. На хакатоне EduGames участники будут придумывать и разрабатывать такие игры, которые не просто помогут учиться, но добавят в учёбу фана и увлекательности.\u003c/p\u003e\u003cp\u003e\u003cem\u003eОрганизаторы джема:\u003cbr /\u003eКомпания \u003ca href\u003d\"http://croc.ru\"\u003eКРОК\u003c/a\u003e, которая создаёт порядка 2000 серьёзных проектов в год, но знает, что игра — один из лучших способов многому научиться.\u003cbr /\u003e\u003c/em\u003e \u003cem\u003eКоманда \u003ca href\u003d\"https://vk.com/syndicat_team\"\u003e«СИНДИКЭТ»\u003c/a\u003e, которая играет с окружающим пространством, и из этого получаются проекты, такие как Science Slam и Games Night в Самаре.\u003cbr /\u003e Команда \u003ca href\u003d\"https://vk.com/devsgo\"\u003eDevsGo\u003c/a\u003e, которая организовывает мероприятия, где представители игровой индустрии могут общаться друг с другом, обмениваться знаниями и опытом, учиться новому.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eДжем пройдет с 24 по 26 апреля в офисе компании КРОК по адресу ул. Волочаевская, 5к1.\u003c/p\u003e\u003cp\u003eЧто ждет участников:\u003cbr /\u003e Мастер-классы и общение с экcпертами.\u003cbr /\u003e Обмен опытом, новые интересные знакомства, драйв и работа в команде.\u003cbr /\u003e Создание новых собственных проектов.\u003cbr /\u003e Призы и подарки от организаторов и партнеров, в числе которых билеты на конференцию разработчиков \u003ca href\u003d\"http://devgamm.com/moscow2015/\"\u003eDevGAMM\u003c/a\u003e и столик на конференции для демонстрации своей игры!\u003c/p\u003e\u003cp\u003eПодробности и ссылку на регистрацию смотрите здесь \u003ca href\u003d\"http://crocok.ru/for-students/EduGames/\"\u003ehttp://crocok.ru/for-students/EduGames/\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eКоличество участников ограничено, поэтому при регистрации постарайтесь подробно рассказать о своем опыте и интересах. Это будет учитываться при отборе. \u003c/p\u003e\u003cp\u003eВстретимся на хакатоне!\u003c/p\u003e\u003cp\u003eОстались вопросы? Пишите сюда \u003ca href\u003d\"mailto:EduGames@croc.ru\"\u003eEduGames@croc.ru\u003c/a\u003e , \u003ca href\u003d\"mailto:NYanushkevich@croc.ru\"\u003eNYanushkevich@croc.ru\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/08/31/0831590f55ea7603020ebb5c4df8ea3ec49d64a0.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["крок","игра","хакатон","для школьников","обучение","games","gamedev","разработка"]}}