{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1503620555,"rating":76,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1503718167,"id":54040,"title":"\u003cp\u003eКвалификационный этап четвертьфинала Южного подрегиона NEERC\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/8f/03/8f0392ad98361cf77fe7b5211c06784222a168fe.png\" style\u003d\"width: 240.0px;float: right;margin: 0 0.5em 0.5em 0.5em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e \u003cp\u003e\u003ci\u003eБольше контестов хороших и разных! Вдохновившись рассказами \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik\" title\u003d\"Мастер MikhailRubinchik\"\u003eMikhailRubinchik\u003c/a\u003e об успехах проведения квалификационных этапов в Восточном четвертьфинале NEERC, в этом году и Южный (саратовский) четвертьфинал объявляет о проведении квалификационного этапа. В октябре состоится 20-й юбилейный четвертьфинал в Саратове. Надеемся, что проводя квалификацию, мы сумеем дать возможность большему количеству команд попробовать себя в соревнованиях по программированию.\u003c/i\u003e\u003c/p\u003e \u003cp\u003e\u003ci\u003eДля широкой аудитории 17-го сентября будет проведено \u003ca href\u003d\"//codeforces.com/contests/847\"\u003eонлайн-зеркало\u003c/a\u003e на Codeforces. Приглашаются все!\u003c/i\u003e\u003c/p\u003e \u003cp\u003e     В этом году (сезон 2017-2018) Четвертьфинал ICPC Южного подрегиона NEERC будет содержать дополнительный     квалификационный этап. Дата проведения — 17 сентября 2017 г. До 11 сентября необходимо зарегистрировать команду на сайте \u003ca href\u003d\"https://icpc.sgu.ru\"\u003ehttps://icpc.sgu.ru\u003c/a\u003e. \u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e \u003ccenter style\u003d\"margin-top: 30.0px;\"\u003e \u003ca href\u003d\"https://icpc.sgu.ru\" style\u003d\"padding: 10.0px 20.0px;font-size: 18.0px;color: white;text-decoration: none;background-color: rgb(177,42,28);\"\u003eЗарегистрироваться →\u003c/a\u003e \u003cdiv style\u003d\"margin-top: 9.0px;\"\u003e\u003csmall\u003eДля команд Южного подрегиона NEERC\u003c/small\u003e\u003c/div\u003e \u003c/center\u003e \u003cp\u003e     Приглашаются команды студентов/магистрантов/аспирантов из Астраханской, Белгородской, Волгоградской, Воронежской, Курской, Липецкой, Нижегородской, Пензенской, Ростовской, Самарской, Саратовской, Тамбовской, Ульяновской областей, Краснодарского, Ставропольского краёв, республик Адыгея, Дагестан, Кабардино-Балкария, Калмыкия, Карачаево-Черкесия, Чечня, Марий Эл, Мордовия, Северная Осетия, Татарстан, Чувашия.     Команды должны состоять из трёх студентов/магистрантов/аспирантов (ниже смотрите формальные требования),     представляющих один вуз.     Участие в квалификационном этапе бесплатное. Оргвзнос не предусмотрен. \u003c/p\u003e\u003cp\u003e  Этап будет одновременно проведен на нескольких площадках в ряде городов Южного подрегиона NEERC.  Продолжительность квалификационного этапа 4 часа,  язык условий — русский. Будет доступен перевод условий на английский язык. \u003c/p\u003e \u003ch2\u003eО квотах на Четвертьфинал в Саратове\u003c/h2\u003e \u003cp\u003e     Любой вуз имеет базовую квоту в 1 команду для участия в Четвертьфинале, независимо от участия или неучастия этой     команды или вуза в квалификационном этапе. Кроме того, эта квота увеличивается на 1 команду для     вузов-участников полуфинала NEERC прошлого сезона. Дополнительно квота увеличивается на 1 команду     за участие вуза в Финале ICPC прошлого сезона. \u003c/p\u003e \u003cp\u003e     Таким образом, базовые квоты по вузам такие: \u003c/p\u003e \u003ctable\u003e     \u003ctbody\u003e\u003ctr\u003e         \u003cth\u003eВуз\u003c/th\u003e\u003cth\u003eБазовая квота\u003c/th\u003e     \u003c/tr\u003e     \u003ctr\u003e\u003ctd\u003eСаратовский государственный университет\u003c/td\u003e\u003ctd\u003e3\u003c/td\u003e\u003c/tr\u003e     \u003ctr\u003e\u003ctd\u003eСамарский национальный исследовательский университет имени академика С.П. Королева\u003c/td\u003e\u003ctd\u003e3\u003c/td\u003e\u003c/tr\u003e     \u003ctr\u003e\u003ctd\u003eВолгоградский государственный технический университет\u003c/td\u003e\u003ctd\u003e2\u003c/td\u003e\u003c/tr\u003e     \u003ctr\u003e\u003ctd\u003eВоронежский государственный университет\u003c/td\u003e\u003ctd\u003e2\u003c/td\u003e\u003c/tr\u003e     \u003ctr\u003e\u003ctd\u003eУльяновский государственный технический университет\u003c/td\u003e\u003ctd\u003e2\u003c/td\u003e\u003c/tr\u003e     \u003ctr\u003e\u003ctd\u003eИнститут компьютерных технологий и информационной безопасности Южного федерального университета\u003c/td\u003e\u003ctd\u003e2\u003c/td\u003e\u003c/tr\u003e     \u003ctr\u003e\u003ctd\u003eНижегородский государственный технический университет им. Р.Е. Алексеева\u003c/td\u003e\u003ctd\u003e2\u003c/td\u003e\u003c/tr\u003e     \u003ctr\u003e\u003ctd\u003eАстраханский государственный университет\u003c/td\u003e\u003ctd\u003e2\u003c/td\u003e\u003c/tr\u003e     \u003ctr\u003e\u003ctd\u003eМордовский государственный университет имени Н.П. Огарева\u003c/td\u003e\u003ctd\u003e2\u003c/td\u003e\u003c/tr\u003e     \u003ctr\u003e\u003ctd\u003eКазанский федеральный университет\u003c/td\u003e\u003ctd\u003e2\u003c/td\u003e\u003c/tr\u003e     \u003ctr\u003e\u003ctd\u003eОстальные вузы\u003c/td\u003e\u003ctd\u003e1\u003c/td\u003e\u003c/tr\u003e \u003c/tbody\u003e\u003c/table\u003e \u003cp\u003e     Базовые квоты назначаются вузам, использовать квоту можно независимо от участия или неучастия вуза и/или     конкретных команд вуза в квалификационном этапе. \u003c/p\u003e \u003cp\u003e     Остальные места будут распределены следующим  образом: результаты команд, выступающих на всех площадках, будут     сведены в одну таблицу. Лучшие 40 команд квалификационного этапа получат приглашение на Четвертьфинал в     Саратове (приглашаются следующие по списку команды в случае отказа). \u003c/p\u003e \u003ch3\u003eПример 1\u003c/h3\u003e \u003cp\u003e     Допустим, Саратовский университет принял участие в квалификационном этапе 20 командами. В лучшие     40 команд попали 6 команд СГУ. Именно эти 6 команд получают приглашение в Четвертьфинал     (среди них могут быть участники полуфинала и финала). Кроме этого, у СГУ есть возможность заявить еще     любые 3 команды (базовая квота) по своему усмотрению. Это могут быть как команды, принимающие участие     в квалификации, так и нет. Это могут быть как команды-участницы полуфиналов и/или финалов, так и нет. \u003c/p\u003e \u003ch3\u003eПример 2\u003c/h3\u003e \u003cp\u003e     Допустим, вымышленный Берляндский государственный университет не нашел возможности принять участие     в квалификации и не имеет дополнительных мест по квоте. Таким образом, у БГУ есть возможность заявить     одну команду на Четвертьфинал. \u003c/p\u003e \u003ch2\u003eКто участвует\u003c/h2\u003e \u003cp\u003e     Все команды должны пройти обязательную регистрацию на общем сайте квалификационного этапа до 11 сентября. \u003c/p\u003e \u003cp\u003e     К участию допускаются все студенческие команды, удовлетворяющие правилам ICPC. К участию допускаются команды из трех учащихся/студентов/аспирантов вузов и колледжей. Каждый член команды должен: \u003c/p\u003e \u003cul\u003e     \u003cli\u003eбыть учащимся в вузе, который представляет;     \u003c/li\u003e\u003cli\u003eпредставлять один вуз в чемпионате ICPC за сезон;     \u003c/li\u003e\u003cli\u003eдважды участники Финала ICPC и участвующие 5 сезонов в каких-либо этапах ICPC не допускаются к участию;     \u003c/li\u003e\u003cli\u003eудовлетворять \u003ci\u003eхотя бы одному\u003c/i\u003e из условий: быть рожденным после 1 января 1994 года, начать свое первое обучение в вузе не ранее 1 января 2013, закончить не более 8 семестров обучения. \u003c/li\u003e\u003c/ul\u003e \u003cp\u003e     Подробная блок-схема определения возможности участия доступна     по \u003ca href\u003d\"https://icpc.baylor.edu/download/regionals/rules/EligibilityDecisionTree-2017.pdf\"\u003eссылке\u003c/a\u003e. \u003c/p\u003e \u003cp\u003e     Допускается  участие команд вне конкурса, в этом случае команда должна указать своё намерение выступать вне конкурса во время регистрации на сайте. Площадка может отказать в участии команде вне конкурса, если количество рабочих мест на площадке не позволяет разместить всех желающих. \u003c/p\u003e \u003cp\u003e     Команда может принимать участие в квалификации в неполном составе, однако весь состав (3 человека) должен быть зарегистрирован на сайте квалификационного этапа. \u003c/p\u003e \u003cp\u003e     Команда, получившая приглашение на четвертьфинал, при изменении состава теряет приглашение, но может принять участие в Четвертьфинале за счет базовой квоты вуза. \u003c/p\u003e\u003c/div\u003e","tags":["icpc","четвертьфинал","квалификация","neerc"]}}