{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1480948161,"rating":52,"authorHandle":"alkurmtl","modificationTimeSeconds":1481115634,"id":48859,"title":"\u003cp\u003eRebusforces Round #1\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eЖЮРИ ГАРАНТИРУЕТ, ЧТО В КОНТЕСТЕ НЕ БУДЕТ РУССКОГО РЭПА\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eДобрый день!\u003c/p\u003e\u003cp\u003e7 декабря 2016 года в 20:00 по московскому времени (жители Саратова, не забудьте, что теперь вы живете по самарскому времени, а значит, для вас это 21:00) состоится первый в истории Codeforces ребусный контест, подготовленный Александром \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/alkurmtl\" title\u003d\"Эксперт alkurmtl\"\u003ealkurmtl\u003c/a\u003e Курилкиным и Сергеем \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/sslotin\" title\u003d\"Кандидат в мастера sslotin\"\u003esslotin\u003c/a\u003e Слотиным.\u003c/p\u003e\u003cp\u003eХочется поблагодарить \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Штаб, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e за чудесную платформу Polygon, которая использовалась при подготовке задач (ребусов), Андрея \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/NedoL\" title\u003d\"Кандидат в мастера NedoL\"\u003eNedoL\u003c/a\u003e Недолужко за тестирование контеста, а также всех подписчиков \u0026quot;Странных опросов для спортивных программистов\u0026quot;, без которых этот контест не был бы возможным.\u003c/p\u003e\u003cp\u003eКонтест проводится по традиционной ACM ICPC системе. Решением задачи является программа, выводящая в стандартный поток вывода ответ на ребус, данный в условии задачи. Длительность контеста — час и двадцать минут. Жюри рекомендует внимательно читать указанный формат вывода.\u003c/p\u003e\u003cp\u003eПробный тур доступен в разделе \u0026quot;соревнования\u0026quot; этой группы.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eПРОЧИТАЙТЕ ЭТО ВНИМАТЕЛЬНО:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eНекоторые языки (в частности, Java, Python и Haskell) плохо работают с различными кодировками, вследствие чего решения на них не работают в задачах с русским ответом. Жюри гарантирует, что решения на C++11/14, FPC и Ruby работают корректно во всех задачах. Пример решения на Ruby задачи А с пробного тура: \u003ccode\u003eputs \u0027ахокорасик\u0027\u003c/code\u003e. Пример решения на Ruby задачи B с пробного тура: \u003ccode\u003eputs \u0027pharaoh\u0027\u003c/code\u003e.\u003c/p\u003e\u003c/div\u003e","tags":[]}}