{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1458947679,"rating":24,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1458984186,"id":43997,"title":"\u003cp\u003eТехнокубок 2016 — Отборочный Раунд 2\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e \u003ca href\u003d\"//codeforces.com/technocup2016\" style\u003d\"float: right;margin: 0 0 1.0em 1.0em;\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/technocup-narrow-logo.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e Добрый день. \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://timeanddate.com/worldclock/fixedtime.html?day\u003d26\u0026amp;month\u003d3\u0026amp;year\u003d2016\u0026amp;hour\u003d10\u0026amp;min\u003d0\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003e26-го марта в 10:00 (московское время)\u003c/a\u003e стартует \u003ca href\u003d\"//codeforces.com/contests/649\"\u003eОтборочный Раунд 2\u003c/a\u003e чемпионата \u003ca href\u003d\"//codeforces.com/blog/entry/43553\"\u003eТехнокубок 2016\u003c/a\u003e. Раунд будет длиться два часа, участникам будут предложены 5 задач. По его результатам лучшие 150 участников (но не более 45% от общего числа участников раунда) будут приглашены на финальный этап в Москву. Для регистрации на раунд и участия перейдите по ссылке \u003ca href\u003d\"//codeforces.com/contests/649\"\u003e\u003c/a\u003e\u003ca\u003ehttp://codeforces.com/contests/649\u003c/a\u003e. Не забудьте заранее зарегистрироваться на раунд. Впрочем, если забудете — не беда. Через 10 минут после старта будет открыта дополнительная регистрация для опоздавших (ее длительность — 100 минут).\u003c/p\u003e \u003cp style\u003d\"text-align: center;\"\u003e \u003ca href\u003d\"//codeforces.com/contests/649\" style\u003d\"font-size: 20.0px;\"\u003eЗарегистрироваться на Отборочный Раунд 2 →\u003c/a\u003e \u003cbr /\u003e \u003csmall\u003eДля зарегистрированных участников олимпиады\u003c/small\u003e \u003c/p\u003e\u003cp\u003eНапомним, что согласно правилам раундов Codeforces во время соревнования ваши решения будут тестироваться только на претестах (предварительном и неполном наборе тестов), а системное тестирование состоится после окончания раунда. Обратите внимание, что претесты не покрывают все возможные случаи входных данных, поэтому тщательно тестируйте свои программы! После прохождения претестов у вас будет возможность заблокировать решение, тем самым получив привилегию искать ошибки и взламывать чужие решения, но отказавшись от возможности перепослать ваше решение при каких-либо обстоятельствах (например, даже если вы найдете ошибку или вас взломают). Со временем задачи падают в стоимости. После системного тестирования учитываются только полные решения. Подробнее про правила соревнований можно прочитать по ссылкам:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/456\"\u003e короткое описание формата\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\" http://codeforces.com/blog/entry/4088\"\u003eполное описание формата\u003c/a\u003e\u003c/li\u003e \u003c/ul\u003e \u003cp\u003e Напоминаем, что регистрация на олимпиаду еще открыта. На кону — дополнительные баллы при поступлении в престижные технические вузы России и ценные призы. Если вы — школьник 8-11 классов и пока не зарегистрировались на Технокубок, то самое время сделать это: \u003c/p\u003e \u003cp style\u003d\"text-align: center;font-size: 20.0px;\"\u003e \u003ca href\u003d\"https://it.mail.ru/technocup/\"\u003eЗарегистрироваться на олимпиаду →\u003c/a\u003e \u003c/p\u003e \u003cp\u003e В финал соревнования будут приглашены лучшие 150 участников каждого из отборочных раундов (но не более 45% от общего числа участников раунда).  \u003c/p\u003e \u003cp\u003e Второй отборочный раунд будет открыт для всех тех, кто не прошел в финальный этап из первого отборочного раунда. Причина (не участие или недостаточный результат) — не важна. \u003c/p\u003e \u003cp\u003e Желаем удачи на олимпиаде, \u003cbr /\u003e MikeMirzayanov и команда Технокубка \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD 1: Раунд будет рейтинговым для всех участников олимпиады \u0026quot;Технокубок\u0026quot;, то есть как для официальных участников раунда, так и участников вне конкурса.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD 2:\u003c/strong\u003e Дорешивание доступно в Тренировках: \u003ca href\u003d\"/gym/100950\" title\u003d\"2016 Технокубок: Отборочный Раунд 2\"\u003e2016 Технокубок: Отборочный Раунд 2\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["технокубок"]}}