{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1404421013,"rating":71,"authorHandle":"msg555","modificationTimeSeconds":1404421040,"id":12932,"title":"\u003cp\u003eMichigan Invitational Programming Contest in CF Gym\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIn the interest of learning a bit about Codeforces\u0027 Polygon and Gym services, I have set up and made available a contest that I worked on a few years ago. The contest was created with the help of Richard Peng, Danny Sleator, Dennis Matveyev, and Krzysztof Onak.\u003c/p\u003e\u003cp\u003eI believe the average problem difficulty should be relatively easy for strong teams although there\u0027s at least one fairly tricky problem in the set. Good luck!\u003c/p\u003e\u003cp\u003eAs an aside, this contest actually has a bit of a story behind it:\u003c/p\u003e\u003cp\u003eThis was an invitational contest hosted by the University of Michigan during the 2011-2012 ICPC season. With help from the contests\u0027 sponsor, Jump Trading, we were able to invite several of the teams from around our area for a contest prior to regionals.\u003c/p\u003e\u003cp\u003eWhile I personally found the logistics of setting up such a contest a bit frustrating to manage, lucky for North America, one of the teams we invited was the University of Chicago coached by Borja Sotomayor. Running with the idea, Borja has created something much bigger and much more meaningful with the NAIPC contests (which many of us hope will become an official NA super regional) from the past three years (thank you Borja and everyone else involved!).\u003c/p\u003e\u003cp\u003eYou can check out these past NAIPC contests at the links below\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://icpc.cs.uchicago.edu/invitational2012/\"\u003ehttp://icpc.cs.uchicago.edu/invitational2012/\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://icpc.cs.uchicago.edu/invitational2013/\"\u003ehttp://icpc.cs.uchicago.edu/invitational2013/\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://naipc.uchicago.edu/2014/\"\u003ehttp://naipc.uchicago.edu/2014/\u003c/a\u003e\u003c/p\u003e\u003cp\u003eAnyway, enough story time. Good luck solving problems! (And see if you can spot all the Pixies references)\u003c/p\u003e\u003c/div\u003e","tags":["acm-icpc","michigan","naipc"]}}