{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1483182803,"rating":243,"authorHandle":"ssms01","modificationTimeSeconds":1483182803,"id":49442,"title":"\u003cp\u003eAn efficient way for cheating !!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi Everyone..\u003c/p\u003e\u003cp\u003eI\u0027m new to codeforces, I have been participating in many contests now, and I noticed a strange thing !!\u003c/p\u003e\u003cp\u003eAfter the contest some participants gets their submission skipped if their code matches someone else\u0027s code. After a few easy investigations (you just filter the submissions on skipped verdict, and VWALA !! you got a list of all the skipped submissions during the current contest) I noticed that some participants do this on purpose.\u003c/p\u003e\u003cp\u003eFrom my previously mentioned investigation, I noticed that some participants have two accounts, one of them is the original one, and the other one is fake. Now they register themselves from both accounts on the upcoming contest. after that, they start the contest from their original account and participate normally like everyone else. Coming to the end of the contest, and if they haven\u0027t done well, they simply sign in from the other account, and submit exactly the same code from it, and let the cheating detection system of codeforces do the rest for you.\u003c/p\u003e\u003cp\u003eAfter the end of the contest, codeforces seems to skip the submissions of similar codes, making these participants out of competition. This way their rating doesn\u0027t get affected !!\u003c/p\u003e\u003ch2\u003eExample\u003c/h2\u003e\u003cp\u003eI noticed that this guy \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Whistle\" title\u003d\"Эксперт Whistle\"\u003eWhistle\u003c/a\u003e, \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/So_Cold\" title\u003d\"Специалист So_Cold\"\u003eSo_Cold\u003c/a\u003e in particular have done this two times in a row.\u003c/p\u003e\u003ch3\u003e\u003ca href\u003d\"//codeforces.com/contest/740\"\u003eCodeforces Round #381 (Div. 2)\u003c/a\u003e\u003c/h3\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/contest/740/submission/22428639\"\u003eProblem A from the first account\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/contest/740/submission/22430177\"\u003eProblem A from the second account\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003ca href\u003d\"//codeforces.com/contest/750\"\u003eGood Bye 2016\u003c/a\u003e\u003c/h3\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/contest/750/submission/23450384\"\u003eProblem A from the first account\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/contest/750/submission/23449862\"\u003eProblem A from the second account\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/contest/750/submission/23450225\"\u003eProblem B from the first account\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/contest/750/submission/23450087\"\u003eProblem B from the second account\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eConclusion\u003c/h2\u003e\u003cp\u003eI\u0027m just wondering that isn\u0027t there some other action should codeforces do other than simply making cheating users out of competition? I used to participate in topcoder, but I heard so much about what a great and easy platform codeforces is (I actually found that this is true), which made me switch to codeforces. However, I think codeforces should pay more attention to these cases to keep its reputation as high as it is now.\u003c/p\u003e\u003cp\u003eThank you for reading and sorry if my long post made you a little bit bored ;)\u003c/p\u003e\u003c/div\u003e","tags":["cheating","skipped-submissions"]}}