{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1501180696,"rating":82,"authorHandle":"dumbass","modificationTimeSeconds":1501336279,"id":53510,"title":"\u003cp\u003eTopcoder Collegiate India Contest — 2017 + Fun Round (Open and Rated)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eOn behalf of Topcoder India and \u003ca class\u003d\"rated-user user-black\" href\u003d\"/profile/hmehta\" title\u003d\"Unrated, hmehta\"\u003ehmehta\u003c/a\u003e, allow me to welcome you to \u003ca href\u003d\"http://crowdsourcing.topcoder.com/tccindia17\"\u003eTopcoder Collegiate India Contest, 2017\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe Qualification Round will be held on \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dTopcoder+Collegiate+Contest+India%2C+Qualification+Round\u0026amp;iso\u003d20170729T21\u0026amp;p1\u003d176\"\u003e29th July, 2017 at 09:00 pm IST\u003c/a\u003e. Top 10 from the Online Round Will Qualify for the Final Round which will take place during the TCO17 India Regionals event. Note that you must be a student studying in an Indian university to be eligible for the next round. There is a fun round in parallel to this event which is open for all participants. Both these rounds are rated!\u003c/p\u003e\u003cp\u003eThe Final Onsite Round will be held on \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dTopcoder+Collegiate+Contest+India%2C+Final+Round\u0026amp;iso\u003d20170820T14\u0026amp;p1\u003d176\"\u003e20th August, 2017 at 02:00pm IST\u003c/a\u003e. The Topcoder Collegiate Champion and the Runner Up in the Onsite Finals will get awarded with 25000 INR and 10000 INR in cash respectively along with TCC Trophies.\u003c/p\u003e\u003cp\u003eApart from the obvious SRM competition, there will be talks by Topcoder members and a lot of fun games and puzzles around the arena. For all the algorithm enthusiasts, there will also be a talk on algorithms from a very well known Topcoder member who has represented India at ACM ICPC World Finals!\u003c/p\u003e\u003cp\u003eLooking forward to meet some of you in person at the onsite round! Good luck and have fun.\u003c/p\u003e\u003c/div\u003e","tags":["topcoder","india","college"]}}