{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1402179324,"rating":726,"authorHandle":"viktork","modificationTimeSeconds":1402687220,"id":12605,"title":"\u003cp\u003eZeptoLab Code Rush 2014\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/zepto2014/image06.png\" style\u003d\"width: 190.0px;float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eA coder can apply his breathtaking coding skills not only in different search engines but also in the mobile game industry. It is an option in Russia. If you do not believe — check this out: ZeptoLab company that created the world famous Cut the Rope game offers you the opportunity to see this for yourself. And yes, we are in Moscow.\u003c/p\u003e\u003cp\u003eIt\u0027s not a secret that those who strive to achieve top coding skills — work hard, including work on his self-education. Here in ZeptoLab we aim to create the area that strongly encourages self-development. Specifically, we have recently purchased a company library with everything necessary to get new knowledge, an improvised reading room with sofas and armchairs.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/zepto2014/image08.jpg\" style\u003d\"width: 400.0px;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eWe also conduct developer\u0027s contest inside the company so that our ZeptoCoders could solve non-trivial problems and impress each other with zeroes and ones. The winners get glory, valuable gifts and name-encrusted weapon (it\u0027s a joke, it’s not weapon)\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/zepto2014/image04.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eWe have recently opened our own algorithmic school here in ZebtoLab and the teacher is no other than the creator and the head of the whole wide Codeforces, Mike Mirzayanov! He is well-known among developers: Mike has trained a team that became the world champion in programming, so it\u0027s not hard to imagine the opportunities opened for ZeptoLab developers and the whole company. It\u0027s the first time that Mike teaches in such format, there are hardly any more examples of such corporate education systems in Russia and throughout the world.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/zepto2014/image09.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eAlgorithms play an important role for us as the requirements for developers are quite tough: ideally, the application should output 60 frames per second on the target gadget. All game logic calculations should be very quick and preferably, with simple and not amortized complexity. Besides, we can afford a fine pre-processing to transport some calculations to the stage at which resources for the game are prepared. Understanding this facts, alongside with many more is the key to the quick gameplay. That is why we support the algorithmist\u0027s movement.\u003c/p\u003e\u003cp\u003eIt\u0027s the first time when Zeptolab holds an algorithmic development contest based on Codeforces. Ingenious problems, fierce developer rivalry and cool prizes are waiting for you:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e1st prize: Ipad Air, plush Om Nom, the championship T-shirt\u003c/li\u003e   \u003cli\u003e2nd-3rd prize: Ipad Mini, plush Om Nom, the championship T-shirt\u003c/li\u003e   \u003cli\u003e4-th-30-th prize: plush Om Nom, the championship T-shirt\u003c/li\u003e   \u003cli\u003e31st-50th prize: the championship T-shirt\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eAnd just for some suspense, we add another prize:\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/zepto2014/image07.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eWe will randomly give the IPad Mini Retina to the person who makes it to the top 50 list of the contest champion. The IPad winner will be chosen like this: we sum up the times of all successful attempts of three top winners (in seconds starting from the start of the contest) and take a row with number \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003es\u003c/i\u003e\u003c/span\u003e % 47 + 4, where \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003es\u003c/i\u003e\u003c/span\u003e is the resulting sum. Being true coders. If the resulting line divides the place, then the priority goes to the earlier person to submit his last solved problem.\u003c/p\u003e\u003cp\u003eBesides, the person who shows good results in the contest will have the opportunity to apply for a job in our company by a simplified scheme. If you\u0027d be interested to try working in the ZeptoLab team, tick the corresponding square at the registration.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/zepto2014/image01.jpg\" style\u003d\"width: 400.0px;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eYou can find out more about what working with us is like at \u003ca href\u003d\"http://zeptoteam.ru/\"\u003ehttp://zeptoteam.ru/\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e \u003c/p\u003e\u003ccenter\u003e \u003ca href\u003d\"/zeptolab2014/apply\" style\u003d\"background-color: rgb(91,183,91);font-size: 20.0px;color: white;text-decoration: underline;padding: 6.0px;border-color: rgb(75,167,75);\"\u003eWhat to apply to ZeptoLab?\u003c/a\u003e \u003c/center\u003e \u003cbr /\u003e\u003cp\u003eThe championship will be conducted in a single round. The contest will go \u003ca href\u003d\"/blog/entry/4088\"\u003eby the Codeforces rules\u003c/a\u003e. The round will be rated and both divisions can participate.\u003c/p\u003e\u003cp\u003eThe date and time of the contest is: \u003ca href\u003d\"http://timeanddate.com/worldclock/fixedtime.html?day\u003d13\u0026amp;month\u003d6\u0026amp;year\u003d2014\u0026amp;hour\u003d19\u0026amp;min\u003d30\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003eJune 13, 2014, 15:30PM — 18PM (UTC)\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe problem scores are: 1000-1000-1500-2500-2500-3000.\u003c/p\u003e\u003cp\u003eThe contest is over! Thanks for all the participants! We hope you like the problems and the contest! Our special congratulations to the winners:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eThe 1st place — \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/KAN\" title\u003d\"Grandmaster KAN\"\u003eKAN\u003c/a\u003e (Nikolay Kalinin, Russia, Nizhniy Novgorod) — iPad Air\u003c/li\u003e   \u003cli\u003eThe 2nd place — \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/winger\" title\u003d\"Master winger\"\u003ewinger\u003c/a\u003e (Vladislav Isenbaev, USA, Facebook) — iPad Mini\u003c/li\u003e   \u003cli\u003eThe 3rd place — \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e (Gennady Korotkevich, Russia, Saint Peterburg, ITMO) — iPad Mini\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eAll the participants on the places 1-30 will receive presents: plush Om Nom and the championship T-shirt. All the participants on the places 31-50 will receive championship T-shirt!\u003c/p\u003e\u003cp\u003eAdditional prize will be received to the the 21st place winner: \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/package.zaic\" title\u003d\"Candidate Master package.zaic\"\u003epackage.zaic\u003c/a\u003e (Vadim Zaycev, Russia, Novosibirsk, NSU).\u003c/p\u003e\u003c/div\u003e","tags":["zeptolab","zepto code rush 2014"]}}