{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399077562,"rating":-8,"authorHandle":"revenge5","modificationTimeSeconds":1399077562,"id":12091,"title":"\u003cp\u003esystem of anti-tactical players\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003ey , that is a real team play basketball. Ramsay became the Popovich era, he was a pioneer in the creation of a new system of anti-tactical players, players who love to share the ball passing, hard running, attacking style of cheerful smooth. Any player, no matter how you usually physical condition, as long as you are willing to run the ball and active, you can find space to play in Ramsey\u0027s tactics. Blazers 1976-77 season, averaging 111.7 points ranked under the H-third in the league, the team six players scoring in double figures.\u0026quot;That team everyone has decent passing skills,\u0026quot; Speaking of the Blazers 1976-77 season, said Ramsey, \u0026quot;\u003ca href\u003d\"http://www.maxsalesupras.com/nike-air-max-95-dyn-fw-c-26.html\"\u003enike air max 95 dyn fw\u003c/a\u003e  Everyone knows that if you ran out of space, it will pass to teammate you when a team everyone played so selfless, will form a powerful force. \u0026quot;Ramsay\u0027s system emphasizes the transfer of moving the ball and players, focusing on integrity while not rigid, allowing players to play to their creativity, according to the defense to make a corresponding mass cut, which is now very similar to the Spurs play . Popovich then admits: \u0026quot;Ramsey coach very helpful in our system, he has personally coached our work, he is very great.\u0026quot;Terror frontcourt duoRamsey\u0027s tactics to successfully execute, Wharton is essential to key players. Wharton\u0027s health in the 1976-77 season finally reached a relatively satisfactory level, he played in 65 regular-season games, averaging 18.6 points and 14.4 rebounds, 3.8 assists and 3.2 blocked shots, became the team\u0027s offensive axis, textbook Passing a model called the center.Wharton is great, but he can not \u003c/p\u003e\u003cp\u003esingle-handedly changed by the pioneers, this Portland team can \u0026quot;ascend toward the twilight of lands and Lang Son of Heaven Church\u0026quot;, another player also played an important role, he is Maurice — Lucas. Lucas in 1976 by the ABA to switch to NBA, was selected Portland. The power forward style of tough, strong offensive firepower from 1976 -77 season, the Blazers were 20.2 points 11.4 rebounds, is the team\u0027s leading scorer. Walton Lucas reduce the pressure to score, so you can focus on Playmaker Wharton and defense. When it comes to the year despite a pioneer, Wharton is the most dazzling star, but the team is the spiritual pillar of Lucas. \u0026quot;He is my life, the best teammate, he soon becomes tough to make the team, no matter what the face of a powerful enemy will not back down.\u0026quot;Walton said.1977 \u003ca href\u003d\"http://www.maxsalesupras.com/nike-lunar-force-1-fuse-c-43.html\"\u003enike lunar force 1 shoes\u003c/a\u003e  fairy taleAlthough the Blazers have a reliable core team and a mature tactical system, but their performance in the regular season is still not stable enough, the last 15 games, lost eight games, the final 49-33 ranked third in the West. Blazers made the playoffs, but no one knows how far they can go, after all, the intensity of the playoffs and the regular season is completely different, they Can Go it Blazers 2-1 in the first round with a total score of clearance, 4-2 second-round cut. They suffered in the regular season league Lakers Western Conference finals, the Grand Army has the super center Kareem Abdul-Jabbar, \u0026quot;sky hook\u0026quot; in the season to get the MVP. Confront the powerful Lakers, the Blazers have not been promising, but the results let doubters popping. Blazers \u003c/p\u003e\u003cp\u003erealized swept to 4-0 neat solution to the Lakers.Game series with the Lakers, Trail Blazers basketball team will play to new heights, despite Kareem Abdul-Jabbar averaged 30.3 points, the Lakers still no way to get the Blazers. Blazers Series five players scoring 11, they reached averaging 20. Blazers surprisingly Finals, you know, this is the first time they hit the playoffs that way.Blazers opponent in the finals was 76, it \u003ca href\u003d\"http://www.maxsalesupras.com/supra-society-c-53.html\"\u003esupra society cheap\u003c/a\u003e  was a team with \u0026quot;J Dr\u0026quot; Owen\u0027s luxury division, looks like the dwarf dwarfish challenge poor rich handsome, but has been a pioneer again hit crazy counter-attack, but the process more wonderful.The first two finals cruised 76 2-0 lead. Turning point occurred in the second field, the Trail Blazers with 76 Gross buckle broken rebounds madman Dawkins clashed with Dawkins Lucas came forward to protect his teammates beat up two people were ejected. Lucas heroic infected teammates, they rediscovered each other support inspiration. \u0026quot;I think about it so that we have a new feeling, but also to re-examine our opponents, they know we are with a decisive attitude to play the game, to win at any cost,\u0026quot; Lucas said.The Blazers won the first two back home, the total score, in the sixth game of the Wharton Taifashenwei Kuangqiang 24 rebounds, the Blazers got the series match point. June 5, 1977, the sixth duel conducted in Portland, Trail Blazers history of this game is the most classic battle. Wharton promotions God as the pinnacle of his career, Pila 20 points and 23 rebounds, 7 assists and 8 blocks, Owen missed a key ball, the Blazers 109-107 win \u003c/p\u003e\u003c/div\u003e","tags":[]}}