{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1428326942,"rating":380,"authorHandle":"I_love_Hoang_Yen","modificationTimeSeconds":1428339683,"id":17302,"title":"\u003cp\u003eBeing good competitive programmer correlates negatively with being good on the job? What do you think?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eToday I came across \u003ca href\u003d\"http://www.catonmat.net/blog/programming-competitions-work-performance/\"\u003ethis article\u003c/a\u003e, in which \u0026quot;Peter Norvig said that one thing that was surprising to him was that being a winner at programming contests was a negative factor for performing well on the job\u0026quot;.\u003c/p\u003e\u003cp\u003eNormally I don\u0027t care about these topics, but this is from Google — where they have good population of high rated competitive programmers and the claim is backed with data.\u003c/p\u003e\u003cp\u003eThe article mentioned one point: \u0026quot;programming contest winners are used to cranking solutions out fast and that you performed better at the job if you were more reflective and went slowly and made sure things were right\u0026quot;. Though I don\u0027t think this is true. For example, being competitive programmer taught me:\u003c/p\u003e \u003col\u003e   \u003cli\u003ebugs can be everywhere \u0026amp; we must code carefully\u003c/li\u003e   \u003cli\u003emany problems have amazing solutions, and it\u0027s not a good idea to start coding anything that comes to mind.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eSome comments talked about how competitive programmers write unmaintainable code or appear arrogant. Having lots of friends who are competitive programmers and read lots of comments here, I believe that these are also not the case.\u003c/p\u003e \u003cul\u003e   \u003cli\u003eYes, amongst rude comments made on Codeforces, many are from reds, but many are also from yellows, purples, blues, greens... and I think majority of high rated people here are very reasonable \u0026amp; nice.\u003c/li\u003e   \u003cli\u003eI think most people have some moments when we come back to read our old code writen in contests, and have no idea what we did. Since we\u0027ve been there, it\u0027s not natural to think that we would write such code when we know that we need to maintain them.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eI understand that the points I made above are probably biased. So what do you think? Do you believe that being good competitive programmer correlates negatively with being good on the job?\u003c/p\u003e\u003c/div\u003e","tags":["rant","whoreadstaganyway"]}}