{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1520366131,"rating":83,"authorHandle":"DrSwad","modificationTimeSeconds":1520480469,"id":58207,"title":"\u003cp\u003eMathMash — Round 2\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces!\u003c/p\u003e\u003cp\u003eWe will be hosting the \u003ca href\u003d\"https://www.mathmash.org/contest.php?id\u003d2\"\u003esecond contest\u003c/a\u003e of MathMash today at \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?day\u003d07\u0026amp;month\u003d03\u0026amp;year\u003d2018\u0026amp;hour\u003d13\u0026amp;min\u003d00\u0026amp;sec\u003d00\"\u003e1:00 PM (UTC)\u003c/a\u003e. The round will consist of 10 problems to be solved within 2 hours.\u003c/p\u003e\u003cp\u003eWe have learned a lot from our previous contest and hope to use that experience to better organize this one. We didn\u0027t expect so many users solving so many problems that quickly. So we added more problems and tried to increase the difficulty of the higher problems a bit.\u003c/p\u003e\u003cp\u003eAlso the time-penalty seemed to cost too high considering the actual number of points rewarded for a problem. So we will be increasing the score for each problem in this round.\u003c/p\u003e\u003cp\u003eThere was an issue in the contest page which has been fixed now. You won\u0027t be rated for the contest even if you are registered but don\u0027t submit any answer(also if you don\u0027t register you can\u0027t submit any answer till the contest ends). And the limit of 20 submissions per problem seemed too high, it has been reduced to 10 now.\u003c/p\u003e\u003cp\u003eI\u0027m also working on a clarification section in the contest page, so that users can ask for any clarification for any problem. Hopefully it\u0027ll be ready before the contest. If not, then it\u0027ll have to wait for the next round to serve us.\u003c/p\u003e\u003cp\u003eI\u0027m inviting you all to participate in the contest. Hopefully we will have a fun and successful round.\u003c/p\u003e\u003cp\u003eUpdate: I didn\u0027t notice that the previous schedule overlapped with a csa round. I\u0027ve updated it so that our contest ends before the csa round starts.\u003c/p\u003e\u003cp\u003eUpdate 2: I feel really sad writing this. The site looks promising, but the timing could not have been worse. With the public exams of my country so near, I am awfully busy trying not to fail(and this exam is really important in my country). It\u0027s literally getting impossible to squeeze out more than 2 hours per day to work on the site now, which I need to spend on improving the platform rather than setting up problems. The current admins(my friends) will also be taking that exam. So the site really begs for some collaboration from others to set up the problems for future contests.\u003c/p\u003e\u003cp\u003eFrom my experience of the last two contests, the whole process of setting up a contest goes as follows:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eWe first work on finding some \u0026quot;not obvious to code\u0026quot; but interesting and not well-known problems which could be set as the 2000+ points problems for the round. This step requires a lot of time, as we try to avoid getting into trouble for using any National or International Olympiad problems just to be safe and thus have to go really deep looking for these problems. Then we collect the 500-1500 points problems mostly focusing on if they are interesting and appealing rather than if they are vulnerable to codes.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAfter that we go through the solution of each of the selected problems to verify if the problems and their answers are correct.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThere\u0027s not much work to do while the contest runs. But when it ends, writing up the editorial takes up a lot of time and effort too.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eWe were really determined to regularly host contests in every 2 or 3 days interval. But if we can\u0027t manage some help now, there might unfortunately be a month-long break in contests.\u003c/p\u003e\u003cp\u003eTill now three awesome people from Codeforces offered to collaborate on the site. But each of the 3 steps above needs more people(particularly step 1). If you would like to join us you can select one or more of the above steps that you would like to collaborate on and kindly  \u003cbr /\u003e — Find me on \u003ca href\u003d\"https://telegram.me/DrSwad\"\u003eTelegram\u003c/a\u003e [Username: DrSwad] (most preferred way)  \u003cbr /\u003e — or find me on \u003ca href\u003d\"https://web.facebook.com/nayeemulislam.swad\"\u003eFacebook\u003c/a\u003e [Username: nayeemulislam.swad]  \u003cbr /\u003e — or PM me here on Codeforces\u003c/p\u003e\u003c/div\u003e","tags":["mathmash","contest","math"]}}