{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1406172287,"rating":12,"authorHandle":"jgsiqueira","modificationTimeSeconds":1406172287,"id":13168,"title":"\u003cp\u003eComplicated knapsack problem\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi All, i\u0027m trying to solve a problem that remembers knapsack, but a little bit difficult. Can someone help me please? :)\u003c/p\u003e\u003cp\u003eThe problem is the following,\u003cbr /\u003e There is a diamond mine unexplored. This mine has the shape of a tree.\u003cbr /\u003e Each vertex of this tree is a collect point of diamonds, where it is possible to collect X diamonds.\u003cbr /\u003e The mine is obstructed. Because of that, we need to dig thru some vertices to reach a collect point of diamonds. There is a cost to dig between to vertices.\u003cbr /\u003e You can spend B money units digging the mine, and you want to collect the maximum of diamonds as possible.\u003cbr /\u003e Its important to notice that, once dug, you don\u0027t need to pay again to pass in an edge.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eThe picture below shows an example.\u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/8b/4a/8b4addce7896693a5873e7c9df63fb4b5532269c.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e The first picture is the answer for a budget of 400 money units. The second one is the answer for a budget of 450 money units.\u003c/p\u003e\u003cp\u003e[Input] In the first line, the number of diamond collect points N (10≤N≤1,000) and total mining budget (0≤B≤10,000) are given.\u003cbr /\u003e In the next N lines, route information (start point, end point), mining cost and benefit of diamonds at the end of the point are given. \u003cbr /\u003e All numbers are natural number and they are separated by a space. The mine entrance number is always 0.\u003cbr /\u003e\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["knapsack","dinamic programming","tree"]}}