{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1525334414,"rating":107,"authorHandle":"Chmel_Tolstiy","modificationTimeSeconds":1525343258,"id":59219,"title":"\u003cp\u003eПродолжается набор в Школу анализа данных\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, Codeforces!!!\u003c/p\u003e\u003cp\u003eДо 19:00 10 мая открыт \u003ca href\u003d\"https://yandexdataschool.ru/admission/\"\u003eнабор\u003c/a\u003e в Школу анализа данных Яндекса.\u003c/p\u003e\u003cp\u003eЗа два года учёбы в ШАДе перед вами раскроется множество направлений современных компьютерных наук. Вы познакомитесь (или улучшите уже имеющиеся знания) с продвинутыми алгоритмами и структурами данных и с методами машинного обучения, научитесь делать выводы из данных и находить приближённые решения NP-трудных задач, узнаете, как работает автоматический переводчик и как научить бота разговаривать, разберётесь в устройстве систем, обрабатывающих огромные потоки данных в режиме реального времени, и беспилотного автомобиля. Будет сложно, но вам понравится!\u003c/p\u003e\u003cp\u003eНабор традиционно проходит в три этапа: онлайн-тест, письменный экзамен и очное собеседование. Вы можете поступить как в ШАД в Москве (очное обучение), так и в один из филиалов (в Минске, Екатеринбурге и Нижнем Новгороде, очно-заочное обучение) или на заочное отделение.\u003c/p\u003e\u003cp\u003eВ этом году в Школе принимают участие легендарные гроссмейстеры Codeforces как среди студентов \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/V--o_o--V\" title\u003d\"Легендарный гроссмейстер V--o_o--V\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eV\u003c/span\u003e--o_o--V\u003c/a\u003e, так и среди преподавателей \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Zlobober\" title\u003d\"Легендарный гроссмейстер Zlobober\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eZ\u003c/span\u003elobober\u003c/a\u003e. Ну и, конечно, много других представителей сообщества.\u003c/p\u003e\u003cp\u003eБуду рад ответить на любые ваши вопросы, куратор минского филиала Школы анализа данных\u003c/p\u003e\u003c/div\u003e","tags":["школа анализа данных"]}}