{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1471867713,"rating":-1,"authorHandle":"zakomon","modificationTimeSeconds":1471867713,"id":46718,"title":"\u003cp\u003eHow do I solve this Dynamic Programming problem\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eProblem Statement\u003c/p\u003e\u003cp\u003eIn ICO School, all students have to participate regularly in SUPW. There is a different SUPW activity each day, and each activity has its own duration. The SUPW schedule for the next term has been announced, including information about the number of minutes taken by each activity. Nikhil has been designated SUPW coordinator. His task is to assign SUPW duties to students, including himself. The school\u0027s rules say that no student can go three days in a row without any SUPW duty. Nikhil wants to find an assignment of SUPW duty for himself that minimises the number of minutes he spends overall on SUPW.\u003c/p\u003e\u003cp\u003eInput format\u003c/p\u003e\u003cp\u003eLine 1: A single integer N, the number of days in the future for which SUPW data is available. Line 2: N non-negative integers, where the integer in position i represents the number of minutes required for SUPW work on day i.\u003c/p\u003e\u003cp\u003eOutput format\u003c/p\u003e\u003cp\u003eThe output consists of a single non-negative integer, the minimum number of minutes that Nikhil needs to spend on SUPW duties this term.\u003c/p\u003e\u003cp\u003eSample Input 1\u003c/p\u003e\u003cp\u003e10\u003c/p\u003e\u003cp\u003e3 2 1 1 2 3 1 3 2 1\u003c/p\u003e\u003cp\u003eSample Output 1\u003c/p\u003e\u003cp\u003e4\u003c/p\u003e\u003cp\u003e(Explanation: 1+1+1+1)\u003c/p\u003e\u003cp\u003eSample Input 2\u003c/p\u003e\u003cp\u003e8\u003c/p\u003e\u003cp\u003e3 2 3 2 3 5 1 3\u003c/p\u003e\u003cp\u003eSample Output 2\u003c/p\u003e\u003cp\u003e5\u003c/p\u003e\u003cp\u003e(Explanation: 2+2+1)\u003c/p\u003e\u003cp\u003eTest data There is only one subtask worth 100 marks. In all inputs: 1 ≤ N ≤ 2×10^5\u003c/p\u003e\u003cp\u003eThe number of minutes of SUPW each day is between 0 and 10^4, inclusive.\u003c/p\u003e\u003c/div\u003e","tags":["dp problem","ioi"]}}