{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1401193992,"rating":34,"authorHandle":"MrBrightside","modificationTimeSeconds":1401377512,"id":12433,"title":"\u003cp\u003eTechlabs Programming Contest\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eTechlabs Cup и БРСМ приглашают всех желающих поучаствовать в личном онлайн-соревновании по программированию — \u003ca href\u003d\"http://programming.techlabs.pro\"\u003eTechlabs Programming Contest\u003c/a\u003e, которое будет проходить в рамках TECHLABS CUP BY Season 2. \u003c/p\u003e\u003cp\u003eУчастники соревнования смогут побороться за ценные призы от организаторов. Сложность задач будет разнообразной, и мы надеемся, что данное событие будет интересно как начинающим участникам, так и тем, у кого уже есть богатый опыт участия в соревнованиях по программированию.\u003c/p\u003e\u003cp\u003eTechlabs Programming Contest будет проходить по правилам ACM-ICPC на платформе Codeforces.ru. Соревнование появится прямо в данной группе \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?iso\u003d20140529T1830\u0026amp;p1\u003d285\"\u003e29 мая в 18:30 по минскому времени\u003c/a\u003e, и будет иметь продолжительность 2 часа 30 минут. Награждение победителей состоится 31 мая в Минске в торговом центре \u0026quot;Столица\u0026quot; на сцене Techlabs Cup.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eПризовой фонд мероприятия:\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e   \u003cli\u003e1 место – \u003ca href\u003d\"http://market.yandex.by/model.xml?modelid\u003d10737102\"\u003eПланшет Smarty Maxi 10L\u003c/a\u003e + \u003ca href\u003d\"http://market.yandex.by/model.xml?modelid\u003d10498110\u0026amp;hid\u003d2417247\"\u003eЭлектронная книга Prestigio MR3664\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e2 место – \u003ca href\u003d\"http://market.yandex.by/model.xml?modelid\u003d9263731\u0026amp;hid\u003d6427100\"\u003eПланшет ASUS MeMO Pad ME172V 16Gb\u003c/a\u003e\u003c/li\u003e   \u003cli\u003e3 место – \u003ca href\u003d\"http://market.yandex.by/model.xml?modelid\u003d7856371\"\u003eТелефон Samsung Galaxy Y Pro Duos GT-B5512\u003c/a\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eQ. Где почитать о правилах, по которым будет проходить соревнование?\u003c/strong\u003e A. Соревнование будет проходить по правилам ACM-ICPC, \u003ca href\u003d\"http://codeforces.ru/blog/entry/79\"\u003eподробнее о которых тут\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ. Как обычно проходят соревнования на Codeforces?\u003c/strong\u003e A. Это детально описано в разделе \u003ca href\u003d\"http://codeforces.ru/help\"\u003e\u0026quot;Помощь\u0026quot;\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ. Будет ли это соревнование рейтинговым?\u003c/strong\u003e A. Нет, результаты этого раунда не будут влиять на рейтинг Codeforces.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ. Какие обязательные условия для участия в соревновании?\u003c/strong\u003e A. Нужно постоянно проживать на территории Республики Беларусь для того, чтобы иметь возможность приехать на награждение.\u003c/p\u003e\u003cp\u003eЕсли у Вас еще остались вопросы, задавайте их прямо в комментариях к этой записи или \u003ca href\u003d\"http://programming.techlabs.pro/\"\u003eна сайте соревнования\u003c/a\u003e, мы обязательно ответим на них.\u003c/p\u003e\u003cp\u003eУдачи!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e Регистрация будет открыта в течение всего контеста. Во время регистрации на соревнование выбирайте пункт \u0026quot;как индивидуальный участник\u0026quot;.\u003c/p\u003e\u003cp\u003eВсего будет предложено шесть задач различной сложности.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eСсылка на контест:\u003c/strong\u003e \u003ca href\u003d\"http://codeforces.ru/group/8QipmXbxtI/contests\"\u003ehttp://codeforces.ru/group/8QipmXbxtI/contests\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD 2.\u003c/strong\u003e Если вдруг вы не можете увидеть соревнование, проверьте, что в вашем интерфейсе Codeforces выставлен русский язык.\u003c/p\u003e\u003c/div\u003e","tags":["techlabs","соревнование","программирование"]}}