{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1510669066,"rating":225,"authorHandle":"kuviman","modificationTimeSeconds":1510792818,"id":55773,"title":"\u003cp\u003eRussian AI Cup 2017 — CodeWars\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHey everyone!\u003c/p\u003e\u003cp\u003eGood news — Russian AI Cup 2017 has started! This competition is being held for the sixth time, and this time, hopefully, we will make happy all the fans of the RTS game genre — you will be controlling 500 vehicles of 5 different types at once. The task is to destroy the opponent!\u003c/p\u003e\u003cp\u003eTry yourself in creating an artificial intelligence, it\u0027s simple and fun. Go to \u003ca href\u003d\"http://russianaicup.ru\"\u003eRussian AI Cup site\u003c/a\u003e and enter the battle. Good luck!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" Russian AI Cup \" src\u003d\"/predownloaded/4a/df/4adfe13a25f1b8a2e90e72f98d6c12f7783ce57e.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e  \u003c/p\u003e\u003ch3\u003eWhat is it?\u003c/h3\u003e\u003cp\u003e\u003cstrong\u003eRussian AI Cup\u003c/strong\u003e — largest annual artificial intelligence programming contest in Russia, and third open competition for talented IT-specialists that is part of Mail.Ru Group strategy of forming and developing competitive Russian IT-industry on a global scale.\u003c/p\u003e\u003cp\u003eFollowing programming languages are supported: C++, C#, Java, Pascal, Python 2, Python 3 и Ruby. Anyway, as previously, we are ready to support language packages, realized by the community.\u003c/p\u003e\u003cp\u003eWe welcome both beginners and professionals to the championship. No special skills are needed, just basic programming level is enough.\u003c/p\u003e\u003ch3\u003eWhen?\u003c/h3\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003eSandbox\u003c/strong\u003e: open for everyone starting on November 7 and finishing on December 24; first and fourth weeks will be beta-testing weeks, this time it is possible that the system is unstable, and significant changes in the rules can be made;\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eRound 1\u003c/strong\u003e: November 25 — November 26;\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eRound 2\u003c/strong\u003e: December 9 — December 10;\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eFinals\u003c/strong\u003e: December 16 — December 17.\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003eКогда?\u003c/h3\u003e \u003cul\u003e   \u003cli\u003e\u003cstrong\u003eПесочница\u003c/strong\u003e: с 7 ноября по 24 декабря открыта для всех желающих; первая и четвертая недели будут проходить в режиме бета-тестирования, в этот период возможны нестабильная работа системы и существенные изменения в правилах;\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eРаунд 1\u003c/strong\u003e: 25-26 ноября;\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eРаунд 2\u003c/strong\u003e: 9–10 декабря;\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eФинал\u003c/strong\u003e: 16–17 декабря.\u003c/li\u003e \u003c/ul\u003e\u003ch3\u003ePrizes\u003c/h3\u003e\u003cp\u003eBest strategies that made it to the Finals and took top places, as well as best players from the Sandbox, will receive prizes. Also, all participants of Round 2 will receive a T-shirt, and all finalists — a hoodie with contest symbolics.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" Prizes \" src\u003d\"/predownloaded/b7/a1/b7a1be349551884f2a858895783ef6f534b73c6b.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}