{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1524867333,"rating":15,"authorHandle":"duckladydinh","modificationTimeSeconds":1525211962,"id":59145,"title":"\u003cp\u003eAn uneasy problem with Arithmetic Sequences?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eUpdated\u003c/strong\u003e: Thank everyone for your helps, but it seems that I missed a certain condition of the problem, and my version maybe really just impossible to solve :v, the original problem with that condition is a thousand time easier than this and is straight-forward to CP coders like us (The original problem description was a bit confusing to me :\u0027( )\u003c/p\u003e\u003cp\u003eHi everyone,\u003c/p\u003e\u003cp\u003etoday, I am stuck with a problem. I hope you can help me with it. I think this is a very interesting problem and I am not even sure there exists a deterministic solution to it. The problem is as follows:\u003c/p\u003e\u003cp\u003e\u0026quot; Given n (n \u0026lt;\u003d 1000, but O(n^3) is also fine) distinct integers, group them into sets of at least 4 elements, and each set is an Arithmetic Sequences. \u0026quot;\u003c/p\u003e\u003cp\u003eExample: \u003c/p\u003e\u003cp\u003eInput: 1250, 3748, 6246, 8744, 2493, 4993, 7493, 9993, 2497, 4996, 7495, 9994, 2498, 4997, 7496, 9995, 2499, 4998, 7497, 9996\u003c/p\u003e\u003cp\u003eOutput: (1250, 3748, 6246, 8744), (2493, 4993, 7493, 9993), (2497, 4996, 7495, 9994), (2498, 4997, 7496, 9995), (2499, 4998, 7497, 9996)\u003c/p\u003e\u003cp\u003eIn this test, if you find the longest sequence first, then the rest will not form any valid sequence anymore.\u003c/p\u003e\u003cp\u003e(Assumption: For the given input, there always exists at least one solution that satisfies the constraints and no number is left)\u003c/p\u003e\u003cp\u003eI have spent hours working on this problem but unfortunately I cannot think of any ideas that will work well in general. What do you think?\u003c/p\u003e\u003cp\u003eThank you.\u003c/p\u003e\u003c/div\u003e","tags":[]}}