{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1419753730,"rating":12,"authorHandle":"_Angelika_","modificationTimeSeconds":1419772803,"id":15432,"title":"\u003cp\u003eЗимние сборы 1. Контест от 28.12\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eУважаемые участники! Я просматриваю DL и логи вижу. Уже есть двое которые пытаются сдавать задачи там. Давайте работать честно.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eЛичное мнение \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/kostya_by\" title\u003d\"Grandmaster kostya_by\"\u003ekostya_by\u003c/a\u003e по этому поводу:\u003c/p\u003e\u003cp\u003eРебята, мне вообще непонятная суть ваших нечестных действий. Этот контест же ничего не решает! Я понимаю, если бы вы тут боролись за место на респе или, хотя бы, решалось кто поедет на респу на верхних полках плацкарта, а кто на нижних. Но нет! Тут не решается вообще ничего! Это тренировка. Теперь я хочу, чтобы вы ответили себе на один вопрос: зачем вы сегодня сели писать тренировку? Чтобы потренироваться или чтобы получить 100 баллов по каждой задаче? Вам эти цели могут показаться схожими, но это не так. Тренировки пишут для того, чтобы на контестах все было гладко. Еще один вопрос, который я хочу, чтобы вы себе задали: а можно ли будет на респе или на области пользоваться дополнительными ресурсами или же только тем, что я сам напишу? Правильно, только тем, что я сам напишу. Зачем тогда вы отсылаете решения на другой ресурс с целью отладить/потестировать/\u0026quot;посмотреть что там 100\u0026quot;? А если на области возникнет необходимость отладить/потестировать/\u0026quot;посмотреть что там 100\u0026quot;? Что вы будете делать? Вам не кажется, что намного более полезным в данной ситуации является решение сесть и написать батник+гентест+лоб и потестировать все самим? Ведь на области именно так и придется делать! Почему бы не потренироваться так делать на тренировке, они ведь для этого и придуманы. \u003c/p\u003e\u003cp\u003eВ общем, подытожу: решение отсылать исходники на dl очень детское и глупое. При минимальном детальном рассмотрении вопроса выходит, что в этом нет никакого смысла. Вы, конечно, можете слать свои решения на dl, я не вижу смысла каким-то образом банить ваши действия, ибо сегодняшний контест ничего не решает. Просто я хочу, чтобы вы сами поняли, что то, что вы делаете, глупо и может вам потом аукнуться.\u003c/p\u003e\u003cp\u003eВсем здравствуйте!\u003c/p\u003e\u003cp\u003eНадеюсь трех дней отдыха было достаточно и все готовы поработать...\u003c/p\u003e\u003cp\u003eСегодняшние \u003ca href\u003d\"https://drive.google.com/file/d/0B2Qe9-6Ey2QLcUdsNWRpX2otUTg/view?usp\u003dsharing\"\u003eзадачи\u003c/a\u003e — это областной тур 20.. года.\u003c/p\u003e\u003cp\u003eПосле тура выложу разбор задач.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD 1.\u003c/strong\u003e eJudge работает. Если есть проблемы с доступом через хамачи, то резервный путь — TeamViewer VPN (только Windows). ID: \u003cstrong\u003e270 984 442\u003c/strong\u003e, PASS: \u003cstrong\u003eIloveprogramming!\u003c/strong\u003e Сервер будет доступен через него по адресу \u003ca href\u003d\"http://7.92.47.107\"\u003e7.92.47.107\u003c/a\u003e. Если кто-то не сможет достучаться — присылайте на почту (в этом случае именем файла должна быть ваша фамилия и номер задачи). \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD 2.\u003c/strong\u003e Контест завершён. Включено дорешивание.\u003c/p\u003e\u003c/div\u003e","tags":[]}}