{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1512227672,"rating":519,"authorHandle":"V--o_o--V","modificationTimeSeconds":1512231017,"id":56119,"title":"\u003cp\u003eRound 449 statements (warning: butthurt)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIf you don\u0027t wanna see some butthurt, skip this post.\u003c/p\u003e\u003cp\u003e1 December: I open main page of codeforces to see a picture of some anime girl taking half of my 1920x1080 screen. I got disgusted back than, but hatred for anime is my personal opinion, but IMO this picture was way too big to be on the main page of CF(it was the biggest one I saw on CF, if i remember correctly).\u003c/p\u003e\u003cp\u003e2 December: after nice Trial Round of NEERC I was looking forward to a CF round. I was not in my hometown and had internet which was LTE, but still was kind of laggy and slow. I was checking in in the hotel at the time of start of the round. \u003c/p\u003e\u003cp\u003eSo the round starts, problem A loads, and here we go. There is another f***g anime picture right in front of me (which loads slowly because of internet, and the statement isn\u0027t loading until the picture loads (it generally isn\u0027t that way though)). Name -\u0026gt; Picture -\u0026gt; Statement. At this point i instantly added some curse words in my template (luckily i decided not to compete, so those didn\u0027t make it in public), after that i went straight for problem E, since I couldn\u0027t code. \u0026quot;The statement cannot be displayed correctly\u0026quot;. Whatever. I open problem D. Another f****g anime picture. At this pointed I decided, fudge it i\u0027ll skip this round since I didn\u0027t feel that well anyway, and had no desire to solve problems of such an author.\u003c/p\u003e\u003cp\u003eOne more thing: \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/gritukan\" title\u003d\"International Grandmaster gritukan\"\u003egritukan\u003c/a\u003e is my teammate in ACM ICPC, so he saw my laptop\u0027s screen when I opened that statement, and he was really surprised. Probably he had no idea about the pictures(I don\u0027t know for sure because it\u0027s not very polite to talk to coordinator of CF about CF during the round).\u003c/p\u003e\u003cp\u003eTo sum things up, I do believe authors should have freedom to make almost any legend within bounds, probably should have freedom to decide which tests are pretests, and maybe something else. But in my opinion, this is too much. The legends have the right to exist, cause you can skip it, the dialogs at the top of the statement have the right to exist, because you automatically skip them, without thinking. But this is way too intrusive. What next? Flashing GIFS at the top of the statement? \u003c/p\u003e\u003cp\u003eI would want to say, that this is not a hate post, but, unfortunately, I can\u0027t.\u003c/p\u003e\u003c/div\u003e","tags":[]}}