{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1503609919,"rating":-7,"authorHandle":"mouse_wireless","modificationTimeSeconds":1503609919,"id":54033,"title":"\u003cp\u003eRequest for comprehensive list of ALL codeforce contest rulings\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI feel like there should be a comprehensive list somewhere with all the rules (about judging, submitting, hacking etc), something that describes the entire process of a contest with all cases that can occur. A \u0026quot;codeforces handbook\u0026quot; if you will.\u003c/p\u003e\u003cp\u003eStory time: I\u0027ve had a situation in the last contest I\u0027ve taken part in, in which I have solved the first 4 problems in the first hour of the contest. For the last minutes of the contest I was starting to get bored (I had absolutely no idea how to solve the last problem and I\u0027ve already been through all the submissions in my room for hacks). I started to modify my code for the 4th problem with different seeds and parameters (it was a randomized, heuristic solution, as was the official one) to see how it fared. I wanted to see how the new parameters would fare on the official tests, so I started to search google and codeforces blogs to see what happens if you re-submit after you\u0027ve already passed the pretests and no matter what search terms I used I couldn\u0027t find anything on the topic. Ultimately, I decided to submit since in pretty much every contest I\u0027ve taken part in if you\u0027ve got \u0026quot;Accepted\u0026quot; on one solution, the submissions after the \u0026quot;Accepted\u0026quot; do not matter towards the score. But lo and behold, there was a penalty! My first solution got \u0026quot;Skipped\u0026quot; and only the last one was evaluated, adding more than 1 hour of submission time and losing me 300-400 points. I was stunned, left to wonder why in the world this isn\u0027t documented anywhere on codeforces. Only after the fact did I managed to find something about it, by googling \u0026quot;Codeforces skipped submissions\u0026quot;. The whole situations seems kinda silly to me.\u003c/p\u003e\u003cp\u003eTo avoid situations like that in the future, maybe it wouldn\u0027t be bad to have a centralized handbook with all the rules (or maybe there is one and I am missing it?). I remember how confused I was about the whole \u0026quot;hacking\u0026quot; system as well when I started out (nowhere was it clearly explained what a \u0026quot;hack\u0026quot; was or the concept of rooms or locking problems).\u003c/p\u003e\u003c/div\u003e","tags":["#codeforces","rules"]}}