{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1458481005,"rating":150,"authorHandle":"csacademy","modificationTimeSeconds":1458674094,"id":43901,"title":"\u003cp\u003eBeta Round #3 — csacademy.com\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eWe are happy to announce that we\u0027re going to host a new contest at \u003ca href\u003d\"http://csacademy.com\"\u003ecsacademy.com\u003c/a\u003e. There were plenty of users who helped us by providing lots of feedback after the last round. We\u0027d like to help everybody for their support :)\u003c/p\u003e\u003cp\u003eOur \u003ca href\u003d\"https://csacademy.com/contest/beta-round-3/\"\u003eBeta Round #3\u003c/a\u003e will take place on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dBeta+Round+%233\u0026amp;iso\u003d20160322T17\u0026amp;p1\u003d1440\u0026amp;ah\u003d2\"\u003eTuesday, Mar/22/2016 17:00 (UTC)\u003c/a\u003e. If you want to take part in this round you need to \u003ca href\u003d\"https://csacademy.com/contest/beta-round-3/\"\u003eregister\u003c/a\u003e before the contest begins. Just like the previous round, the difficulty will be moderate (similar to a Codeforces Div. 2)\u003c/p\u003e\u003ch4\u003eContest format:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003eYou will have to solve \u003cstrong\u003e5\u003c/strong\u003e tasks in \u003cstrong\u003e2\u003c/strong\u003e hours.\u003c/li\u003e   \u003cli\u003eThere will be full feedback throughout the entire contest.\u003c/li\u003e   \u003cli\u003eTasks will not have partial scoring, so you need to pass all test cases for a solution to count (ACM-ICPC-style).\u003c/li\u003e   \u003cli\u003eTasks will have dynamic score. According to the number of users that solve a problem the score will vary between 100 and 1000.\u003c/li\u003e   \u003cli\u003eBesides the score, each user will also get a penalty that is going to be used as a tie breaker.\u003c/li\u003e \u003c/ul\u003e\u003ch4\u003eAbout the penalty system:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003eComputed using the following formula: the minute of the last accepted solution + the penalty for each solved task. The penalty for a solved task is equal to log2 (no_of_submissions) * 5.\u003c/li\u003e   \u003cli\u003eSolutions that don\u0027t compile or don\u0027t pass the example test cases are ignored.\u003c/li\u003e   \u003cli\u003eOnce you solve a task you can still resubmit. All the following solutions will be ignored for both the score and the penalty.\u003c/li\u003e \u003c/ul\u003e\u003ch4\u003ePlatform changes since Beta Round #2:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003ePersonalised source templates for when you open a new task (access them in your \u003ca href\u003d\"https://csacademy.com/accounts/settings/\"\u003eaccount settings\u003c/a\u003e, the worskspace tab)\u003c/li\u003e   \u003cli\u003eWorkspace UI clean-up (Compile/Run/etc buttons are grouped together)\u003c/li\u003e   \u003cli\u003eWorkspace settings persist when you load the workspace again and apply to all workspaces (font size, editor theme, etc)\u003c/li\u003e   \u003cli\u003eClean-up some g++ compiler warnings (to ignore scanf return values)\u003c/li\u003e   \u003cli\u003eStderr output was not being updated correctly sometimes\u003c/li\u003e   \u003cli\u003eBackspace key was not working in some circumstances\u003c/li\u003e   \u003cli\u003eSlight performance tweaks and some other small bug fixes\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eUnfortunately we didn\u0027t have time to fix the browser compatibility issues, so we recommend using an updated version of Google Chrome. If you find any bugs please email us at \u003ca href\u003d\"mailto:contact@csacademy.com\"\u003econtact@csacademy.com\u003c/a\u003e\u003c/p\u003e\u003cp\u003eDon\u0027t forget to like us on \u003ca href\u003d\"https://www.facebook.com/csacademy\"\u003eFacebook\u003c/a\u003e, \u003ca href\u003d\"https://vk.com/realcsacademy\"\u003eVK\u003c/a\u003e and follow us on \u003ca href\u003d\"https://twitter.com/realCSAcademy\"\u003eTwitter\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEDIT\u003c/strong\u003e: The \u003ca href\u003d\"https://csacademy.com/blog/2016/03/22/beta-round-3/\"\u003eeditorial\u003c/a\u003e is ready. Congratulations to all the users and we hope you had a great time. We are waiting for you at Beta Round #4.\u003c/p\u003e\u003c/div\u003e","tags":[]}}