{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1469452911,"rating":-13,"authorHandle":"singh1495","modificationTimeSeconds":1469476356,"id":46263,"title":"\u003cp\u003eneed help\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003efor this problem You will get 2 points for solving this problem.\u003c/p\u003e\u003cp\u003eYou are given a rooted tree. The tree is not necessarily binary. The tree contains N nodes, labeled 1 to N. You are given the tree in the form of an array P[1..N] of size N. P[i] denotes label of the parent of node labeled i. For clarity, you may assume that the tree satisfies the following conditions.\u003c/p\u003e\u003cp\u003eThe root of the tree is labeled 1. Hence P[1] is set to 0. The parent of node T will always have a label less than T. Hence P[i] \u0026lt; i will always be true. All nodes contain a mutable value (or, more simply, a variable), which is initially set to 0. You are asked to perform several operations of the following type\u003c/p\u003e\u003cp\u003eADD X Y: add Y to the value at node X.\u003c/p\u003e\u003cp\u003eADDUP X Y: add Y to the value at node X. Then, add Y to the value at P[X] (i.e. the parent of X). The, add Y to the value at P[P[X]] (i.e. the parent of P[X]).. and so on, till you add Y to the value at root.\u003c/p\u003e\u003cp\u003eAfter you have performed all the given operations, you are asked to answer several queries of the following type\u003c/p\u003e\u003cp\u003eVAL X: print the value at node X.\u003c/p\u003e\u003cp\u003eVALTREE X: print the sum of values at all nodes in the subtree rooted at X (including X).\u003c/p\u003e\u003cp\u003eInput\u003c/p\u003e\u003cp\u003eThe first line of input contains the number T, the number of test cases. Then follows the description of T test cases. The first line of each test case contains the numbers N, M and Q respectively (separated by single space character). N depicts the number of nodes. M depicts the number of operations you must perform. Q depicts the number of queries you must answer.\u003c/p\u003e\u003cp\u003eThe next N lines contain a number each, depicting the array P[1..N]. Of course the number on the first such line is always 0.\u003c/p\u003e\u003cp\u003eThe next M lines contain description of the respective operation. An operation will be either \u0026quot;ADD X Y\u0026quot; or \u0026quot;ADDUP X Y\u0026quot; (without the quotes). Please refer to the problem statement and sample I/O explanation for clarity on the meaning of the operations.\u003c/p\u003e\u003cp\u003eAfter the operations, the next Q lines contain description of the queries. A query will be either \u0026quot;VAL X\u0026quot; or \u0026quot;VALTREE X\u0026quot; (without the quotes). Please refer to the problem statement and sample I/O explanation for clarity on the meaning of the queries.\u003c/p\u003e\u003cp\u003eOutput\u003c/p\u003e\u003cp\u003ePrint the result of each query on a line by itself. Since the answer for some queries may be too large, please print the result modulo 1,000,000,007. Do not print any blank lines between test cases.\u003c/p\u003e\u003cp\u003eConstraints\u003c/p\u003e\u003cp\u003e1 ≤ T ≤ 10 1 ≤ N ≤ 50000 1 ≤ M ≤ 50000 1 ≤ Q ≤ 50000 1 ≤ X ≤ N 1 ≤ Y ≤ 50000\u003c/p\u003e\u003cp\u003eThe input file will be smaller than 2 MB. Sample Input\u003c/p\u003e\u003cp\u003e2 5 5 3 0 1 1 1 3 ADD 1 10 ADD 2 20 ADD 3 30 ADD 4 40 ADDUP 5 50 VAL 3 VALTREE 3 VALTREE 1 7 4 5 0 1 2 2 2 1 2 ADD 6 76 ADDUP 1 49 ADD 4 48 ADDUP 2 59 VALTREE 1 VALTREE 5 VAL 5 VALTREE 2 VAL 2\u003c/p\u003e\u003cp\u003eSample Output\u003c/p\u003e\u003cp\u003e80 130 250 291 0 0 107 59\u003c/p\u003e\u003cp\u003ei write this code \u003ca href\u003d\"https://ideone.com/H0fZZR\"\u003ehttps://ideone.com/H0fZZR\u003c/a\u003e\u003c/p\u003e\u003cp\u003ebut this gives me WA plz help me that where i was wrong plz ............... thanx in advance\u003c/p\u003e\u003c/div\u003e","tags":[]}}