{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1514593384,"rating":1058,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1514593524,"id":56732,"title":"\u003cp\u003eThe holidays comes to us! Gifts!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/d5/e7/d5e7e7554e5715c8088274efd5b40dee24e5cc18.png\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eDo you already have a New Year\u0027s mood?\u003c/p\u003e\u003cp\u003eAnd we have traditional gifts!\u003c/p\u003e\u003ch4\u003eChange handle feature\u003c/h4\u003e\u003cp\u003eHurry! Only until the 10th of January, you can change your handle (\u003cb\u003ebut only once\u003c/b\u003e)! Note that it will be possible to roll back the changes or change the handle again only \u003cem\u003eafter a year\u003c/em\u003e. Be careful what you wish for.\u003c/p\u003e\u003cp\u003eYou can change your handle to the new one which wasn\u0027t used before by anybody or which was used by you before. The links to a profile page with old handle would automatically redirect to the actual profile.\u003c/p\u003e\u003cp\u003eThis year we have an improvement. If you took part in at least 10 rounds you can request handle of an \u003cem\u003einactive\u003c/em\u003e participant. It means that the participant should have a period of activity on Codeforces of at most 30 days, this period should be in 2012 or earlier. The inactive participant can’t have posted comments, messages and so on. It can’t take part in more than 2 contests. It will be automatically renamed and informed by email. If you can’t change handle to others, it means that some requirement doesn’t meet. Please do not ask me to do something with it. I’m not Santa Claus.\u003c/p\u003e\u003cp\u003eTalking about handles I always reminisce the following story. Once a user wrote me the message: \u0026quot;Please change my handle from I_love_Valya to I_love_Sveta, as I no longer love Valya ...\u0026quot;\u003c/p\u003e\u003ch4\u003eNew Year\u0027s masquerade of colors and ranks\u003c/h4\u003e\u003cp\u003eTraditional magical tab has appeared in the profile setting. Happy New Year!\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","happy new year","2018"]}}