{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1402304071,"rating":115,"authorHandle":"mirob","modificationTimeSeconds":1402326233,"id":12622,"title":"\u003cp\u003ePsychology for programmers I\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI always wanted to write article about what I have learned in psychology, and how it relates to programming. It was hard to come up with single article, so I decided that I will write multiple unrelated blogs.\u003c/p\u003e\u003cp\u003eThe first post is about \u003cstrong\u003eRating Anxiety\u003c/strong\u003e, there have been no scientific studies about this phenomena to my knowledge, but from self-reports of competition programmers, I conclude it exists, and I think a lot coders develop it to certain degree and certain peronalities are more prone for the developement.\u003c/p\u003e\u003cp\u003eRating anxiety(RA) is when you feel bad about losing rating(TopCoder or CodeForces) and as a consequence of that you either \u003cstrong\u003eskip competition\u003c/strong\u003e or are nervous and under pressure because of that. In practice this pressure leads to poor performance(thrugh means I will describe in other post), and individual might gain better results if he gets rid of rating anxiety. If your in-contest and ot-contest performance differs somehow, it might be sign of RA. If you feel intese joy on rating increase, means you are prone to it.\u003c/p\u003e\u003cp\u003eYou might have it when you think rating is important. Or you feel shame for low rating. Pathological effects are if you are basing your self-worth on high rating. Or you need self-assurance based external validation of how good you are. To prevent that, you should build following belief system: Your opinions are of equal values despite rating, your intelligence is not confirmed by rating. High rating is pseudo-achievement. There are 7 bilion people unaware of your rating, or do not care about it. You do not have higher value, or should be treated differently if you have high rating. Hight rating will not grant you any success.\u003c/p\u003e\u003cp\u003eWhat I am not saying is that RA is the only trigger for stress. Neither I am not sayin that rating is bad, or that you should not feel good when your ratig is high. \u003cstrong\u003eOnly i am saying that it is possible to get rid of RA\u003c/strong\u003e. \u003c/p\u003e\u003cp\u003eIt is basically easy to get rid of RA, \u003cstrong\u003eit just suffices admiting that it limits you\u003c/strong\u003e. \u003c/p\u003e\u003cp\u003eI think it is good idea to try following way, which might possibly help. Good way(with benefits, but takes a lot of time) is to participate in multitude of programming competition portals (TopCoder, Codeforces, HackerRank, CodeChef) and by having so many ratings and contests done you stop to have it.\u003c/p\u003e\u003cp\u003eOther way is not looking on your rating on web page and not thinking on your rating ever. I thinkg following this deceptive logic based statemnt might give you motivation. It is widely accepted phenomena, that losing certain amount of money feels five times worse than gaining the same amount. So given that your rating oscilates around certain value, amount of increases is equal to amount of decreases, so there will be 5 times more nagative emotion than positive. \u003c/p\u003e\u003cp\u003eUnfortunatelly there are no results or statistic to conclusion, I can only say that I had rating anxiety in past and now I do not think I have it.\u003c/p\u003e\u003cp\u003eI cannot resist to not put here my famous quote at the end: \u0026quot;Ultimate developement of narcissist is when he realizes that he must get rid of narcissistic features to become perfect\u0026quot;.\u003c/p\u003e\u003c/div\u003e","tags":["psychology","stress","rating"]}}