{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1490300810,"rating":116,"authorHandle":"geniucos","modificationTimeSeconds":1491820911,"id":51171,"title":"\u003cp\u003eInvitation to new OI style contest Info(1) Cup\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003eI\u0027m writing this entry to invite you all to take part in \u003ca href\u003d\"http://info1cup.com/\"\u003ethe first edition of Info (1) Cup contest\u003c/a\u003e. It is an individual contest with algorithmic tasks and we will accept only C++ sources. The contest itself has 2 parts, both of which held online.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eYou can still take part in the online mirror in any frame of 5 hours before \u003ca href\u003d\"https://www.timeanddate.com/countdown/generic?iso\u003d20170412T15\u0026amp;p0\u003d5121\u0026amp;msg\u003dinfO%281%29+Cup+International+Round+-+Online+Mirror+END\u0026amp;font\u003dcursive\u0026amp;csz\u003d1\"\u003etime\u003c/a\u003e. We invite you all to participate. The tasks should be challenging for everyone The \u003ca href\u003d\"http://open.info1cup.com:8890/Ranking.html\"\u003elive scoreboard\u003c/a\u003e of the online mirror is on.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003ePS: As in all the other contests that have online mirrors, I kindly ask you not to discuss the tasks until all the rounds and their online mirrors end. After that, on the official site, you\u0027ll find the editorials of the problems.\u003c/p\u003e\u003cp\u003eThe first one consists of a national contest in which only invited Romanians can take part and which should be easier. \u003cs\u003eWe haven\u0027t decided yet whether we\u0027ll host an online mirror of it or not and I\u0027ll update the post later with this kind of information.\u003c/s\u003e \u003cstrong\u003eWe will host an online mirror of round 1 too. We invite you all to take part. We assess the difficulty to be similar to that of a div2 round or even a little lower, so if you are div1 we strongly advise you not to take part in this round, but rather in the second contest described below\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe second one is the international contest that I can assure you anyone can take part in. However, as we want the contest to be as similar as possible to international OIs (such as BOI, or CEOI), we want just participants from the official teams of different countries to sign up at the official version. We\u0027ll also have an unofficial second contest, similar to an online mirror which you can take in any 5-hours frame for a couple of days after the contest (usaco system). The official round will have a fixed \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dInfo%281%29+Cup+Round+2+Official\u0026amp;iso\u003d20170409T10\u0026amp;p1\u003d49\u0026amp;ah\u003d5\"\u003eframe\u003c/a\u003e . If you consider the time frame good for your country and the country is not listed below yet, I kindly ask you to PM me with information about how to contact any person that may be considered to be in charge with the selection of your country\u0027s teams for international competitions to give them the link to the official registration form. Ohh and about the unofficial registration, you\u0027ll be able to make an account soon using the official site \u003cstrong\u003e(LE: Now you can register for the online mirror)\u003c/strong\u003e. The contest will be full-feedback and will use CMS, 5-hours long with 4 problems with all kinds of difficulty level.\u003c/p\u003e\u003cp\u003eAlso, about the prizes, we\u0027ll award medals and certificates to the winners of the official round,\u003c/p\u003e\u003cp\u003eOhh and forgot to mention the scientific committee: I\u0027m one of the members together with \u003ca href\u003d\"//codeforces.com/profile/AlexandruVlad\"\u003eAlex Niculae\u003c/a\u003e and \u003ca href\u003d\"//codeforces.com/profile/Tudor\"\u003eCostin Tudor\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe official round 2 is now over\u003c/strong\u003e. Congratulations to all the participants and special congratulations for those who got a maximum score: \u003ca href\u003d\"//codeforces.com/profile/Reyna\"\u003eMahmoudian Bidgoli Arash\u003c/a\u003e (who finished after just 3 hours and 48 minutes), \u003ca href\u003d\"//codeforces.com/profile/atatomir\"\u003eAlex Tatomir\u003c/a\u003e and \u003ca href\u003d\"//codeforces.com/profile/Enchom\"\u003eMishinev Encho\u003c/a\u003e . I hope you enjoyed the contest. Also, we\u0027re sorry that, at the 4th problem, we had a limit a little too large which let solutions intended to get 78 points to get a full score. We\u0027d like to address special congratulations to the only contestant that solved the problem in the intended way (that we find pretty tricky and nice and will be explained in the editorial after the ending of the online mirror), \u003ca href\u003d\"//codeforces.com/profile/Narenji58\"\u003eHossein Mohammad Nematollahi\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eWe kindly ask you not to discuss the solutions until the end of the online mirror. However, we\u0027d be happy to receive any kind of feedback regarding the competition so that we can improve it the next year, doesnt\u0027t matter whether it\u0027s positive feedback or not.\u003c/p\u003e\u003c/div\u003e","tags":["contest","invitation","oi"]}}