{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1528365131,"rating":633,"authorHandle":"fcspartakm","modificationTimeSeconds":1528369961,"id":59886,"title":"\u003cp\u003ePolygon Improvements (May — June 2018)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces. Below you can see the improvements in the system Polygon.\u003c/p\u003e\u003cp\u003eA lot of work has been done to simplify the preparation of school tasks, which use groups and points for tests. In the General Information tab, you can enable the points option for each test. This option is enabled points for the whole problem, that is, for tests from all testsets. Let me remind you that test groups can be enabled for each testset separately on the Tests tab.\u003c/p\u003e\u003ch4\u003ePoints for groups, points policies, dependencies\u003c/h4\u003e\u003cp\u003ePoints for the test, as well as groups, can be entered in the table with the list of tests, and also specify them when creating a new test. If the group for the test appears for the first time, it will be automatically added to the list of available groups. This list is presented in the table.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/93/c4/93c45f1fdffd7aa193288461c8e740b62329a12f.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eHere the problem developer can specify a policy for calculating points for the group, and also specify from which groups the current group depends on. The are two types of the points policies. The first type of the points policy is \u003ccode\u003eEACH_TEST\u003c/code\u003e, in which case points will be added for each passed test from this group. The second type of the points policy is \u003ccode\u003eCOMPLETE_GROUP\u003c/code\u003e, in which case the points for the group will be added only if all tests from this group have been passed.\u003c/p\u003e\u003cp\u003eAlso, you can now add dependencies on other groups for each group. If group A depends on group B, then regardless of which of the tests of group A were passed, you will get 0 points for all tests of group A if at least one of test of group B is not passed.\u003c/p\u003e\u003ch4\u003eSolution tags by groups and testsets\u003c/h4\u003e\u003cp\u003eIn Solutions tab now you can specify a tag for each solution for each existing testset and for each existing group. The interface for working with tags is presented below.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/ac/d3/acd3dd4b5f5b7e2c1419c66afb145a3ec0d28a85.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch4\u003eUpdates in Invocations\u003c/h4\u003e\u003cp\u003eWhen the invocation is started, all the information about groups, points, dependencies and tag solutions are now taken into account. The points for each group will be calculated according to the group\u0027s points policy, as well as according to the groups on which the current group depends. If the solution violates at least one of its tags, the invocation will be highlighted in red, and the information about violation tags is available in detailed invocation report.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/0b/f4/0bf4099d51becbf6f5fb99eb5878090f815b0bbe.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch4\u003eUpdates in Packages\u003c/h4\u003e\u003cp\u003eAll information about test groups, points and solution tags added to the problem descriptor on the stage of building packages. \u003ca href\u003d\"https://assets.codeforces.com/files/polygon/problem.xml\"\u003eHere\u003c/a\u003e you can find the example of the descriptor of the school problem.\u003c/p\u003e\u003cp\u003eThank you for attention! We hope that the described improvements will be useful to you.\u003c/p\u003e\u003c/div\u003e","tags":["polygon","2018","improvement"]}}