{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1431493457,"rating":152,"authorHandle":"poikniok","modificationTimeSeconds":1431493457,"id":17858,"title":"\u003cp\u003eIn Between as a Purple Competitor\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI am writing this in the hopes that Codeforces will seriously reconsider allowing purple coders into Division 2 contests. My personal reason for this is that the problem standards in Division 1 contests are quite high, and as a purple coder in the last few Div 1 contests I have not been able to solve any of the problems, and therefore I end up effectively not participating. Having read a few discussions that regard this as almost “cheating” in some way is also frustrating, because is one supposed to submit a known incorrect solution or what? Basically as a blue coder I was perfectly happy, because I could compete in Div 2 contests, and solve the A and B problems and have good shot at the C. However now having moved up to Div 1 has made my experience far less enjoyable, as in the more difficult contests I am simply unable to solve anything, and in average contests I can only hope to solve the 1st problem at best. Now of course the optimal solution to my problem is simply more practice until I am able to solve Div 1 A’s and B’s, and effectively move up to yellow, however this is not a true solution. Basically I feel that Codeforces has a gap into which purple coders fall right now, and it is rather unfortunate. I really do not see any downsides to purple individuals being in Div 2, because it is quite rare I think for any people around my level to even look at the Div 1 D and E problems. And while maybe for grandmasters to solve the Div2 A’s and B’s is insulting because of the simplicity of the problems, as a purple competitor I do not feel this way at all. Particularly looking at the upcoming contests right now and seeing 2 Div2 contests upcoming is rather frustrating, because I will only be able to compete out of contest, without affecting my rating, and because I know when a Div1 contest rolls around in two or three weeks there is a \u0026gt;30% chance I will not be able to solve anything, and will effectively sit out the contest. I realize that such a change should not be considered lightly, given that this has been the way things have been for 5 years almost now, and Codeforces popularity has rightly skyrocketed. However I think that there are strong reasons for this change that have become clear now, one of which is I feel rating inflation, along the lines that being top 200 in Div2 is enough to get bumped up to Div1, and also as competitive programming advances Div1 problems becoming harder. This combination I feel has put many people in situation where they move up to Div1 without having the tools at all to effectively compete. I thank anybody who read this, and also look forward to any comments and counterarguments that people have. \u003c/p\u003e\u003c/div\u003e","tags":[]}}