{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1437405515,"rating":216,"authorHandle":"I_love_natalia","modificationTimeSeconds":1437405974,"id":19329,"title":"\u003cp\u003eСпортивное программирование и тоталитарные секты\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПо материалам \u003ca href\u003d\"http://www.aif.ru/dontknows/kak_raspoznat_sektu_10_priznakov_kotorye_dolzhny_nastorozhit\"\u003eодной статьи\u003c/a\u003e (текст полностью скопирован). Шутка, конечно, но повод задуматься.\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eМаркетинг. Сектанты стараются привлечь как можно больше адептов, поэтому участники секты обычно активно занимаются пропагандой своего учения. Должны насторожить назойливые звонки, письма и сообщения с предложениями бесплатно посетить \u003cs\u003eкружок по программированию в вузе\u003c/s\u003e семинар по духовному росту или пробуждению. Благотворительные концерты, фестивали для детей, психологические тренинги тоже зачастую скрывают псевдорелигиозные течения.\u003cbr /\u003e КСТАТИ Существует специальный психологический приём «бутерброд»: человека окружают особым вниманием и заботой, двое \u003cs\u003eтиммейтов\u003c/s\u003e сектантов постоянно держат всестороннюю связь с вербуемым, чтобы не допустить его критических мыслей в отношении учения.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eИерархия и двойное учение. Обычно инициаторы секты маскируют своё учение под \u003cs\u003eпрограммирование\u003c/s\u003e общепризнанные ценности. Всей правды об \u003cs\u003eнаписании алгоритма Дейкстры пятьдесят раз\u003c/s\u003e истинных идеалах сектантов новичкам никогда не рассказывают. Зачастую, чтобы стать «посвящённым» в дела общины, нужно \u003cs\u003eиметь высокий рейтинг\u003c/s\u003e занимать высокое место в иерархии. Иерархичность – одно из главных свойств построения религиозной секты. Такое устройство позволяет держать всю организацию под строгим контролем, а также стимулировать участников проявлять активность, чтобы добраться до следующей ступени.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВзносы. Большинство сект существует на средства её приверженцев. На каком-то определённом этапе от участника секты начинают требовать взносы, пожертвования и вклады в общее дело. Иногда секты с самого начала информируют о платности своих семинаров и тренингов, но зачастую о том, что придётся платить, новичок узнаёт уже после «посвящения» в свои ряды. Для того чтобы распоряжаться средствами и имуществом своих приверженцев, сектанты могут использовать различные методы подавления сознания, гипноза и психологического давления, вплоть до угроз жизни и здоровью.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eНепогрешимый лидер. Сектантские учения обычно претендуют на уникальность и неоспоримость. Более того, у течения есть \u003cs\u003eвыберите любого сами\u003c/s\u003e лидер, из биографии которого известны лишь те отдельные факты, которые подтверждают его «священность». Все знания, пришедшие к «верховному учителю», обычно получены \u003cs\u003eблагодаря природному таланту\u003c/s\u003e сверхъестественным путём – через общение с духами, природой или инопланетным разумом. Его уровень «просветления» недостижим для последователей, а приказы не обсуждаются. Это своеобразный «диктатор», а подчинение ему по иерархическим ступеням носит тоталитарный характер. Даже если на начальных этапах новичкам кажется, что участие носит добровольный и демократичный характер, на самом деле в структуре всё строго регламентировано.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПодавление рационального сознания. Так или иначе секты обращаются к эмоциональной (внерациональной) стороне мышления человека. Чтобы он не мог разумно обдумать предлагаемые ему постулаты, используется так называемый «эффект присутствия», когда человека стараются полностью и постоянно держать в поле зрения. Часто применяются различные способы программирования сознания, внушаются те или иные установки и убеждения. В рядах сектантов всегда есть хорошие \u003cs\u003eтренеры\u003c/s\u003e психологи, которые умеют направить «учеников» по заданной траектории мышления. Некоторые секты не гнушаются применять даже наркотические вещества, преподносимые в качестве лекарств, снадобий или как часть ритуальных трапез.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eКниги и собрания. Чтобы новичок проникся духом религиозного общества, его снабжают \u003cs\u003eссылкой на Codeforces\u003c/s\u003e всевозможными информационными материалами, будь то книги, диски, фильмы, буклеты или прочее. Его приглашают \u003cs\u003eв ЦОПП\u003c/s\u003e на собрания сектантов, в ходе которых происходят «чудеса», доказывающие праведность их верований. Собрания и встречи участников секты – обязательная процедура для новеньких. В зависимости от характера секты, эти встречи могут быть как \u003cs\u003eнебольшими тренировками\u003c/s\u003e «камерными» (когда участников мало, или даже тет-а-тет), а могут быть и \u003cs\u003eполноценными тренировочными сборами\u003c/s\u003e массовыми, чтобы адепт понял, как много людей осознали «правильность» данного учения.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПротивопоставление миру. Участникам секты постоянно внушается некая «элитарность» их положения среди остальных людей. Как правило, они «будут спасены» или смогут достичь «невероятных высот \u003cs\u003eпрограммирования\u003c/s\u003e сознания», или даже «спасти заблудшее человечество, когда придёт время». Главный подтекст – адепты секты являются «избранными людьми» среди всех остальных. Окружающих, по мнению сектантов, необходимо жалеть и всячески способствовать тому, чтобы они, так же как и члены секты, «обрели смысл жизни». Адептам предписывается противопоставлять себя всем остальным, «совершенствоваться» и отказаться от внешних ценностей в угоду внутренних. Под внутренними могут пониматься духовное развитие, телесное самосовершенствование или же \u003cs\u003eумение решать задачи\u003c/s\u003e внутриобщинные идеалы, которым нужно следовать. ВАЖНО Сектанты стараются спровоцировать новичка на поступки, ставящие его вне общественных рамок, чтобы ещё больше обособить его от внешнего мира.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eАктивность. Человек, пришедший в секту, не может появляться там время от времени. Свободное посещение означает непостоянный контроль, поэтому всё свободное время адептов должно быть занято. Человека должны вырвать из привычного круга общения, изменить его поведение и подстроить его под жизненный уклад секты. Его побуждают активно \u003cs\u003eувеличивать вклад\u003c/s\u003e действовать на благо секты, искать новых участников или проходить какие-то курсы, ездить в «паломнические» поездки, заниматься с «учителями» или помогать другим «новичкам». Жертвуя своей старой жизнью, временем, средствами и здоровьем, адепты прочно привязываются к самой секте и не мыслят себя вне её.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eОбщая цель и обособление от внешнего мира. Не все, но многие, особенно радикальные, сектантские учения имеют конкретную конечную цель своего существования. Это может быть Апокалипсис и соответственно спасение своей души, может быть «точка просветления», завоевание \u003cs\u003eмедали на финале\u003c/s\u003e власти или материальных ценностей или даже месть. В документах секты часто можно встретить чуть ли не \u003cs\u003eсм. пост Ферлона\u003c/s\u003e поэтапный план достижения поставленной цели. Большинство проблем, существующих в мире, согласно учению, можно решить именно после достижения конечной цели т. н. братства или общины. Общая цель объединяет членов секты и отделяет её как структуру от остального внешнего мира.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eОпознавательные символы, \u003cs\u003eфутболки\u003c/s\u003e униформа, знаки отличия. Членам секты важно отличить «своих» и «чужих». Для этого придумываются специальные символы, которые могут наноситься в качестве татуировок в незаметных местах тела или в качестве амулетов прятаться под одеждой. Может использоваться специальный «язык», понятный лишь «посвящённым», невербальные знаки. Участники могут носить какую-то специфическую деталь одежды, особую причёску, украшение. Всё это направлено на то, чтобы человек, даже находясь вне стен секты, чувствовал свою связь с ней.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eЧто делать, если ваш знакомый \u003cs\u003eувлекся СП\u003c/s\u003e попал в секту?\u003c/p\u003e\u003cp\u003eВ секты обычно попадают люди с неустойчивой психикой и те, кто находится на жизненном перепутье. Жертвами становятся те, кто подсознательно чувствует себя одиноким и неуверенным в себе. На этом как раз и играют сектанты, навязывая человеку свою поддержку.\u003c/p\u003e\u003cp\u003eРаспознать, что человек из вашего окружения \u003cs\u003eстал заниматься олимпиадами\u003c/s\u003e попал в секту, можно как по косвенным, так и по прямым признакам. Иногда он может прямо признаться, что нашёл \u003cs\u003ecodeforces\u003c/s\u003e «замечательное место», где \u003cs\u003eучат программировать\u003c/s\u003e всем «помогают». Иногда человек становится сам на себя не похож – подолгу пропадает \u003cs\u003eв архивах задач\u003c/s\u003e неизвестно где, находится в неестественно приподнятом настроении и заявляет, что он \u003cs\u003eстал фиолетовым\u003c/s\u003e нашёл «смысл жизни», использует непонятные выражения и носит \u003cs\u003eпризовые футболки\u003c/s\u003e символическую атрибутику.\u003c/p\u003e\u003cp\u003eПомочь ему можно и нужно. \u003cstrong\u003eКак?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":["разрыв шаблона","самарские тролли"]}}