{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1482599654,"rating":-8,"authorHandle":"szawinis","modificationTimeSeconds":1482599978,"id":49297,"title":"\u003cp\u003eMy terrible experience with freopen()\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eSo, just a few hours ago, we finished a contest on a Thai site, namely \u003ca href\u003d\"http://codecube.in.th\"\u003eCodecube\u003c/a\u003e. The round consisted of 6 problems to solve in 3 hours. I was feeling confident at first ACing two problems in 15 minutes. Then came the third problem, which was a typical two pointers + data structures. I was almost certain I could solve the problem, and started to code the solution. Many minutes passed by, and I finally got the solution. I submitted it, and got a WA slapped on my face. So, I simply moved on to the fourth problem and ACed it, because finding bugs is time consuming. I later returned to the third problem, and tried finding the bug for almost an hour with no luck, only to find out that the only line I messed up on was: \u003ccode\u003efreopen(\u0026quot;data.txt\u0026quot;, \u0026quot;r\u0026quot;, stdin);\u003c/code\u003e, which I forgot to uncomment. I later submitted after the contest and got AC just with that line commented out. Absolutely disappointing.\u003c/p\u003e\u003cp\u003eAs many of us know, the freopen command is used to redirect stdio to file IO. This is particularly useful when testing your program on a local machine because you can avoid copying and pasting the test data every time you want to debug. However, one of the problems I have experienced when using it is I forget to uncomment it out when submitting. This is a huge problem, especially on CF where many points are deducted for resubmission. I don\u0027t know if it\u0027s bad luck, but this has happened to me several times already. For anyone who is experiencing the same problem, I think the solution here is simply to write comments to remind yourself. Has this ever happened to any of you guys? Or is it just me being awfully stupid?\u003c/p\u003e\u003c/div\u003e","tags":[]}}