{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1501588264,"rating":153,"authorHandle":"ilyakor","modificationTimeSeconds":1501704735,"id":53603,"title":"\u003cp\u003eCodeforces contest results and Data Analysis\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003eIntroduction\u003c/h1\u003e\u003cp\u003eIn the recent \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Легендарный гроссмейстер tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e\u0027s \u003ca href\u003d\"//codeforces.com/blog/entry/53457\"\u003eblogpost\u003c/a\u003e about a new strategy for some types of contests, there was \u003ca href\u003d\"//codeforces.com/blog/entry/53457?#comment-375339\"\u003ean interesting comment\u003c/a\u003e from \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ftiasch\" title\u003d\"Международный гроссмейстер ftiasch\"\u003eftiasch\u003c/a\u003e. Apparently, some participants try to artificially boost their rating with the following strategy: solve problem C, if it goes fast and nice — submit and continue with the contest, otherwise don\u0027t submit anything. The assumption is, other problems in the contest are created by the same author, so if one performs good on problem C, they are more likely to perform good on other problems.\u003c/p\u003e\u003cp\u003eIn the comment thread, some people expressed doubts about this strategy. Reading their comments, I wondered: is there any point in discussing this with groundless arguments, when there is large volume of historical data of contest results, and we can just analyse them to understand if the strategy really works. Luckily, Codeforces even provides \u003ca href\u003d\"//codeforces.com/api/help\"\u003eAPI\u003c/a\u003e, so there is no need to implement custom scrapers.\u003c/p\u003e\u003ch1\u003eCollecting and cleaning up data\u003c/h1\u003e\u003cp\u003eFor the dataset, I\u0027ve used all the contests with CF rules (it doesn\u0027t make sense to evaluate the strategy on other rulesets). Even among CF-rule contests, there is a big variety, in particular, sometimes there are more than 5 problems. For the sake of the analysis, I\u0027ve truncated all the problems to the standard \u0026quot;A-B-C-D-E\u0026quot; format (discarding FGH when they are present). Also, I\u0027ve removed from the standings all the users with 0 points, to reduce noise.\u003c/p\u003e\u003cp\u003eNext question is, over which users to compute statistics. It is very likely that things work differently for Div2 users than for Div1 ones. Also, orange users are likely to have more noisy and inconsistent results than red and nutella ones. That\u0027s why I restricted stats computation \u003cstrong\u003eonly to users with rating \u0026gt;\u003d 2400\u003c/strong\u003e at the time of scraping (note though that all users are considered when computing contest-level stats).\u003c/p\u003e\u003ch1\u003eVerifying if the strategy works\u003c/h1\u003e\u003ch2\u003eFirst look at the data\u003c/h2\u003e\u003cp\u003eLet\u0027s look at the scraped dataset. We have 695 contests (many of those are Div2 though, so they don\u0027t affect our stats). We have 107975 total users, but only 383 of them are red.\u003c/p\u003e\u003cp\u003eLet\u0027s see how red coders perform on different problems. First, what are the success rates for each problem? Here is the data (95%-conf intervals are printed):\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eA \u003c/th\u003e       \u003cth\u003eB \u003c/th\u003e       \u003cth\u003eC \u003c/th\u003e       \u003cth\u003eD \u003c/th\u003e       \u003cth\u003eE \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e0.91 ± 0.00 \u003c/td\u003e       \u003ctd\u003e0.80 ± 0.01 \u003c/td\u003e       \u003ctd\u003e0.59 ± 0.01 \u003c/td\u003e       \u003ctd\u003e0.35 ± 0.01 \u003c/td\u003e       \u003ctd\u003e0.15 ± 0.00 \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eAs we can see, the rates are even monotonic (so the popular claim \u0026quot;E is much easier than D!11\u0026quot; isn\u0027t true \u003cem\u003eon average\u003c/em\u003e). What other stats are there besides success rates? An interesting one is how often a user\u0027s solution places among the top solutions in the contest (e.g. by score). The data looks as follows (with \u0026quot;top\u0026quot; defined as top-10%):\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eA \u003c/th\u003e       \u003cth\u003eB \u003c/th\u003e       \u003cth\u003eC \u003c/th\u003e       \u003cth\u003eD \u003c/th\u003e       \u003cth\u003eE \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e0.38 ± 0.01 \u003c/td\u003e       \u003ctd\u003e0.38 ± 0.01 \u003c/td\u003e       \u003ctd\u003e0.37 ± 0.01 \u003c/td\u003e       \u003ctd\u003e0.29 ± 0.01 \u003c/td\u003e       \u003ctd\u003e0.14 ± 0.00 \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eAn interesting observation is that for problem E, top-10% rate is almost the same as accept rate, while for problem A, these rates are very different.\u003c/p\u003e\u003ch2\u003eA very naive attempt\u003c/h2\u003e\u003cp\u003eFirst idea to evaluate the strategy is to estimate the following: given that someone solves problem C, how much more likely is that they also solve some other problem? We can think first and discard this idea right away, but for the sake of the analysis, let\u0027s compute the stats first. Here is the delta-rates (i.e. P[one solves problem X | problem C is solved] — P[one solves problem X]):\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eA \u003c/th\u003e       \u003cth\u003eB \u003c/th\u003e       \u003cth\u003eC \u003c/th\u003e       \u003cth\u003eD \u003c/th\u003e       \u003cth\u003eE \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.01 ± 0.00\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.05 ± 0.01\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.41 ± 0.00\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.09 ± 0.01\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.06 ± 0.01\u003c/span\u003e \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eAs we can see, all the lifts are above the confidence intervals (lift for C is huge, which is expected — the rate is lifted to 1.0). But does it mean that we\u0027ve determined that the strategy indeed works. One can say that obviously NO: there is a strong bias towards contest difficulty. I.e., for easier problemsets, we\u0027re more likely to solve C as well as other problem. That is, this data just shows that \u0026quot;solving problem C\u0026quot; might be a proxy for \u0026quot;problemset is easy\u0026quot; property, which indeed means we solve more problems, but doesn\u0027t mean we perform better.\u003c/p\u003e\u003ch2\u003eSlightly less naive attempt\u003c/h2\u003e\u003cp\u003eAs we have seen in the previous section, estimating our performance on problems without considering other participants isn\u0027t what we want. But what about comparing us with everyone else for each problem separately? We\u0027ve already computed the data for \u0026quot;being in top 10% scores for a given problem\u0026quot;, let\u0027s compute deltas conditioned to \u0026quot;we\u0027re in top-10% scores for problem C\u0026quot;:\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eA \u003c/th\u003e       \u003cth\u003eB \u003c/th\u003e       \u003cth\u003eC \u003c/th\u003e       \u003cth\u003eD \u003c/th\u003e       \u003cth\u003eE \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.15 ± 0.01\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.19 ± 0.01\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.63 ± 0.00\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.18 ± 0.01\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.10 ± 0.01\u003c/span\u003e \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eSo, the strategy works after all? Not necessarily: one can argue that we\u0027re hitting a different bias. If a contestant solves problems sequentially, then quickly solving A and B (therefore having good scores on them) automatically increases score on C (as well as D, E, F). So these huge lifts are expected, and we again estimated not what we wanted.\u003c/p\u003e\u003ch2\u003eProper^W Even less naive attempt\u003c/h2\u003e\u003cp\u003eFinally, let\u0027s estimate what we want. From the very beginning, we needed to understand what happens to \u0026quot;performance\u0026quot; on problem X given good \u0026quot;performance\u0026quot; on problem C. Here, \u0026quot;performance\u0026quot; should be independent of other problems (as we have seen in the previous section, score doesn\u0027t work for this). A natural measure is time spent on this particular problem, but we don\u0027t know it. An easy way to estimate it is to sort all submission times and take differences. We assume that participants solve problems one-by-one in some order. Of course sometimes it\u0027s not true (I\u0027ve seen successful submits with distance 5 seconds in the dataset), but should be mostly true.\u003c/p\u003e\u003cp\u003eOk, now we define \u0026quot;performance on the problem\u0026quot; as \u0026quot;time to solve this particular problem\u0026quot;, estimate it from submission log, define \u0026quot;good performance\u0026quot; as \u0026quot;being in best-10% times for this problem\u0026quot;. Without conditioning on problem C, \u0026quot;good performance\u0026quot; rates look as follows:\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eA \u003c/th\u003e       \u003cth\u003eB \u003c/th\u003e       \u003cth\u003eC \u003c/th\u003e       \u003cth\u003eD \u003c/th\u003e       \u003cth\u003eE \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e0.34 ± 0.01 \u003c/td\u003e       \u003ctd\u003e0.37 ± 0.01 \u003c/td\u003e       \u003ctd\u003e0.36 ± 0.01 \u003c/td\u003e       \u003ctd\u003e0.28 ± 0.01 \u003c/td\u003e       \u003ctd\u003e0.14 ± 0.00 \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eAnd deltas look as follows:\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eA \u003c/th\u003e       \u003cth\u003eB \u003c/th\u003e       \u003cth\u003eC \u003c/th\u003e       \u003cth\u003eD \u003c/th\u003e       \u003cth\u003eE \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.14 ± 0.01\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.19 ± 0.01\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.64 ± 0.00\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.19 ± 0.01\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.11 ± 0.01\u003c/span\u003e \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eSo, it seems that the strategy indeed works. The effect looks rather significant, especially for harder problems (almost doubling the probability to perform good on E). Are we done with the analysis?\u003c/p\u003e\u003ch2\u003eDebiasing individual strength\u003c/h2\u003e\u003cp\u003eApparently not. At this point, I thought that other biases present aren\u0027t significant. But as \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Um_nik\" title\u003d\"Легендарный гроссмейстер Um_nik\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eU\u003c/span\u003em_nik\u003c/a\u003e pointed out in comments, this is still biased towards of individual strength of participants. If someone is strong — they\u0027re more likely to solve C as well as other problems.\u003c/p\u003e\u003cp\u003eWhat to do? OK, let\u0027s compute similar stats (top-10% by time for a given problem) on user level. This naively assumes that user strength is constant throughout the time, but let\u0027s ignore this effect for now. Confidence intervals will be huge, but we can aggregate user-level numbers to one final number, weighting by the number of observations. Final lifts look as follows (don\u0027t quote me on confidence intervals):\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eA \u003c/th\u003e       \u003cth\u003eB \u003c/th\u003e       \u003cth\u003eC \u003c/th\u003e       \u003cth\u003eD \u003c/th\u003e       \u003cth\u003eE \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.11 ± 0.00\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.16 ± 0.00\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.64 ± 0.01\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.16 ± 0.00\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.09 ± 0.00\u003c/span\u003e \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eDeltas are smaller than before, but still positive. We can also explore stats on a per-user basis. E.g. this is how raw stats look for some interesting users:\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eUser \u003c/th\u003e       \u003cth\u003eA \u003c/th\u003e       \u003cth\u003eB \u003c/th\u003e       \u003cth\u003eC \u003c/th\u003e       \u003cth\u003eD \u003c/th\u003e       \u003cth\u003eE \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Легендарный гроссмейстер Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e0.76 ± 0.08 \u003c/td\u003e       \u003ctd\u003e0.79 ± 0.07 \u003c/td\u003e       \u003ctd\u003e0.75 ± 0.08 \u003c/td\u003e       \u003ctd\u003e0.75 ± 0.08 \u003c/td\u003e       \u003ctd\u003e0.52 ± 0.09 \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Легендарный гроссмейстер tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e0.80 ± 0.07 \u003c/td\u003e       \u003ctd\u003e0.82 ± 0.07 \u003c/td\u003e       \u003ctd\u003e0.81 ± 0.07 \u003c/td\u003e       \u003ctd\u003e0.78 ± 0.08 \u003c/td\u003e       \u003ctd\u003e0.54 ± 0.09 \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Um_nik\" title\u003d\"Легендарный гроссмейстер Um_nik\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eU\u003c/span\u003em_nik\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e0.51 ± 0.09 \u003c/td\u003e       \u003ctd\u003e0.50 ± 0.09 \u003c/td\u003e       \u003ctd\u003e0.54 ± 0.09 \u003c/td\u003e       \u003ctd\u003e0.41 ± 0.09 \u003c/td\u003e       \u003ctd\u003e0.22 ± 0.08 \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eAnd here — stats conditioned on doing well on problem C:\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eUser \u003c/th\u003e       \u003cth\u003eA \u003c/th\u003e       \u003cth\u003eB \u003c/th\u003e       \u003cth\u003eC \u003c/th\u003e       \u003cth\u003eD \u003c/th\u003e       \u003cth\u003eE \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Легендарный гроссмейстер Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e0.82 ± 0.08 \u003c/td\u003e       \u003ctd\u003e0.83 ± 0.08 \u003c/td\u003e       \u003ctd\u003e1.00 ± 0.00 \u003c/td\u003e       \u003ctd\u003e0.76 ± 0.09 \u003c/td\u003e       \u003ctd\u003e0.58 ± 0.11 \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Легендарный гроссмейстер tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e0.81 ± 0.08 \u003c/td\u003e       \u003ctd\u003e0.88 ± 0.07 \u003c/td\u003e       \u003ctd\u003e1.00 ± 0.00 \u003c/td\u003e       \u003ctd\u003e0.81 ± 0.08 \u003c/td\u003e       \u003ctd\u003e0.56 ± 0.10 \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Um_nik\" title\u003d\"Легендарный гроссмейстер Um_nik\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eU\u003c/span\u003em_nik\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e0.61 ± 0.12 \u003c/td\u003e       \u003ctd\u003e0.64 ± 0.12 \u003c/td\u003e       \u003ctd\u003e1.00 ± 0.00 \u003c/td\u003e       \u003ctd\u003e0.62 ± 0.12 \u003c/td\u003e       \u003ctd\u003e0.36 ± 0.12 \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eSo, even for them, lifts exist, but mostly within confidence intervals.\u003c/p\u003e\u003ch2\u003eDebiasing content composition and individual strength growth\u003c/h2\u003e\u003cp\u003eOK, are we done yet? Apparently, not :( As \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Легендарный гроссмейстер Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e mentioned in comments, there is yet another bias: it is easier to perform good in a contest where not too many strong people participate. At this point, I ran out of ideas (maybe readers have some), and decided to use rating as a proxy to strength. We were using 10th percentile as the definition of good performance — let\u0027s change it: sort all participants by rating, and say you\u0027re performing good if your time for this problem is better than sorted_times[your rank by rating].\u003c/p\u003e\u003cp\u003eRaw data for top participants looks rather sad (it is hard to perform better than your rank by rating if you are \u003ca class\u003d\"rated-user user-black\" href\u003d\"/profile/first\" title\u003d\"Не в рейтинге, first\"\u003efirst\u003c/a\u003e by rating; I\u0027m still surprised though that e.g. \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Легендарный гроссмейстер tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e has 0.12 ratio for problem A — i.e. solves A faster than everyone 12% of times; I hope it is not due to a bug :) ):\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eUser \u003c/th\u003e       \u003cth\u003eA \u003c/th\u003e       \u003cth\u003eB \u003c/th\u003e       \u003cth\u003eC \u003c/th\u003e       \u003cth\u003eD \u003c/th\u003e       \u003cth\u003eE \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Легендарный гроссмейстер Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e0.05 ± 0.04 \u003c/td\u003e       \u003ctd\u003e0.14 ± 0.06 \u003c/td\u003e       \u003ctd\u003e0.11 ± 0.06 \u003c/td\u003e       \u003ctd\u003e0.26 ± 0.08 \u003c/td\u003e       \u003ctd\u003e0.56 ± 0.09 \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Легендарный гроссмейстер tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e0.12 ± 0.06 \u003c/td\u003e       \u003ctd\u003e0.05 ± 0.04 \u003c/td\u003e       \u003ctd\u003e0.12 ± 0.06 \u003c/td\u003e       \u003ctd\u003e0.16 ± 0.07 \u003c/td\u003e       \u003ctd\u003e0.38 ± 0.09 \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Um_nik\" title\u003d\"Легендарный гроссмейстер Um_nik\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eU\u003c/span\u003em_nik\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e0.07 ± 0.05 \u003c/td\u003e       \u003ctd\u003e0.04 ± 0.03 \u003c/td\u003e       \u003ctd\u003e0.07 ± 0.05 \u003c/td\u003e       \u003ctd\u003e0.12 ± 0.06 \u003c/td\u003e       \u003ctd\u003e0.41 ± 0.09 \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eAverage lifts:\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eA \u003c/th\u003e       \u003cth\u003eB \u003c/th\u003e       \u003cth\u003eC \u003c/th\u003e       \u003cth\u003eD \u003c/th\u003e       \u003cth\u003eE \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.05 ± 0.00\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.08 ± 0.00\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.69 ± 0.01\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.13 ± 0.00\u003c/span\u003e \u003c/td\u003e       \u003ctd\u003e\u003cspan style\u003d\"color: rgb(0,100,0);\"\u003e+0.11 ± 0.00\u003c/span\u003e \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eAlso, data for top participants conditioned on problem C (conf intervals are huge, so it is mostly meaningless):\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eUser \u003c/th\u003e       \u003cth\u003eA \u003c/th\u003e       \u003cth\u003eB \u003c/th\u003e       \u003cth\u003eC \u003c/th\u003e       \u003cth\u003eD \u003c/th\u003e       \u003cth\u003eE \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Легендарный гроссмейстер Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e0.17 ± 0.21 \u003c/td\u003e       \u003ctd\u003e0.25 ± 0.24 \u003c/td\u003e       \u003ctd\u003e1.00 ± 0.00 \u003c/td\u003e       \u003ctd\u003e0.50 ± 0.28 \u003c/td\u003e       \u003ctd\u003e0.67 ± 0.27 \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Легендарный гроссмейстер tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e0.15 ± 0.20 \u003c/td\u003e       \u003ctd\u003e0.15 ± 0.20 \u003c/td\u003e       \u003ctd\u003e1.00 ± 0.00 \u003c/td\u003e       \u003ctd\u003e0.23 ± 0.23 \u003c/td\u003e       \u003ctd\u003e0.46 ± 0.27 \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Um_nik\" title\u003d\"Легендарный гроссмейстер Um_nik\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eU\u003c/span\u003em_nik\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e0.25 ± 0.30 \u003c/td\u003e       \u003ctd\u003e0.00 ± 0.00 \u003c/td\u003e       \u003ctd\u003e1.00 ± 0.00 \u003c/td\u003e       \u003ctd\u003e0.25 ± 0.30 \u003c/td\u003e       \u003ctd\u003e0.62 ± 0.34 \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003e\u003cem\u003eTechnical note:\u003c/em\u003e ratings were used at the time of scraping. Using ratings at the time of contest would remove bias of strengths changing over time.\u003c/p\u003e\u003cp\u003eSo, in the end, it seems we have enough evidence to say that the strategy works. How ethical to use it is a separate question (one just gets some constant increase to their rating, at cost of not having fun solving more contests, and also likely feeling guilty), but it is outside of the score of this post.\u003c/p\u003e\u003ch1\u003eConclusion\u003c/h1\u003e\u003cp\u003eUsing some basic data analysis, we determined that the described strategy indeed works quite well. There are many open questions though:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eIs the explanation \u0026quot;it is easier to solve problems from certain authors\u0026quot; correct? Other potential explanation is that someone is just having a good day (slept well etc.), and \u0026quot;quickly solving C\u0026quot; is a proxy to it;\u003c/li\u003e   \u003cli\u003eDoes this generalize to div-2 participants?\u003c/li\u003e   \u003cli\u003eIs it true that top participants perform worse on \u0026quot;purple\u0026quot; rounds?\u003c/li\u003e   \u003cli\u003eIs there such thing as \u0026quot;affinity\u0026quot; of participant and problem author? Is it correlated with rating difference?\u003c/li\u003e   \u003cli\u003e... and many other questions.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIt would be very interesting to see more data analysis of contest results — it might help to understand problem-solving process better and develop more interesting strategies.\u003c/p\u003e\u003c/div\u003e","tags":["strategy","data analysis","api"]}}