{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1496338736,"rating":42,"authorHandle":"o_panda_o","modificationTimeSeconds":1496425592,"id":52322,"title":"\u003cp\u003eNeed guidance and tips regarding upsolving\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI am a mediocre coder as of now. I want to improve fast but am confused about how to go for \u003cstrong\u003eupsolving\u003c/strong\u003e. Once upon a time I thought of solving 5 problems per day by sorting the problemset from most solved to least solved and go with the flow but now I feel like I am only doing naive questions which only make me feel good but no improvement at all. I\u0027ve done nearly 420 questions but still feeling damn dissatisfied.\u003c/p\u003e\u003cp\u003eI really don\u0027t have any instructor or coach here to give some particular guidance to how to solve something or how not to solve something. So please someone, anyone help me out. \u003c/p\u003e\u003cp\u003eOne more thing is that when I go for solving hard questions and just go for solving Div 2 C or so, it scares the hell out of me. I feel like I don\u0027t know anything \u0026amp; maybe I\u0027m jumping straight away to something without any previous knowledge of it. I hope many coders would have gone the same phase just like me. \u003c/p\u003e\u003cp\u003eI just want to interact with anyone willing to help just for once and clear my doubts. Please help me. \u003c/p\u003e\u003cp\u003eI think my strength is I\u0027ve dedication and hard work and I hope the weakness in me is I\u0027m really not confident about what I am doing is right or not. \u003c/p\u003e\u003cp\u003eI would be highly generous if anyone really helps me out.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD 1:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eI saw many guys giving down-votes to my blog. Can anyone explain why ? I would really like to know. \u003c/p\u003e\u003cp\u003eIt\u0027s too bad that some people really don\u0027t understand serious problems of others. I agree that there are so many resources available over internet but the tough part is selecting the suitable resource among all of them, which is quite a tedious job without an instructor and I don\u0027t have one. \u003c/p\u003e\u003cp\u003eThanks \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ania\" title\u003d\"Гроссмейстер ania\"\u003eania\u003c/a\u003e for your suggestion. I really got some ideas about how to proceed after your suggestion. It was fruitful\u003c/p\u003e\u003c/div\u003e","tags":["need help","upsolving","need guidance","how to solve quick"]}}