{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1404325633,"rating":125,"authorHandle":"hiukim","modificationTimeSeconds":1404325633,"id":12917,"title":"\u003cp\u003eA new tool to rank submissions\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI think most of us can agree that reading other people\u0027s submissions is a very good way to learn. Sometimes, I found that it might be even more effective to read a correct submission than editorial in order to understand the solutions. However, selecting a good submission to read could be difficult, especially when there are a lot of accepted ones.\u003c/p\u003e\u003cp\u003eTo solve this problem, I think we can gather everyone\u0027s wisdom. My idea is that: whenever you read a solution and found it well written in the sense that it\u0027s easy to understand, then you just vote it up. At the end of the day, good submissions will stand out, and later on, people will know which submissions to read efficiently.\u003c/p\u003e\u003cp\u003eTo try it out, I\u0027ve developed a simple application which allow you to \u0026quot;Like\u0026quot; a submission. It is similar to the status page of a contest, containing the list of accepted submissions for a particular problem, but with a few extra features. Here is a sample contest URL: \u003ca href\u003d\"http://hiukim.com/cfsubmissions/contest.php?contestId\u003d442\"\u003ehttp://hiukim.com/cfsubmissions/contest.php?contestId\u003d442\u003c/a\u003e. And here you can find other contests (I have currently crawled only 3 latest contests): \u003ca href\u003d\"http://hiukim.com/cfsubmissions/index.php\"\u003ehttp://hiukim.com/cfsubmissions/index.php\u003c/a\u003e\u003c/p\u003e\u003cp\u003eI think the community can benefit as a whole if we could collaborate in selecting good submissions. It might as well be a good way to encourage code readability. \u003cstrong\u003eAny comments and suggestions are welcome\u003c/strong\u003e. I hope we could try it out in the coming contest.\u003c/p\u003e\u003c/div\u003e","tags":[]}}