{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1408448549,"rating":47,"authorHandle":"PavelKunyavskiy","modificationTimeSeconds":1408452938,"id":13453,"title":"\u003cp\u003eIOI graders: linking C with Pascal and Java\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eGood time of the day.\u003c/p\u003e\u003cp\u003eAs some of you know, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/yeputons\" title\u003d\"International Grandmaster yeputons\"\u003eyeputons\u003c/a\u003e and I have an archive of IOI-tasks. While preparing it, we had understood, that we have no resources to prepare graders for all languages,so we want to find a way to write a grader only for C, and to link other languages to it.. Also, I think it\u0027s better to have one grader and adapters to avoid code duplicating, which can cause errors.\u003c/p\u003e\u003cp\u003eThere were some problems with linking Pascal, but they were mostly solved. I\u0027ll write about one unsolved problem further. It would be very good if someone have ideas how to solve it.\u003c/p\u003e\u003cp\u003eNext year Java will be available on IOI. So I tried to write Java adapter for graders. \u003ca href\u003d\"https://yadi.sk/d/aYWQG5Uva3K6w\"\u003eHere\u003c/a\u003e is one for the problem 2010.cluedo. I think this one works well.\u003c/p\u003e\u003cp\u003eI publish this because I think someone else can be interested in it. Also I have some problems, which I don\u0027t know how to solve. Probably someone here can solve them.\u003c/p\u003e\u003cp\u003eFirst of all, we need to include \u003ccode\u003ejni.h\u003c/code\u003e. But it doesn\u0027t belong to gcc library path. So we need to set path, which depends on computer settings (path to java, to be more precise).\u003cbr /\u003eAlso this way is quite complicated to compile. I don\u0027t know how to do this in some IDE, which is probably used by participant using java. And participant probably don\u0027t know what is jni, and how to do something like this.\u003cbr /\u003eThe same problem happens to pascal. Also there is one extra problem. FPC needs libc to link this. And I don\u0027t know way to find libc on windows. libmsvcrt.a from MinGW is ok. But how to find it on participants computer? And what to do, if he is using some other compiler? Also, participant needs C-compiler to use Pascal, and that is not very good.\u003c/p\u003e\u003cp\u003eAll this problems are not really important on competition (as we know settings of participants computers), but if we use on-line judge for it we will face the above-mentioned problems.\u003c/p\u003e\u003cp\u003eI hope there is someone from ISC or some other IOI structures, who can help with it, who is reading Codeforces. Anyway, if you have some ideas how to make this better, or any comments, I will be very interested in it.\u003c/p\u003e\u003c/div\u003e","tags":["ioi","graders","java","c++","pascal"]}}