{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1496610855,"rating":131,"authorHandle":"Sazzon","modificationTimeSeconds":1496610855,"id":52386,"title":"\u003cp\u003eWhy editorials are so hard to understand ?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi,\u003c/p\u003e\u003cp\u003eas usual, when you ask someone in codeforces tips on how to improve with the most amazing feature of this site has (that\u0027s constant contests rounds), they are all equal: compete, read all problem statements and then read the editorial to solve the unsolved ones. I follow this step by step, but when I reach the last one I fail completely.\u003c/p\u003e\u003cp\u003eWhat I mean is, why is so hard to understand most (Most because from the top of my head I can recall really good editorial writers like \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/zscoder\" title\u003d\"Grandmaster zscoder\"\u003ezscoder\u003c/a\u003e and \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Errichto\" title\u003d\"Grandmaster Errichto\"\u003eErrichto\u003c/a\u003e) of editorials here ? Sometimes is like the contest writers want us to get inside their brain and understand what they mean by some paragraph. I get it, is really difficult to be great in explaining things, maybe the hardest thing in the job of creating a contest. \u003c/p\u003e\u003cp\u003eBut sometimes I think it only requires time and effort. Some of the most interesting contest \u0026amp; editorials I\u0027ve seen had depictions of how the idea of the algorithm works, or lots and lots of tips before giving it out, or even displaying the content needed to be already understood to get this question right (which is one of the most effective, for me \u003d] ). It\u0027s really not great to try your best to improve on some contest and fail at the final step, even if you read 20x the same paragraph you wont understand.\u003c/p\u003e\u003cp\u003eI\u0027m glad we are here as a community and everytime I stumble on a difficult explanation, I quickly go to the comment section and find about 3 comments teaching their way of doing it and they are crystal clear! Also 5 comments complaining of how difficult it is to understand what was written, and most of the time the author is there to help out, but if the editorial was written more carefully this wouldn\u0027t be necessary at all.\u003c/p\u003e\u003cp\u003eI think what is missing is empathy. Empathy on how the people that did not solve that question is going to read that explanation. Those are your targets. People that don\u0027t really understand and maybe don\u0027t have the background to get the idea as you, problem setter, do. Focus on how you are going to explain a idea of your algorithm to a person that is not a programmer, try to explain with figures, with tips, use everything in your hands. After doing so, ask some friend of yours, to try understand your text and explain it to you and so on. \u003c/p\u003e\u003cp\u003eTeaching is hard, really hard, but rewarding. I think the community would really improve with great editorials. \u003c/p\u003e\u003cp\u003eDoes someone experiencing this too? Let\u0027s discuss it. Help our writers to improve too.\u003c/p\u003e\u003cp\u003eTo problem setters: get this post as a constructive critique. The job of creating good and interesting contests are really hard alone, but don\u0027t forget to put the same effort on the explanations. Cheers!\u003c/p\u003e\u003c/div\u003e","tags":[]}}