{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1424806352,"rating":98,"authorHandle":"saul_goodman","modificationTimeSeconds":1424808737,"id":16607,"title":"\u003cp\u003eRegarding Editorials\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eCodeforces is arguably one of the best judges online. It has a really great problemset. But one of it\u0027s big problem is the quality of editorials. Topcoder and Codechef, the two main competitors of codeforces have much better editorials overall. I feel like taking some steps can drastically improve the quality of editorials. These are only suggestions I am sorry if I have offended anyone through this post.\u003c/p\u003e\u003cp\u003e1) Improving the language of the editorial — Being from a country whose 1st language is not english, I know it\u0027s not easy to be good in english so I think the editorialists who are not good in english should take help from people who are in writing editorials. I am not talking about focussing on punctuation, etc. just checking the if it\u0027s easy to understand what you are trying to say.\u003c/p\u003e\u003cp\u003e2) Names of standard problems — Many times I have read the line \u0026quot;this is a standard problem\u0026quot;. Just mention the name of the problem so that we can google it.\u003c/p\u003e\u003cp\u003e3) Implementations of the problem — It\u0027s hard to just read the editorial and then implement the solution correctly. Sometimes an implementation can help quite a lot in learning. If you give an implementation, please make it as clean as possible (ex — good bye 2014 editorials). If you don\u0027t want to write an implementation then just give some kind of pseudocode in the editorial and mention the edge cases so that we can also implement it. Or give the link to a (clean)implementation of a participant who has the same idea as given in the editorial.\u003c/p\u003e\u003cp\u003e4) It\u0027s easy to prove — Many editorials skip the proof by saying this statement. It\u0027s actually not easy to prove many times. Please add proof to show that your solution works.\u003c/p\u003e\u003cp\u003eI believe that these tips can make the editorial a lot better. Again, I am sorry If I have offended anyone.\u003c/p\u003e\u003c/div\u003e","tags":["editorial"]}}