{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1400000025,"rating":20,"authorHandle":"fushar","modificationTimeSeconds":1400000421,"id":12286,"title":"\u003cp\u003eTOKI Open 2014\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello!\u003c/p\u003e\u003cp\u003eIt is the first time for Indonesia to open our IOI selection contest to (selected) international participants. We call it \u003cstrong\u003eTOKI Open 2014\u003c/strong\u003e. TOKI stands for Tim Olimpiade Komputer Indonesia, or Indonesian Computing Olympiad Team in English. We received very good responses in term of number of participants and the enthusiasm, despite the limited amount of time for preparation and publication.\u003c/p\u003e\u003cp\u003eObjectives of us opening this contest include, but not limited to:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eFoster friendship between Indonesia and other IOI participating countries.\u003c/li\u003e   \u003cli\u003eTest Indonesia\u0027s scientific committee capability in setting IOI-level problems.\u003c/li\u003e   \u003cli\u003eTest Indonesia\u0027s technical committee capability in hosting IOI-level contests.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eHere are the \u003ca href\u003d\"http://tokilearning.org/public/TOKIOpen2014Tasks.pdf\"\u003eproblemset\u003c/a\u003e, \u003ca href\u003d\"http://tokilearning.org/public/TOKIOpen2014Results.pdf\"\u003eresults\u003c/a\u003e, and \u003ca href\u003d\"http://tokilearning.org/public/TOKIOpen2014TestData.zip\"\u003etest data\u003c/a\u003e. We hope you find the problems interesting!\u003c/p\u003e\u003cp\u003eThere were in total 124 contestants registered: 40 going to this year IOI, 50 not determined yet whether going or not to this year IOI, 18 no longer eligible for IOI, 16 perhaps going to later IOI. And among those, 1 champion achieved perfect score (600), congrats to contestant registered as \u003cstrong\u003eMohammad Ishraq Huda\u003c/strong\u003e from \u003cstrong\u003eAustralia\u003c/strong\u003e. Congratulations!\u003c/p\u003e\u003cp\u003eWe hope to conduct TOKI Open again next year, with broader audience. If you have any inquiries, please contact \u003ca href\u003d\"mailto:scientific@toki.or.id\"\u003escientific@toki.or.id\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eFeel free to discuss anything!\u003c/p\u003e\u003c/div\u003e","tags":["toki-open"]}}