{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1501620932,"rating":731,"authorHandle":"matthew99","modificationTimeSeconds":1518731286,"id":53624,"title":"\u003cp\u003eHow not to perform well on IOI\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eFirst, you would jump the first task, which was an answer-only task and didn\u0027t fit you. Then you would have a wrong basic idea to the task, such as thinking that the answer would be to connect the points one by one when n \u003d m.\u003c/p\u003e\u003cp\u003eThen you would spend some time coding a naive solution, which definitely would get wrong answer, and you would spend some time looking at your screen and not knowing what to do. Then you would start stress testing and found your hypothesis wrong.\u003c/p\u003e\u003cp\u003eNow, one and a half hours had passed and you would be worried. You would like to solve the task as soon as possible-----because it wasn\u0027t early now. However, you would have lost your wit due to your nervousness, so you would likely come up with other two wrong solutions.\u003c/p\u003e\u003cp\u003eIt had been 3 hours since the beginning and you still wouldn\u0027t have any ideas. You would start looking all the subtasks, searching for some morsels of points that you could get. You found subtask2 easy. After coding it out, you would find the solution heuristic and finally found a correct solution.\u003c/p\u003e\u003cp\u003eYou would get 100 at the 4-hour mark. You would not be satisfied with what you had done, and as a veteran Codeforces and Topcoder coder, you would ignore the answer-only task and run rashly for 100 on the third task.\u003c/p\u003e\u003cp\u003eAfter finding a plausible solution, you would think that you would solve it in 20min, and would still have time for the first time. However, the task didn\u0027t crack even when the contest ended, and you would end up getting 105. \u003c/p\u003e\u003cp\u003eOn the second day, you would be even more nervous and want to get points as soon as possible. After getting 99.71 on the first task at a fantastic speed. You would start coding 100 points for the second task without any thinking on the third one.\u003c/p\u003e\u003cp\u003eHowever, your solution turned out to be wrong again. But you would soon find a new solution based on an arbitrary spanning tree. All that was left was a detail.\u003c/p\u003e\u003cp\u003eThat detail proved to be your \u003cem\u003ebete noire\u003c/em\u003e, and you would spend so much time on it without any progress. You would find the spanning tree special---all edges were from ancestors to descendants, and find a solution based on this feature.\u003c/p\u003e\u003cp\u003eHowever, your coding skill was too poor. Time was fleeting and your code was always a fixer upper. You would be so frustrated to find your solution was wrong again at the 4:30 mark.\u003c/p\u003e\u003cp\u003eThe contest was extended by 30min and you would manage to get some subtasks done. Your efforts proved to be futile and you ended up being several places behind the gold medal.\u003c/p\u003e\u003cp\u003eYou would receive many consolations from your friends. You would even wonder whether you were a shame to your country and school.\u003c/p\u003e\u003cp\u003eYour friend would even be cynical about your performance, saying that you had no experience on IOI-styled contests; that you should have submitted brute forces on all tasks in the beginning; that you shouldn\u0027t have rushed into 100 points solution on a random task directly and that you should always have been selecting the subtasks that fitted you most. These words were so true.\u003c/p\u003e\u003cp\u003eThose had been the strategies you had used for multiple competitions. If you had managed to solve some task when there was only a little time left, you would try to solve another and you had always just done it before the contest ended. You would never give up half way on a task, and would always do answer-only tasks after all other ones. You had won NOI2016 this way. Ironically, the first time these strategies failed altogether was in IOI.\u003c/p\u003e\u003cp\u003eMore ironically, the first time you ever got a silver medal(you had been getting gold or bronze ones) was also in IOI.\u003c/p\u003e\u003cp\u003eYou would try to list all kinds of alternate histories where you would get gold medals and how they didn\u0027t come true. You would still be stunned about what you had done and still wouldn\u0027t know why you had done it. You would find that you had so many missteps and that had you made one fewer misstep, you would have ended up gold. However, failing a contest is like rolling a snowball, which starts getting bigger since it is created. Therefore, you should not be surprised to find that your missteps came one after another.\u003c/p\u003e\u003cp\u003eThis story is based on my experience in IOI2017. It was written when I was not in a good mood and might be somewhat illogical. Finally, thank those who encouraged me and gave me consolations.\u003c/p\u003e\u003c/div\u003e","tags":["#ioi2017"]}}