{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1475102477,"rating":139,"authorHandle":"ifsmirnov","modificationTimeSeconds":1475102914,"id":47402,"title":"\u003cp\u003eDSU with randomized linking is as fast as with rank heuristic\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIt is known (well, as long as Tarjan\u0027s proof is correct, and it is believed to be) that DSU with path compression and rank heuristics works in \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eO\u003c/i\u003e(α(\u003ci\u003en\u003c/i\u003e))\u003c/span\u003e, where \u003cspan class\u003d\"tex-span\"\u003eα(\u003ci\u003en\u003c/i\u003e)\u003c/span\u003e is an inverse Ackermann function. However, there is a rumor in the community that if you do not use the rank heuristic than the DSU runs as fast, if not faster. For years it was a controversial topic. I remember some holywars on CF with ones arguing for a random heuristic and others claiming they have a counter-test where DSU runs in \u003cimg align\u003d\"middle\" class\u003d\"tex-formula\" src\u003d\"/predownloaded/df/5d/df5dbbdf029efb258cda73bd7def7a3d6a43aa63.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e independently of \u003cem\u003erand()\u003c/em\u003e calls.\u003c/p\u003e\u003cp\u003eRecently I was looking through the proceedings of SODA (a conference on Computer Science) and found a paper by Tarjan et al. The abstract states:\u003c/p\u003e\u003cp\u003e\u003cem\u003eRecent experiments suggest that in practice, a naïve linking method works just as well if not better than linking by rank, in spite of being theoretically inferior. How can this be? \u003cstrong\u003eWe prove that randomized linking is asymptotically as efficient as linking by rank.\u003c/strong\u003e This result provides theory that matches the experiments, which implicitly do randomized linking as a result of the way the input instances are generated.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eThis paper is relatively old (2014), though I haven\u0027t yet heard of it and decided to share with you.\u003c/p\u003e\u003cp\u003eA whole paper can be found \u003ca href\u003d\"http://epubs.siam.org/doi/pdf/10.1137/1.9781611973402.75\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["dsu","computer science"]}}