{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1528688893,"rating":0,"authorHandle":"PPnT","modificationTimeSeconds":1528737036,"id":59951,"title":"\u003cp\u003eLightOJ_DP 1345\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eproblem link: \u003ca href\u003d\"http://lightoj.com/volume_showproblem.php?problem\u003d1345\"\u003ehttp://lightoj.com/volume_showproblem.php?problem\u003d1345\u003c/a\u003e\u003c/p\u003e\u003cp\u003ehow dp can be used to solve this problem ? \u003c/p\u003e\u003cp\u003eproblem statement : It\u0027s said that Aladdin had to solve seven mysteries before getting the Magical Lamp which summons a powerful Genie. Here we are concerned about the fifth mystery.\u003c/p\u003e\u003cp\u003eAfter defeating the Genie in \u0027Game of Bracelets\u0027, Aladdin moved forward and found a garden. There were n small Genies in the garden and they were all sad. Aladdin asked them about the lamp. But none of them was interested. So, Aladdin had to make them happy. Soon he noticed that height of every Genie is distinct but they were standing in a line randomly. Aladdin found a book there, and after reading the book, he discovered that the only way to make them happy was to make a line with the Genies such that k consecutive genies in the line could be found whose heights are in increasing order. But the book also mentioned that if k+1 consecutive Genies found in the line whose heights are in increasing order then they would be sad again. So, Aladdin did make them happy, and they showed the path to Aladdin and he moved forward.\u003c/p\u003e\u003cp\u003eNow you are given n and k, your task is to find in how many ways Aladdin could make them happy.\u003c/p\u003e\u003cp\u003eInput Input starts with an integer T (≤ 1275), denoting the number of test cases.\u003c/p\u003e\u003cp\u003eEach case starts with a line containing two integers: n and k (1 ≤ k ≤ n ≤ 50).\u003c/p\u003e\u003cp\u003eOutput For each case, print the case number and the number of ways Aladdin could make them happy. As the result can be big; print the result modulo 1000 000 007.\u003c/p\u003e\u003cp\u003eSample Input 5\u003c/p\u003e\u003cp\u003e2 2\u003c/p\u003e\u003cp\u003e3 2\u003c/p\u003e\u003cp\u003e4 3\u003c/p\u003e\u003cp\u003e5 4\u003c/p\u003e\u003cp\u003e5 3 Output for Sample Input Case 1: 1\u003c/p\u003e\u003cp\u003eCase 2: 4\u003c/p\u003e\u003cp\u003eCase 3: 6\u003c/p\u003e\u003cp\u003eCase 4: 8\u003c/p\u003e\u003cp\u003eCase 5: 41\u003c/p\u003e\u003c/div\u003e","tags":["light oj","#dp"]}}