{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1415474177,"rating":22,"authorHandle":"MikhailRubinchik.ru","modificationTimeSeconds":1415530853,"id":14640,"title":"\u003cp\u003e1 / 8 финала NEERC \u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eЕсли вы со мной согласны, что квота NEERC должна расти, то смело проматывайте до нумерованного списка.\u003c/p\u003e\u003cp\u003eТут недавно произошло малозаметное событие. Его можно узреть, если зайти по ссылке: \u003ca href\u003d\"http://neerc.snarknews.info/index.cgi?data\u003dmacros/summary\u0026amp;menu\u003dindex\u0026amp;head\u003dindex\u0026amp;qf\u003dneerc\u0026amp;class\u003dneerc2014\u0026amp;text\u003dNEERC\u0026amp;year\u003d2014\u0026amp;bayregion\u003dneerc\"\u003ehttp://neerc.snarknews.info/index.cgi?data\u003dmacros/summary\u0026amp;menu\u003dindex\u0026amp;head\u003dindex\u0026amp;qf\u003dneerc\u0026amp;class\u003dneerc2014\u0026amp;text\u003dNEERC\u0026amp;year\u003d2014\u0026amp;bayregion\u003dneerc\u003c/a\u003e В этом году впервые наш полуфинал собрал 1000 участников. В прошлом году было 800 с чем-то. Олег Христенко призывается в комментариях, чтоб уточнить цифру :) \u003c/p\u003e\u003cp\u003eМне приятно, что мы (организаторы уральского чф) приложили к этому руку (собрали на 80 команд больше, чем в прошлом). Также из заметного в этом году — МФТИ набрал 100 команд (один ВУЗ 100 команд! о_О).\u003c/p\u003e\u003cp\u003eЛадно, к чему это я. Количество участников полуфинала и количество различных вузов влияют на квоту этого самого полуфинала на финале. \u003c/p\u003e\u003cp\u003eОбщая численность команд на финале растёт медленней, чем число участников от азиатских полуфиналов. К примеру, недавно прошёл четвертьфинал во Вьетнаме, он набрал 234 команды из 66 ВУЗов. Ни одному из наших чф не снилось 66 ВУЗов :) \u003c/p\u003e\u003cp\u003eВнимательный читатеть уже понял, к чему я клоню. Если не увеличивать число участников NEERC, то нашу квоту постепенно будет кушать Азия :) Кто из нас этого хочет?\u003c/p\u003e\u003cp\u003eТеперь от вводной части к делу. Что такое (с точки зрения организаторов финала) количество участников полуфинала? Это просто количество команд, которые зарегались на baylor’e и при этом пришли на соревнование (полуфинал или любой из его этапов) и сделали сабмит (опять же поправьте меня, если я вру). \u003c/p\u003e\u003cp\u003eМы попытались привлечь много команд к себе на четвертьфинал и огребли организационных проблем. Наверное не мы одни. \u003c/p\u003e\u003cp\u003eЯ предлагаю начать проводить в NEERC ⅛ финала. Сейчас я изложу проект правил — я старался сделать их максимально простыми. \u003c/p\u003e \u003col\u003e   \u003cli\u003e⅛ — это заочный тур четвертьфинала. Попасть на четвертьфинал можно только участвуя в ⅛.\u003c/li\u003e   \u003cli\u003eКонтест проходит в интернете, все участники данного четвертьфинала находятся в одном мониторе. Формат очень похож на интернет-отбор на вкошп и на Открытый кубок.\u003c/li\u003e   \u003cli\u003eЧтоб принять участие, команда должна выбрать площадку, где она будет играть. Площадкой может стать любой из ВУЗов данного четвертьфинала.\u003c/li\u003e   \u003cli\u003eДля появления площадки сотрудник ВУЗа или тренер одной из команд может подать заявку на сайте четвертьфинала.\u003c/li\u003e   \u003cli\u003eПо итогам контеста на четвертьфинал приглашается лучшая команда каждого ВУЗа, если она решила хотя бы одну задачу (нулей можно избегать, если всегда делать одну очень простую задачу). Пусть таких команд F штук.\u003c/li\u003e   \u003cli\u003eДалее приглашённые команды вычёркиваются из монитора. Из оставшихся нужно выбрать еще T команд. T зависит от общего числа команд, которые организатор ¼ готовы у себя посадить.\u003c/li\u003e   \u003cli\u003eИтого F+Т — общая квота, но конечно, есть ещё и квота ВУЗа. Она зависит от одного единственного параметра. Если ВУЗ не организовывал свою площадку, то от него уже прошла одна лучшая команда, больше пройти не может. Если организовывал свою площадку, то его общая квота равна 1 + ⌈K/5⌉, где K — количество команд, игравших на площадке ВУЗа (ВУЗ вправе приглашать или не приглашать на свою площадку другие ВУЗы)\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eТак мы можем решить следующие проблемы:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eСложно организовать очный четвертьфинал для большого количества команд.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВУЗы не замотивированы выставлять много команд — многие представлены только теми одной-двумя командами, которые имеют шанс пройти на полуфинал\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВУЗы, традиционно участвующие в соревнованиях, не замотивированы пиарить движение среди другие вузов своего города\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eДаже если вуз готов выставить некоторое количество команд, ему может быть затруднительно привезти все эти команды на четвертьфинал в другой город.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eP.S. Флуд в комментах приветствуется. \u003c/p\u003e\u003c/div\u003e","tags":[]}}