{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1508495087,"rating":52,"authorHandle":"lperovskaya","modificationTimeSeconds":1508652862,"id":55300,"title":"\u003cp\u003eThree Subregionals Cup 2017\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eWe gladly invite you to participate in the \u003ca href\u003d\"http://contest.yandex.com/QF2017/\"\u003eThree Subregionals Cup 2017\u003c/a\u003e – a team-based online programming competition parallel to the ACM ICPC Subregionals in Moscow, Minsk and St. Petersburg. The tournament will be organized by the team of Yandex.Contest and the jury of the Subregionals. The online rounds will be held on the Yandex.Contest system. \u003c/p\u003e\u003cp\u003eEach online contest will be available for solving for \u003cem\u003ethree days\u003c/em\u003e starting the day of the QF.\u003c/p\u003e\u003cp\u003eStart times are: Moscow – \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dMoscow+QF\u0026amp;iso\u003d20171022T1200\u0026amp;p1\u003d166\"\u003eOctober 22, 12:00 MSK\u003c/a\u003e, Minsk – \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dWestern+QF\u0026amp;iso\u003d20171102T1100\u0026amp;p1\u003d166\"\u003eNovember 2, 11:00 MSK\u003c/a\u003e, Saint Petersburg – \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dNorthern+QF\u0026amp;iso\u003d20171104T1300\u0026amp;p1\u003d166\"\u003eNovember 4, 13:00 MSK\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eTeams that participate in the onsite version of one of the three quarterfinals will be able to participate in the online versions of the other quarterfinals via Yandex.Contest. Teams that don’t participate in any of the three quarterfinals onsite will be able to participate in all of them online via Yandex.Contest. Cumulated results of three subregional contests will be calculated based on Grand Prix 30 scoring system.\u003c/p\u003e\u003cp\u003eYou can register for the online rounds at any time. You can represent a single person or create a team using the \u003ca href\u003d\"http://contest.yandex.com/QF2017/teams/\"\u003eteams link\u003c/a\u003e. Each invited team member has to confirm his participation in the team. You can choose participation type and team members upon registering for the contest.\u003c/p\u003e\u003cp\u003eThe rules of the online rounds correspond to the onsite quarterfinal\u0027s rules.\u003c/p\u003e\u003cp\u003eFor your convenience a \u003ca href\u003d\"http://contest.yandex.com/QF2017/contest/3/enter/\"\u003etest contest\u003c/a\u003e is available.\u003c/p\u003e\u003cp\u003e\u003cem\u003eUPD\u003c/em\u003e Welcome to the \u003ca href\u003d\"https://contest.yandex.ru/QF2017/contest/5515/enter/\"\u003eMoscow QF\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["acm icpc","neerc","qf","2017"]}}