{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1473090524,"rating":67,"authorHandle":"MiptLited","modificationTimeSeconds":1475502421,"id":46962,"title":"\u003cp\u003eMoscow International Workshop ACM ICPC (autumn 2016)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/5f/81/5f814d0c74da70e6292d864a6f845187d83c8d16.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFrom 8 to 18 November 2016\u003c/strong\u003e the Moscow International Workshop ACM ICPC is going to be held at Moscow Institute of Physics and Technology.\u003c/p\u003e\u003cp\u003eMoscow International Workshop ACM ICPC presents programming education and training camp for students. It is traditionally held by the \u003ca href\u003d\"http://mipt.ru/\"\u003eMoscow Institute of Physics and Technology\u003c/a\u003e and the \u003ca href\u003d\"http://ifmo.ru/en\"\u003eUniversity ITMO\u003c/a\u003e with the \u003ca href\u003d\"http://msu.ru\"\u003eLomonosov Moscow State University\u003c/a\u003e and this year is going to be the sixth time the event is taking place. The workshop is aimed at training and educating students in programming for successful participation in the ACM ICPC. The official language is English.\u003c/p\u003e\u003cp\u003eThe workshop schedule is planned to have 9 workdays that include daily contests and problem analyses, as well as lectures and time for upsolving. In the evenings, there will be sports and other activities. \u003c/p\u003e\u003cp\u003eContests are moderated by Oleg Khristenko: coordinator of the Pankratiev Open Cup and the main editor of Snarknews.info\u003c/p\u003e\u003cp\u003eThe training is going to be held in accordance with the \u003cstrong\u003e\u0026quot;one and a half divisions\u0026quot; scheme\u003c/strong\u003e. No less than four and no more than five rounds out of nine will be non-thematic five hour long contests with the same level of difficulty as those of the ACM ICPC Regionals. The overall standings will be formed by the results of these rounds. The remaining rounds will be held separately by divisions. The Division A (for experienced teams\u0027 training) will also have non-thematic five hour long contests of the ACM ICPC Regionals difficulty level; analyses of non-thematic rounds will be held by MIPT team trainers. The Division B (educational) will have two thematic shortened contests in the morning and in the evening, as well as a lecture in the corresponding topic and analyses of problems composed by lecturers. The schedule is composed in the way that makes it possible for participants of the Division A to submit an application to the organizing committee to become lecturers (on the same conditions as invited lecturers). Teams select a division to participate in themselves. Aside from the overall standings, each division will have its own separate standings calculated, so winners of each division will also be rewarded.\u003c/p\u003e\u003cp\u003eThe organizing fee is \u003cstrong\u003e34.000 rubles for citizens of countries of the Eurasian Economic Union and $640 for everybody else.\u003c/strong\u003e This cost includes the curriculum, meals and accomodation in the MIPT campus, as well as the sports and travel programme for weekends. We are also ready to aid with Visas.\u003c/p\u003e\u003cp\u003eParticipants and teams that are willing to take part in the training need to pass the \u003ca href\u003d\"https://docs.google.com/a/phystech.edu/forms/d/e/1FAIpQLSckBGQVdMEhV5SnM5SXkupP-RnsHRFABlmHV9vswrTHslf69Q/viewform\"\u003epreliminary registration\u003c/a\u003e. Registration extended \u003cstrong\u003euntil October 24\u003c/strong\u003e, however if you need a visa in order to enter Russia, we urge you to register until October 12. \u003cem\u003eInformation for coaches: if you intend to send a team to the training but will not be sure which one until October 12, and in turn cannot pass the registration, please send us an application with specification of the number of participants to our email\u003c/em\u003e \u003ca href\u003d\"mailto:acm@phystech.edu\"\u003eacm@phystech.edu\u003c/a\u003e\u003c/p\u003e\u003cp\u003eOur website: \u003ca href\u003d\"http://it-edu.mipt.ru/en/fall_training_2016\"\u003ehttp://it-edu.mipt.ru/en/fall_training_2016\u003c/a\u003e\u003c/p\u003e\u003cp\u003eOur email: \u003ca href\u003d\"mailto:acm@phystech.edu\"\u003eacm@phystech.edu\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/bd/08/bd08e73f5c64f42aed00225dddd719bfa045ae7d.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["acm icpc","training camp","mipt","moscow","itmo","msu"]}}