{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1505732594,"rating":7,"authorHandle":"E869120","modificationTimeSeconds":1505732594,"id":54599,"title":"\u003cp\u003eA mystery of CF Contest Start Time\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eDear Codeforces.\u003cbr /\u003e Today, I wrote about a mystery of Codeforces contest start time.\u003cbr /\u003e \u003cbr /\u003e\u003c/p\u003e\u003ch3\u003e1 — Background\u003c/h3\u003e\u003cp\u003eThere are many codeforces users from many countries. In spite of this, recently I feel Codeforces contest time is too biased and it\u0027s difficult to participate or enjoy for some country. For example, Codeforces Round #434 started at 13:05 UTC, Round #433 started at 12:55 UTC and Round #432 started at 14:35 UTC. It have only around 3 hours difference between \u0026quot;the earliest of the 3\u0026quot; and \u0026quot;the latest of the 3\u0026quot;.\u003cbr /\u003e This is also an answer of \u0026quot;why I wrote this blog\u0026quot;.\u003cbr /\u003e \u003cbr /\u003e\u003c/p\u003e\u003ch3\u003e2 — Codeforces Time Distribution Graph\u003c/h3\u003e\u003cp\u003eFirst, to investigate actual codeforces time, I searched \u003cstrong\u003erecent 100\u003c/strong\u003e contests time and made a distribution graph.\u003cbr /\u003e \u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/5b/2e/5b2e211ee119df76863f25a7d593cf152697ed84.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003cbr /\u003e\u003c/p\u003e\u003ch3\u003e3 — Problem\u003c/h3\u003e\u003cp\u003eRecently, I found that Codeforces Contest times are biased and they\u0027re difficult to participate for some people:\u003cbr /\u003e \u003c/p\u003e\u003cul\u003e \u003cli\u003eAround 9000 out of 30000 (30%) active users are difficult to participate because they\u0027re too late time. (China, Japan, South Korea, etc.)\u003c/li\u003e \u003cli\u003eAround 3000 out of 30000 (10%) active users are difficult to participate because they\u0027re too early time. (United States, Brazil, Canada, etc.)\u003c/li\u003e \u003c/ul\u003e \u003cbr /\u003e For example, the standard time in Beijing is UTC+8, so around 65% of contest starts at 22:00 or later, and ends at 24:00 or later. A large amount of participants are students, and I think 24:00-03:00 is too late time for student. If they saw systemtest and rating change, the sleeping time could be one hour later.\u003cbr /\u003e \u003cbr /\u003e The other example is in New York. The standard time is UTC-5, so around 95% of contest starts at 12:00 or earlier, and ends at 14:00 or earlier. I think it is too early time, and the time overlaps for most people because of school or working. They can wake up more earlier, but I think morning is busy time for the most, so it\u0027s difficult to make time to participate a single contest in morning.\u003cbr /\u003e \u003cbr /\u003e\u003ch3\u003e4 — My Suggestion\u003c/h3\u003e\u003cp\u003eI think it is better that codeforces do this:\u003cbr /\u003e \u003c/p\u003e\u003cul\u003e \u003cli\u003e~20 or ~30 percent of contest should move in range 06:00-12:00 UTC. It\u0027s better time for Chinese, Korean, Japanese, etc.  (It is also possible time for Indians, etc.)\u003c/li\u003e \u003cli\u003e~15 or ~20 percent of contest should move in range 21:00-03:00 UTC. It\u0027s better time for American, Canadian, Brazilian, etc.\u003c/li\u003e \u003c/ul\u003e \u003cbr /\u003e This system in my suggestion is like TopCoder. (Contest time is not too biased)\u003cbr /\u003e \u003cbr /\u003e I think this made some good effects and bad effects as follows:\u003cbr /\u003e \u003cul\u003e \u003cli\u003eIt became \u003cstrong\u003ejust a little bit\u003c/strong\u003e more difficult to participate Codeforces contest for Indian, Russian, etc.\u003c/li\u003e \u003cli\u003eIt became more easier \u003cstrong\u003egreatly\u003c/strong\u003e to participate Codeforces contest for Chinese, American, etc.\u003c/li\u003e \u003cli\u003eOn the whole, I think active users would increase because it seems that there are many people who didn\u0027t cannot participate because of time.\u003c/li\u003e \u003c/ul\u003e \u003cbr /\u003e This is just my suggestion, but I think this is also a strategy to increase users and to make codeforces more active.\u003cbr /\u003e \u003cbr /\u003e Thank you for listening.\u003c/div\u003e","tags":["codeforces","time","distribution","mystery"]}}