{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1497020227,"rating":3,"authorHandle":"Unlimited_Time","modificationTimeSeconds":1497020227,"id":52493,"title":"\u003cp\u003eNotes on Codeforces Beta Round #51, A(Use periodic property to limit the search times), B, C\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eA. Flea travel\u003c/p\u003e\u003cp\u003eSuppose that at first the flea is at position S. According to the problem, the flea will appear at position \u003c/p\u003e\u003cp\u003e(S+1+2+3+...+t-1)%N\u003d(S+(t-1)*t/2 )%N\u003c/p\u003e\u003cp\u003eafter the t-th minute. It seems that we have to check infinite times to find out whether it can appear at all the positions, which is in fact impossible. However, we can prove that if the flea is at position V after the t-th minute, then it must return to position V after the (t+2*N)-th minute. The proof is \u003c/p\u003e\u003cp\u003e(S+(t+2*N-1)*(t+2*N)/2 )%N\u003d(S+(t-1)*t/2+(t-1)*N+t*N+2*N*N)%N\u003d(S+(t-1)*t/2 )%N\u003c/p\u003e\u003cp\u003eTherefore, it is sufficient to check from 0-th minute to (2*N-1)-th minute, and then we can find out whether the flea can visit all the positions or not.\u003c/p\u003e\u003cp\u003eB. Smallest number\u003c/p\u003e\u003cp\u003eWe can generate all the feasible permutation of the given four integers, and denote the them as a,b,c,d. Furthermore, we denote the operations as x,y,z. Then, we can first calculate ((a x b) y c) z d, and then calculate ((a x b) z (c y d)). For all the results that we have obtained, it is sufficient to record the minimum one and this is just the answer.\u003c/p\u003e\u003cp\u003eC. Pie or die\u003c/p\u003e\u003cp\u003eA problem that is full of tricks...\u003c/p\u003e\u003cp\u003eFor the i-th pie, we can calculate its Manhattan distance to the four borders. Among the four Manhattan distances, we only focus on the minimum one, denoted as d[i], and the corresponding border is denoted as B[i]. Furthermore, we select the pie which has the minimum distance d[i], and this distance is denoted as D while the corresponding border is B. Then, we consider the answer based on the value of D.\u003c/p\u003e\u003cp\u003e1) D\u003d0: the answer is obviously yes;\u003c/p\u003e\u003cp\u003e2) D\u003d1: the answer is yes; one simple strategy is to first move one step closer to border B; if this position is not blocked, then we win; otherwise we move on to the corner along the border (we can choose any corner); as the corner in fact \u0026quot;provides\u0026quot; two \u0026quot;exits\u0026quot; to escape from the board, the two \u0026quot;exits\u0026quot; cannot be blocked at the same time;\u003c/p\u003e\u003cp\u003e3) D\u003d2,3,4: the answers are all yes; the strategy is that we always first try to move to the border B and then move on along the four borders until we find a corner with two \u0026quot;exits\u0026quot; which cannot be blocked at the same time; it is guaranteed that if D\u0026lt;\u003d4, there is always a corner that has two \u0026quot;exits\u0026quot; and they cannot be blocked at the same time, which can be proved as follows:\u003c/p\u003e\u003cp\u003eNote that it takes us four steps to reach the border B. The competitor can take advantage of these four steps to block one \u0026quot;exit\u0026quot; (or edge) for each of the four corners. However, this means that when we arrive at the border, we can successfully escape since only the \u0026quot;exits\u0026quot; at the four corners have been blocked. If the competitor only blocks one \u0026quot;exit\u0026quot; (edge) for some (not all) of the four corners, we can move on along the border B and will finally arrive at the corner which has two \u0026quot;exits\u0026quot;.\u003c/p\u003e\u003cp\u003e4) D\u0026gt;\u003d5: the answer is always no; the reason is that before we arrive at the border B, at least one of the \u0026quot;exits\u0026quot; (edges) at the four corners have been blocked; thus when we arrive at border B, the competitor can just block the edge that we are facing to, and even when we reach the corner, there exists only one \u0026quot;exit\u0026quot; and the competitor can always block it immediately after we arrive there.\u003c/p\u003e\u003c/div\u003e","tags":[]}}