{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1424213178,"rating":1383,"authorHandle":"Enchom","modificationTimeSeconds":1424257776,"id":16473,"title":"\u003cp\u003eWho sorry_dreamoon really is\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everybody. So I was really bored tonight and looked at so many comments being like \u0026quot;\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/sorry_dreamoon\" title\u003d\"Candidate Master sorry_dreamoon\"\u003esorry_dreamoon\u003c/a\u003e is X\u0026quot; and then people arguing and disagreeing. Since I had nothing better to do, I decided to finally unravel the truth of who he actually is. Here is the full case and how I actually got to him, hope you enjoy! :D\u003c/p\u003e\u003ch2\u003eSelection\u003c/h2\u003e\u003cp\u003eLet\u0027s start by the obvious. He managed to get first place in Div2 and he got second in Div1 (would\u0027ve been first if the scores were static). So what we know is that he is really good.\u003c/p\u003e\u003cp\u003eLet\u0027s look at the past 10 Div1 contests. It turns out that only 8 times it happened that someone with a rating of less than 2500 got in top5. This is 8 times out of 50 people being in top5. But he was second and almost first, so he is better than that.\u003c/p\u003e\u003cp\u003eIt turns out actually, that in the past 10 Div1 contests, only 2 times it happened that someone with rating less than 2500 got in top3.\u003c/p\u003e\u003cp\u003eCombining this information with \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/sorry_dreamoon\" title\u003d\"Candidate Master sorry_dreamoon\"\u003esorry_dreamoon\u003c/a\u003e\u0027s confidence and great results — we can assume that his rating is 2500+. That leaves us with \u003cstrong\u003e76 suspects\u003c/strong\u003e.\u003c/p\u003e\u003ch2\u003eReducing the suspects\u003c/h2\u003e\u003cp\u003eAs pointed out a few times, the obvious way is to remove all people that participated in CF rounds #284 and #292, as those are the rounds \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/sorry_dreamoon\" title\u003d\"Candidate Master sorry_dreamoon\"\u003esorry_dreamoon\u003c/a\u003e participated in. Obviously it\u0027s hard to perform well on two accounts, so we can be sure those people are not him. Removing those from our suspect list we are left with \u003cstrong\u003e36 suspects\u003c/strong\u003e.\u003c/p\u003e\u003ch2\u003eReducing the suspects even further\u003c/h2\u003e\u003cp\u003eAs you can notice from the \u003ca href\u003d\"/blog/entry/16446\"\u003eblog post of round #292\u003c/a\u003e \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/dreamoon\" title\u003d\"Grandmaster dreamoon\"\u003edreamoon\u003c/a\u003e invited \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/sorry_dreamoon\" title\u003d\"Candidate Master sorry_dreamoon\"\u003esorry_dreamoon\u003c/a\u003e to participate 26hrs ago (as of when I was investigating) and the respond (top comment) was almost immediate. This shows that our suspect was browsing codeforces at the time. And since the account was initially made only as a one-time joke, he most likely was browsing from his real account.\u003c/p\u003e\u003cp\u003eSo from this, we can remove all our suspects that havent logged in the last 26 hours.\u003c/p\u003e\u003cp\u003eWell, believe it or not, we\u0027re down to \u003cstrong\u003e18 suspects\u003c/strong\u003e!\u003c/p\u003e\u003ch2\u003eThe final conclusion\u003c/h2\u003e\u003cp\u003eNow here the things start to get a little bit tricky. But imagine the following scenario:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eYou create an account with the only purpose to be first in a competition. If you fail, it will be somewhat embarrasing. While you want to keep your identity private, you want to be as good as you can. Would you use your primary programming language?\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eFor me at least, the answer is absolutely \u003cstrong\u003eyes\u003c/strong\u003e. If you are used to a language, then your maximum performance is with that language and changing it is incredibly risky.\u003c/p\u003e\u003cp\u003eWhile not certain as the other two methods of eliminating, this method is still logical — \u0026quot;there is no good investigation without some assumptions\u0026quot;.\u003c/p\u003e\u003cp\u003eSo, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/sorry_dreamoon\" title\u003d\"Candidate Master sorry_dreamoon\"\u003esorry_dreamoon\u003c/a\u003e is using Java. Guess how many people from our 18-people-long suspect list use Java? That\u0027s right, you got it — \u003cstrong\u003e1\u003c/strong\u003e!\u003c/p\u003e\u003cp\u003e\u003cem\u003eAnd who is it... \u003cstrong\u003einserting drum roll\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/qwerty787788\" title\u003d\"Grandmaster qwerty787788\"\u003eqwerty787788\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eNot convinced yet?\u003c/h2\u003e\u003cp\u003eYou know, when we try to mask our code we would usually change names of variables and functions but the structure and the way your thought goes is hard to change. So, it turns out that \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/sorry_dreamoon\" title\u003d\"Candidate Master sorry_dreamoon\"\u003esorry_dreamoon\u003c/a\u003e has a code including maximum flow — \u003ca href\u003d\"/contest/499/submission/9251954\" title\u003d\"Submission 9251954 by sorry_dreamoon\"\u003e9251954\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eIt turns out that \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/qwerty787788\" title\u003d\"Grandmaster qwerty787788\"\u003eqwerty787788\u003c/a\u003e has maximum flow too, in the recent Rockethon — \u003ca href\u003d\"/contest/513/submission/9762794\" title\u003d\"Submission 9762794 by qwerty787788\"\u003e9762794\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eSo, looking at the function that actually does the flow you can see the following:\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/qwerty787788\" title\u003d\"Grandmaster qwerty787788\"\u003eqwerty787788\u003c/a\u003e\u0027s code :\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eclass Flow {\n\tint n;\n\tArrayList\u0026lt;Edge\u0026gt;[] g;\n\n\tFlow(int n) {\n\t\tthis.n \u003d n;\n\t\tg \u003d new ArrayList[n];\n\t\tfor (int i \u003d 0; i \u0026lt; n; i++) {\n\t\t\tg[i] \u003d new ArrayList\u0026lt;\u0026gt;();\n\t\t}\n\t\tq \u003d new int[n];\n\t\th \u003d new int[n];\n\t\tcur \u003d new int[n];\n\t}\netc\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eAnd this is \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/sorry_dreamoon\" title\u003d\"Candidate Master sorry_dreamoon\"\u003esorry_dreamoon\u003c/a\u003e\u0027s code :\u003c/p\u003e \u003cpre\u003e\u003ccode\u003estatic class Flow {\n        int n;\n        ArrayList\u0026lt;Edge\u0026gt;[] g;\n\n        Flow(int n) {\n            this.n \u003d n;\n            g \u003d new ArrayList[n];\n            for (int i \u003d 0; i \u0026lt; n; i++) {\n                g[i] \u003d new ArrayList\u0026lt;\u0026gt;();\n            }\n            q \u003d new int[n];\n            h \u003d new int[n];\n            cur \u003d new int[n];\n        }\netc\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eWhat is the difference? It\u0027s literally the word \u0026quot;static\u0026quot;.\u003c/p\u003e\u003cp\u003eThis is just a small fraction of the flow class. About 90% of it is completely identical.\u003c/p\u003e\u003ch2\u003eConclusion\u003c/h2\u003e\u003cp\u003eTo be honest I really liked the mysteriousness of \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/sorry_dreamoon\" title\u003d\"Candidate Master sorry_dreamoon\"\u003esorry_dreamoon\u003c/a\u003e but I really had nothing better to do tonight and since I really wanted to live my detective-dream, I hope everybody takes my work with a smile :)\u003c/p\u003e\u003cp\u003eP.S.\u003c/p\u003e\u003cp\u003eAnd in case \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/dreamoon\" title\u003d\"Grandmaster dreamoon\"\u003edreamoon\u003c/a\u003e hadn\u0027t figured that out by himself yet, I hope it helps him sleep better at night :D\u003c/p\u003e\u003cp\u003eP.S.S.\u003c/p\u003e\u003cp\u003eI hope this doesn\u0027t bring any problems to \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/qwerty787788\" title\u003d\"Grandmaster qwerty787788\"\u003eqwerty787788\u003c/a\u003e since he is a very good coder and I think we all can agree that this was a very well carried out joke (though technically my \u0026quot;logic\u0026quot; isn\u0027t a solid proof that it\u0027s him at all)\u003c/p\u003e\u003c/div\u003e","tags":[]}}