{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1474391147,"rating":144,"authorHandle":"vepifanov","modificationTimeSeconds":1474888116,"id":47238,"title":"\u003cp\u003eIntel Code Challenge\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cem\u003eНезависимо от того, официально вы будете участвовать в Intel Code Challenge или нет, участие в раундах на Codeforces будет открыто для всех. \u003cstrong\u003eУ всех участников будет пересчитан рейтинг.\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/fb/59/fb5983cb4bc9ddd5ebd7ad29e37135666a97db03.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eКорпорация Intel проводит соревнование по программированию Intel Code Challenge (\u003ca href\u003d\"http://codechallenge.ipdnn.com/\"\u003ehttp://codechallenge.ipdnn.com/\u003c/a\u003e), приуроченное к крупной технологической партнерской конференции Intel Partners Day.\u003c/p\u003e\u003cp\u003eПобедители соревнования будут награждены ценными призами, а также поездкой на технологическую конференцию, которая пройдёт в г. Нижний Новгород. Главный победитель, набравший по итогам соревнования наибольшее количество баллов, получит возможность посетить одно из международных научных событий.\u003c/p\u003e\u003cp\u003eВ соревновании могут принять участие граждане РФ в возрасте от 18 до 27 лет.\u003c/p\u003e\u003cp\u003eСоревнование будет проводиться на Codeforces в два раунда: заочный и очный.\u003cbr /\u003e Для того, чтобы принять участие в Intel Code Challenge, необходимо ознакомиться с условиями проведения соревнования и зарегистрироваться по ссылке \u003ca href\u003d\"http://codechallenge.ipdnn.com/register\"\u003ehttp://codechallenge.ipdnn.com/register\u003c/a\u003e. Город, в котором вы реально сможете принять участие во втором (очном) раунде, нужно выбрать при регистрации. Участники, зарегистрировавшиеся на Intel Code Challenge, будут разделены на группы по выбранному городу. В каждой группе 25 лучших участников первого раунда пройдут во второй этап.\u003c/p\u003e\u003cp\u003eСписок городов, где будет проходить очный этап (тревел-грант не предусмотрен): \u003c/p\u003e\u003cul\u003e  \u003cli\u003eМосква\u003c/li\u003e  \u003cli\u003eСанкт-Петербург\u003c/li\u003e  \u003cli\u003eНижний Новгород\u003c/li\u003e  \u003cli\u003eАрхангельск\u003c/li\u003e  \u003cli\u003eВолгоград\u003c/li\u003e  \u003cli\u003eКазань\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eДля участия в очном этапе конкурса необходимо будет иметь с собой ноутбук с возможностью доступа в Интернет. Длительность раундов составит 2 часа в отборочном и 3 часа в основном туре.\u003c/p\u003e\u003cp\u003eРаунды будут проведены по обычным правилам Codeforces.\u003c/p\u003e\u003cp\u003eГрафик проведения соревнования: \u003c/p\u003e\u003cul\u003e \u003cli\u003eОкончание приема заявок: 1 октября 2016 г. в 17:00 по московскому времени\u003c/li\u003e \u003cli\u003e1-й этап (заочный) – 1 октября 2016 г.\u003c/li\u003e \u003cli\u003e2-й этап (очный) – 8 октября 2016 г.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eПо итогам очного этапа соревнований в каждом из городов проведения конкурса победители получат: \u003c/p\u003e\u003cul\u003e \u003cli\u003e1 место: Микрокомпьютер Intel® Compute Stick и тревел-грант на посещение конференции «Intel Partners Day» 9-го ноября 2016 г. в Нижнем Новгороде\u003c/li\u003e \u003cli\u003e2 место: Фитнес-браслет\u003c/li\u003e \u003cli\u003e3 место: Внешний аккумулятор\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eПобедитель очного этапа, набравший наибольшее количество баллов среди всех участников, получит тревел-грант на посещение одного из международных научных событий.\u003c/p\u003e\u003cp\u003eОба раунда будут рейтинговыми и доступными для участия всем пользователям Codeforces.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eКак указано на главной странице, заявка должна содержать следующую информацию: \u003c/p\u003e\u003cul\u003e \u003cli\u003eФамилия, Имя и Отчество заявителя\u003c/li\u003e \u003cli\u003eE-Mail\u003c/li\u003e \u003cli\u003eВУЗ или место работы\u003c/li\u003e \u003cli\u003eКурс или должность\u003c/li\u003e \u003cli\u003eГород проживания или учебы\u003c/li\u003e \u003cli\u003eГород, в котором вы планируете проходить очный этап, если пройдете в финал\u003c/li\u003e \u003cli\u003eЛогин на Codeforces\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":["intel code challenge"]}}