{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1498110138,"rating":219,"authorHandle":"pulgares","modificationTimeSeconds":1498131444,"id":52818,"title":"\u003cp\u003eCompetitive Programming Tutoring\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi codeforces :)\u003c/p\u003e\u003cp\u003eMy name is Augusto and I\u0027ve been doing competitive programming for some years now. Rapid City World Finals were my second ICPC WF, so my ICPC-contestant times are over :\u0027( But I still have a long way to go to become a red coder! And also a lot of coaching to new contestants at my college :)\u003c/p\u003e\u003cp\u003eMeanwhile...\u003c/p\u003e\u003cp\u003eI know codeforces community is great and you can get help just by asking, but I wanted to try giving online competitive programming tutoring to people that feel like they need or that they\u0027d like this kind of help. People here are great and as I said, you can always get help, easily, but usually it\u0027s not a very dedicated help (though there are amazing exceptions to this! (amazing codeforces community is amazing)) and maybe that\u0027s exactly what you feel you need, somebody that dedicates a couple of hours to help you :) Maybe talk about some algorithm you want to understand better, or about some problems you need help with, gaining intuition on some kind of problems, talk about my experience at the world finals or in codeforces contests (it isn\u0027t much but maybe it can help you), talk about what I think has helped me the most to improve my skills and about what you\u0027re doing to improve yourself... anything you want (except, probably, geometry D:). I actually have given a lot of lessons to friends at my college, just wanted to try it online now because:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eI want to improve my English. I think I\u0027m not that bad explaining algorithms and problem solutions in my mother tongue (I\u0027m not the best either :D), but I need practice doing it in English :)\u003c/li\u003e   \u003cli\u003eI would like to charge some payment (I know I wouldn\u0027t get rich or anything ;)). In my free time I give math (sometimes physics) lessons to high school students but I find this really boring and unrewarding :( mostly because the students aren\u0027t usually interested, they take the lessons because they have to pass some test or basically because their parents made them take it. I do it just because of the money and just to pay my very small expenses. If I could get some money out of these online lessons I could give fewer high school lessons (hence, I could be happier :)).\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eI know I\u0027m nowhere near the best coder here, but still I think I could help a lot div2 people who\u0027s struggling to improve themselves, as I\u0027ve done a lot with people at my college.\u003c/p\u003e\u003cp\u003eBut before formally charging money I have to see how the lessons go. So, for now, I will just accept whatever you feel paying, even nothing (I would appreciate at least something, though, hahaha :\u0027( due to my country\u0027s horrible economic situation, even a little money makes a big difference to me).\u003c/p\u003e\u003cp\u003eSo what do you say? Are you interested? Send me a message with the topic or problems you want me to help you with and I\u0027ll prepare the lesson :) then we can agree on the time!\u003c/p\u003e\u003cp\u003eAny comment/idea/thought are more than welcome :)\u003c/p\u003e\u003c/div\u003e","tags":["tutor","tutoring","lesson"]}}