{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1434916417,"rating":7,"authorHandle":"gkeesh7","modificationTimeSeconds":1434916417,"id":18779,"title":"\u003cp\u003eCounting Problem\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eGreetings Everyone,\u003c/p\u003e\u003cp\u003eI know this sounds pretty much like a homework problem that\u0027s why I was hesitant to ask it in the first place. (I could have asked someone through a PM but I have lost faith in such methods lately)\u003c/p\u003e\u003cp\u003eAnyways,\u003c/p\u003e\u003cp\u003e\u003cem\u003eThere are 3n balls in total, of 3 different colours , (i.e. n balls of each colour) find the number of ways you can arrange them in a row such that no two balls of the same colour are adjacent\u003c/em\u003e \u003c/p\u003e\u003cp\u003eThe various approaches which I could google include,\u003c/p\u003e\u003cp\u003e1 ) Principle of Inclusion and Exclusion :- It stated \u003cem\u003eFind the total number of ways of arranging 3n balls with the constraints (i.e. n identical balls of each colour) then subtract from it the number of ways in which atleast two balls of same colour are together.\u003c/em\u003e But I couldn\u0027t derive a formula from it :( the one I derived was wrong.\u003c/p\u003e\u003cp\u003e2 ) Someone on Quora said to brute force till n\u003d5 and guess the formula.\u003c/p\u003e\u003cp\u003e3 ) Suggestions of O(n^3) DP from a freind. Don\u0027t know how to do it. \u003c/p\u003e\u003cp\u003eI still think this is a pretty standard Permutations problem but sorry I guess my googling sucks.\u003c/p\u003e\u003cp\u003eAny Resource / Approach / Formula would be deeply appreciated.\u003c/p\u003e\u003cp\u003eI am sorry if this is a stupid problem, Also if you would like to answer a follow up.\u003c/p\u003e\u003cp\u003eI was thinking of generalizing this problem to kn balls and k different colours. How to do it ?\u003c/p\u003e\u003cp\u003eThanks in Advance.\u003c/p\u003e\u003c/div\u003e","tags":["counting","math","formula"]}}