{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1499766821,"rating":109,"authorHandle":"MiptLited","modificationTimeSeconds":1499768062,"id":53228,"title":"\u003cp\u003eDiscover Grodno by Moscow Workshops ACM ICPC\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eWe invite you to participate in the boot camp that will be held at \u003ca href\u003d\"https://www.grsu.by/ru/\"\u003eYanka Kupala Grodno State University\u003c/a\u003e in collaboration with Moscow ACM ICPC Workshops from 15 to 25 August, 2017. \u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/57/4c/574ce325de02560b9dca0aa909237abf09fdb018.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e The main purpose of the camp is to prepare student teams that participate in ACM ICPC season 2017/2018 to successful performance in this competition. There will be two division. \u003cfont color\u003d\"red\"\u003e\u003cstrong\u003eDivision B\u003c/strong\u003e\u003c/font\u003e is designed for participants of the ACM ICPC Regionals level and above. The official language of Division B is \u003cstrong\u003e English\u003c/strong\u003e. Another division is \u003cfont color\u003d\"#FFA500\"\u003e\u003cstrong\u003eDivision C\u003c/strong\u003e\u003c/font\u003e, which is designed for newcomers to the world of competitive programming. The official language of Division C is \u003cstrong\u003e Russian\u003c/strong\u003e. The curriculum of both divisions features contests, analyses and thematic lectures. The part of lectures will be for both divisions, also there will be thematic separate lectures for \u003cstrong\u003eDivision B\u003c/strong\u003e and \u003cstrong\u003eDivision C\u003c/strong\u003e.\u003cp\u003eThe cost of participation per single person is: 490 USD. \u003c/p\u003e\u003cp\u003eThe cost features the curriculum, food and accommodation at the Grodno State University campus and trip schedule on days-off.\u003c/p\u003e\u003cp\u003eGrodno State University, being located almost in the center of Europe, is one of the centers for ACM ICPC coaching. Among the events hosted at GrSU are: bootcamps and open competitive programming championships.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRegistrate \u003ca href\u003d\"https://docs.google.com/forms/d/e/1FAIpQLSco_Rvbbi8jrKG1e-I1Nv-u93C6ybUdwMMv3xaAg0chvv4LvQ/viewform\"\u003ehere!\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e \u003cp\u003eRecommended time of arrival: August 14, or 15 until 12:00am\u003c/p\u003e \u003cp\u003eRecommended time of departure: August 26, or 25 after 20:00 (8pm)\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://it-edu.mipt.ru/en/discover_grodno\"\u003eLook here for more information.\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}