{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1440074166,"rating":-54,"authorHandle":"Huyum_nik","modificationTimeSeconds":1440074241,"id":19878,"title":"\u003cp\u003eWho today would look FOOTBALL ????\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eAdmin tighten up on the main evening pliz !!!!\u003c/p\u003e\u003ch2\u003eHELLO KODFORSOVTSY\u003c/h2\u003e\u003ch1\u003e** Today is a very historic moment Machala already two of the Europa League, \u0026quot;Krasnodar\u0026quot; at 20:00 MSK will HJK and \u0026quot;Ruby\u0026quot; at 21:00 MSK will play in Skopje with Macedonian club \u0026quot;Rabotnicki\u0026quot;. **\u003c/h1\u003e\u003cp\u003eHere are the details:\u003c/p\u003e\u003cp\u003e\u0026quot;Krasnodar\u0026quot; and \u0026quot;Ruby\u0026quot; will start in the play-off round of the Europa League\u003c/p\u003e\u003cp\u003e03: 4620.08.2015 (updated: 08/20/2015 3:49) 1164 On Thursday in the first round match of the playoffs, \u0026quot;Krasnodar\u0026quot; at 20:00 MSK will HJK and \u0026quot;Ruby\u0026quot; at 21:00 MSK will play in Skopje with Macedonian club \u0026quot;Rabotnicki\u0026quot;. Match Krasnodar \u0026amp; mdash; Rubin, archive photo © RIA Novosti. Vitaly Timko | Buy graphic\u003c/p\u003e\u003cp\u003eKRASNODAR, August 20 — R-Sport, Ildar Satdinov. Footballers \u0026quot;Krasnodar\u0026quot; and Kazan \u0026quot;Ruby\u0026quot; in the struggle for an exit in the group stage of the Europa League will meet with Finnish HIKom and Macedonian club \u0026quot;Rabotnicki\u0026quot; respectively.\u003c/p\u003e\u003cp\u003eOn Thursday in the first round match of the playoffs, \u0026quot;Krasnodar\u0026quot; at 20:00 MSK will HJK and \u0026quot;Ruby\u0026quot; at 21:00 MSK will play in Skopje \u0026quot;Rabotnicki\u0026quot;. Attacking football, \u0026quot;Krasnodar\u0026quot; not afraid of HJK\u003c/p\u003e\u003cp\u003e\u0026quot;Krasnodar\u0026quot; on the eve of the match with the Finns managed to beat away the defending champion Russia St. Petersburg \u0026quot;Zenith\u0026quot; (2: 0). At the same time the head coach of the \u0026quot;bulls\u0026quot; Oleg Kononov said that the game of his team at the moment is far from ideal.\u003c/p\u003e\u003cp\u003e\u0026quot;I can not say that the game against the\u0026quot; Zenith \u0026quot;was exemplary. The play then well in the selection of the ball really. But in attack, we did not act so well. I am sure that the team agrees with me on this. They can no longer, they are skilled enough players and can play against any opponent. We still need to move on in the game, in the organization of the game, \u0026quot;- said Kononov.\u003c/p\u003e\u003cp\u003eHead coach Oleg Kononov Krasnodar. Archival photo © RIA Novosti. Alexey Filippov | Buy graphic Kononov: the players, \u0026quot;Krasnodar\u0026quot; need to improve the quality of the game Evaluating Features Hick, head coach of the \u0026quot;bulls\u0026quot; said the ability to play an opponent dangerous standard provisions.\u003c/p\u003e\u003cp\u003e\u0026quot;For the matches Hick, I was looking, I like this team, like its orderliness in the selection of goals. This team focuses on attack, their attack is based on the powerful center, two forwards and two wingers that are shifted to the middle. Plus they powerfully played draw with the standard points in front of goal, \u0026quot;- said Kononov at the pre-match press conference.\u003c/p\u003e\u003cp\u003eDefender Markus Haykkinen Hick, in turn, said that his team did not attach particular importance to attacking style of play, \u0026quot;Krasnodar\u0026quot;.\u003c/p\u003e\u003cp\u003e\u0026quot;We know that\u0026quot; Krasnodar \u0026quot;is very strong. Our goal in the first leg — provide a convenient result for us to fully prepared to come to the home game. It\u0027s hard to say what kind of account will be convenient for us, every match has its own story. But I I do not think that attacking football, \u0026quot;Krasnodar\u0026quot; is now important for us. When we play in the Europa League and Championship in Finland, we are able to use both types of games — both defensive and attacking, \u0026quot;- said Haykkinen. \u0026quot;Ruby\u0026quot; to expect a difficult game, \u0026quot;Rabotnicki\u0026quot;\u003c/p\u003e\u003cp\u003eFootball. Archive photos. © RIA Novosti. Vitaliy Belousov | Buy graphic Rival \u0026quot;Ruby\u0026quot; by LE \u0026quot;Rabotnicki\u0026quot; won the championship match of Macedonia Kazan in good spirits coming to the away match with the \u0026quot;Rabotnicki\u0026quot;. \u0026quot;Ruby\u0026quot;, having achieved victory in the recent league match against Russia Krasnodar \u0026quot;Kuban\u0026quot; (1: 0), interrupted by a series of four defeats and went from last place in the standings. According to the chief coach of \u0026quot;ruby\u0026quot; Rinat Bilyaletdinov, his team will face a serious test in the two-legged showdown with the Macedonian club.\u003c/p\u003e\u003cp\u003e\u0026quot;If someone thinks that we got an easy opponent, he is much mistaken.\u0026quot; Rabotnicki \u0026quot;- an experienced tournament fighter with played and capable staff, angry, uncompromising team. With a player less, they in extra time failed to score in the Turkish\u0026quot; Trabzonspor . \u0026quot;It is worth it. We are waiting for a very difficult test, and pass the Macedonian team, we will be quite difficult,\u0026quot; — said Bilyaletdinov.\u003c/p\u003e\u003cp\u003eCoach \u0026quot;Rabotnicki\u0026quot; Igor Angelovski said that his team is not going to move away from their style of play in a match with \u0026quot;Ruby\u0026quot;.\u003c/p\u003e\u003cp\u003e\u0026quot;We can achieve a good result before the second leg. We know with what team we play, we respect the opponent, but will do everything possible to win. I do not plan to change anything, we\u0027ll be playing in his usual style,\u0026quot; — said Angelovski.\u003c/p\u003e\u003ch2\u003e** ALSO ESSENTIAL READING many wise RASUZHDENY: ** \u003ca href\u003d\"http://www.sovsport.ru/blogs/blog/bmessage-item/41516\"\u003ehttp://www.sovsport.ru/blogs/blog/bmessage-item/41516\u003c/a\u003e\u003c/h2\u003e\u003ch1\u003eLET THERE OBSUDAT STROKES Maciej ???? For what rosiyskogo command sick longer and why ??????\u003c/h1\u003e\u003cp\u003eSpecial Interests opinion on who would win \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Legendary grandmaster Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/vepifanov\" title\u003d\"Legendary grandmaster vepifanov\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003ev\u003c/span\u003eepifanov\u003c/a\u003e \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/qwerty787788\" title\u003d\"Legendary grandmaster qwerty787788\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eq\u003c/span\u003ewerty787788\u003c/a\u003e \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/rng_58\" title\u003d\"Legendary grandmaster rng_58\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003er\u003c/span\u003eng_58\u003c/a\u003e \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/niyaznigmatul\" title\u003d\"International Grandmaster niyaznigmatul\"\u003eniyaznigmatul\u003c/a\u003e \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/WJMZBMR\" title\u003d\"International Grandmaster WJMZBMR\"\u003eWJMZBMR\u003c/a\u003e \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/TooSimple\" title\u003d\"International Grandmaster TooSimple\"\u003eTooSimple\u003c/a\u003e [user: scott_wu, 2015 -08-20] \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/yeputons\" title\u003d\"International Grandmaster yeputons\"\u003eyeputons\u003c/a\u003e but not just write all the others too !!! :))\u003c/p\u003e\u003cp\u003e** For one fell swoop, and they look to the big sports razbirayutsya **\u003c/p\u003e\u003c/div\u003e","tags":[]}}