{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1416265135,"rating":52,"authorHandle":"Enchom","modificationTimeSeconds":1416265686,"id":14744,"title":"\u003cp\u003eUnderstanding Fast Fourier Transform\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everybody,\u003c/p\u003e\u003cp\u003eSometime ago I learnt \u003ca href\u003d\"http://en.wikipedia.org/wiki/Fast_Fourier_transform\"\u003eFFT\u003c/a\u003e and its application in multiplying numbers. I never understood completely how it works but I sort of understood the way it multiplied numbers. \u003c/p\u003e\u003cp\u003eNow lately I\u0027ve heard friends of mine talking about FFT and using it in places I couldn\u0027t possibly imagine how would FFT help. I\u0027m having trouble understanding what does FFT compute at all. Wikipedia talks about complex sinusoids and I\u0027ve tried understanding it but I just jump from a huge article to another and get lost in countless definitions and equations.\u003c/p\u003e\u003cp\u003eA classic example of what I mean is the \u003ca href\u003d\"/contest/472/problem/G\"\u003efollowing problem\u003c/a\u003e. The \u003ca href\u003d\"/blog/entry/14028\"\u003eeditorial\u003c/a\u003e talks about FFT but I can\u0027t even comprehend what it is saying.\u003c/p\u003e\u003cp\u003eNow I know that FFT involves quite serious mathematical theory that I most likely don\u0027t know, since I\u0027m only 10th grade, but as I\u0027m competing quite actively in many competitions I thought that understanding it is quite important.\u003c/p\u003e\u003cp\u003eI would be extremely grateful if someone could help me out in understanding what exactly is this algorithm doing by explaining or pointing me to a place I can learn it from. While Wikipedia often has tons of information, it often lacks simplicity and learning from it directly can be really tough.\u003c/p\u003e\u003cp\u003eI am looking for an explanation that would help me understand the concept and idea of the algorithm, and \u003cstrong\u003enot\u003c/strong\u003e code or implemenations.\u003c/p\u003e\u003cp\u003eThanks in advance :)\u003c/p\u003e\u003c/div\u003e","tags":[]}}