{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1432286654,"rating":14,"authorHandle":"kirakira","modificationTimeSeconds":1432286730,"id":18025,"title":"\u003cp\u003eGoogle Code Jam 2015 Round 1C Problem B\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eAfter reading the analysis of this problem, I once again think that my concept in probability / excepted value is so bad that I should kill myself.\u003c/p\u003e\u003cp\u003eHere is the link of the problem: \u003ca href\u003d\"http://code.google.com/codejam/contest/4244486/dashboard#s\u003dp1\"\u003eTypewriter Monkey\u003c/a\u003e\u003c/p\u003e\u003cp\u003eAnyway my problem is about the part of calculating the Expected Number of Bananas (# Occurrence of pattern in the string)\u003c/p\u003e\u003cp\u003eOriginally, my thought is the most basic one about Expected Value (which I think it must be correct?):\u003c/p\u003e\u003cp\u003e\u003ccode\u003eE(X) \u003d P(Exact 1 banana)*1 + P(Exact 2 bananas)*2 + ...\u003c/code\u003e\u003c/p\u003e\u003cp\u003eThen I stop right here and think that, it is too hard for me to find the probability...I cannot count it directly as it will double count a lot, I know no good way to use Inclusion-Exclusion Principle here either...I have no idea.\u003c/p\u003e\u003cp\u003eThen I read the solution and it said: \u003c/p\u003e \u003cpre\u003e\u003ccode\u003eBy linearity of expectation, the expected number of copies is then just P multiplied by the number of places the string can occur, which is S-L+1.\n\nwhere P is the probability of occurrence of the pattern at a fixed point\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eNow P is easy to calculate as it does not need to consider any repeating / overlapped cases.\u003c/p\u003e\u003cp\u003eHowever I cannot understand that why simply \u003ccode\u003eP*(S-L+1)\u003c/code\u003e would be the answer?\u003c/p\u003e \u003cpre\u003e\u003ccode\u003ePrecisely, how can I deduce that E(X) \u003d P(Exact 1 banana)*1 + P(Exact 2 bananas)*2 + ... \u003d P*(S-L+1)\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003ePS: If anyone can provide any source / tutorial for probability (Programming Contest Oriented is better!), I would be very appreciate that I will send a million \u0026quot;Thank You\u0026quot; messages, separately, to your inbox :)\u003c/p\u003e\u003c/div\u003e","tags":["gcj","probability"]}}