{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1502016511,"rating":-23,"authorHandle":"KamilBek","modificationTimeSeconds":1502016765,"id":53714,"title":"\u003cp\u003eКоманда Казанского федерального университета принимает участие в сборах Сазанка-2017. Спонсором выступил CLOVER GROUP\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eКоманда КФУ принимает участие в медународной школе по программированию Сазанка-2017. От нашего университета выступают Нигматуллин Ранис(3 курс ИВМиИТ-ВМК КФУ), Иликаев Артем(1 курс ИВМиИТ-ВМК КФУ), Капралов Руслан(1 курс ИВМиИТ-ВМК КФУ).\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/c6/01/c6016615d65b037f973214e49da9bb8006f6202b.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eРебята получают новые знания и тренируются перед новым сезоном.\u003c/p\u003e\u003cp\u003eМы благодарим спонсоров за финансирование этой поездки. Спонсором выступила компания CLOVER GROUP. Мы приведем информацию о компании:\u003c/p\u003e\u003cp\u003eРоссийский разработчик платформы интеллектуального анализа данных для промышленных предприятий. Внедряем интеллектуальную предиктивную аналитику на промышленных предприятиях: энергетика, машиностроение, нефть, газ, металлообработка. В компании работают специалисты по машинному обучению, разработчики и отраслевые эксперты. Присоединяйтесь к Clover Group для трансформации производства в цифровое пространство и развития рынка IIoT.\u003c/p\u003e\u003cp\u003eВакансии:\u003c/p\u003e\u003cp\u003edata scientist \u003ca href\u003d\"https://tatarstan.hh.ru/vacancy/20221178\"\u003ehttps://tatarstan.hh.ru/vacancy/20221178\u003c/a\u003e java script \u003ca href\u003d\"https://tatarstan.hh.ru/vacancy/20347170\"\u003ehttps://tatarstan.hh.ru/vacancy/20347170\u003c/a\u003e python \u003ca href\u003d\"https://tatarstan.hh.ru/vacancy/20122520\"\u003ehttps://tatarstan.hh.ru/vacancy/20122520\u003c/a\u003e \u003c/p\u003e\u003cp\u003eClover Group itclover.ru Ищем data scientist в нашу команду. Мы российская компания, предоставляющая решения в области искусственного интеллекта и машинного обучения для отраслевых рынков.\u003c/p\u003e\u003cp\u003eМы создаем компанию хороших людей и считаем, что можно взять хорошего человека и сделать из него крутого специалиста. Но не наоборот.\u003c/p\u003e\u003cp\u003eЕсли тебе интересен индустриальный интернет вещей, машинное обучение и нейронные сети, то мы будем рады пообщаться и обсудить возможности нашего взаимодействия.\u003c/p\u003e\u003cp\u003eУровень зп обсуждаем на собеседовании.\u003c/p\u003e\u003cp\u003eВакансия Python developer Clover Group itclover.ru Ищем в нашу команду Python разработчика.\u003c/p\u003e\u003cp\u003eМы – молодые, умные и амбициозные, занимаемся разработкой в сфере индустриального интернета.\u003c/p\u003e\u003cp\u003eМы приближаем наступление эры IIoT, и если ты знаешь, что такое машинное обучение и нейронные сети хотя бы чуть больше, чем написано в википедии, приходи!\u003c/p\u003e\u003cp\u003eМы определенно ищем тебя, если ты:\u003c/p\u003e\u003cp\u003eЗнаешь ООП, python, sql, git; Работал с одним из фрейворков на python: django, flask, pyramid; Имеешь представление о numpy, pandas, spark; Знаком с SOLID, GRASP, паттернами проектирования, принципами функционального программирования. Что нужно будет делать:\u003c/p\u003e\u003cp\u003eПолучать данные из различных источников (базы данных, текстовые файлы, бинарные файлы); Работать с базами данных (postgresql, mongodb, cassandra, hive); Разрабатывать микросервисы. Важное о нас:\u003c/p\u003e\u003cp\u003eМы заморочены на качестве и крутых идеях; Мы стремимся быть лучшими; Мы точно знаем, чего хотим и всегда привержены своему стилю; В команду берем только по-настоящему близких по духу людей и по-хорошему амбициозных.\u003c/p\u003e\u003cp\u003eВакансия Java Script developer Clover Group itclover.ru Ищем в нашу команду Java Script разработчика.\u003c/p\u003e\u003cp\u003eМы – молодые, умные и амбициозные, занимающиеся разработкой в сфере индустриального интернета.\u003c/p\u003e\u003cp\u003eМы приближаем наступление эры IIoT, и если ты знаешь, что такое машинное обучение и нейронные сети хотя бы чуть больше, чем написано в википедии, приходи!\u003c/p\u003e\u003cp\u003eМы определенно ищем тебя, если ты:\u003c/p\u003e\u003cp\u003eПонимаешь JS: ES5, ES6, closures, prototype, callbacks, promises; Умеешь составлять простое веб-приложение без применения какого-либо framework; Понимаешь организационный процесс работы: gulp, linters, GIT; Имеешь представление о средствах помогающих в создании SPA приложений: Angular 1, Angular 2, React. Что нужно будет делать:\u003c/p\u003e\u003cp\u003eРазрабатывать интерфейс, с которым работает пользователь; Делать наш фронтэнд удобным и понятным; Быть нашим единомышленником. Важное о нас:\u003c/p\u003e\u003cp\u003eМы заморочены на качестве и крутых идеях; Мы стремимся быть лучшими; Мы точно знаем, чего хотим и всегда привержены своему стилю; В команду берем только по-настоящему близких по духу людей и по-хорошему амбициозных.\u003c/p\u003e\u003cp\u003eОтправляйте резюме/пишите \u003ca href\u003d\"mailto:hr@itclover.ru\"\u003ehr@itclover.ru\u003c/a\u003e Екатерина +7 (927) 043 12 14\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/f8/08/f808c04d2a6d92f791996ccc0e5187e7d41e14bf.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}