{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1426243785,"rating":20,"authorHandle":"infiniteloop17","modificationTimeSeconds":1426429662,"id":16930,"title":"\u003cp\u003eInvitation to participate in IOPC\u002715 organised by Techkriti, IIT Kanpur.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eDear coders,\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e The Techkriti team presents the 2015 edition of IOPC, the annual International Online Programming Contest of IIT Kanpur. This 24 hour long contest will have you competing with some of the best coders in the world in solving very challenging problems of an algorithmic nature. There will be total prizes worth 2500$ as well.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e IOPC 2015 will be held from 1800 hrs on March 14 to 1800 hrs on March 15 (IST) check \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dIOPC%2715+\u0026amp;iso\u003d20150314T18\u0026amp;p1\u003d176\u0026amp;ah\u003d23\u0026amp;am\u003d55\"\u003ehere\u003c/a\u003e for the exact time for you. Teams of upto 3 members can participate in the contest. The contest is open to all — however, to be eligible for prizes, the teams need to be comprised of students who are currently registered in some university only. It is not necessary that all students be from the same university.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e IOPC 2015 will be hosted on Codechef platform (\u003ca href\u003d\"http://www.codechef.com/IOPC2015\"\u003eLink to the contest page\u003c/a\u003e).\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e To participate in the contest, teams need to \u003ca href\u003d\"http://www.codechef.com/teams/register/IOPC2015\"\u003eregister on Codechef\u003c/a\u003e before the start of the contest. To be eligible for prizes, teams and members have to \u003ca href\u003d\"http://techkriti.org/competitions/#iopc\"\u003eregister on the IOPC page\u003c/a\u003e as well.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e The last year\u0027s contest link can be found \u003ca href\u003d\"http://www.codechef.com/IOPC2014\"\u003ehere\u003c/a\u003e . Visit the Codechef contest page and the IOPC site for rules and more details. \u003cbr /\u003e The contest has been prepared by \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/infiniteloop108\" title\u003d\"Candidate Master infiniteloop108\"\u003einfiniteloop108\u003c/a\u003e, \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/abhilak\" title\u003d\"Expert abhilak\"\u003eabhilak\u003c/a\u003e, \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/triveni\" title\u003d\"Expert triveni\"\u003etriveni\u003c/a\u003e, \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/sshekh\" title\u003d\"Expert sshekh\"\u003esshekh\u003c/a\u003e and \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/AIgen\" title\u003d\"Expert AIgen\"\u003eAIgen\u003c/a\u003e .\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e Important Notes\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e * Team registration needs to be done on the Codechef site bparticipate the contest. Even if the members of the team have individual Codechef IDs, a new team has to be registered for the contest. \u003cbr /\u003e * The event is part of Techkriti 2015. Prize dispatch will be done along with prizes for other events of Techkriti, and can be expected to arrive in two to three months.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e Expecting a grand participation!\u003c/p\u003e\u003cp\u003eHope you will enjoy the problems !\u003c/p\u003e\u003cp\u003eBest of Luck and Happy Coding !\u003c/p\u003e\u003cp\u003e\u003cb\u003e UPD \u003c/b\u003e : The Contest is now over. Thank you all for participating. The final scoreboard of the contest can be found here: (\u003ca href\u003d\"http://www.codechef.com/rankings/IOPC2015\"\u003eLink\u003c/a\u003e). We will publish the editorials soon.\u003c/p\u003e\u003c/div\u003e","tags":[]}}