{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1409329589,"rating":53,"authorHandle":"BYN","modificationTimeSeconds":1409489710,"id":13620,"title":"\u003cp\u003eShortcut! Round is over\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThank you all for participating in Bayan Programming Contest 2014-2015. We honestly didn\u0027t expect to host around 2500 contestants for the Shortcut! round.\u003c/p\u003e\u003cp\u003eWe had hosted 7 successful rounds with previous stable version of our platform, but due to major changes in it, we needed to test the new version, and that\u0027s why we planned to add the Shortcut! round as an opportunity \u003ca href\u003d\"//codeforces.com/blog/entry/13542\"\u003e\u0026quot;mainly meant to help us actively test our new contest platform\u0026quot;\u003c/a\u003e.\u003c/p\u003e\u003ch2\u003eRound Issues\u003c/h2\u003e\u003cp\u003eAlthough we were prepared to face some issues, we seriously never expected to lose about 20 minutes of the contest. We were experiencing about 550 requests per second from more than \u003cstrong\u003e12,000 IPs\u003c/strong\u003e! With the start of the round, the burden was increased to \u003cstrong\u003e700 req/sec\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eWe first tried to mitigate the attacks, and then we tripled our computing power by adding CPU cores as fast as we could, after which the situation became more stable.\u003c/p\u003e\u003cp\u003eAs we\u0027ve mentioned before, our official tournament starts after our warm-up round on Codeforces, and we\u0027d like to ensure you that we\u0027ll be working hard enough to improve both our contest platform and network facilities, and make your next experience an awesome one. \u003c/p\u003e\u003cp\u003eThank you once again for your your \u003cstrong\u003eactive\u003c/strong\u003e presence in our Shortcut! round.\u003c/p\u003e\u003ch2\u003eResults\u003c/h2\u003e\u003cp\u003eSo, congratulations to Kazuhiro Hosaka who stood on the 1st place by solving the 3rd problem (and thus owning the problemset) in the very last moments of the round, and won the direct ticket to the final event!\u003c/p\u003e\u003cp\u003eAs we promised before, top 5 contestants will be receiving Bayan Programming Contest 2014-2015 t-shirts: \u003c/p\u003e \u003col\u003e   \u003cli\u003eKazuhiro Hosaka \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/hos.lyric\" title\u003d\"Гроссмейстер hos.lyric\"\u003ehos.lyric\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eGennady Korotkevich \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Легендарный гроссмейстер tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eIvan Zdomskyi \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/ballon\" title\u003d\"Мастер ballon\"\u003eballon\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eNathan Azaria \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/nathanajah\" title\u003d\"Международный мастер nathanajah\"\u003enathanajah\u003c/a\u003e\u003c/li\u003e   \u003cli\u003ePeter Bejda \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/piob\" title\u003d\"Гроссмейстер piob\"\u003epiob\u003c/a\u003e\u003c/li\u003e \u003c/ol\u003e\u003c/div\u003e","tags":["bayan"]}}