{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399085655,"rating":-28,"authorHandle":"bask89","modificationTimeSeconds":1399085655,"id":12123,"title":"\u003cp\u003ereporter noted magician and\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003ehe news is not true, in the article, the reporter noted magician and the Clippers did not carry out a similar communication, although he did openly that want to buy a branch NBA or NFL teams, but the Clippers are not for sale, but the league is also forcing \u003ca href\u003d\"http://www.shoejordan.fr/nike-kobe-8-c-40.html\"\u003enike kobe 8 pas cher\u003c/a\u003e  Stirling sell Clippers unlikely.Stirling event had a very bad effect, in addition to attracting many players and bosses denounce, but even coach Doc — Doc Rivers said uncertain whether it will continue to stay next season, the Clippers coach, but for the present Clippers captains are the playoffs, whether it is public pressure or morale blow, are very large.In addition, according to the \u0026quot;Basketball Insiders\u0026quot; reported that, as of now, has 14 sponsors and the Clippers announced termination, including a number of the nation\u0027s largest used car retailer CarMax, Virgin Atlantic Airways, and Mercedes-Benz, and other famous enterprises.And the NBA will EDT at 14:00 on the April 29 press conference on the Stirling event, President Adam — Silva will be announced on Stirling punishment. Los Angeles Lakers\u0027 poor performance this season, Shaquille O\u0027Neal — conducted a comment. He believes that the key issue Lakers, Buss family is required to employ some smart people.Lakers\u0027 dismal performance this season, as the core of the new century of the Lakers three consecutive, O\u0027Neal talked about the situation of the old club, said the Lak\u003c/p\u003e\u003cp\u003eers need to do now is the most important thing, \u0026quot;the right people in the right position.\u0026quot; .\u0026quot;I always prefer to hire people who are smarter than me. Jim (Buss) is capable of, Jenny (Bass) also have the ability,\u0026quot; O\u0027Neill said in an interview, \u0026quot;but you must know the reason why the Lakers flourished, They are hired Jerry — West and Bill — such people only after Sharman happen. \u0026quot;West All-Star team 14 times, throughout his career have contributed to the Lakers, and led the team won the championship in 1972. West as a manager, is also very brilliant career, he served as a coach, scout and general manager. Under his leadership, the West led the team won the championship six times. \u0026quot;SHOWTIME\u0026quot; and three consecutive West of the new century has the credit of the 1980s.Sharman is meritorious Lakers coach, \u003ca href\u003d\"http://www.shoejordan.fr/nike-lebron-11-c-27.html\"\u003elebron 11 a vendre\u003c/a\u003e  general manager and also served as president of the team. He Lakers in 1980, 1982, 1985, 1987 and 1988 championship, behind Sharman also have shadow.O\u0027Neill said, find the next great talent is the key to the future success of the Lakers. \u0026quot;So, I think, you know, it is time to assess the Lakers and hire smarter people. So things might be different.\u0026quot;Although O\u0027Neill did not say through words, but clearly meritorious, general manager of the Lakers are the West and Sharman, president, O\u0027Neill at this time these two levels of pupils come up with is the godfather of things, seems to have the finger pointed to the Lakers total Manager Mitch — Mitch Kupchak.O\u0027Neal and Kupchak have long been contradictory, this is not a secret. 2004, O\u0027Neal and the Lakers want to renew, but has not been successful, O\u0027Neill bluntly, \u0026quot;If I were a general manager, I will dry good.\u0026quot; Kupchak also a leader in direct trading O\u0027Neal, Shaquille O\u0027Neal in 2011 \u003c/p\u003e\u003cp\u003epublished his autobiography criticized on Kupchak. O\u0027Neill said in the book, Kupchak had promised after the 2003-04 season to season, O\u0027Neal a contract extension, but after the end of the season, but then O\u0027Neill\u0027s contract Kupchak open-minded, which makes O\u0027Neill Kupchak lost confidence.In the book, O\u0027Neill also said that after retiring General Manager West, the Lakers should find a special person to take over in order to ensure their concerns, but Kupchak is not that kind of person, he and Mitch Kupchak difficult along\u003ca href\u003d\"http://www.shoejordan.fr/nike-lebron-10-c-23.html\"\u003enike lebron 10 pas cher\u003c/a\u003e . Kupchak eyes only for himself and Jerry — Bass. Premiership giants Arsenal officially announced candidates for best player in the team in April, the German striker Lukas Podolski to more than 2/3 of the vote, Polti April 5 Battle 4 goals to help Arsenal made four straight ranked Premiership Fourth. Fabianski and Ramsay voted best player breakdown of second and third.In April, Polti staged scored twice in the Premier League even field of play, on April 16 reversed West Ham 3-1 Arsenal, Podolski scored twice to help the Gunners complete reversal, In the 20th Arsenal 3-0 Hull City, Polti Ramsey pass then broke twice. May the best player in the club voting, Podolski won more than 2/3 of the votes, was elected for the first time this season, the best month.It is worth mentioning that, although the Polish goalkeeper Lukasz Fabianski played only once throughout the month, but in May the best selection ranked second. Arsenal and Wigan in the FA Cup semi-final in a penalty shootout Fabianski twice bashing God, to secure the Gunners \u003c/p\u003e\u003c/div\u003e","tags":[]}}