{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1403811440,"rating":-23,"authorHandle":"ivan.popelyshev","modificationTimeSeconds":1403817687,"id":12858,"title":"\u003cp\u003eСпутник и чемпион: как победили русские программисты\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch2\u003e\u003ca href\u003d\"http://sputnikipogrom.com/russia/14911/sputnik-and-champion/\"\u003eСпутник и чемпион: как победили русские программисты\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eДорогие друзья!\u003c/p\u003e\u003cp\u003eМы все гении в определённом пространстве — в алгоритмах, ну может быть вообще в CS. Но когда мы лезем в политику — мы котята слепые. Тема на самом деле страшная и волнительная, нервов в это утекает уйма.\u003c/p\u003e\u003cp\u003eЯ нисколько не претендую на то чтобы быть супер-осведомлённым, но запостить это я должен.\u003c/p\u003e\u003cp\u003eДмитрий, я всё отлично понимаю. Но новость о победе и о своих взглядах на этом ресурсе надо было разнести, я могу потом объяснить почему.\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e Д.Е.: «Спутник» мне интересен как ресурс, наиболее близкий по политическим взглядам к моим, а также не содержащий фактических ошибок и подлога (по крайней мере которые я бы отловил). Как у человека, который часто ездит в другие города и имеет много знакомых из самых разных частей нашей Родины (в том числе и за пределами текущих государственных границ РФ), многие либеральные ресурсы вызывают у меня недоверие. Как мне верить сайту, который ежедневно рассказывает, что крымчане раскаиваются в своем выборе на референдуме, когда мой знакомый из Крыма говорит мне, что его знакомые и народ в целом вполне довольны текущим положением дел?\n\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eЕсли вы читаете СиП — я поздравляю, вы сумели преодолеть себя и воспользоваться мозгами не в своей области, чтобы изгнать из себя либеральный бред. Но чтобы распознать подлог СиП-а уже нужен опыт и хорошее знание предмета. Просвирнин это тот же монстр только высокоуровневый, для разоблачения нужна очень продвинутая пати. Насколько я знаю, много кто из наших на это попался.\u003c/p\u003e\u003cp\u003eТак вот. Зачем я это пишу? Чтобы через несколько лет кто-то бампнул тему комментарием \u0026quot;блин, Ваня же нас предупреждал\u0026quot;. Про крым я уже что-то писал три года назад в другой теме.\u003c/p\u003e\u003cp\u003eUPD. ещё раз — Дмитрий всё правильно сказал, но статья вышла там где не надо, ну хотя бы на две части надо было разделить.\u003c/p\u003e\u003cp\u003eUPD2. Ладно, Дмитрий не всё правильно сказал, там есть большой подвох который я сам не сразу понял. Оставляю это вам на домашнее задание.\u003c/p\u003e\u003c/div\u003e","tags":["политика","иногда_лучше_жевать","подлог_80_lvl"]}}