{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1410905512,"rating":19,"authorHandle":"kingofnumbers","modificationTimeSeconds":1410926058,"id":13820,"title":"\u003cp\u003eOlympiad system in your country\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello\u003c/p\u003e\u003cp\u003eI would like to know about what is the criteria of choosing the team that will represent your country in IOI and what is the criteria of training students, is programming is studied in high schools in your country and details about this stuff.\u003c/p\u003e\u003cp\u003eI\u0027ll start by talking about Olympiad system in Syria:\u003c/p\u003e\u003cp\u003ein Syria there\u0027s one organization that is responsible for all science Olympiad (maths, informatics , chemistry , physics , biology) all events for all subjects happens in the same time.\u003c/p\u003e\u003cp\u003eeach year there\u0027s mainly three events\u003c/p\u003e\u003cp\u003e1- Central national Olympiad (in January of every year):\u003c/p\u003e\u003cp\u003ethis is the first step to enter the Olympiad world each student in first year of high school should choose only one subject to participate in, then they do elimination exams, so that the top 5 of every state in Syria is chosen to to participate in \u0026quot;Central national Olympiad\u0026quot;, since programming is not teached in high schools the majority of students don\u0027t know programming thus, the exams are paper-wise which have many question ans puzzles which needs way of thinking similar to the one in competitive programming , after the top 5 is chosen from each state they are given some lessons about programming to get ready for \u0026quot;Central national Olympiad\u0026quot; that is held in Damascus (capital of Syria) , students have only one month to learn programming before \u0026quot;Central national Olympiad\u0026quot; , only top 10 will be members of \u0026quot;national team\u0026quot; students that fail of being in \u0026quot;national team\u0026quot; in first year of high school have no other chance to join it.\u003c/p\u003e\u003cp\u003e2- Selection contest (in march of every year):\u003c/p\u003e\u003cp\u003eonly \u0026quot;national team\u0026quot; members are invited to this contest where top 4 in this contest are chosen to represent Syria in IOI\u003c/p\u003e\u003cp\u003e3- training camp (in June of every year):\u003c/p\u003e\u003cp\u003eall \u0026quot;national team\u0026quot; members are invited to this camp where they stay in Damascus for about 20 days to get training\u003c/p\u003e\u003cp\u003eWhat about your country?\u003c/p\u003e\u003cp\u003esorry for my poor English\u003c/p\u003e\u003c/div\u003e","tags":[]}}