{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1522565463,"rating":27,"authorHandle":"Kirundel","modificationTimeSeconds":1522565463,"id":58669,"title":"\u003cp\u003eCF Heroes: Space\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет, мы студенты Самарского университета, решили анонсировать свою новую игру.\u003c/p\u003e\u003cp\u003eВ прошлом году мы успешно запустили игру CF Heroes, которая стала абсолютным бестселлером и обрела кучу поклонников. Мы опросили тысячи людей, исследовали их мнения и решили разработать новую игру, кардинально изменив концепцию. Теперь мы отправляем наших Героев в ... космос!\u003c/p\u003e\u003cp\u003e2025 год. В солнечную систему вошел неизвестный объект. Он стремительно направился к Земле. Решением ООН на осмотр был отправлен автоматический зонд. Подойдя к похожему на астероид объекту, названному \u0026quot;Дельта-0\u0026quot;, на несколько десятков тысяч километров, зонд практически испарился. В ответ на это с Земли был произведен массовый ракетный отстрел и десятки ядерных боеголовок уже через несколько часов они прожгли насквозь тяжелый крейсер неизвестных инопланетян.\u003c/p\u003e\u003cp\u003eВ ООН сразу же пошло массовое обсуждение данного вопроса. Каждая из стран предлагала разные решения для данной проблемы: РФ предложила разместить на орбите как можно больше легких орудийных платформ, вооруженных до зубов. США — построить большое количество дальних космических кораблей с экипажем в сотни тысяч человек и с еще большим количеством кораблей охранения.\u003c/p\u003e\u003cp\u003eНо подумав повнимательней все поняли, что огромное количество кораблей Земля построить не в состоянии, а орудийные платформы дают возможность лишь для защиты, но никак не для нападения. В этот момент все стали обдумывать Ваше предложение: оборудовать наигромаднейший корабль, на который погрузить все наилучшие умы мира (естественно, наилучшими умами мира являются олимпиадники), для большей эффективности. После построения одного корабля к тому же ресурсы на некоторое количество платформ оставались. Общим решением было объявлено, что это лучшее решение и Вас поставили во главе проекта, получившего название \u0026quot;Мстя\u0026quot;.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" Изображение корабля, который будет под вашим управлением. \" src\u003d\"/predownloaded/59/24/592416fabc0e964f23f0b1a7735e53fbc512b740.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eСразу скажу, что игра вышла не совсем простая, многие будут сталкиваться с такими проблемами:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/92/43/92435da046b37c993e18fa359bf09f551a4fc8f3.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eВедь не все так просто. Космос дело серьезное. Да и Герои — тоже люди. И им не особо хочется улетать с уютненькой Земли. Причем, чем больше рейтинг у Героя, тем труднее его нанять для жизненно важной для всей Земли миссии.\u003c/p\u003e\u003cp\u003eГерои крайне полезны. Так как на корабле куча роботов, как вполне мирных, так и военных, то они нуждаются в постоянном контроле и перепрограммировании. Поэтому \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Легендарный гроссмейстер tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e или \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Легендарный гроссмейстер Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e, посаженные за управление военной техникой могут дать вашим войскам грандиозное преимущество над противником даже при огромном количественном отставании. А \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Штаб, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e или \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik.ru\" title\u003d\"Мастер MikhailRubinchik.ru\"\u003eMikhailRubinchik.ru\u003c/a\u003e, которые будут являться ответственными за воспитание нового поколения олимпиадников на корабле помогут вам подготовить еще большее количество героев, причем даже уже во время полета! \u003c/p\u003e\u003cp\u003eДа готовьтесь к тому, что не все Герои одобрят курс, на который Вы идете. К примеру, если Вы захотите стать военным диктатором, то возможно вы не сможете нанять в экспедицию таких Героев, как \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/pitfall\" title\u003d\"Гроссмейстер pitfall\"\u003epitfall\u003c/a\u003e или \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/orotti\" title\u003d\"Специалист orotti\"\u003eorotti\u003c/a\u003e, но зато \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Shlakoblock\" title\u003d\"Эксперт Shlakoblock\"\u003eShlakoblock\u003c/a\u003e или \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/I_love_natalia\" title\u003d\"Мастер I_love_natalia\"\u003eI_love_natalia\u003c/a\u003e однозначно будут довольны Вашим выбором. А вот если Вы хотите стать дипломатом, то, возможно все будет и наоборот (а возможно и нет, ведь за все отвечает нейросеть и мы сами не в курсе, как она работает).\u003c/p\u003e\u003cp\u003eТеперь немного о нововведениях. Сюжет будет не просто большой, он будет очень большой. Да и еще к тому же сюжет CF Heroes: Space обладает крайне мощной адаптивной частью, которая автоматически дописывается той самой нейронной сетью по мере того, как вы выбираете ответы в диалогах. Хотите быть злодеем и все уничтожать? Пожалуйста. Хотите отыгрывать роль благородного рыцаря/рыцарессы? Можно и так. Ведь в CF Heroes: Space возможно практически все!\u003c/p\u003e\u003c/div\u003e","tags":["cf heroes","game","acm","codeforces"]}}