{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1431114430,"rating":7,"authorHandle":"NeverSayNever","modificationTimeSeconds":1431114593,"id":17796,"title":"\u003cp\u003eDynamic Programming Problem :)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Frends ,\u003c/p\u003e\u003cp\u003eThis problem is from the last hack contest on hackerrank. Here is the link \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.hackerrank.com/contests/101hack24/challenges\"\u003econtest link\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.hackerrank.com/contests/101hack24/challenges/contest-strategy/editorial\"\u003e Problem Link\u003c/a\u003e\u003c/p\u003e\u003cp\u003eProblem Statement\u003c/p\u003e\u003cp\u003eHackerRank is conducting a teamed programming contest. The rules of the contest are a bit different than usual:\u003c/p\u003e\u003cp\u003eA team consists of exactly N members. Problemset contains exactly N problems and each team member must solve exactly 1 problem. Only one member from the team is allowed to read the problem statements before the contest start time. Note that not everyone have read the problems at first. So, to solve problems a member needs to know the statements from some teammate who already knows them. After knowing problems once, a member is eligible to explain them to other teammates ( one teammate at a time ). You can assume that the explaining ( 1 or N problems ) will always take D minutes. During explaining, none of the two involved members will be able to do anything else.\u003c/p\u003e\u003cp\u003eProblems are of different difficulty levels. You can assume that it will take Ti minutes to solve the ith problem, regardless of which member solves it.\u003c/p\u003e\u003cp\u003eGiven a team\u0027s data, what is the minimum possible time in which they can solve all problems?\u003c/p\u003e\u003cp\u003eInput Format\u003c/p\u003e\u003cp\u003eThe first line will contain T, the number of test cases. The first line of each test case will contain space-separated integers N and D. The second line will contain N space-separated integers, where the ith integer denotes Ti.\u003c/p\u003e\u003cp\u003eConstraints\u003c/p\u003e\u003cp\u003e1≤T≤20 \u003c/p\u003e\u003cp\u003e1≤N≤3×10^3 \u003c/p\u003e\u003cp\u003e1≤Ti,D≤10^9\u003c/p\u003e\u003cp\u003eOutput Format\u003c/p\u003e\u003cp\u003eFor each test case, output the minimum possible time in which the given team will be able to solve all problems in a separate line.\u003c/p\u003e\u003cp\u003eSample Input\u003c/p\u003e\u003cp\u003e1\u003c/p\u003e\u003cp\u003e2 100\u003c/p\u003e\u003cp\u003e1 2 Sample Output\u003c/p\u003e\u003cp\u003e102\u003c/p\u003e\u003cp\u003eExplanation\u003c/p\u003e\u003cp\u003eMember 1 is allowed to know problems before start time. He starts explaing problems to member 2 when contest starts. Explaining ends at the 100th minute. Then both of them immidiately starts solving problems parallely. Member 1 solved 1st problem at the 101th minute and member 2 solved 2nd problem at the 102th minute.\u003c/p\u003e\u003cp\u003eI have also copied problem statement along with the problem link. I am just unable to solution mentioned in the editorial. Also it is mentioned this problem can be solved with better complexity :). I am interested in learning both approaches. If anyone of you can help me :). \u003c/p\u003e\u003c/div\u003e","tags":[]}}