{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1479129794,"rating":45,"authorHandle":"MikhailRubinchik.ru","modificationTimeSeconds":1479248540,"id":48384,"title":"\u003cp\u003eРыночные отношения и забота о студентах в ICPC\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет! \u003c/p\u003e\u003cp\u003eКак наверное все уже видели из постов \u003ca class\u003d\"rated-user user-black\" href\u003d\"/profile/Savinova\" title\u003d\"Unrated, Savinova\"\u003eSavinova\u003c/a\u003e, я в этом году по приглашению Botan Investments веду в группе \u003ca href\u003d\"http://vk.com/botaninvestments\"\u003evk.com/botaninvestments\u003c/a\u003e свой блог для тренеров. Многие посты совсем наивны и рассчитаны на новичков, но некоторые, на мой взгляд, могут быть полезны и довольно опытным в этом деле. Один из постов вызвал довольно резкую критику одного из участников сообщества (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Sunar\" title\u003d\"Candidate Master Sunar\"\u003eSunar\u003c/a\u003e). Я ему ответил что-то краткое и не стал развивать дискуссию vk, но решил взять тот пост, подкорректировать и добавить комментарий по поводу позиции (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Sunar\" title\u003d\"Candidate Master Sunar\"\u003eSunar\u003c/a\u003e). Если будет дополнительная критика и комментарии в данном посте, то это только хорошо :) Больше шансов прийти к истине. \u003c/p\u003e\u003cp\u003eИтак, я начну с поста из vk (с небольшими правками), а после добавлю ответ на комментарий \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Sunar\" title\u003d\"Candidate Master Sunar\"\u003eSunar\u003c/a\u003e. Вообще данный пост vk вырос из \u003ca href\u003d\"//codeforces.com/blog/entry/45362\"\u003eэтого поста на cf\u003c/a\u003e. Правда здесь я буду говорить только про орг. работу, а не про работу тренера. \u003c/p\u003e \u003chr /\u003e\u003cp\u003eЧасть 1.\u003c/p\u003e\u003cp\u003eВ этом посте я буду говорить шире, чем просто о тренировках — чем универ может помогать АСМщику?\u003c/p\u003e\u003cp\u003eВот студент хочет заниматься АСМ. Что ему нужно делать?\u003c/p\u003e\u003cp\u003eОбычный студент учится, спит, ест, развлекается. Ему нужно не вылететь из универа и иметь деньги на еду и развлечения. Продвинутый студент старается прокачаться в чем-то еще (помимо универа), и АСМ — один из видов такой прокачки. И вот наш студент, помимо того, что учится, ест, спит и развлекается, ещё и делает что-то в АСМ. \u003c/p\u003e\u003cp\u003eНа первый взгляд кажется, что ничего сложного тут нет, и студент просто решает задачки.\u003c/p\u003e\u003cp\u003eНо, во-первых, он решает задачи по-разному: архивы можно решать и дома, но все равно хорошо бы подогнать расписание так, чтобы успевать играть контесты. Командные тренировки хорошо бы решать в каком-то специально выделенном помещении. А еще он может пролениться и вообще не решать просто из-за того, что его вовремя никто не поддержал.\u003c/p\u003e\u003cp\u003eА во-вторых, помимо того, что ему нужно решать задачи, ему ещё нужно кучу всего сопутствующего. Например, искать или тратить свои деньги на поездки. Найти команду, выстроить отношения с сокомандниками. Думать о тактике на контестах. Переживать поражения. Договориться с командой о поездках, купить билеты, забронировать гостиницы. Спланировать все поездки, не забыть зарегаться на все нужные соревнования. Договориться с преподавателями и деканатом, чтоб на него не злились, что он уехал.\u003c/p\u003e\u003cp\u003eДумаете, это всё? Я всё равно забыл про кучу мелочей. Но, наверное, все уже понимают, что работы здесь много. Цель данного поста в том, чтобы осознать, что, помимо решения задач, АСМщику нужно решать множество организационных вопросов, и это совсем не просто.\u003c/p\u003e\u003cp\u003eЯ думаю, что для большинства АСМщиков гораздо нужней не тренерская помощь, а организаторская, которая поможет им разгрузиться от части этой работы. И я приведу список того, что может сделать университет. Где-то всё это будет делать тренер, где-то часть работы выполнит специальный человек, а где-то этим будет заниматься целый отдел. Также я расскажу, как этот процесс происходит в УрФУ. Конечно пост был бы лучше, если бы я разобрал это на примере и других вузов. Но обычно когда я начинаю что-то писать про другие вузы, находится кто-то несогласный, кто говорит, что я у них не учился и ничего о них не знаю. Поэтому, к сожалению, я буду писать только про УрФУ, зато про него я точно могу рассказать в деталях, т.к. варюсь в этом.\u003c/p\u003e\u003cp\u003eЧасть 2.\u003c/p\u003e\u003cp\u003eВ УрФУ почти всю (но не всю) организационную работу, связанную с тренировками и поездками, делаю я. Возможно, в некоторых вузах есть специальные люди для бюрократии :), но для участников это не так важно. Список конкретных дел:\u003c/p\u003e\u003cp\u003e1.Очень хорошо, если ваш вуз сможет оплатить все поездки, и участнику не нужно будет думать об этом и уточнять, дадут деньги или не дадут. Участнику достаточно просто знать, что если он пройдёт на соревнование, то всё будет оплачено без вопросов. У нас, например, каждый год часть расходов берёт на себя УрФУ, также есть долгосрочные договорённости с СКБ Контур и периодически другими спонсорами из Екб. В этом году нам пару поездок оплатил фонд Botan Investments. Старайтесь находить и договариваться со спонсорами. Конечно, всё в рамках разумного. Если у вас одна команда, то все поездки на год — это около 500 тысяч (2 сборов в МФТИ, 2 сборов ПетрГУ, полуфинал, турнир ICL, ЧУ, всесиб). Если же ребята хотят сгонять куда-то на соревнования или сборы за границу, то это уже “потустить” и нельзя это воспринимать, как важную трату.\u003c/p\u003e\u003cp\u003e2.Допустим, вы нашли деньги, и они оказались в бухгалтерии универа. Очень плохо, если вы отправите студента самого оформлять все эти служебки, приказы, отчитываться по командировкам. У нас студенты этого не делают, лишь изредка отчитываются по командировке (если вдруг едут без меня), а обычно им для отчетности нужно только принести посадочные талоны. Теперь допустим, что у вас есть деньги в чистом виде, не в бюрократической структуре. Тогда легко? :) Не тут-то было. Всё равно придётся купить билеты, забронировать гостиницы, оплатить оргвзносы, и при выборе этого всего согласовать с остальной частью команды. У нас всё это покупаю я (за редким исключением). Советую другим тренерам делать так же. Вообще ребята должны понимать, что они в надёжных руках, т.к. иногда случаются нестандартные ситуации, которые нужно решать оперативно. Для примера приведу несколько кейсов, которые приходилось решать, будучи тренером или участником: a.Отменили ночной самолёт Пермь-Казань. Едем на такси, приезжаем ночью, по пути бронируем гостиницу. b.Сборы в Петрозаводске наложились на отбор на РОИ. Договариваемся, чтоб отбор на РОИ был сыгран вместе с участниками Карелии. c.Сборы в Петрозаводске наложились на олимпиаду, с которой не договориться, а участник несовершеннолетний. Участник приезжает в птз позже (без меня). Моя жена везёт участника до Москвы и там сажает на поезд в птз.\u003c/p\u003e\u003cp\u003e3.Должно быть хорошее помещение для тренировок с круглосуточным доступом . В нем должны быть столы и стулья в достаточном количестве, принтер для печати решений. В общаге или дома играть неудобно, т.к. есть мешающие факторы. Можно попробовать найти комнату в универе или в местной it-компании. У нас есть АСМ-комната в УрФУ и в Контуре. В Контуре более удобная и большая, зато первая ближе к учёбе. Я думаю, что при достаточном организаторском таланте оба варианта достаточно реальны для вас.\u003c/p\u003e\u003cp\u003e4.Если серьёзно заниматься АСМ, то точно будут пропуски пар и экзаменов. Зимние сборы в ПетрГУ часто попадают на сессию, а из-за сборов в МФТИ участники пропускают много пар. Очень важно, чтобы у вузовских преподавателей не было негативного отношения к АСМщикам, иначе у студентов может пропасть всякое желание заниматься. Когда у моих студентов возникают проблемы, я сам хожу разговаривать с преподами. На халяву мы ничего не проставляем, но иногда продлеваем время сессии или переносим экзамены, а также проставляем некоторые спецкурсы для АСМщиков. Слышал много историй о том, что в некоторых вузах АСМщиков отчисляли. В УрФУ у серьёзных АСМщиков (тех, кто ездит на сборы) есть “вторая жизнь” на случай, если их соберутся отчислять. Хотя для справедливости надо сказать, что за то время, пока я учился, было только 2 АСМщика, которые бывали на грани отчисления (один из них я :) ).\u003c/p\u003e\u003cp\u003e5.Многие студенты-программисты рано идут работать, а АСМщик уже “работает” для популярности вуза. Поэтому здорово, если эта работа оплачивается. В УрФУ всех активных АСМщиков поощряют неплохими стипендиями. Самые маленькие, о которых я слышал, — в районе 8000 рублей, самые большие — больше 20 000 рублей. \u003c/p\u003e\u003cp\u003e6.Последний пункт уже чуть ближе к непосредственно тренерской работе: “пинание”. Если ребята в команде назвали список свободных дней, и в пересечении оказалось пусто, то тренировки могут не состоятся. Хорошо, если кто-то из ребят прогнётся и всё получится. Но если такого не случится, то инициативу на себя должен взять тренер: поговорить с каждым, попытаться найти компромисс, возможно на самого ленивого надавить или даже изменить состав команды. Также тренер должен подбадривать людей или ругать, если они мало решают архивы/пропускают тренировки. \u003c/p\u003e \u003chr /\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eИтак, теперь комментарий Sunar.\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eВы соизмеряйте свои советы с реальными кейсами. вот вам реальный кейс — \u003ca href\u003d\"http://acm.khpnets.info/w/index.php?title\u003dКомандировки\"\u003ehttp://acm.khpnets.info/w/index.php?title\u003dКомандировки\u003c/a\u003e. На неделе вернулись из Самары (тренер выбивал деньги в последний момент как мог) — из-за того, что нет сертификатов, в бухгалтерии предложили отксерить футболки. и мы, заметьте, далеко не самый маргинальный вуз, да и систему взаимоотношений между администрацией и асмщиками можно считать вполне устоявшейся\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eМой ответ в группе\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eМаксим, А вы участник или тренер? Полностью прочитал то, что описано в вашей ссылке. В УрФУ всё один-в-один также было год назад. Недавно отменили командировочные удостоверения (это закон недавно вышел, что они не нужны, у вас тоже наверное это сделают). Я не нашёл пунктов, которые не может сделать тренер без студентов. Подписи собрать только нужно с них и всё. Я всё это делаю на своих ребят (делегации обычно по 2-3 команды) сам. И да, я считаю, что хороший тренер должен заботиться о своих студентах и брать удар на себя.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eОсталось дать мой более развёрнутый комментарий. \u003c/p\u003e\u003cp\u003eВообще, мы живём в условиях рыночной экономики. И тут мало кто кому-то что-то должен. Не делаешь ты что-то \u003d\u0026gt; с тобой не сотрудничают (не платят денег, не учат тебя, не учатся у тебя и т.д.). В данном случае мы должны понимать, что некоторые столичные вузы очень хорошо распиарены как минимум своими результатами. У них действует примерно такой алгоритм:\u003c/p\u003e\u003cp\u003e1.В вуз приходят крутые чуваки.\u003c/p\u003e\u003cp\u003e2.Их никто не тренирует в АСМ и никто не помогает с орг.работой.\u003c/p\u003e\u003cp\u003e3.Они выступают хорошо, т.к. они были крутыми и до поступления и при этом тренируются сами.\u003c/p\u003e\u003cp\u003e4.О результатах слышат крутые школьники и снова идут в этот вуз.\u003c/p\u003e\u003cp\u003eЗамкнутый круг счастья столичных вузов :)\u003c/p\u003e\u003cp\u003eНет, я не говорю, что во всех столичных вузах дела обстоят так, но такие вузы точно есть. Более того, в вузах, где тренировки хорошо поставлены, этот фактор всё равно очень важен. Даже если вы сверхгениальный тренер и у вас всё супер организовано, но к вам не поступает ни одного призёра всеросса, вы никак не будете делать стабильно призёров финала АСМ (но иногда может везти конечно на талантливых студентов).\u003c/p\u003e\u003cp\u003eТак вот, если вы хотите, чтоб школьник выбрал ваш вуз, придётся создать условия, которые будут лучше большинства столичных вузов (хотя бы в части пунктов). Иначе каким бы чудесным тренером вы ни были, вам придётся качать людей за время универа с самых новичков. \u003c/p\u003e\u003cp\u003eТеперь конкретно про рассуждения \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Sunar\" title\u003d\"Candidate Master Sunar\"\u003eSunar\u003c/a\u003e. Мой список — это то, чего добились мы в УрФУ. Вероятно, его можно улучшать и улучшать, но в целом, я думаю, он довольно неплох. И строился он далеко не сразу: когда я пришёл в УрФУ студентом, были пункты 1, 2 (только билеты покупали), 4 (не отчисляли, но с преподом студенты договаривались сами), 5. По пунктам 2, 3, 6 не было хороших решений, их постепенно привносил я. Т.е. мы к этому шли годами, и я ни в коем случае не ругаю тренеров, которые пока сделали только малую часть. Ведь я “стоял на плечах гигантов”, а некоторые тренеры делают вообще всё с нуля. Я просто показываю, куда ещё можно развиваться, и буду рад, если какие-то советы им помогут :)\u003c/p\u003e\u003c/div\u003e","tags":[]}}