{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1476169422,"rating":78,"authorHandle":"Helgui","modificationTimeSeconds":1476172816,"id":47665,"title":"\u003cp\u003eДерево Фенвика и ошибки перевода\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003eЯ не уверен, что эта тема не освещалась ранее, но поиск по блогам результатов не дал. \u003c/p\u003e\u003ch4\u003eСразу к делу\u003c/h4\u003e\u003cp\u003eВзглянем на статью о дереве Фенвика в википедии: \u003cem\u003e\u0026quot;Дерево Фенвика (двоичное индексированное дерево, англ. Fenwick tree, binary indexed tree, BIT)...\u0026quot;\u003c/em\u003e\u003c/p\u003e\u003cp\u003eРазве дерево Фенвика является двоичным? В общем случае — \u003cstrong\u003eнет\u003c/strong\u003e. На рисунке ниже дерево Фенвика изображено в виде... дерева! Дело в том, что в подавляющем большинстве материалов, авторы не пытаются указать, почему дерево Фенвика — дерево.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/bd/ba/bdba2c578796edd9e730d5e3b2c01e9ff6687615.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch4\u003eПочему недвоичное дерево назвали двоичным?\u003c/h4\u003e\u003cp\u003eВсе дело в неверном переводе составного прилагательного \u0026quot;Binary Indexed\u0026quot;, одним из корректных переводов которого является \u0026quot;двоично-индексируемое\u0026quot;. В ошибочном варианте перевода \u0026quot;Binary\u0026quot; и \u0026quot;Indexed\u0026quot; воспринимаются, как два самостоятельных прилагательных — \u0026quot;двоичное\u0026quot; и \u0026quot;индексированное\u0026quot;.\u003c/p\u003e\u003ch4\u003eА что такое двоично-индексируемое дерево?\u003c/h4\u003e\u003cp\u003eДерево, вершины которого пронумерованы числами так, что номера (индексы) вершин-сыновей вычисляются с помощью битовых операций над номером вершины-родителя. Помимо дерева Фенвика, яркими примерами двоично-индексированных деревьев служат двоичная куча (в классической реализации) и дерево отрезков, написанное на массиве. Кстати, эти примеры — не самые удачные, т.к. в них фигурируют двоичные двоично-индексирумые деревья, поэтому рассмотрим еще один пример. Имеется полное дерево степени 4, корень которого имеет индекс 0, а сыновья вершины \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ex\u003c/i\u003e\u003c/span\u003e имеют индексы \u003cspan class\u003d\"tex-span\"\u003e(\u003ci\u003ex\u003c/i\u003e \u0026lt;  \u0026lt; 2) + 1, (\u003ci\u003ex\u003c/i\u003e \u0026lt;  \u0026lt; 2) + 2, (\u003ci\u003ex\u003c/i\u003e \u0026lt;  \u0026lt; 2) + 3, (\u003ci\u003ex\u003c/i\u003e \u0026lt;  \u0026lt; 2) + 4\u003c/span\u003e, где \u003cspan class\u003d\"tex-span\"\u003e \u0026lt;  \u0026lt; \u003c/span\u003e — двоичный сдвиг влево.\u003c/p\u003e\u003cp\u003eНадеюсь, этот пост будет полезен тем, кто еще не разобрался с деревом Фенвика. Спасибо за внимание!\u003c/p\u003e\u003c/div\u003e","tags":["дерево фенвика","bit"]}}