{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1402319627,"rating":40,"authorHandle":"Equilibrium","modificationTimeSeconds":1402319726,"id":12626,"title":"\u003cp\u003eKeeping eyes healthy\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI wanted to share an experience about computer .Many of us wear glasses (and many are about to).I think people whose job is related to computer (like programmers) must try to keep their eyes as well as the first they they sat in front of computer .I have several tips for keeping eyes healthy that you may want to read :\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003ePosition your screen about an arm’s length from your eyes and 20 degrees below eye level.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eSet colour and contrast tones to suit your eyes, and match the brightness of your screen with your surroundings.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eMinimize reflected glare on your screen by using dimmer switches on lights and a protective anti-glare screen cover. Also consider positioning your screen so that it sits perpendicular to windows and other bright light sources. If you are having trouble locating the source of the glare, turn off your monitor to reveal a darkened screen, and tilt/swivel your monitor until the reflection disappears.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eKeep your screen free of fingerprints and dust, as both can reduce visual clarity.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIf you alternate between looking at your screen and paperwork, consider obtaining a clipboard that attaches alongside your monitor so that the two are at the same working distance.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eUse the 20-20-20 rule. Every 20 minutes take a 20 second break and focus your eyes on something at least 20 feet away (the water cooler, possibly?). This will give your eyes a much-needed break and reduce some of the symptoms mentioned earlier.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eRemember to blink! Did you know that on average we blink 12 times per minute, but when we’re on the computer, we only blink 5 times per minute? That can add up to dry eyes. Relieve the discomfort by using artificial teardrops or gels and remembering to blink. Consult your optometrist to determine which eye drops are best to relieve your dry eyes.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAsk for anti-reflective coatings on the lenses of your glasses, which can be applied at the time of manufacturing, to protect your eyes from bright and/or flickering light sources such as fluorescent lights. Your Doctor of Optometry can even talk to you about eyewear designed specifically for computer use.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003esource :\u003ca href\u003d\"http://www.prevention.com\"\u003ewww.prevention.com\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["health","eye protection","cvs"]}}