{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1500924496,"rating":5,"authorHandle":"Qudrat_Ibadullayev","modificationTimeSeconds":1501226155,"id":53464,"title":"\u003cp\u003eTrains #2\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cb\u003eUPD:\u003c/b\u003e 2-trainsni muhokamasini ham o\u0027tkazamiz.\u003cbr /\u003e \u003cstrong\u003e2-trains masalarini tushuntiruvchi talabalar ro\u0027yxati quyidagicha:\u003c/strong\u003e\u003cbr /\u003e A masala — Sarvar\u003cbr /\u003e B masala — Shahriyor\u003cbr /\u003e C masala — Yusufboy\u003cbr /\u003e D masala — Behzod\u003cbr /\u003e E masala — Husanboy\u003cbr /\u003e F masala — Muhammad\u003cbr /\u003e \u003cb\u003e2-trains muhokamalarni tayyorlash muddati 1-avgustgacha.\u003c/b\u003e\u003cbr /\u003e Gruppamizga 2-trains contest qo\u0027yildi. Contest 25.07.2017 soat 20:00 da boshlanadi. Contestda 6 ta masala va ularni yechish uchun 2:30 soat vaqt beriladi. 1-trains masalalarini doreshivaniya qilishni ham to\u0027xtatmanglar. Hozirgacha 1-trains masalalarini doreshivaniya qilganlar kam bo\u0027lganligi uchun masalalar muhokamasini quyidagicha o\u0027tkazamiz:\u003cbr /\u003e Har bir masala bir talabaga tushuntirish uchun beriladi, bunda talabaning ushbu masalani yechgan yoki yechmaganligi inobatga olinmaydi.\u003cbr /\u003e \u003cstrong\u003e1-trains masalarini tushuntiruvchi talabalar ro\u0027yxati quyidagicha:\u003c/strong\u003e\u003cbr /\u003e A masala — Shahriyor\u003cbr /\u003e B masala — Yusufboy\u003cbr /\u003e C masala — Sarvar\u003cbr /\u003e D masala — Lochinbek\u003cbr /\u003e E masala — Husanboy\u003cbr /\u003e F masala — Behzod\u003cbr /\u003e Masalalar razborini Trains #1 blogiga kommentariya qoldirish orqali qilishingiz mumkin. Masalani tushuntirishda kod, kod parchalari va shunga o\u0027xshash elementlardan foydalanish maqsadga muvofiq. Bunda faqat masalani tushuntirayotgan talaba emas balki boshqalar ham faol bo\u0027lishi kerak. Tushunmagan savollarni ham aynan izohlarda qoldirishingiz mumkin. Yuqorida nomi keltirilgan talabalar o\u0027z masalalari muhokamasini 26.07.2017 gacha tayyorlashlari zarur.\u003c/p\u003e\u003c/div\u003e","tags":[]}}