{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1483106669,"rating":3,"authorHandle":"1am","modificationTimeSeconds":1483205910,"id":49409,"title":"\u003cp\u003eWeek 3\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003eA. Chewbaсca and Number\u003c/h1\u003e\u003cp\u003eThis problem involved taking in a number that could be maximum 10 ^ 18 and inverting some digits to 9 - t to minimize the number. We said that the best way to deal with this problem would be to take in the number as a string. This may seem like a new idea to you, but in the future we will be using it a lot. Especially if it says the number could be greater than 10 ^ 18, it practically is screaming STRING. \u003c/p\u003e\u003cp\u003eDigits and their inversion:\u003c/p\u003e\u003cp\u003e0 -\u0026gt; 9\u003c/p\u003e\u003cp\u003e1 -\u0026gt; 8\u003c/p\u003e\u003cp\u003e2 -\u0026gt; 7\u003c/p\u003e\u003cp\u003e3 -\u0026gt; 6\u003c/p\u003e\u003cp\u003e4 -\u0026gt; 5\u003c/p\u003e\u003cp\u003e5 -\u0026gt; 4\u003c/p\u003e\u003cp\u003e6 -\u0026gt; 3\u003c/p\u003e\u003cp\u003e7 -\u0026gt; 2\u003c/p\u003e\u003cp\u003e8 -\u0026gt; 1\u003c/p\u003e\u003cp\u003e9 -\u0026gt; 0\u003c/p\u003e\u003cp\u003eIf we look at these, inverting a digit less than or equal to 4 gets us a larger number, and this is not ideal. So all we need to do is check if the digit is greater than 4, and invert it in that case. The only thing to watch out for is that if the string starts with a \u00279\u0027, we dont want to invert it to a 0 because the question states that the number should not have any leading zeros.\u003c/p\u003e\u003cp\u003eHere is the code for it : \u003ca href\u003d\"http://ideone.com/uvriJd\"\u003ehttp://ideone.com/uvriJd\u003c/a\u003e\u003c/p\u003e\u003ch1\u003eB. Wet Shark and Odd and Even\u003c/h1\u003e\u003cp\u003eThis question wants to get maximum possible even (divisible by 2) sum. Always adding even numbers will make our sum always even, so if the number is even, we add it. We know odd + odd \u003d even. but and odd amount of odd numbers sum up to and odd number, like 5 +3 + 1 \u003d 9. Two odds cancel out to make an even. So to get all our odd numbers to sum up to even if the number of odd numbers is odd, we only need to remove the smallest odd number. If the sum is already even, dont do anything. Also the sum could be greater than 1e9, so we need to hold our sum in a long long data type which can store maximum 1e18.\u003c/p\u003e\u003cp\u003eHere is the code for it: \u003ca href\u003d\"http://ideone.com/Av2jga\"\u003ehttp://ideone.com/Av2jga\u003c/a\u003e\u003c/p\u003e\u003ch1\u003eC. Two Substrings\u003c/h1\u003e\u003cp\u003eThis question asks for us to find two the two substrings : \u0026quot;AB\u0026quot; and \u0026quot;BA\u0026quot; in any order, but with the condition that they are not overlapping, as in \u0026quot;ABA\u0026quot; is not allowed, we would have to search the rest of string for separate BA or AB in that case. \u003c/p\u003e\u003cp\u003eHere is the code we wrote: \u003ca href\u003d\"http://ideone.com/UhkCaY\"\u003ehttp://ideone.com/UhkCaY\u003c/a\u003e\u003c/p\u003e\u003cp\u003es.find () returns -1 if string not found, otherwise returns the index of the beginning of the string.\u003c/p\u003e\u003cp\u003eI will finish tutorial at night, sorry for the delay\u003c/p\u003e\u003ch1\u003eD. Vitaly and Night\u003c/h1\u003e\u003cp\u003eThis question talks about an apartment with n floors and m rooms, each room has two windows , a left one and a right one. The light is turned on in that window if its value is 1. Vitaly considers the people in the room to be awake if either the left window or the right window are turned on or both. All you need to do is count how many rooms are awake.\u003c/p\u003e\u003cp\u003eFor example:\u003c/p\u003e\u003ccenter\u003e \u003cimg align\u003d\"middle\" height\u003d\"150px\" src\u003d\"/predownloaded/5b/63/5b63d29cc5403de524e9827debe1deb1b963f393.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" width\u003d\"150px\" /\u003e \u003c/center\u003e\u003cp\u003eHere three rooms are turned on.\u003c/p\u003e\u003cp\u003eIn this question, you can think of whenever we used one for loop, we were working with one dimensional space. A list of numbers, but here the question needs 2D space. So we need two for loops inside of each other, one for the floors, the other for the rooms on each floor. The outer loop would be the floors, the inner loop is room in each floor.\u003c/p\u003e\u003cp\u003eTake a look at the following code: \u003ca href\u003d\"http://ideone.com/DsS9q0\"\u003ehttp://ideone.com/DsS9q0\u003c/a\u003e\u003c/p\u003e\u003ch1\u003eE. Holidays\u003c/h1\u003e\u003cp\u003eThis problem could be solved with some basic division, modulos. But i planned on teaching it with while loops. While loops are like for loops but without the beginning i \u003d0 or any declaration and without the end i++. You simply have a condition, and the while loop continues to loop until the condition is false (0). The week cycle is always 5 days work then 2 days off. We want the maximum number of days off and the minimum number of days off. \u003c/p\u003e\u003cp\u003eImagine if the number of days is 7. In this case whether you start with 2 days off then 5 work, or 5 work then 2 days off, the maximum and the minimum are both the same ( which is 2 days off).\u003c/p\u003e\u003cp\u003eBut imagine if the number of days were 5. Here we can maximize number of days off by starting with 2 off, then 3 work. If we start with 5 work then there will be no days off. max is 2, min is 0. \u003c/p\u003e\u003cp\u003eTherefore the maximum number of days off starts by taking two days off, then 5, 2, 5, 2, 5,2 ... The minimum number of days off starts with 5 work days, then 2 off, then 5, ,2, ,5 ,2, 5, 2 ...\u003c/p\u003e\u003cp\u003eIn the end the difference between maximum and minimum wont be that large.\u003c/p\u003e\u003cp\u003eStudy this code: \u003ca href\u003d\"http://ideone.com/L0XJBo\"\u003ehttp://ideone.com/L0XJBo\u003c/a\u003e\u003c/p\u003e\u003cp\u003eI will inshallah explain it next week though more clearly.\u003c/p\u003e\u003cp\u003eGood luck!\u003c/p\u003e\u003c/div\u003e","tags":[]}}