{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1463715594,"rating":458,"authorHandle":"I_love_Hoang_Yen","modificationTimeSeconds":1463728570,"id":44968,"title":"\u003cp\u003eMy story at ACM ICPC World Final 2016\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eMy team (me + \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/flashmt\" title\u003d\"Международный мастер flashmt\"\u003eflashmt\u003c/a\u003e + \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/nguyenhungtam\" title\u003d\"Специалист nguyenhungtam\"\u003enguyenhungtam\u003c/a\u003e) was probably never noticed by anyone, but we were actually aiming for medal. And I think we performed ok in the final, ending up at #15, still need some more luck \u0026amp; brain to win a medal. Anw, I decided to share my story. Btw if you are Vietnamese, you can also read \u003ca href\u003d\"https://www.facebook.com/notes/thanh-trung-nguyen/t%C3%B3m-t%E1%BA%AFt-acm-world-final-2016/1157851804228014?pnref\u003dstory\"\u003ethis\u003c/a\u003e.\u003c/p\u003e\u003ch1\u003eBack story\u003c/h1\u003e\u003cp\u003eIn the ACM history, a Vietnamese team has never won any WF medal. 5 years ago, team of \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/ktuan\" title\u003d\"Кандидат в мастера ktuan\"\u003ektuan\u003c/a\u003e (only Vietnamese red target on Topcoder) had high hope, but ended up at #17. 4 years ago, team of \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/ConanKudo\" title\u003d\"Кандидат в мастера ConanKudo\"\u003eConanKudo\u003c/a\u003e also had high hope, but messed up in the first 3 hours and ended up at #17.\u003c/p\u003e\u003cp\u003eSo I really wanted to win medal. And I\u0027ve been planning for this World Final for several years..\u003c/p\u003e\u003ch1\u003eTeam formation\u003c/h1\u003e\u003cp\u003eI\u0027ve chosen \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/flashmt\" title\u003d\"Международный мастер flashmt\"\u003eflashmt\u003c/a\u003e as teammates for several years, but were not able to choose any third member. Since I only want to select Vietnamese, we have only few good options (\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/darknstd\" title\u003d\"Мастер darknstd\"\u003edarknstd\u003c/a\u003e, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/infrmtcs\" title\u003d\"Мастер infrmtcs\"\u003einfrmtcs\u003c/a\u003e — both IOI silver medalist). After the WF 2015, I read \u003ca href\u003d\"//codeforces.com/blog/entry/17906#comment-228504\"\u003ethis comment\u003c/a\u003e by \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/fhlasek\" title\u003d\"Гроссмейстер fhlasek\"\u003efhlasek\u003c/a\u003e about the story of his team, and decided to pick an IMO guy instead. Thus, I picked \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/nguyenhungtam\" title\u003d\"Специалист nguyenhungtam\"\u003enguyenhungtam\u003c/a\u003e who was IMO medalist but has very few experience with programming / algorithm and I trained him from that. It was a good choice, I had a lot of fun watching/trying to understand problem solving from Math people perspective, and we did much better with better mathematical imagination.\u003c/p\u003e\u003ch1\u003eRegionals\u003c/h1\u003e\u003cp\u003eAt regionals, \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/nguyenhungtam\" title\u003d\"Специалист nguyenhungtam\"\u003enguyenhungtam\u003c/a\u003e has few experience, so I was really afraid of losing ticket to WF. Anw, we won in Jakarta regional which guaranteed a ticket. We were #3 at Singapore regional, but I always believe we can do much better as \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/nguyenhungtam\" title\u003d\"Специалист nguyenhungtam\"\u003enguyenhungtam\u003c/a\u003e improved very fast towards WF.\u003c/p\u003e\u003ch1\u003eStrategy\u003c/h1\u003e\u003cp\u003eOur strategy is \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/flashmt\" title\u003d\"Международный мастер flashmt\"\u003eflashmt\u003c/a\u003e will code mostly all problems while \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/nguyenhungtam\" title\u003d\"Специалист nguyenhungtam\"\u003enguyenhungtam\u003c/a\u003e and I solve all the problems on paper. This is mainly because I usually fail to code simple things in important competitions (anw during this WF I implemented B \u0026amp; K, both had 1 wrong submission, but I think it is ok considering my current standard). And we also believe that the WF problemset requires more thinking, so 2/3 team time thinking is good.\u003c/p\u003e\u003cp\u003eAnd indeed, there are many positive side on this strategy:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eI think I had much more time solving problems.\u003c/li\u003e   \u003cli\u003eThe algorithm needs to be very clear before we start implementing them.\u003c/li\u003e   \u003cli\u003eSince \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/flashmt\" title\u003d\"Международный мастер flashmt\"\u003eflashmt\u003c/a\u003e\u0027s coding skill is very good, leaving him the only one coding is definitely good enough.\u003c/li\u003e \u003c/ul\u003e\u003ch1\u003eMy take on the WF problemset\u003c/h1\u003e\u003cp\u003eI think the easier problems are ok, but maybe too many of them (8 easy problems..). I liked K. The judge solution for B is nice, but I think they are not very familiar with Divide \u0026amp; conquer DP optimization, thus this problem became copy-paste divide \u0026amp; conquer DP from our notebook. (I publicized our notebook \u003ca href\u003d\"https://github.com/ngthanhtrung23/ACM_Notebook_New\"\u003ehere\u003c/a\u003e — you can use it at your own risk)\u003c/p\u003e\u003cp\u003eThere were 5 hard problems F H I J M. I think H I J are too hard, M is hard to implement, so my team only had one choice of solving F: either we solve F and get medal or we don\u0027t solve F and don\u0027t get medal. I think the choice is very limited this year. Maybe if there was 1 medium problem instead of easy problem, there would be some choice for teams after solving easy problems.\u003c/p\u003e\u003cp\u003eAnw, my team strategy worked well. We always have something to code until we finished the 8th problem. And \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/flashmt\" title\u003d\"Международный мастер flashmt\"\u003eflashmt\u003c/a\u003e did not have too hard-to-debug bugs, so we were solving problems quite fast considering our level.\u003c/p\u003e\u003cp\u003eAfter this WF, probably I\u0027ll partially retired (probably still participate in CF rounds \u0026amp; big contests but mostly no training). If you have questions for me in comments, I\u0027ll gladly answer.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e: Special thanks to my girlfriend, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/ktuan\" title\u003d\"Кандидат в мастера ktuan\"\u003ektuan\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/ConanKudo\" title\u003d\"Кандидат в мастера ConanKudo\"\u003eConanKudo\u003c/a\u003e and \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/tutanjokersharp\" title\u003d\"Гроссмейстер tutanjokersharp\"\u003etutanjokersharp\u003c/a\u003e. I inherited the spirit from \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/ktuan\" title\u003d\"Кандидат в мастера ktuan\"\u003ektuan\u003c/a\u003e by hearing stories about him, and \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/ConanKudo\" title\u003d\"Кандидат в мастера ConanKudo\"\u003eConanKudo\u003c/a\u003e and \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/tutanjokersharp\" title\u003d\"Гроссмейстер tutanjokersharp\"\u003etutanjokersharp\u003c/a\u003e trained me to this level :)\u003c/p\u003e\u003c/div\u003e","tags":["acm","acm icpc world finals","team training"]}}