{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1520347219,"rating":4,"authorHandle":"0day20hour","modificationTimeSeconds":1520668074,"id":58202,"title":"\u003cp\u003eActivity Selection and Matroid Theory\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eMany people on different articles suggests that if an optimization problem has a greedy solution, the underlying structure must have matroid property.\u003c/p\u003e\u003cp\u003eI was trying to understand this. So far, I was able to prove that for,\u003cbr /\u003e1. Maximum sum of m integers among n integer.\u003cbr /\u003e2. Minimum spanning tree. \u003c/p\u003e\u003cp\u003eHowever, The classical greedy algorithm \u003cem\u003eActivity Selection\u003c/em\u003e seems to fail having \u003cem\u003eexchange\u003c/em\u003e property. \u003c/p\u003e\u003cp\u003eLet,\u003cbr /\u003e\u003ccode\u003eE \u003d {1-3, 2-4, 3-5, 4-6, 5-7}\u003c/code\u003e \u003c/p\u003e\u003cp\u003eNow, Take two independent set,\u003cbr /\u003e\u003ccode\u003eI \u003d {2-4, 4-6}\u003c/code\u003e and \u003ccode\u003eJ \u003d {1-3, 3-5, 5-7}\u003c/code\u003e \u003c/p\u003e\u003cp\u003eThere is no activity in \u003ccode\u003eJ\u003c/code\u003e which can extend \u003ccode\u003eI\u003c/code\u003e. Which fails the \u003cem\u003eexchange\u003c/em\u003e property of matroid, if I understood it correctly. Thus, it is not matroid and shouldn\u0027t have a greedy algorithms.\u003c/p\u003e\u003cp\u003eWhere am I wrong?\u003c/p\u003e\u003cp\u003eNB:\u003cbr /\u003e1. a-b means starts at time a end just before time b.\u003cbr /\u003e2. I know matroid is not best way to find greedy algorithms in contest. I just like to understand the underlying structure once.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEDIT:\u003c/strong\u003e\u003cbr /\u003ePlease Suggest some math forum where I may get the answer. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPDATE\u003c/strong\u003e\u003cbr /\u003eWell, I got the answer. In strict sense, the \u003cstrong\u003eactivity selection\u003c/strong\u003e algorithm is called greedy-like not greedy. That is the reason. There are many algorithm which we take as greedy but they aren\u0027t greedy in mathematical sense. They are just greedy-like. This also explain how many people \u003cstrong\u003emisguiding\u003c/strong\u003e others that you should prove the matroid property when solve greedy problem. Fortunately, many people also suggest not to use matoroid as an criteria.\u003c/p\u003e\u003c/div\u003e","tags":["greedy","matroids"]}}