{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1481438232,"rating":583,"authorHandle":"Balajiganapathi","modificationTimeSeconds":1489168302,"id":48991,"title":"\u003cp\u003eCodeforces problem recommender\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi all,\u003c/p\u003e\u003cp\u003eWhile practicing I always have difficulty choosing which problems to solve next. So, I coded a site to look at the user\u0027s submissions so far and recommend what all problems to solve next. Since the ICPC season is at peak now, it can also analyze multiple users and recommend practice problem for the whole team. \u003c/p\u003e\u003cp\u003eView the site here: \u003ca href\u003d\"http://code-drills.com\"\u003eCode drills\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eSo far, it only supports cf (EDIT: Now also supports codechef and spoj). I plan to add support for other sites later. Besides recommending, it will also show some statistics of your submissions so far. If you scroll down after entering your handle, you can view the practice recommendation. I will explain some of them here:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eICPC\u003c/strong\u003e: Best to use this with team i.e. enter all your teammates\u0027 handles too. It will try to select problems from different topics. This and all other recommendations are based on your past submissions. So, the difficulty of the set will vary according to your past submissions (i.e if you have solved a lot of hard problems, then you will get harder problem recommendations, so tourist\u0027s easy problem will be very different from my easy problem recommendation :) )\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMini Contest\u003c/strong\u003e: Best for individual coders. 5 problems are recommended, again based on the coders\u0027 past submission.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDaily Practice\u003c/strong\u003e: Suggests only 2 problems — an easy and a hard. This is useful for those who don\u0027t have that much time to practice. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWarmup\u003c/strong\u003e: 2 easy problems for solving before some contest.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEasy/Medium/Hard\u003c/strong\u003e: 10 problems of the chosen difficulty.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTopic based\u003c/strong\u003e: Select a topic and start solving from easy to hard problems on that topic.\u003c/p\u003e\u003cp\u003eThis was all coded in one day, so expect some bugs :) . I will try to keep adding more features and other sites for analysis. Comments and suggestions are welcome.\u003c/p\u003e\u003c/div\u003e","tags":["practice"]}}