{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1494230924,"rating":0,"authorHandle":"elena","modificationTimeSeconds":1494796618,"id":51888,"title":"\u003cp\u003eЗадания по СППО\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch4\u003eТема \u0026quot;Потоки вычислений\u0026quot;\u003c/h4\u003e\u003cp\u003eЗадание:\u003c/p\u003e\u003cp\u003eНапишите программу, перемножающую две матрицы. \u003c/p\u003e\u003cp\u003eНа всякий случай: если у нас есть матрица \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eA\u003c/i\u003e\u003c/span\u003e размера \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e × \u003ci\u003em\u003c/i\u003e\u003c/span\u003e и матрица \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eB\u003c/i\u003e\u003c/span\u003e размера \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003em\u003c/i\u003e × \u003ci\u003ek\u003c/i\u003e\u003c/span\u003e, результатом их перемножения будет матрица \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eC\u003c/i\u003e\u003c/span\u003e размера \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e × \u003ci\u003ek\u003c/i\u003e\u003c/span\u003e, элементы которой вычисляются как \u003cimg align\u003d\"middle\" class\u003d\"tex-formula\" src\u003d\"/predownloaded/85/51/85513c5788fd5b825a25203691ac693d1518c189.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e.\u003c/p\u003e\u003cp\u003eМодифицируйте эту программу таким образом, чтобы каждая строка новой матрицы вычислялась в отдельном потоке (Thread). Проведите измерения времени: рассмотрите матрицы разных размеров и выясните, отличается ли (и на сколько) время, потраченное на вычисление в программе, работающей с одним потоком, и в программе, работающей с несколькими потоками.\u003c/p\u003e\u003cp\u003eМодифицируйте программу таким образом, чтобы все \u0026quot;заявки на вычисление элемента\u0026quot; сначала помещались в очередь, а из очереди их \u0026quot;забирали\u0026quot; бы потоки (их количество фиксируется в начале программы). Проведите измерения времени для различного количества потоков.\u003c/p\u003e\u003ch4\u003eТема \u0026quot;PowerShell\u0026quot;\u003c/h4\u003e\u003cp\u003eЗадание 1:\u003c/p\u003e\u003cp\u003eВыбрать в заданной папке файлы заданного формата, имеющие размеры не меньше и не больше заданных величин. Папка, формат, размеры — это параметры, которые можно изменять. Файлы во вложенных папках также следует учитывать. Вычислить, сколько всего места занимают выбранные файлы. Записать в текстовый файл в виде таблицы список выбранных файлов и их размер, а также суммарный объем памяти, который они занимают. \u003c/p\u003e\u003cp\u003eОформить вышеописанное \u003c/p\u003e\u003cp\u003eа) в виде функции, одним из параметров которой является переменная, определяющая, будет ли информация дублироваться на консоль или же вывод на консоль будет подавлен\u003c/p\u003e\u003cp\u003eб) в виде фильтра\u003c/p\u003e\u003cp\u003eЗадание 1А:\u003c/p\u003e\u003cp\u003eПредложите и реализуйте в функции и фильтре способ задавать более одного формата файлов.\u003c/p\u003e\u003cp\u003eЗадание 2:\u003c/p\u003e\u003cp\u003eИзучите список виртуальных дисков (Get-PSDrive). Создайте на диске W: папку MyLogs и создайте для нее виртуальный диск в PowerShell (пока не проверялось, работает ли это в сети; в крайнем случае создайте такую папку в своем подразделе на диске C:).\u003c/p\u003e\u003cp\u003eНапишите функцию, которая выводит содержимое дисков Env, Variable, HKCU, HKLM в текстовые файлы (по одному на каждый вывод). Эти текстовые файлы должны создаваться в папке MyLogs, обращаться к которой следует через виртуальный диск. \u003c/p\u003e\u003cp\u003eДоработайте функцию таким образом, чтобы вывод осуществлялся в файл html-формата. Разработайте для этого свою таблицу стилей CSS. По завершении формирования вывода функция должна запускать браузер и открывать сформированный файл.\u003c/p\u003e\u003cp\u003eНапишите функцию, которая получает весь список команд, использованных в течение сеанса, и формирует из него CSV-файл.\u003cbr /\u003eДоработайте функцию таким образом, чтобы можно было выбирать команды, содержащие некоторое слово (буквосочетание). Это слово должно передаваться функции в качестве параметра.\u003c/p\u003e\u003c/div\u003e","tags":["сппо"]}}