{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1483536831,"rating":730,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1483562326,"id":49569,"title":"\u003cp\u003eFor contest writers: proposal tracking system\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eNew year brings changes to the Codeforces team. \u003ca href\u003d\"/blog/entry/49466\"\u003eAs you probably know\u003c/a\u003e \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/GlebsHP\" title\u003d\"Grandmaster GlebsHP\"\u003eGlebsHP\u003c/a\u003e completed his work as the chief coordinator of Codeforces. Gleb, thanks a lot! You did an excellent job and coordinated a lot of interesting rounds. You\u0027re a professional, an interesting person, you have impeccable taste to problems, and you proved to be brilliant and talented writer. Thank you that you were with us! Hope to see your tasks on Codeforces many times again!\u003c/p\u003e\u003cp\u003eNikolay \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/KAN\" title\u003d\"Grandmaster KAN\"\u003eKAN\u003c/a\u003e Kalinin came to Gleb\u0027s place. He is also an experienced participant, Nikolay has already held several rounds as a coordinator. \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/KAN\" title\u003d\"Grandmaster KAN\"\u003eKAN\u003c/a\u003e seriously engaged in programming contests since he was 12 years old. His major achievements: he won twice All-Russian School Team Olympiad; he won All-Russian School Olympiad (the 1st place!); he has two Gold medals in International Olympiad in Informatics (IOI 2013, 2014), bronze medal in the ACM-ICPC World Finals 2016 and he took the third place at the RCC 2016. This is the highest level! I am very pleased that Nikolay has joined the Codeforces team. I am confident we will succeed!\u003c/p\u003e\u003cp\u003eAnd here there is the first innovation of 2017 year. The idea to ​​organize work with proposals has swirled in my head for a long time. It turned out well: \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/KAN\" title\u003d\"Grandmaster KAN\"\u003eKAN\u003c/a\u003e visited Saratov to get acquainted with the whole Codeforces team and celebrate the New Year together. And we not only had a good time, but found some time to discuss details how we see our work with writers. Here\u0027s what happened.\u003c/p\u003e\u003ch2\u003eWriters Requirements\u003c/h2\u003e\u003cp\u003eAll the functionality described below is only available for experienced contestants and writers of past rounds. There are requirements on the number of rated contests depending on your color (magic does not work here, sorry).\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003ecolor \u003c/th\u003e       \u003cth\u003ethe minimum number of rating contests\u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003eblue \u003c/td\u003e       \u003ctd\u003e25\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003eviolet \u003c/td\u003e       \u003ctd\u003e15\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003eorange \u003c/td\u003e       \u003ctd\u003e5\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003ered \u003c/td\u003e       \u003ctd\u003eno restrictions\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003eWas already a writer in the past \u003c/td\u003e       \u003ctd\u003eno restrictions\u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003ePlease do not assume that the requirements are too strict. Our experience shows that it is hard to work with writers who are inexperienced as contestants . If you are a writer/jury member with experience in other competitions/events, please write \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/KAN\" title\u003d\"Grandmaster KAN\"\u003eKAN\u003c/a\u003e a private message about your wish to prepare a contest and describe your experience in this area. Be respectful to the coordinator decision, if it prompts you to achieve the general formal requirements prior to review your proposal.\u003c/p\u003e\u003ch2\u003eWriters Reward\u003c/h2\u003e\u003cp\u003ePreparation of the round is fascinating, but large and demanding work. We have the opportunity to reimburse the effort of the writers according to the following tariff:\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eRound Type \u003c/th\u003e       \u003cth\u003e$\u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003eDiv 1 + Div 2 \u003c/td\u003e       \u003ctd\u003e$250 + $50*\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003eDiv 2 \u003c/td\u003e       \u003ctd\u003e$100 + $50*\u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003e\u003csmall\u003eAn asterisk denotes a bonus, which is issued in case of work in time, without any issues\u003c/small\u003e\u003c/p\u003e\u003cp\u003eIf a round is a part of a championship, there is an additional bonus, which is discussed separately.\u003c/p\u003e\u003cp\u003e\u003ci\u003eI dream to raise reward to writers. I dream to see the most experienced, the most creative and interesting writers give our users the opportunity to participate in their rounds on Codeforces!\u003c/i\u003e Codeforces rounds attract record number of participants from around the world (the next frontier is 10000 registrations!), I personally \u003ca href\u003d\"//codeforces.com/contests/writer/MikeMirzayanov\"\u003eoffered a large number of problems\u003c/a\u003e — the chance to give an interest to participants is priceless.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePlease send us your problems, spend contest proposals! We can make a platform, we can build a process, we can host championships. But we can\u0027t invent and prepare problems on each round.\u003c/strong\u003e\u003c/p\u003e\u003ch2\u003eHow to propose a contest (можно читать всё!)\u003c/h2\u003e\u003cp\u003eThose who meet the requirements will find the special link “propose a contest/problems” in the personal menu in the right sidebar. Click on it and you will have the opportunity to offer a contest, add problems to it. Read all instructions carefully. Carefully prepare and submit your proposal for a contest and for problems. I think that user interface is simple and intuitive.\u003c/p\u003e\u003cp\u003e\u003ci\u003eNow, you can use only new system to submit proposals. If you have already received an answer from \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/KAN\" title\u003d\"Grandmaster KAN\"\u003eKAN\u003c/a\u003e for current proposal, you shouldn\u0027t transfer it to the new system. If the response has not been received yet and the proposal in actual, please, use the new system to send the proposal again.\u003c/i\u003e\u003c/p\u003e\u003cp\u003eThe discussion of your ideas will be in comments mostly. Perhaps at a later stage it will be a possibility to communicate with the coordinator through any messenger.\u003c/p\u003e\u003cp\u003ePlease be active, respond to coordinators\u0027 questions in time, make the proposed changes quickly. Remember that Codeforces coordinators are very experienced as participants and as reviewers . Their opinion is important, always balanced, and they have the highest priority in any decisions on the problems.\u003c/p\u003e\u003cp\u003eWhen the work goes to the preparation of problems in \u003ca href\u003d\"https://polygon.codeforces.com/\"\u003ePolygon\u003c/a\u003e, the pre-read the examples of well-prepared problems, read all articles about using \u003ca href\u003d\"//codeforces.com/testlib\"\u003etestlib\u003c/a\u003e. It is not difficult, but once you understand, you will be able to prepare high-quality problems for any Olympiad!\u003c/p\u003e\u003ch3\u003eConclusion\u003c/h3\u003e\u003cp\u003eLater we come up with how to adapt the system for educational rounds (they come back!), for educational problems. With the new system we will get rid of lost proposals and can significantly automate and organize the process of working with them. I am sure that the system will be upgraded in the future and will become more flexible, more comfortable, more functional.\u003c/p\u003e\u003cp\u003eI hope that in 2017 we will host a lot of interesting rounds with your help. I hope you are waiting for them as well as I\u0027m waiting!\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["problemsetting","writer","writers","author","authors","problem writing"]}}