{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1424544946,"rating":-31,"authorHandle":"helliabol","modificationTimeSeconds":1424544946,"id":16556,"title":"\u003cp\u003eMessage of Ayatollah Seyyed Ali Khamenei To the Youth in Europe and North America\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIn the name of God, the Beneficent the Merciful To the Youth in Europe and North America,\u003c/p\u003e\u003cp\u003eThe recent events in France and similar ones in some other Western countries have convinced me to directly talk to you about them. I am addressing you, [the youth], not because I overlook your parents, rather it is because the future of your nations and countries will be in your hands; and also I find that the sense of quest for truth is more vigorous and attentive in your hearts.\u003c/p\u003e\u003cp\u003eI don’t address your politicians and statesmen either in this writing because I believe that they have consciously separated the route of politics from the path of righteousness and truth.\u003c/p\u003e\u003cp\u003eI would like to talk to you about Islam, particularly the image that is presented to you as Islam. Many attempts have been made over the past two decades, almost since the disintegration of the Soviet Union, to place this great religion in the seat of a horrifying enemy. The provocation of a feeling of horror and hatred and its utilization has unfortunately a long record in the political history of the West.\u003c/p\u003e\u003cp\u003eHere, I don’t want to deal with the different phobias with which the Western nations have thus far been indoctrinated. A cursory review of recent critical studies of history would bring home to you the fact that the Western governments’ insincere and hypocritical treatment of other nations and cultures has been censured in new historiographies.\u003c/p\u003e\u003cp\u003eThe histories of the United States and Europe are ashamed of slavery, embarrassed by the colonial period and chagrined at the oppression of people of color and non-Christians. Your researchers and historians are deeply ashamed of the bloodsheds wrought in the name of religion between the Catholics and Protestants or in the name of nationality and ethnicity during the First and Second World Wars. This approach is admirable.\u003c/p\u003e\u003cp\u003eBy mentioning a fraction of this long list, I don’t want to reproach history; rather I would like you to ask your intellectuals as to why the public conscience in the West awakens and comes to its senses after a delay of several decades or centuries. Why should the revision of collective conscience apply to the distant past and not to the current problems? Why is it that attempts are made to prevent public awareness regarding an important issue such as the treatment of Islamic culture and thought?\u003c/p\u003e\u003cp\u003eYou know well that humiliation and spreading hatred and illusionary fear of the “other” have been the common base of all those oppressive profiteers. Now, I would like you to ask yourself why the old policy of spreading “phobia” and hatred has targeted Islam and Muslims with an unprecedented intensity. Why does the power structure in the world want Islamic thought to be marginalized and remain latent? What concepts and values in Islam disturb the programs of the super powers and what interests are safeguarded in the shadow of distorting the image of Islam? Hence, my first request is: Study and research the incentives behind this widespread tarnishing of the image of Islam.\u003c/p\u003e\u003cp\u003eMy second request is that in reaction to the flood of prejudgments and disinformation campaigns, try to gain a direct and firsthand knowledge of this religion. The right logic requires that you understand the nature and essence of what they are frightening you about and want you to keep away from.\u003c/p\u003e\u003cp\u003eI don’t insist that you accept my reading or any other reading of Islam. What I want to say is: Don’t allow this dynamic and effective reality in today’s world to be introduced to you through resentments and prejudices. Don’t allow them to hypocritically introduce their own recruited terrorists as representatives of Islam.\u003c/p\u003e\u003cp\u003eReceive knowledge of Islam from its primary and original sources. Gain information about Islam through the Qur’an and the life of its great Prophet. I would like to ask you whether you have directly read the Qur’an of the Muslims. Have you studied the teachings of the Prophet of Islam and his humane, ethical doctrines? Have you ever received the message of Islam from any sources other than the media?\u003c/p\u003e\u003cp\u003eHave you ever asked yourself how and on the basis of which values has Islam established the greatest scientific and intellectual civilization of the world and raised the most distinguished scientists and intellectuals throughout several centuries?\u003c/p\u003e\u003cp\u003eI would like you not to allow the derogatory and offensive image-buildings to create an emotional gulf between you and the reality, taking away the possibility of an impartial judgment from you. Today, the communication media have removed the geographical borders. Hence, don’t allow them to besiege you within fabricated and mental borders.\u003c/p\u003e\u003cp\u003eAlthough no one can individually fill the created gaps, each one of you can construct a bridge of thought and fairness over the gaps to illuminate yourself and your surrounding environment. While this preplanned challenge between Islam and you, the youth, is undesirable, it can raise new questions in your curious and inquiring minds. Attempts to find answers to these questions will provide you with an appropriate opportunity to discover new truths.\u003c/p\u003e\u003cp\u003eTherefore, don’t miss the opportunity to gain proper, correct and unbiased understanding of Islam so that hopefully, due to your sense of responsibility toward the truth, future generations would write the history of this current interaction between Islam and the West with a clearer conscience and lesser resentment. Seyyed Ali Khamenei 21st Jan. 2015\u003c/p\u003e\u003c/div\u003e","tags":["message","khamenei","youth","young","europe","america"]}}