{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1414155977,"rating":11,"authorHandle":"NoCakeNoCode","modificationTimeSeconds":1414156025,"id":14410,"title":"\u003cp\u003eOnline Judge Sandboxing Techniques?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eGreetings\u003c/p\u003e\u003cp\u003eI\u0027m a B-Tech Software Engineering Student and I\u0027m on my last semester, I have a course project where I have to develop a simple \u0026quot;Online Judge\u0026quot; website, I decided to hard code it from scratch using php, here\u0027s an under development snapshot of the website front page:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/aa/9a/aa9ad1ba9c812a3a3e25c77705afc38af97bae67.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eI have about a month or more to finish the work, I can build the website and handle everything else related to the website except for one last hurdle, which is \u003cstrong\u003emalicious code treatment\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eThis online judge will only accept submissions in \u003cstrong\u003eC/C++/Java\u003c/strong\u003e , however I need to make sure the code is safe to run. So far I have been playing around \u003cstrong\u003eJava\u0027s Security Manager\u003c/strong\u003e and I have learned about policy files and granting permissions as well passing arguments to use that file to restrict permissions.\u003c/p\u003e\u003cp\u003eI have tested and I can confirm it is working and restricting the user from creating a Socket and also executing a command via Runtime, I can also restrict file access permissions, some examples:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eSocket s \u003d new Socket(\u0026quot;localhost\u0026quot;,7777);\nor\nRuntime.getRuntime().exec(\u0026quot;shutdown -s -t 0\u0026quot;);\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eHowever I\u0027m yet to completely understand how to modify the policy file, for instance I don\u0027t know how restrict \u003cstrong\u003ejava imports\u003c/strong\u003e as I do not want the user to do any network related operations and neither execute JFrames or applets, I\u0027m also yet to know how to use Class Loaders and how to measure memory usage and execution time to mark \u003cstrong\u003eTLE\u003c/strong\u003e and \u003cstrong\u003eMLE\u003c/strong\u003e .\u003c/p\u003e\u003cp\u003eThis is just on the Java side, I\u0027m yet to learn about \u003cstrong\u003esandboxing techniques for C++\u003c/strong\u003e , I can\u0027t seem to find good step by step video or tutorial that can easily explain how to go about it.\u003c/p\u003e\u003cp\u003eSome techniques I heard about but not tried would be virtualization, using chroot jail technique, LXC containers on Ubuntu, systrace and a bulk of search results...nothing easily understandable for my poor brain x[\u003c/p\u003e\u003cp\u003eIf anybody knows any easy sandboxing solutions that I could understand and use to safely execute \u003cstrong\u003emalicious code\u003c/strong\u003e to prevent damage or scenarios such as shutting down a machine or other unwanted actions then I would be grateful for your input.\u003c/p\u003e\u003cp\u003eThank you for spending time reading this. (^-^)/\u003c/p\u003e\u003c/div\u003e","tags":["sandbox","c++","java","online","judge","php"]}}