{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1457277571,"rating":443,"authorHandle":"Zlobober","modificationTimeSeconds":1457529217,"id":43615,"title":"\u003cp\u003eCodeforces Round #345\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi everybody!\u003c/p\u003e\u003cp\u003eGlad to tell you that tomorrow on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?day\u003d7\u0026amp;month\u003d3\u0026amp;year\u003d2016\u0026amp;hour\u003d12\u0026amp;min\u003d5\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003e9:05 UTC\u003c/a\u003e there will be Codeforces Round #345. The round is formed of the first day of X Moscow Open Olympiad problemset with several additional problems created for this round. This round is brought to you by the scientific committee of Moscow Programming Olympiads controlled by \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/GlebsHP\" title\u003d\"Grandmaster GlebsHP\"\u003eGlebsHP\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/romanandreev\" title\u003d\"Grandmaster romanandreev\"\u003eromanandreev\u003c/a\u003e and your humble servant, and also with a great help of \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/fcspartakm\" title\u003d\"Candidate Master fcspartakm\"\u003efcspartakm\u003c/a\u003e who helped us make a complete problemset of our problems.\u003c/p\u003e\u003cp\u003eThe round will be conducted under the standard Codeforces rules, you will be given 5 problems for 2 hours. Yes, this round is rated :)\u003c/p\u003e\u003cp\u003eNote that because of holding the main onsite round system testing and upsolving will be available no earlier than 12:35 UTC. Also we would like to ask you to \u003cstrong\u003enot discuss\u003c/strong\u003e problems in comments during the time between the end of the round and the end of the onsite competition. All comments with discussions will be removed and the most active violators will be punished. Thanks for your understanding.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e Sorry, the round start was moved to 9:25 UTC. It is not easy to run onsite round and Codeforces Round simultaneously!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2\u003c/strong\u003e You may discuss the solutions! System testing will be run shortly.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD3\u003c/strong\u003e The editorial has finally appeared: \u003ca href\u003d\"//codeforces.com/blog/entry/43677\"\u003ehttp://codeforces.com/blog/entry/43677\u003c/a\u003e Sorry for the delay!\u003c/p\u003e\u003c/div\u003e","tags":["codeforces round 345","open olympiad","best way to spend monday"]}}