{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1495507952,"rating":523,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1495566970,"id":52128,"title":"\u003cp\u003eACM-ICPC World Finals 2017: News\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/f2/94/f2949c082624b41bdf37d2052990dba41b17f5ad.jpg\" style\u003d\"width: 500.0px;float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eThe ACM-ICPC World Finals 2017 event is running now. Tomorrow will be the main contest. During these days the directorate of ACM-ICPC shared some news.\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eLet me remind you that this season (2016-2017) is last, when the general sponsor of the championship is IBM. For 20 years, IBM has supported ACM-ICPC, investing millions of dollars annually. Thank you, IBM! At the moment, the model is actively being worked out, when there will be not one general sponsor, but there will be a fund in which several companies will participate. At the opening ceremony the Sport Programming Foundation was mentioned. I believe this Foundation will be the main one for the future seasons of the championship. However, these are not yet close plans.\u003c/p\u003e\u003cp\u003eIt was announced that the next three years the general sponsor of ACM-ICPC will be JetBrains! This is amazing news. Particularly pleased that this is actually a Russian company, and its executive director Maxim Shafirov coached the team of St. Petersburg State University, which became the world champion in 2000! I\u0027m sure that the wonderful development environment from JetBrains in the future finals of the championship will await us as a pleasant bonus.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThere is a reform of the qualifying stages of the championship. For example, now Rissian+ regional contest (NEERC) is not part of the European Regionals, but is a separate league of the Northern Eurasia. In general, eight leagues (read, super-regions) were singled out: Europe, Northern Eurasia, North America, Latin and South America, two leagues in Asia, Africa and probably Australia and Oceania. It is planned that each league will have its own separate finals with medals and the top 12 teams from each league will receive a ticket to the World Finals. While these are still distant plans, but the first steps have already been taken. Discusses its quota on the number of participations in the league finals (3 times).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eUnfortunately, this year a significant part of the teams did not receive a visa at all (5 teams) and a dozen more could not arrive completely because of the visa problems of one of the participants. Saratov State University, apparently, is among them. It was announced the decision to invite to the next Wold Finals without any selections and quota accounting for 5 teams that could not come this year. In addition, it is proposed to give a +1 year to participate (without taking into account any other requirements) to all teams that could not arrive completely.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe next Finals will be held in Beijing, and a year later — in Kochi (India).\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eSuch news.\u003c/p\u003e\u003c/div\u003e","tags":["acm-icpc"]}}