{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1417798269,"rating":34,"authorHandle":"Nada","modificationTimeSeconds":1417798877,"id":15021,"title":"\u003cp\u003ePOLYGON TEST CASES GENERATION\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003eHow to Generate Test Cases Using Polygon\u003c/h1\u003e\u003ch3\u003eStep 1:\u003c/h3\u003e\u003cp\u003eDownload \u003ca href\u003d\"https://code.google.com/p/testlib/downloads/detail?name\u003dtestlib.h\"\u003etestlib\u003c/a\u003e\u003c/p\u003e\u003cp\u003eYou will have 4 folders and 1 file, one folder is \u0026quot;Generator\u0026quot;, it will contain 6 cpp files, each file generates a different kind of input, if you open any file you will know what kind of input it generates.\u003c/p\u003e\u003ch3\u003eStep 2:\u003c/h3\u003e\u003cp\u003eOn polygon, after you finish writing your problem, click on \u0026quot;Files\u0026quot; at the upper bar. at Resource files, click \u0026quot;Add File\u0026quot;, select the file \u0026quot;testlib.h\u0026quot; from your hard disk and click \u0026quot;Add\u0026quot;.\u003c/p\u003e\u003ch3\u003eStep 3:\u003c/h3\u003e\u003cp\u003eThen, at Source files, click \u0026quot;Add File\u0026quot;, and you should select the suitable cpp file for your problem from the folder \u0026quot;Generators\u0026quot; on your hard disk, and click \u0026quot;Add\u0026quot;.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNow you are ready to generate your test cases.\u003c/strong\u003e\u003c/p\u003e\u003ch3\u003eStep 4:\u003c/h3\u003e\u003cp\u003eSelect \u0026quot;Tests\u0026quot; from the upper bar, you will find an empty text box written upon it \u0026quot;Script\u0026quot;. in this text box you will call your generator with different parameters to generate different values.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eExample:\u003c/strong\u003e if you are using \u0026quot;sgen\u0026quot;, then your script will be like this:\u003c/p\u003e\u003cp\u003esgen 1 \u0026gt; $\u003c/p\u003e\u003cp\u003esgen 2 \u0026gt; $\u003c/p\u003e\u003cp\u003esgen 5 \u0026gt; $\u003c/p\u003e\u003cp\u003esgen 8 \u0026gt; $\u003c/p\u003e\u003cp\u003e(Each dollar signs will be automatically replaced with the smallest available test index)\u003c/p\u003e\u003ch3\u003eStep 5:\u003c/h3\u003e\u003cp\u003eSave script and select \u0026quot;Invocations\u0026quot; from the upper bar, select \u0026quot;Want to run solutions?\u0026quot; to check for the generated test cases.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAnd you are done.\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":["polygon","testcases","generator","problem setting"]}}