{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1482641939,"rating":15,"authorHandle":"duckladydinh","modificationTimeSeconds":1482641939,"id":49304,"title":"\u003cp\u003eAny testing system for Genetic Algorithms???\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello friends,\u003c/p\u003e\u003cp\u003eafter weeks of mind-battling, I have finally made up my mind to take a break from Competitive Programming. My plan is to pay a visit to other fields of Computer Science, to see if there are any other things interesting in life, and I have found the first stop in my journey... Genetic Algorithms.\u003c/p\u003e\u003cp\u003eThe thing is, I have recently come across a problem, \u0026quot;input a number and output any equation that equals to it\u0026quot;. Sound simple :v??? Indeed, but just after I read the code, I felt like \u0026quot;what the heck I am reading\u0026quot;. The program is a few hundreds of lines in length, and the algorithm is exactly what I learnt in my high school biology lessons: create a \u0027population\u0027 of equations, encode them into binary \u0027genes\u0027, choose \u0027dad\u0027 and \u0027mom\u0027 genes in a way resembling \u0027natural selection\u0027, let them marry and produce children by crossover and mutation of their genes. Just like the way organisms evolved, isn\u0027t it? Why this \u0026quot;crazy\u0026quot; approach works is still mysterious to me.\u003c/p\u003e\u003cp\u003eLink to the problem and solution (code): \u003ca href\u003d\"http://www.ai-junkie.com/ga/intro/gat3.html\"\u003ehttp://www.ai-junkie.com/ga/intro/gat3.html\u003c/a\u003e\u003c/p\u003e\u003cp\u003eNow I feel really interested in such algorithms, and I want to learn more about them, but you know, it is really difficult because I cannot find any similar problems and even if I can, there is just no one around to evaluate my work. Therefore, I wonder if there is any online judge like Codeforces or Topcoder that has such problems. It would be very nice if someone can recommend some learning materials and some communities that focus on this field. At the moment I am following the book An Introduction to Genetic Algorithms by Mitchell, but when I am not clear about something, I cannot ask anyone :\u0027( at all.\u003c/p\u003e\u003cp\u003eThank you for your time and consideration. HAPPY CODING.\u003c/p\u003e\u003c/div\u003e","tags":[]}}