{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1457889646,"rating":84,"authorHandle":"zeliboba","modificationTimeSeconds":1457971519,"id":43777,"title":"\u003cp\u003eHFT Battle\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003eНаше соревнование \u003ca href\u003d\"http://hftbattle.com/\"\u003eHFT Battle\u003c/a\u003e идет уже третью неделю, и оно оказалось популярным среди пользователей codeforces, что не может не радовать. Мы хотим рассказать вам о том, как оно проходит, и ответить на часто возникающие вопросы.\u003c/p\u003e\u003cp\u003eСейчас у нас 355 зарегистрированных участников, из них порядка 50 регулярно работают над своим алгоритмом. С момента старта система показала крайне высокий uptime, чего мы, честно говоря, не ожидали. Добиться положительных результатов удалось пока немногим участникам, поэтому мы решили опубликовать рекомендации о том, как искать идеи hft-алгоритмов. В ближайшее время в нашем блоге мы опубликуем статью о том, что такое HFT и как можно написать высокочастотную стратегию, набирающую положительный результат. Мы надеемся, что это поможет многим участникам. Следите за новостями!\u003c/p\u003e\u003cp\u003eПо ходу всего соревнования мы проводим конкурсы, за которые вручаем призы. К примеру, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Frifon\" title\u003d\"Candidate Master Frifon\"\u003eFrifon\u003c/a\u003e и \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Zhuravlyov.A\" title\u003d\"Expert Zhuravlyov.A\"\u003eZhuravlyov.A\u003c/a\u003e уже выиграли Das Keyboard 4. Объявляем о новом конкурсе: первые 30 человек, чьи стратегии будут иметь положительный результат на полном тренировочном наборе дней и в среднем будут делать не менее 1000 сделок, получат от нас книгу “Flash Boys”! Мы уверены, что это по силам сделать любому участнику Codeforces.\u003c/p\u003e\u003cp\u003eПроведя небольшой опрос, мы узнали, что многие не торопятся приступать к борьбе, так как времени до конца ещё много. Хотим заметить, что каждую неделю мы проводим тестирование на новом наборе дней, и у вас есть возможность убедиться, что стратегия дает стабильные положительные результаты, и повысить шансы на победу в финальном тестировании! Ближе к завершению соревнования такой возможности не будет, поторопитесь!\u003c/p\u003e\u003cp\u003eТакже обращаем ваше внимание, что решения топовых участников станут доступны для скачивания после окончания соревнования (если они разрешат).\u003c/p\u003e\u003cp\u003eЖелаем всем высокого рейтинга и положительных результатов в HFT Battle!\u003c/p\u003e\u003c/div\u003e","tags":["hft","hftbattle","aimtech","hft battle"]}}