{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1502732911,"rating":669,"authorHandle":"TeaPot","modificationTimeSeconds":1502732911,"id":53852,"title":"\u003cp\u003eWill competitive programming ever become a real sport?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI always was dreaming that one day competitive programming will become a real sport, not just activity for a small group of participants. Why? Because I don\u0027t really like working and my tries to do some science were totally unsuccessful. It would be cool to live just by doing what you like. Very childish, I know.\u003c/p\u003e\u003cp\u003eBut this blog is not about if competitive programming is important or are there any ways to make it interesting to watch to wider audience. I am just trying to understand, is it currently moving toward real sport or away from it? And I get some mixed signals about that:\u003c/p\u003e\u003cp\u003eBad signals:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eBig onsites (like GCJ or TCO) seem to cut the number of participants and the amount of prizes.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eSome onsite-finals are turning to online-finals. For example, several years ago we had Russian Code Cup onsite in Russia, currently RCC Finals is online.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eSome big companies are turning away from sport programming (IBM is stopping sponsorship of ACM ICPC).\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eGood signals:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eSome new finals were created during last years. For example, VK Cup in Russia, SnackDown in India or Code Festival in Japan (for students).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eSome small firms are holding rounds and even created their own little onsite finals.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eSports programming (not in the financial part) seems to thrive. For instance, there are new platforms for training that were created just in the last year: like atcoder (for international participants) or csacademy.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eSo, what future will you predict for a competitive programming? Will it become a real sport? Or will it forever be just for fun and for students to get to the interview in a big company?\u003c/p\u003e\u003c/div\u003e","tags":["competitive programming","money"]}}