{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1480613549,"rating":46,"authorHandle":"ma5termind","modificationTimeSeconds":1480786432,"id":48767,"title":"\u003cp\u003eHackerRank HourRank-15\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi Codeforces,\u003c/p\u003e\u003cp\u003eI am taking this opportunity to announce HackerRank HourRank 15, a 60 minute contest where the fastest coder wins!. The contest will be held on \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dHackerRank+HourRank+15\u0026amp;iso\u003d20161203T22\u0026amp;p1\u003d176\u0026amp;ah\u003d1\"\u003e16:30 UTC Saturday, 3rd December, 2016\u003c/a\u003e. You can sign up for the contest \u003ca href\u003d\"https://www.hackerrank.com/hourrank-15\"\u003ehere\u003c/a\u003e. Contestants will be given 4 problems and 1 hour to solve. I recommend all of you to read all the problems as each problem contains some interesting subtasks. Top 10 global winners will get cool HackerRank T-shirts. Note that contest will be rated for all users.\u003c/p\u003e\u003cp\u003eAs you can probably guess, i am author of this contest and i promise you all to deliver an interesting problem set with something for all. I really want to thank \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/dans\" title\u003d\"Гроссмейстер dans\"\u003edans\u003c/a\u003e for testing all the problems and helping me to come up with nice problem set. My special thanks to \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Shafaet\" title\u003d\"Эксперт Shafaet\"\u003eShafaet\u003c/a\u003e for bringing me back to problem setting and motivate me to work hard for this contest. Also, thanks to \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/svanidz1\" title\u003d\"Кандидат в мастера svanidz1\"\u003esvanidz1\u003c/a\u003e for presolving the contest and providing his valuable feedback.\u003c/p\u003e\u003cp\u003eScoring will be posted right before the contest and editorials will be published right after the contest.\u003c/p\u003e\u003cp\u003eHope to see you participating.\u003c/p\u003e\u003cp\u003eGood Luck \u0026amp; Have Fun.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPDATE 1:\u003c/strong\u003e Score Distribution \u003cstrong\u003e15-35-70-80\u003c/strong\u003e. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPDATE 2:\u003c/strong\u003e Contest will be started in less than 25 minutes. See you guys on leaderboard.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPDATE 3:\u003c/strong\u003e Contest will be started in less than 5 minutes. All the best.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPDATE 4:\u003c/strong\u003e Contest has started. May the force is with you :). \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPDATE 5:\u003c/strong\u003e Contest has ended. Editorials are uploaded. Thank you for participating. I am eagerly waiting to have your feedback guys.\u003c/p\u003e\u003c/div\u003e","tags":["hackerrank","hourrank15"]}}