{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1488518982,"rating":69,"authorHandle":"Sazzon","modificationTimeSeconds":1488518982,"id":50774,"title":"\u003cp\u003eHow to motivate your teammates ?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, and welcome to another insecure blog entry of mine.\u003c/p\u003e\u003cp\u003eLately I\u0027ve increased my study by being motivated by interesting problems, nice blogs and community here, and also by a endless urge to excel my knowledge. All of this helps me get through some though times when I\u0027m stuck in a particular problem or technique. But this isn\u0027t the same on my teammates.\u003c/p\u003e\u003cp\u003eI\u0027ve already instigated them to participate more here, or to look for interesting problems as well as teaching each other, but it seems not quite effective. Maybe the problem is with me, maybe I\u0027m too focused and they are not. Maybe they want different things right now in their life and their focus are on other things, like earning some money developing stuff to someone, or even they are too comfortable thinking they are the best in our sub-regional (which I think is a huge trap).\u003c/p\u003e\u003cp\u003eDon\u0027t get me wrong, they have a huge potential of being one of the best and together achieve a lot and I have absolute faith on them, but recently this faith and this potential are being put to test by lack of study.\u003c/p\u003e\u003cp\u003eSometimes I can be very harsh in my critiques just to maybe put them to work so we can grow together, but more than one time this was treated as some kind of bossy action, and I don\u0027t blame them.\u003c/p\u003e\u003cp\u003eHave you ever being in this situation before? What should I do to get them on tracks again? Give me tips to get them working again and also not be a total jerk while doing it. \u003c/p\u003e\u003cp\u003eThank you for your time! Be gently in the comments.\u003c/p\u003e\u003c/div\u003e","tags":["teammates","study group"]}}