{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1478105594,"rating":3,"authorHandle":"Zash","modificationTimeSeconds":1478168778,"id":48165,"title":"\u003cp\u003eО компонентах двусвязности\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ процессе решения задач возникло пару вопросов.\u003c/p\u003e\u003cp\u003e1) Как я понял, компонента рёберной двусвязности — это связный граф, в котором любые две вершины лежат на рёберно простом цикле. Мне кажется, что отсутствие мостов — это признак рёберной двусвязности графа, но доказать или опровергнуть это я не могу.\u003c/p\u003e\u003cp\u003e2) Пусть есть 3 произвольные вершины A, B, C (Некоторые буквы могут обозначать одну и ту же вершину). Правда ли что в компоненте рёберной двусвязности всегда существуют не пересекающиеся по рёбрам пути AB и AC?\u003c/p\u003e\u003cp\u003e3) Компонента вершинной двусвязности — это связный граф, в котором любые два ребра лежат на вершинно простом цикле. Является ли истиной, что отсутствие мостов и точек сочленения — это признак вершинной двусвязности графа? Если да, то почему?\u003c/p\u003e\u003cp\u003eВсё что я нашёл по этой теме — \u003ca href\u003d\"http://neerc.ifmo.ru/wiki/index.php?title\u003d%D0%9E%D1%82%D0%BD%D0%BE%D1%88%D0%B5%D0%BD%D0%B8%D0%B5_%D1%80%D0%B5%D0%B1%D0%B5%D1%80%D0%BD%D0%BE%D0%B9_%D0%B4%D0%B2%D1%83%D1%81%D0%B2%D1%8F%D0%B7%D0%BD%D0%BE%D1%81%D1%82%D0%B8\"\u003eтык\u003c/a\u003e, \u003ca href\u003d\"http://neerc.ifmo.ru/wiki/index.php?title\u003d%D0%9E%D1%82%D0%BD%D0%BE%D1%88%D0%B5%D0%BD%D0%B8%D0%B5_%D0%B2%D0%B5%D1%80%D1%88%D0%B8%D0%BD%D0%BD%D0%BE%D0%B9_%D0%B4%D0%B2%D1%83%D1%81%D0%B2%D1%8F%D0%B7%D0%BD%D0%BE%D1%81%D1%82%D0%B8\"\u003eтык\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e Доказательство первого факта оказалось простым, но почему-то догадался не сразу. В ссылке выше есть доказательство транзитивности двусвязности двух вершин (вершины называются двусвязными, если есть хотя-бы два, не пересекающихся по рёбрам, пути, соединяющие эти вершины). Так как для любых двух, соединённых ребром, вершин верно, что они двусвязны (так как нет мостов), то по свойству транзитивности это верно для любых пар вершин.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2.\u003c/strong\u003e Третий факт можно доказать аналогично первому, но только с тем отличием, что два смежных ребра всегда лежат на вершинно простом цикле, если отсутствуют мосты и точки сочленения.\u003c/p\u003e\u003cp\u003eДоказательство и пояснение второго факта в комментариях.\u003c/p\u003e\u003cp\u003eНадеюсь, кому-нибудь это будет полезно.\u003c/p\u003e\u003c/div\u003e","tags":["двусвязные компоненты","рёберная двусвязность","вершинная двусвязность","графы"]}}