{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1506676434,"rating":0,"authorHandle":"tomasz.kociumaka","modificationTimeSeconds":1506937769,"id":54831,"title":"\u003cp\u003eEliminacje wydziałowe 2017: Regulamin\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003col\u003e   \u003cli\u003eEliminacje indywidualne odbywają się w dniach 5.10.2017 (czwartek) w godz. 14.30-19.30 oraz 7.10.2017 (sobota) w godz. 9.15-14.15.\u003c/li\u003e   \u003cli\u003eEliminacje można pisać w zarezerwowanych przez nas laboratoriach komputerowych lub za pośrednictwem Internetu (nie dotyczy uczestników II rundy ubiegających się o zwolnienie z ASD-labu).\u003c/li\u003e   \u003cli\u003ePo zakończeniu eliminacji w sali 2070 odbędzie się omówienie rozwiązań, na które serdecznie zapraszamy wszystkich startujących. Bezpośrednio przed omówieniem zapraszamy na \u003cstrong\u003epizzę\u003c/strong\u003e w ww. sali.\u003c/li\u003e   \u003cli\u003eEliminacje polegają na \u003cstrong\u003esamodzielnym rozwiązywaniu 4-8 zadań\u003c/strong\u003e. Konkurs będzie przeprowadzony na zasadach ACM ICPC (zgłoszenia są akceptowane albo odrzucane, liczone są zgłoszenia zaakceptowane i sumaryczny czas, czas za rozwiązane zadanie liczony od początku konkursu, 20 minut kary za każdą bombkę w rozwiązanym zadaniu, zamrażanie rankingu na godzinę przed zakończeniem konkursu itd.). Gdyby ktoś miał jakieś wątpliwości co do zasad, proszę nas pytać. Zasady będą zresztą takie same jak na naszych treningach indywidualnych.\u003c/li\u003e   \u003cli\u003eWynik punktowy dla pojedynczej rundy eliminacji będzie wyznaczony za pomocą skali \u003ca href\u003d\"https://www.mimuw.edu.pl/~kociumaka/gp30.txt\"\u003eGP30\u003c/a\u003e (tak jak m.in. w skokach narciarskich). Łączny rezultat eliminacji będzie \u003cstrong\u003esumą wyników z obydwu rund\u003c/strong\u003e.\u003c/li\u003e   \u003cli\u003eKażda z rund eliminacyjnych będzie trwała 5 godzin.\u003c/li\u003e   \u003cli\u003eZadania będą miały zróżnicowaną tematykę i stopień trudności. Treści zadań będą sformułowane w języku angielskim. Limity pamięciowe i czasowe będą podane przy każdym zadaniu.\u003c/li\u003e   \u003cli\u003eW trakcie eliminacji \u003cstrong\u003enie wolno korzystać z materiałów elektronicznych\u003c/strong\u003e (w tym z elektronicznych wersji biblioteczek itp.) ani z Internetu poza stroną \u003cem\u003e\u003ca href\u003d\"//warsaw.contest.codeforces.com\"\u003egrupy UW na codeforces\u003c/a\u003e\u003c/em\u003e, gdzie będą odbywać się eliminacje. Eliminacje będą dostępne tylko dla zarejestrowanych uczestników. Bardzo liczymy na Waszą uczciwość. Można jednakże korzystać on-line z dokumentacji używanego języka programowania (np. dla C++ \u003ca href\u003d\"http://en.cppreference.com/w/\"\u003ecppreference.com\u003c/a\u003e lub \u003ca href\u003d\"http://www.cplusplus.com/\"\u003ecplusplus.com\u003c/a\u003e). Ze względów technicznych, dozwolone jest korzystanie z gotowych konfiguracji edytorów graficznych i konsolowych (np. z gotowego .vimrc). \u003cstrong\u003eNie jest dozwolone\u003c/strong\u003e korzystanie np. z jakiegoś gotowego szablonu programu np. zawierającego makra.\u003c/li\u003e   \u003cli\u003eW trakcie eliminacji \u003cstrong\u003emożna\u003c/strong\u003e korzystać z dowolnych materiałów papierowych (drukowanych, książkowych itp.). Jeśli ktoś nie ma wydrukowanej biblioteczki, może ją umieścić na swoim koncie na students przed rozpoczęciem zawodów i \u003cstrong\u003eprzepisywać\u003c/strong\u003e kody do drugiego okna.\u003c/li\u003e   \u003cli\u003eKażdy uczestnik eliminacji musi mieć założone konto w codeforces (z prawdziwym imieniem i nazwiskiem) oraz zarejestrować się za pomocą formularza.\u003c/li\u003e   \u003cli\u003eW trakcie eliminacji można zadawać pytania związane z zadaniami. Nie na każde pytanie zostanie udzielona odpowiedź (wyjątkiem mogą być np. pytania typu \u0026quot;zupełnie nie rozumiem treści\u0026quot; lub pytania o sposób rozwiązania zadania; w takich przypadkach możemy udzielić odpowiedzi \u0026quot;BRAK ODPOWIEDZI\u0026quot;).\u003c/li\u003e   \u003cli\u003eNależy przyjąć, że dane testowe są bezbłędne, zgodne z warunkami zadania i podaną specyfikacją wejścia.\u003c/li\u003e   \u003cli\u003eDane powinny być wczytywane ze standardowego wejścia, a wyniki — wypisywane na standardowe wyjście.\u003c/li\u003e   \u003cli\u003eOd soboty 7.10 będziemy zbierać preferencje poszczególnych zawodników odnośnie osób, z którymi chciałyby lub nie chciałyby być w drużynach. Forma nadsyłanych preferencji dowolna; im bardziej szczegółowe, tym lepiej. Jeśli trzy osoby same dobiorą się w drużynę, \u003cstrong\u003ekażda\u003c/strong\u003e z nich powinna złożyć stosowne preferencje. Preferencje będą czytane tylko przez grupę trenerską. Termin nadsyłania propozycji przewidujemy na \u003cstrong\u003eponiedziałek 9.10.2017, godz. 15:00\u003c/strong\u003e. Preferencje prosimy przesyłać do \u003ca href\u003d\"mailto:m.smulewicz@mimuw.edu.pl\"\u003eMarcina Smulewicza\u003c/a\u003e, podając \u0026quot;[ACM] Preferencje\u0026quot; jako tytuł wiadomości. O wysłanie preferencji prosimy \u003cstrong\u003ekażdego\u003c/strong\u003e uczestnika eliminacji (nawet, jeśli miałyby to być bardzo niekonstruktywne preferencje albo rezygnacja z dalszych startów).\u003c/li\u003e   \u003cli\u003e\u003cstrong\u003eNa podstawie rankingu po eliminacjach i preferencji uczestników\u003c/strong\u003e (oraz biorąc pod uwagę inne istotne kryteria merytoryczne) \u003cstrong\u003eGrupa Trenerska podejmie decyzję o uformowaniu (trzyosobowych) drużyn UW do zawodów ACM ICPC 2017/2018\u003c/strong\u003e. Decyzja zostanie ogłoszona najpóźniej we wtorek 10.10.\u003c/li\u003e   \u003cli\u003eW czwartek 19.10.2017 odbędą się eliminacje drużynowe do \u003ca href\u003d\"http://amppz.ii.uni.wroc.pl/\"\u003eAkademickich Mistrzostw Polski w Programowaniu Zespołowym 2017\u003c/a\u003e (organizowanych we Wrocławiu przez UWr). Do tych zawodów zakwalifikowanych zostanie N (ok. 8) najlepszych drużyn z eliminacji. Natomiast K (ok. 3-6) najlepszych drużyn z AMPPZ 2017 będzie reprezentować Uniwersytet Warszawski na \u003ca href\u003d\"http://cerc.hsin.hr/\"\u003eŚrodkowoeuropejskich Zawodach Regionalnych (CERC) ACM ICPC\u003c/a\u003e w Zagrzebiu. W eliminacjach drużynowych wezmą udział wszystkie chętne drużyny UW.\u003c/li\u003e \u003c/ol\u003e\u003ch4\u003eSkład Grupy Trenerskiej Uniwersytetu Warszawskiego:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003eprof. Krzysztof Diks\u003c/li\u003e   \u003cli\u003eAdam Karczmarz (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/dasko1\" title\u003d\"Grandmaster dasko1\"\u003edasko1\u003c/a\u003e)\u003c/li\u003e   \u003cli\u003eTomasz Kociumaka (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/tomasz.kociumaka\" title\u003d\"International Grandmaster tomasz.kociumaka\"\u003etomasz.kociumaka\u003c/a\u003e)\u003c/li\u003e   \u003cli\u003eMarcin Smulewicz (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Marcin_smu\" title\u003d\"Grandmaster Marcin_smu\"\u003eMarcin_smu\u003c/a\u003e)\u003c/li\u003e   \u003cli\u003eprof. Jan Madey\u003c/li\u003e \u003c/ul\u003e\u003cp\u003ePytania i uwagi techniczne związane z eliminacjami można przesyłać do \u003ca href\u003d\"mailto:m.smulewicz@mimuw.edu.pl\"\u003eMarcina Smulewicza\u003c/a\u003e. W razie pojawienia się \u0026quot;dobrych pytań\u0026quot; zastrzegamy sobie możliwość dopisania jakichś punktów do regulaminu przed rozpoczęciem pierwszej rundy eliminacji. Zmiany zostaną wtedy wyróżnione kursywą.\u003c/p\u003e\u003c/div\u003e","tags":[]}}