{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1475923209,"rating":23,"authorHandle":"MikhailRubinchik.ru","modificationTimeSeconds":1475931399,"id":47622,"title":"\u003cp\u003eКволы 2016. Дайджест\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eГод и два назад я надоедал всем постами про кволы. В этот раз не будет огромных постов, будет краткий дайджест.\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eНаши кволы 2016 кончились только что. Здесь можно посмотреть замороженные результаты: \u003ca href\u003d\"http://acm.timus.ru/monitor.aspx?id\u003d399\"\u003ehttp://acm.timus.ru/monitor.aspx?id\u003d399\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eКонтест я уже залил в мешапы (\u003ca href\u003d\"//codeforces.com/group/DOo7Ng4jy4/contests\"\u003ehttp://codeforces.com/group/DOo7Ng4jy4/contests\u003c/a\u003e) . Его можно отыграть прямо сейчас, но он без реальных участников. Кто-то может подсказать, как залить результаты в мешап? Если залить результаты нельзя без wizard, то залью, как только появится более удобный способ. Ну или любители рутины могут попросить у меня права на контест в полигоне\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eКволы теперь “легализованы”. Это отражено в новых правилах полуфинала \u003ca href\u003d\"http://neerc.ifmo.ru/information/selection-rules.html\"\u003ehttp://neerc.ifmo.ru/information/selection-rules.html\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eНесколько четвертьфиналов в прошлом году сказали, что собираются проводить кволы\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eКроме нас никто в этом году кволы не провёл. Увидим, что будет в следующем году :)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eЕсли какие-то четвертьфиналы хотят проводить кволы, но есть проблемы с задачами, то предлагаем в следующем году использовать наши задачи (на тимусе, либо вашей системе на выбор)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВ прошлом году в кволах участвовала 361 команда\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВ этом году я сам не занимался PRом совсем. Мы только разослали письма прошлогодним участникам\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eТем не менее квол собрал 338 команд\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eИз внезапного: ЮУрГУ привёл 85 команд! Я лично в шоке\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e В этом контесте много простых задач, но есть и сложные. Это можно видеть по монитору. Поэтому контест вполне для тренировки подходит и команде совсем новичков и команде уровня топ в птз.\u003c/p\u003e\u003c/div\u003e","tags":[]}}