{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1461898966,"rating":8,"authorHandle":"cotrim149","modificationTimeSeconds":1462047486,"id":44609,"title":"\u003cp\u003eHow to find elements from a 0/1 knapsack with 2 table\u0027s rows\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI\u0027m doing a 0/1 knapsack algorithm in C.\u003c/p\u003e\u003cp\u003eI\u0027m retrieving the items and yours respective informations from a database to use in algorithm.\u003c/p\u003e\u003cp\u003eCounting this items, I have the total of 18k items.\u003c/p\u003e\u003cp\u003eFor this motive I was oriented to make a knapsack using only 2 rows.\u003c/p\u003e\u003cp\u003eBut now I don\u0027t know how to get the items from this optimization. This happens because I don\u0027t have anymore a table to analise the values.\u003c/p\u003e\u003cp\u003eI found this \u003ca href\u003d\"http://stackoverflow.com/questions/17246670/0-1-knapsack-dynamic-programming-optimazion-from-2d-matrix-to-1d-matrix/\"\u003etopic\u003c/a\u003e: Talk about 3 methods of knapsack implementation. I`m using a variation of method 2.\u003c/p\u003e\u003cp\u003eAnd I found this other \u003ca href\u003d\"http://stackoverflow.com/questions/7489398/how-to-find-which-elements-are-in-the-bag-using-knapsack-algorithm-and-not-onl\"\u003etopic\u003c/a\u003e: Talk about how to find elements in a normal way of 0/1 knapsack using all values of the table.\u003c/p\u003e\u003cp\u003eSo, my Question is: How to find the items of a 0/1 knapsack using a 2 rows implementation, once the table don\u0027t have the rest of values? I don\u0027t understand how to get this elements without all the table :(\u003c/p\u003e\u003cp\u003eP.S.: Sorry for my English\u003c/p\u003e\u003cp\u003eUPDATE: Possible Solution?\u003c/p\u003e\u003cp\u003eI thought in a simple solution, but it is very simple and costly.\u003c/p\u003e\u003cp\u003eI\u0027m thinking to use 1 byte per 8 item. In other words every bit of this byte can be considered like a bit id.\u003c/p\u003e\u003cp\u003eThe ideia behind of this is set this \u0026quot;tracking bytes\u0026quot; for every cell in other 2 rows knapsack table, like a clone of the first table but with \u0026quot;tracking bytes\u0026quot; not profit value.\u003c/p\u003e\u003cp\u003eAn example of this:\u003c/p\u003e\u003cp\u003eIf I have 5 Itens, soon I have 1 byte.\u003c/p\u003e\u003cp\u003eMy bag have the capacity, for exemple, of 10. \u003c/p\u003e\u003cp\u003eSoon my knapsack table will be 11 columns and 6 lines, but with optimization the lines will be count like 2, and my \u0026quot;tracking bytes\u0026quot; knapsack table will be the same columns and lines count.\u003c/p\u003e\u003cp\u003eIf we count the space for used for this \u0026quot;tracking table\u0026quot; will be of:\u003c/p\u003e\u003cp\u003e1 byte per cell\u003c/p\u003e\u003cp\u003e11*2 cells \u003d 22 cells\u003c/p\u003e\u003cp\u003e22*1 byte \u003d 22 bytes for all table.\u003c/p\u003e\u003cp\u003eSo, this is the way I\u0027m thinking. What you think about this? Feel free to comment \u003c/p\u003e\u003c/div\u003e","tags":["knapsack","optimization","2 rows","find","elements","items"]}}