{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1478004258,"rating":51,"authorHandle":"geniucos","modificationTimeSeconds":1478083970,"id":48137,"title":"\u003cp\u003eSort of output only problems\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, everybody!\u003c/p\u003e\u003cp\u003eI\u0027m writing this entry for asking for your help. It is a special kind of task, that I like the most and, however, I can\u0027t say am very good at. I\u0027m talking about output only problems, or tasks similar to them, or some sort of puzzle tasks. I\u0027m talking generally about tasks that require generating something (maybe an array or a matrix) as a input to a source that is given in the statement explicitly or implicitly (maybe they don\u0027t give you the source but they want the number of pairs of indices with who-know-what property to be large or small) to generate a number as high or as low as possible (not necessarily minimum or maximum). The worst is that I don\u0027t have any example to give at the moment (I don\u0027t exactly remember any such problem or where to find it). I\u0027ll try to give a short example (not necessarily solvable): Generate an array with N numbers smaller or equal than M so that the number of values that can be obtained by summing some of the initial values (each can be used at most one time) to be as large as possible. And I want a solution to generate for N \u003d 10 and M \u003d 100 a set whose size will be 500 (this may be an output only problem), or I am simply giving you N and M as input and the scoring is computed someway to let a strategy get 100 points (it\u0027s not an optimization task like codechef long challenge ones). Something like if you get a size of NlogM you get 100 or who knows.\u003c/p\u003e\u003cp\u003eI\u0027d also like to include in this category the problems that ask for generating something with a certain property (like paving a matrix with some sort of puzzle pieces for example). These two types of problems are not that linked, but both of them require constructing of something.\u003c/p\u003e\u003cp\u003eOne more important thing: I want the problems to be solvable by \u003cstrong\u003edeterminist\u003c/strong\u003e algorithms or \u003cstrong\u003eproved probabilistical\u003c/strong\u003e solutions. Also, I don\u0027t ask for you to know their solution, even though that would help, but just for the problems and after a while I hope I\u0027ll get them done, or if not, I think I\u0027ll ask either here in the comments or in some separate post.\u003c/p\u003e\u003cp\u003eI especially like these sort of tasks and I want to train to become able to solve more of them. But they are hard to find (usually because such problems have a very big variety of scores and wouldn\u0027t be good as ACM tasks and most of the competitive programming resources that I know are targeting ACM training, and also because, as you can see, I don\u0027t know what is their generic name, so I can\u0027t google it or even see wheter there is already such a topic). So I wanted to ask: do you know where to find such tasks? Every single link may help. I also hope that I\u0027m not the only one who appreciate such tasks, so that the topic will not be helpful just for me. As soon as I remember those problems of this kind that I\u0027ve seen, I\u0027ll edit the post and add some links.\u003c/p\u003e\u003cp\u003eAs generating a covering of someway of something, I have a \u003ca href\u003d\"http://www.infoarena.ro/problema/acoperire\"\u003elink\u003c/a\u003e to a problem in Romanian that asks for paving a matrix whose corners are cut, with L shape pieces. Even though the statement is in Romanian, you can check the sample to see what it\u0027s asking for.\u003c/p\u003e\u003cp\u003eLE: I remember \u003ca href\u003d\"//codeforces.com/problemset/problem/297/D\"\u003eone\u003c/a\u003e of the problems I was talking about. It is almost what I wanted to say through this post, but the best representative of this category, I guess, is the \u003ca href\u003d\"//codeforces.com/blog/entry/48137#comment-323498\"\u003eone\u003c/a\u003e mentioned by Um_Nik\u003c/p\u003e\u003cp\u003eThanks in advance!\u003c/p\u003e\u003c/div\u003e","tags":["output-only","special kind of problems"]}}