{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1413545667,"rating":65,"authorHandle":"lperovskaya","modificationTimeSeconds":1413559822,"id":14317,"title":"\u003cp\u003eЯндекс: cпонсорский зачет OpenCup\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПриближается новый, пятнадцатый сезон Открытого Кубка. Уже в это воскресенье он откроется Гран-При Санкт-Петербурга — онлайн-трансляцией XXXIX командного чемпионата СПбГУ по программированию. Если вы еще не определились с сектором — скорее создайте его (инструкция расположена на \u003ca href\u003d\"http://opencup.ru\"\u003eopencup.ru\u003c/a\u003e). \u003c/p\u003e\u003cp\u003eМногие из вас наверняка заметили изменения в регламенте. С этого года второе место будет получать 75 очков по системе GP-30 (вместо прошлогодних 80). \u003c/p\u003e\u003cp\u003eЯндекс уже много лет поддерживает ACM ICPC команды в их поездках на сборы и соревнования. Мы считаем поддержку ICPC одним из приоритетных направлений и рады видеть призеров ICPC своими коллегами.\u003c/p\u003e\u003cp\u003eК делу :) Вторым регламентным изменением OpenCup является введение спонсорского зачета — ICPC зачета Открытого кубка от Яндекса. Мы хотим пригласить команды, удовлетворяющие условиям допуска к ACM ICPC в этом году (однако не обязательно выступающие в этом году; более формально — те, у которых еще есть возможность принять участие хотя бы в одном официальном ICPC соревновании в будущем) к участию в Открытом Кубке на платформе Яндекс.Контест. По результатам спонсорского зачета среди команд, участвующих в OpenCup с Яндекс.Контеста, мы предлагаем поддержку в поездках на ключевые ICPC мероприятия лучшим командам.\u003c/p\u003e\u003cp\u003eПолная информация доступна на \u003ca href\u003d\"http://contest.yandex.ru/opencup\"\u003eсайте\u003c/a\u003e, зарегистрироваться к участию в ICPC зачете можно будет на протяжении всего сезона.\u003c/p\u003e\u003c/div\u003e","tags":[]}}