{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1487812698,"rating":96,"authorHandle":"Saat","modificationTimeSeconds":1487812698,"id":50600,"title":"\u003cp\u003eLong Contests\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eMany online judges (Codechef, Hackerrank, Hackerearth) organize regularly long contests, i.e. contests that last around one week. Codeforces once experimented with this, but it was a one-problem contest, and that problem was an approximation problem \u003ca href\u003d\"/contest/684\" title\u003d\"Codeforces Marathon Round 1\"\u003eCodeforces Marathon Round 1\u003c/a\u003e. Having participated in all of these four platforms, I\u0027ve found Codeforces problems the most interesting, and Codeforces itself the best site. Therefore, this blog is about advocating for long contests here :).\u003c/p\u003e\u003cp\u003eFor people in the other side of the world, participating in regular, short contests represents a sacrifice. For example, regular time of contests is around 11 am for me, and if it is not in a weekend, that means I have to skip classes in order to participate. Long contests help alleviate a little this problem, as we can participate regardless of time zone.\u003c/p\u003e\u003cp\u003eAlso, long contests allow setting more challenging/tedious problems, as coding time is more flexible. They also help avoid the frustration of many participants whose solution was uploaded just seconds after the contest time is over. Also, people might be able (and encouraged) to approach the problems from different angles, possibly resulting in a greater learning experience.\u003c/p\u003e\u003cp\u003eI know there are a lot of challenges in implementing this idea. It is possible that if handled incorrectly, cheaters might have access to other contestants solutions more easily, or that people share ideas during contest time. It is possible that, at some times, the server would be full of submissions. There could be tons of other problems I cannot think about. However, I think that with the right set of rules, and the will of the CF community to make this idea succeed, long contests could be a thing.\u003c/p\u003e\u003cp\u003eWhat do you think about it? Would it be a nice idea?\u003c/p\u003e\u003c/div\u003e","tags":["#codeforces","general","long contest"]}}