{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1518613960,"rating":-71,"authorHandle":"I_LOVE_METSUKA","modificationTimeSeconds":1518614099,"id":57758,"title":"\u003cp\u003ePlease stop violating the rules!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces! Being the lowest contributor, I might not be the right person to say this, but let\u0027s please follow the rules. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCodeforces does not allow creating new accounts to participate in a contest\u003c/strong\u003e, you can see it \u003ca href\u003d\"//codeforces.com/help\"\u003ehere\u003c/a\u003e. This is probably because it affects other user\u0027s ratings. However, it seems like a lot of Div 1 coders violate this rule to get their names seen on the Div 2 contest\u0027s official standings. Lets\u0027 take a look at recent Div 2 contests; \u003ca href\u003d\"//codeforces.com/contest/919/standings\"\u003eCodeforces Round #460\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/contest/918/standings\"\u003eCodeforces Round #459\u003c/a\u003e, \u003ca href\u003d\"//codeforces.com/contest/916/standings\"\u003eCodeforces Round #457\u003c/a\u003e... Actually most of the Div 2 contests have unrated contestants on the top 10.\u003c/p\u003e\u003cp\u003eNow let\u0027s see how does \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Штаб, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e see this \u003ca href\u003d\"//codeforces.com/blog/entry/56391#comment-401017\"\u003esituation\u003c/a\u003e. Well it seems like \u0026quot;It\u0027s ugly, unethical, disrespectful to him and the community.\u0026quot; \u003c/p\u003e\u003cp\u003eThe most recent obvious and shameless \u0026quot;cheating\u0026quot; I have seen is \u003ca href\u003d\"//codeforces.com/ratings/organization/8059\"\u003ethis\u003c/a\u003e. Even right now \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/UoA_Akane\" title\u003d\"Эксперт UoA_Akane\"\u003eUoA_Akane\u003c/a\u003e is participating in the current Div 2 round. Although I don\u0027t have a solid evidence, doesn\u0027t it look like the real user behind all those account is \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/UoA_ZQC\" title\u003d\"Кандидат в мастера UoA_ZQC\"\u003eUoA_ZQC\u003c/a\u003e?\u003c/p\u003e\u003cp\u003eHow can we stop this, Mr.\u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Штаб, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e? Codeforces could improve their verification system. Maybe verifying an account through a phone number? Since those people\u0027s goal is to get ranked top on the leaderboard, Codeforces could stop displaying unrated users on the leaderboard? Unrated users will still get their rating changed so it won\u0027t affect the real unrated users.\u003c/p\u003e\u003cp\u003eHowever, this problem could be easily solved if those Div 1 participants just start participating unofficially. So I kindly ask you guys to stop doing this unethical thing, as it affects other Div 2 users.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/b6/8c/b68c07761cd43d1cca1b64ec0e41ee74e02d04a1.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}