{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1494759774,"rating":171,"authorHandle":"Nurseiit","modificationTimeSeconds":1494865040,"id":51983,"title":"\u003cp\u003eУязвимость, позволяющая управлять кларами на контесте\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДобрый день, Codeforces!\u003c/p\u003e\u003cp\u003eСовсем недавно, во время раунда \u003cstrong\u003eTinkoff Challenge — Финал\u003c/strong\u003e, случайным образом я наткнулся на очень интересный баг в системе. Интересный потомучто простым \u003cs\u003eсмертным\u003c/s\u003e контестантам с помощью него можно в каком-то роде почуствовать себя менеджерами! \u003c/p\u003e Разумеется я сразу же написал Михаилу \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e. Но к большому сожалению, он еще не прочитал мое сообщение. И вот решил с вами поделиться ею. \u003cbr /\u003e \u003cem\u003eНу и конечно, делюсь не потомучто хочу чтобы пользовались, а наоборот чтобы побыстрее исправили его!\u003c/em\u003e \u003cbr /\u003e \u003cbr /\u003e Пожалуй, начну с того что саму уязвимость я целиком не знаю, но раз уж нашел его я по чистой случайности, то и тем кто ищут чем бы насолить, обнаружить и еще больше углубиться в нем не составит труда. \u003cbr /\u003e Так уж получилось, что во время раунда я проводил два мэшап контеста внутри закрытой группы. У одной из них время начала и окончания контеста в точности совпадали с раундом codeforces, в последствии чего я подозреваю и возник баг. \u003cbr /\u003e\u003cbr /\u003eВо первых, в основной странице контеста в группе появились какие-то странные красные надписи, на которые я сразу не обратил внимания. \u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/d2/f5/d2f5a182fe0a470f3856d1b4120b5b21a3479dcf.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e Лишь потом понял что система кларов раунда, и моего контеста конфликтуют — решил разобраться в чем дело \u003cs\u003eи за одно повеселиться\u003c/s\u003e. \u003cbr /\u003e Первым делом, хотел сделать общее оповещение — не вышло, так как можно только по определенной задаче оповещать и у меня задач с раунда в списке не было. Думал что на этом все и лишь клары читать могу. Но нет! Оказалось что и публиковать/скрывать клары можно. \u003cbr /\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/43/be/43be9f6e16c163db8bbd575209b424bf8c103b6f.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e И вот результат: \u003cbr /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/42/f7/42f79d2eda9c43784a6451af34962b70d51c7179.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e А дальше, любопытный я сразу же хотел попробовать проверить ответить на клар — к сожалению или к счастью, как бы я тщательно не пытался кнопка \u003cstrong\u003eотправить\u003c/strong\u003e никак не нажималась. \u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/5b/68/5b6841e2a1a64194c75a4e0bb350459ed00252e7.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eЗа несколько секунд до конца контеста я вернул все как было, т.е. скрыл все клары которые я публиковал. И к моему удивлению, после контеста все вышесказанные баги/фичи остались как есть. \u003cbr /\u003e Как я и говорил в начале поста, я сразу решил что лучше написать Михаилу. А чтобы он мне поверил, я опубликовал единственный клар в котором говорится что кто-то кого-то подозрительно взламывает. На этом мои исследования подошли к концу, хотя все еще могу покопаться в том что осталось после раунда.\u003cbr /\u003e \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eВ завершении хочу лишь добавить что надеюсь эта уязвимость окажется последней в \u003cstrong\u003ecodeforces\u003c/strong\u003e и данный факт послужит хорошим уроком для его сотрудников. Думаю когда проект приобретает значительные масштабы, то самое время побольше позаботиться о его информационной безопасности. \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eВсем добра! \u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003eОбновление:\u003c/strong\u003e эта уязвимость больше не актуальна. По крайней мере мне не удалось воссоздать предыдущие обстоятельства. К моему удивлению не смотря на то что клар, мною ранее опубликованный, все еще виден, все вышесказанные возможности теперь не доступны. \u003cbr /\u003e\u003cbr /\u003e Чтож, кажется это все же долгожданный конец моего поста. \u003cbr /\u003e Я искренне рад что мне посчастливилось еще больше улучшить нашу всеми любимую систему \u003cstrong\u003ecodeforces\u003c/strong\u003e! \u003cbr /\u003e\u003cbr /\u003e Всем удачи!\u003c/p\u003e\u003c/div\u003e","tags":["уязвимости","баги","да ответьте вы уже майк","уже не надо :)"]}}