{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1490568640,"rating":-5,"authorHandle":"PROGRAMMAR","modificationTimeSeconds":1490572464,"id":51235,"title":"\u003cp\u003epraying for help in java\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI\u0027m very tired with this \u0026quot;lightoj.com\u0026quot; problem. I tried to find java code from internet but couldn\u0027t find. since this judge requires \u0026quot;registration\u0026quot;; i share the problem here followed by my code. I know the logic. even i did it using c++ and got ac. I\u0027m knew in JAVA. it will be helpfull if you say why my code facing \u0026quot;MLE\u0026quot;\u003c/p\u003e\u003cp\u003e1009 — Back to Underworld(problem name) Time Limit: 4 second(s) Memory Limit: 32 MB\u003c/p\u003e\u003cp\u003eThe Vampires and Lykans are fighting each other to death. The war has become so fierce that, none knows who will win. The humans want to know who will survive finally. But humans are afraid of going to the battlefield.\u003c/p\u003e\u003cp\u003eSo, they made a plan. They collected the information from the newspapers of Vampires and Lykans. They found the information about all the dual fights. Dual fight means a fight between a Lykan and a Vampire. They know the name of the dual fighters, but don\u0027t know which one of them is a Vampire or a Lykan.\u003c/p\u003e\u003cp\u003eSo, the humans listed all the rivals. They want to find the maximum possible number of Vampires or Lykans.\u003c/p\u003e\u003cp\u003eInput Input starts with an integer T (≤ 10), denoting the number of test cases.\u003c/p\u003e\u003cp\u003eEach case contains an integer n (1 ≤ n ≤ 10^5), denoting the number of dual fights. Each of the next n lines will contain two different integers u v (1 ≤ u, v ≤ 20000) denoting there was a fight between u and v. No rival will be reported more than once.\u003c/p\u003e\u003cp\u003eOutput For each case, print the case number and the maximum possible members of any race.\u003c/p\u003e\u003cp\u003eSample Input Output for Sample Input\u003c/p\u003e\u003cp\u003e2\u003c/p\u003e\u003cp\u003e2\u003c/p\u003e\u003cp\u003e1 2\u003c/p\u003e\u003cp\u003e2 3\u003c/p\u003e\u003cp\u003e3\u003c/p\u003e\u003cp\u003e1 2\u003c/p\u003e\u003cp\u003e2 3\u003c/p\u003e\u003cp\u003e4 2\u003c/p\u003e\u003cp\u003eCase 1: 2\u003c/p\u003e\u003cp\u003eCase 2: 3\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://ideone.com/so3oF3\"\u003ehttps://ideone.com/so3oF3\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}