{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1475244496,"rating":162,"authorHandle":"gKseni","modificationTimeSeconds":1475270608,"id":47440,"title":"\u003cp\u003eACM-ICPC World Finals Reunion Dinner 2016\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eACM-ICPC World Finals Reunion Dinner was on 16th of September in the Stanford University. Vladimir Yakunin, the participant of ICPC 2005 and 2010, engineer of Google, shared his impressions about this meeting:\u003c/p\u003e \u003cdiv style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e The organizer, Doug Mohr, invited us to one of Stanford buildings. Yet on the parking I met Roman Chadnov, my friend from Tomsk. We entered the building and asked where the event was. It turned out that there were several of them. Finally we found out the garden mainly thick of young people in jeans and t-shirts who got together and didn’t pay attention to others. Many of them had badges of Google and Facebook members. Our!  \u003cbr /\u003e\u003cbr /\u003e In the far end of the garden there was a bar which, however, was not so popular. Waiters scurried about  the programmers and offered various snacks (mmm, tunny was amazing!!!). All people fastened on their badges (actually not to make the acquaintance of everyone) and sorted out, apparently, according to linguistic/geographical features. Russian group quickly became too much and divided into two. Also there were more than one Chinese group.  \u003cbr /\u003e\u003cbr /\u003e Apart from expected friends (Andrey Lasarev, Artem Rahov and Sergei Rogulenko from Saratov; Slava Isenbaev, Roman Elizarov, Dmitriy Dgulgakov and others) I surprisingly met several people who also take part in ICPC: Ilya Mironov — Vice World Champion of 1998, a colleague from Google and well-known in narrow circles player in the «What?Where?When?».Alex Grusheckiy who sits in 10 meters away from me at work, also was among them. Of course, you can guess that the team from Vitalik Goldstein and Petit Mitrichev coincidentally is not gathering. \u003cbr /\u003e\u003cbr /\u003e \u003ccenter\u003e \u003cimg src\u003d\"//codeforces.com/predownloaded/9b/64/9b64add78327049b13c54d74c8d3027b24dfcc7e.png\n\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003csmall\u003e\u003cp\u003eAndrey Lasarev, Vladimir Yakunin, Alex Grusheckiy\u003c/p\u003e\u003c/small\u003e \u003c/center\u003e Doug Mohr and Bill Poucher were very friendly and went to everyone. \u003cbr /\u003e\u003cbr /\u003e Then we moved to the big room where a supper was for us. That is just what was wanted, because it is hard to find the supper in Facebook and Google on Fridays. Waiters kept persistently pour wine, from which it was clear that the performances was coming. \u003cbr /\u003e\u003cbr /\u003e The performances were prepared not as usual: a week before the event to attenders was offered to send their stories; organizers choose several of them and gave them a word.  \u003cbr /\u003e\u003cbr /\u003e The professor from Waterloo was there, his team won the Champion in 80s and started the tradition of the Olympiad movement: they gather participants from the imposing part of Canada, receive the best students who burn the desire to solve problems, and still win medals on the final of ICPC. But it was then that they were able to gain a recognition and a support from the university administration, and the professor is deservedly proud of himself, his students and the university. \u003cbr /\u003e\u003cbr /\u003e The finalist of the 80s made his presentation, asked to stop talking that we had not yet been born and told about the problem in the final that year. The problem was like that: numbers starting with one were filled into the table line by line from left to right. Then they were rearranged to fill in columns from top to bottom. We need to find to which place a certain number will move. «Haha!» — we thought. «Hehe», — he said. On that time there were no monitors, they make programs on something that is now hardly called a computer.  What kind of programming languages were there I don’t want to know.  \u003cbr /\u003e\u003cbr /\u003e All repeated that the pleasure of solving problems is the most important. Nobody thought that it was the way to career, recognition and something like that. Simply did what was interesting for them. This, of course, very resonated with my memories. Life of all speakers (and present) dramatically changed due to competition. For many years (and in especially interesting cases, decades) they spent almost all the time on problem solving, on training tasks, on help to others who want to solve problems. In terms of career, of course, it had an influence almost on all present (in fact, the place where the meeting took place, eloquent enough). In addition to the expected people from Europe, North America and China, there were people from Egypt, South America and India. All now live in San Francisco and Silicon Valley. \u003cbr /\u003e\u003cbr /\u003e Then awards for the contribution to community life were presented. The first went fine Bill, he hesitated and did not know what to say. But then it was his turn to present awards, and then he shone. Roman Elizarov was awarded for a great contribution to the development of NEERC; also several coaches, established a regional Olympiad school programming, including Roman Chadnova, received their awards.  \u003cbr /\u003e\u003cbr /\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/df/ba/dfba422879d7576e0fa9ecdf66494a2a42e5e1c7.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003csmall\u003e\u003cp\u003eRoman Chadnov and Bill Poucher\u003c/p\u003e\u003c/small\u003e \u003c/center\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/76/1f/761f4aef752b3efeb703e10f85a96feaec3089d9.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003csmall\u003e\u003cp\u003eSphere of Excellence Award. In Honor of Your Contributions to the ACM-ICPC\u003c/p\u003e\u003c/small\u003e \u003c/center\u003e Then Bill told about the ICPC work, their goals and principles. Perhaps the success in competitions for such a long time largely determined by the fact that their principles are primarily humanistic and universal, and only then focus on tasks. He always emphasizes that the strength of the competition in the region which is almost completely independent and operate with minimal support from the organizers of the finals. The task of the organizers the finals and regional coordinators is not to do events, tasks, translation and everything else, but the fact that on the one hand to give interested persons an opportunity to solve problems and to be succeed in this, and on the other hand to direct the spotlight of public attention and industry on these successes. I think Bill\u0027s team manage not to lose these important goals in a huge number of small and large details that stand in the way for them, and because of that ICPC becomes the central event of sports programming per year, and is increasingly being recognized outside the programming community. \u003cbr /\u003e\u003cbr /\u003e Already we discussed on the sidelines of the transition from one model to the sponsor (IBM) to many sponsors. On the one hand there are a lot of people who want to help a good cause, on the other hand it is difficult to negotiate, willing not to quarrel among themselves, it is necessary to seek a balance. \u003cbr /\u003e\u003cbr /\u003e We decided that we will meet in this format on a regular basis, at least once a year, and in the first cry of including powerful lobby in all the major IT-companies benefit aysipisishnikov them enough. \u003c/div\u003e\u003cp\u003eWho of you was at the meeting? What else can you tell?\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news"]}}