{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1503483489,"rating":222,"authorHandle":"ErdemKirez","modificationTimeSeconds":1503628991,"id":54007,"title":"\u003cp\u003eHow not to perform well on life(With how not to perform well on ICPC bonus)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eFirst of all, for a long time I wanted to write this blog but I keep delaying it and finally here I am. After seeing \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/matthew99\" title\u003d\"Международный гроссмейстер matthew99\"\u003ematthew99\u003c/a\u003e\u0027s blog I decided to my time has come. I really wanted to write like him but my English skills aren\u0027t enough to use \u0026quot;you would\u0026quot; dozens of times. So I will explain how I didn\u0027t perform well in my life, and if you do same things you will end up succeed at failing in your life.\u003c/p\u003e\u003cp\u003eAnd it\u0027s very important to say at this point, I\u0027m very bad at English, so if you\u0027re disgusted you can stop right there and I\u0027m truly sorry about it.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTLDR\u003c/strong\u003e : I am a loser.\u003c/p\u003e\u003cp\u003eI was a regular student before high school. I interested with math olympiads little bit but I didn\u0027t get even a national medal just a several contests. By the way I won a The New iPad. So I am passing that times and coming to high school.\u003c/p\u003e\u003cp\u003eIn our country national eliminations goes like that, paper based elimination at may, national OI at december, team selection contest at march/april. High school is 4 years so we have a 3 chances to participate(At least we did have).\u003c/p\u003e\u003cp\u003eIn first grade I didn\u0027t manage to pass first paper based elimination because I\u0027m a dumbass. In second grade a passed first elimination and at national OI I got 18th degree and got last of bronze. Results are \u003ca href\u003d\"https://www.dropbox.com/s/qcxpxpud5iwygkf/Photo%2019.02.2015%2018%2020%2045.jpg?dl\u003d0\"\u003ehere\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eOn second problem of first day, the setter was more dumbass than me and lot after the contest we learned that checker was wrong. The problem was simply \u0026quot;Print the connected subset of nodes in a tree such that multiplication of values at nodes is maximum as possible. There can be negative ones.\u0026quot; Greedy solutions failed, and dp solutions passed if it prints the lexicographically minimum one or something. Mine was greedy and I couldn\u0027t come up with an idea and spend all time on that stupid question. \u003c/p\u003e\u003cp\u003eOn second problem of second day, even though I love the setter I can\u0027t avoid from these words, he was a dumbass too. We never heard checker or input files are wrong but, for to get 30 points you just need to print the maximum of an array but 5 people couldn\u0027t get that subtask done.\u003c/p\u003e\u003cp\u003eI wasn\u0027t good and lucky so I simply failed. Everyone told me not to prepare for team selection contest because they\u0027re 17 people better than me at OI and I have to pass at least 14 of them. \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/enesoncu\" title\u003d\"Международный мастер enesoncu\"\u003eenesoncu\u003c/a\u003e and \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/eminayar\" title\u003d\"Кандидат в мастера eminayar\"\u003eeminayar\u003c/a\u003e was have a IOI medal and \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/ikbal\" title\u003d\"Мастер ikbal\"\u003eikbal\u003c/a\u003e was a god so I though I have no chance. But \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/muratt\" title\u003d\"Международный гроссмейстер muratt\"\u003emuratt\u003c/a\u003e intended to study for it and he was at a lower grade than me at my school and I can\u0027t except that he will be better than me :P We really supported each other and we had a great motivation(not beaten up by the other) so we really worked hard.\u003c/p\u003e\u003cp\u003eIf you really want you can find problems written in English by \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/ikbal\" title\u003d\"Мастер ikbal\"\u003eikbal\u003c/a\u003e \u003ca href\u003d\"//codeforces.com/blog/entry/17392\"\u003ehere\u003c/a\u003e and results \u003ca href\u003d\"https://www.dropbox.com/s/8cvmk7d3rq639gg/Photo%2012.04.2015%2020%2026%2019.jpg?dl\u003d0\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eSecond problem of first day was a really easy sparse table problem. I finished it very fast as solutions is very obvious and simple. But I couldn\u0027t manage the get accepted like 3 hours and I did even change my \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eN\u003c/i\u003e \u003d (\u003ci\u003eint\u003c/i\u003e)1\u003ci\u003ee\u003c/i\u003e5 + 5\u003c/span\u003e to \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eN\u003c/i\u003e \u003d 100005\u003c/span\u003e because I couldn\u0027t find any single bug. I got other points and return this problem and nothing changed till the contest ends. After the contest I heard a really sad story.\u003c/p\u003e\u003cp\u003eNumber of nodes is \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eN\u003c/i\u003e \u0026lt;  \u003d 10\u003csup class\u003d\"upper-index\"\u003e5\u003c/sup\u003e\u003c/span\u003e but number of queries can be \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eM\u003c/i\u003e \u003d 2 * \u003ci\u003eN\u003c/i\u003e\u003c/span\u003e at this problem. The setter was same person who creates \u0026quot;maximum multiplication of tree problem\u0026quot;. He wrote \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eN\u003c/i\u003e \u0026lt;  \u003d 10\u003csup class\u003d\"upper-index\"\u003e5\u003c/sup\u003e\u003c/span\u003e at constraints but I didn\u0027t think input size could be 2 times larger so couldn\u0027t manage to pass bigger subtask. It\u0027s an excuse and it was my fault but WHY WOULD ANYONE SPECIFY THE BOUND OF OUTPUT????? I can\u0027t even remember his name but still I can see him in my nightmares(There was a sentence like that on Game of Thrones so it was a sarcasm and I wanted to clarify it)\u003c/p\u003e\u003cp\u003eAnyway I got the 6th degree at first day I was happy because I did pass many people and I still have a chance. Second day I got 100 points from 3rd problem very fast and I was quite sure there won\u0027t be many 100 points so I started really believing I can go to IOI. 62 points from second problem was easy so after like 100 minutes I got 162 points.\u003c/p\u003e\u003cp\u003eHere\u0027s stupidity comes, after that I didn\u0027t go for first problem because it looks easy(or hard I really can\u0027t remember) and found a solution that includes mo\u0027s algorithm and trie for max xor at second problem and another stupid things(it was real solution anyway) but I didn\u0027t manage it to pass so I got like 30 minutes left at the very last of contest. \u003c/p\u003e\u003cp\u003e30 minutes and there was a problem I didn\u0027t even think about it. After reading problem a realized it\u0027s really easy to got 36 points and started coding for it. My solution was slow but here\u0027s the funny part. I didn\u0027t get TLE but got WA instead. I couldn\u0027t fix it and end up with 23 points.\u003c/p\u003e\u003cp\u003eTwo more funny parts, the intended solution uses KD-tree but \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eN\u003c/i\u003e \u0026lt;  \u003d 25000\u003c/span\u003e because of high constants and time limit was 5 seconds so \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eO\u003c/i\u003e(\u003ci\u003eN\u003c/i\u003e\u003csup class\u003d\"upper-index\"\u003e2\u003c/sup\u003e)\u003c/span\u003e solutions did pass. Many hours after the contest I heard from a friend of mine, our rabbit can\u0027t jump in 4 directions, it can jump to right and up only. BTW the solution is same except two if\u0027s. \u003c/p\u003e\u003cp\u003eSo even tough I did very well at contest(compared to myself), because of -50 in first day and -77 in second day I got 5th degree having a 2 points difference from 4th guy. Coaches tried to decide which one of us should get in team but after that they decided it was unfair to choose 5th guy even tough there\u0027s a really small difference, and they were right.\u003c/p\u003e\u003cp\u003eIn our country if anyone gets a medal at internationals he/she will have a right to go any university in our country. If anyone couldn\u0027t get to team at 3rd grade they usually stop doing olympiads because they need to study for university. I was loving doing it so I couldn\u0027t let it go and I thought I still can get IOI medal next year and don\u0027t struggle with university exams shits.\u003c/p\u003e\u003cp\u003eAt national OI I got 3rd degree, I couldn\u0027t manage to solve matrices and fibonacci problem but I was happy at my results. I didn\u0027t stop studying for anytime. Before team selection contest I was wanting get a good score on first day and feel comfortable at second day. At first day I got 300 points and I got really happy at contests.\u003c/p\u003e\u003cp\u003eAfter first day I learned they were 9 PEOPLE WITH 300 POINTS. Okay, it was easy but, WHAAAT? I got really angry because setters didn\u0027t manage any shits. At second day they write 4 hard problems.\u003c/p\u003e\u003cp\u003eAs a spoiler I solved 3 of them and got 1st degree and solving 1 was enough to get into team. I solved one of them like 2 hours. After that I got accepted with brute force at one of the problems. Then I solved another one and there was like an 1 our left. After that they changed input data for \u0026quot;brute forced problem\u0026quot; and I got -80 at contest. I was really having a negative points at contest and I went to toilet and start punching walls because my life was depend on it and I have no choice other than IOI medal and I couldn\u0027t stand the chance of it. \u003c/p\u003e\u003cp\u003eI realised I need to calm down and managed it don\u0027t remember how. Changing inputs at the contest(at even 1 hours left) was really dishonest behavior. Okay my solution is wrong but I waited like 2 hours and they didn\u0027t announce anything, I stopped thinking about real solution and start dealing with 4rd problem that I have no clue. Because of that it wasn\u0027t fair I got really angry. Anyway somehow I found the real solution in a few minutes and coded it like 40 minute and got accepted. \u003c/p\u003e\u003cp\u003eAfter I got 100 points, I send a clarification request which contains the following message \u0026quot;You don\u0027t need to try to blow up my solutions, it\u0027s the intended one now\u0026quot;. It was a foolish thing to do but I couldn\u0027t stop myself.\u003c/p\u003e\u003cp\u003eI was studying at my top performance till the IOI. Than the real shit has come, which isn\u0027t none of my fault this time. Coup d\u0027état attempt happened in our country and they decide not to participate in international olympiads even tough there wasn\u0027t any single shit got wrong. It was my whole life and I did have nothing to do. It\u0027s just sad and if you don\u0027t live in garbage country you should be happy about it sometimes :(\u003c/p\u003e\u003cp\u003eTOBB University gives scholarship to students who haves a national medals. So it was my only chance and I got in there. \u003c/p\u003e\u003cp\u003eWe participate at ACM-ICPC SEERC and got 6th degree. My teammates was very bad and I\u0027m not hesitating saying it because they know it too and there isn\u0027t a chance that they see here :P Our score was good enough I think when we consider I\u0027m the only one who write codes and deal with solutions. Anyway I got very sad after contest because we finished one problem 1 minute after contest(I submitted that code on Codeforces gym and it got accepted). After some weeks we learned that we are invited to World Finals. It was really shocking because something went good at my life for the first time. Anyway my team was useless and they didn\u0027t get visas even though they applied for 2 times. \u003c/p\u003e\u003cp\u003eI went finals with my coach. It was great to participating in it. I was the only Turkish person coming there. I was proud of myself. Anyway I always wanted to have a medal at World Finals even tough I didn\u0027t see anyone even participate at it. I wasn\u0027t that good for it and I didn\u0027t even have a team so there isn\u0027t a single chance for me. \u003c/p\u003e\u003cp\u003eThey were 3 really easy problems and I finished them in 34 minutes as I remember. I got 12th degree as I remember. It was quite fast for my level and I got very motivated. I looked problem D and in a few minutes I thought it can be solved with divide and conquer optimization. Here\u0027s my stupitidy starts again. I didn\u0027t prove it but I was quite sure it will pass but instead coded TERNARY SEARCH. I don\u0027t have any idea why such thing happened :( Of course id didn\u0027t pass but even that time I didn\u0027t try D\u0026amp;C optimization. My performance isn\u0027t that bad still and I found the solution for problem A and started coding it. It was a geometry problem so I have bugs and got some WAs but it didn\u0027t stop. I couldn\u0027t manage the get AC. I thought I need a break and try to go for problem C. Solution was obvious but I thought flow was too hard for a problem that most of teams had solve. You idiot, it\u0027s WORLD FINALS, YOU ARE NO TOURIST, AND YOU ARE ALONE, AND IT\u0027S JUST A FLOW. \u003c/p\u003e\u003cp\u003eHow can anyone think such stupid thing? I really don\u0027t know and I hate myself most of times. After that I returned D and completed it in like 2 minutes.(Even that point I didn\u0027t code D\u0026amp;C but instead expand the limit of ternary search like while(r-l\u0026gt;1000) and it got accepted) In other minutes I didn\u0027t get anything done. After the contest so many people congratulate me even tough I messed up so bad. They don\u0027t know who I am, don\u0027t have to care about me, don\u0027t need to do kindness to me but even that case they treated me like a family. Volunteers, coaches, participants I\u0027m really grateful to know people like you in my life.\u003c/p\u003e\u003cp\u003eAt the ceremony Dr. Poucher announced a university and a guy and said that he was alone and we need to applause him. For the ones that was there, that guy was me. Supporting is the best feeling on earth and there\u0027re so few times a felt it. I wanted to thanks to anyone who care about me even tough for a second.\u003c/p\u003e\u003cp\u003eSo that was my story. Moral of the story is don\u0027t be stupid and read problems at contest. BTW, I realized I forgot to mention, I did read geometry problem wrong on finals. I thought it says we connect two vertices but it said we connect any two points. Solution isn\u0027t much different just add a small case but I couldn\u0027t do it because I realized my wrong a lot after contests. \u003c/p\u003e\u003cp\u003eIn a short time period I\u0027m planning to write another long blog but if you hated this so much please let me know so I won\u0027t disturb you again in that case :)\u003c/p\u003e\u003cp\u003eHave a wonderful life.\u003c/p\u003e\u003c/div\u003e","tags":["#acmicpc2017","ioi"]}}