{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1523656811,"rating":55,"authorHandle":"misis","modificationTimeSeconds":1523702250,"id":58917,"title":"\u003cp\u003eГотовь кадры смолоду, или ACM MISIS for SCHOOL\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eС Вами снова команда тренеров \u003cstrong\u003eACM MISIS\u003c/strong\u003e. На этот раз наш пост ориентирован на тех, кто только пытается сделать первые шаги в занятиях олимпиадным программированием и… собственно, не знает, куда идти. Совсем скоро мы запускаем \u003cstrong\u003eонлайн-курс для школьников по основам олимпиадного программирования\u003c/strong\u003e. На самом деле, поучаствовать в вводном контесте можно уже \u003ca href\u003d\"https://school.misis.ru/auth/register?groupKey\u003d3a3c3d462832459cdd30898f776bf1bbba917c8977998dae389acb822730f711dd5456d27733781440a6155f8ba0f2bb\"\u003eсейчас\u003c/a\u003e, но обо всем по порядку. \u003c/p\u003e\u003cp\u003eПодготовленный курс предназначен для тех, кто хотел бы впервые попробовать свои силы в олимпиадном программировании или уже пытался заниматься самостоятельно, но понял, что не знает, куда смотреть. Наверное, многим тут это покажется странным, ведь “в начале всё просто”. Знаете, когда-то сдавая первую задачу на acmp.ru, я понятия не имела про считывания из файла и крайне рада, что рядом нашлись люди, которые сказали: “Смотри, вот эти магические строчки тебя спасут” \u003d) Итак, хватит лирики, теперь по делу.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/b3/45/b345d9025881375827acad40975d2deaf349a4dd.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eДля кого и о чем курс:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eДля школьников 7-11 классов, которые хотят попробовать себя в спортивном программировании или уже участвовали в начальных этапах олимпиад (школьном, районном). На самом деле, даже изначальное знание какого-либо языка программирования необязательно. Мы будем рассматривать С++ и начнем с самых азов. Курс включает в себя теоретическую информацию по нескольким темам, начиная с установки среды разработки, и контесты. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eСколько длится и когда начинается:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eПродолжительность курса — 2 месяца. На данный момент активен вводный контест. Полноценно курс начнется ориентировочно 23 апреля, когда соберется группа.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eКурс будет проходить в следующем формате:\u003c/strong\u003e \u003c/p\u003e\u003cp\u003eНа специальной платформе \u003ca href\u003d\"https://school.misis.ru\"\u003eschool.misis.ru\u003c/a\u003e каждую неделю будет проходить новый контест, и длится он будет всю неделю. То есть, начало контеста — в 12:00 понедельника (по Москве), завершение — в 23:59 воскресенья. Единственным исключением является вводный контест, который уже активен и продлится до 23 апреля. К каждому контесту будут выкладываться конспекты, с разобранной текущей темой. Также в системе есть возможность чата с тренерами. Мы постараемся как можно оперативнее отвечать на все вопросы (но мы тоже люди, так что, если будете писать глубокой ночью, ответить сможем не сразу). После завершения контеста выкладывается разбор всех задач, и в дальнейшем их можно сдавать в режиме дорешивания. Для регистрации в системе необходимо зарегистрироваться \u003ca href\u003d\"https://school.misis.ru/auth/register?groupKey\u003d3a3c3d462832459cdd30898f776bf1bbba917c8977998dae389acb822730f711dd5456d27733781440a6155f8ba0f2bb\"\u003eпо ссылке\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eВсе успешно прошедшие курс участники получат электронные сертификаты, а, главное, новые знания и понимание, куда двигаться дальше.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eСледите за новостями на \u003ca href\u003d\"http://acm.misis.ru/school-misis/\"\u003eофициальной странице курса\u003c/a\u003e,\u003c/strong\u003e\u003cbr /\u003e\u003cstrong\u003eа также в нашей \u003ca href\u003d\"https://vk.com/acmmisis\"\u003eгруппе в ВК\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}