{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1491324154,"rating":85,"authorHandle":"P_Nyagolov","modificationTimeSeconds":1491326889,"id":51426,"title":"\u003cp\u003eWould it be cheating?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003eSo two days ago, a friend of mine told me that \u003ca href\u003d\"http://www.spoj.com/problems/MAXCHILDSUM/\"\u003eone of my problems on SPOJ\u003c/a\u003e has been used as \u003ca href\u003d\"http://www.bubblecup.org/Problems/MaxChildSum\"\u003ea problem for Bubble Cup\u003c/a\u003e. And \u003cstrong\u003eby coincidence\u003c/strong\u003e I have just had this conversation:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/38/09/3809897dbc8a7b00a14c7fa292ad30becb80ce2b.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e.\u003c/p\u003e\u003cp\u003eWe can\u0027t be sure if it really is coincidence or attempt of gaining points in Bubble Cup in a nasty way but something made me think that the latter could with high probability be the case.\u003c/p\u003e\u003cp\u003eAs you see, I didn\u0027t agree to give him my code but what if I did? Would it be cheating? I should mention that \u003cstrong\u003eI didn\u0027t agree in anyway to get my problem used in Bubble cup, nor was I informed by someone from their team\u003c/strong\u003e. I also made sure that the \u0026quot;Available for use in 3rd party contests\u0026quot; isn\u0027t checked on my problem panel in SPOJ:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/52/27/522767ac4a386e11dbc9f4c2b61fa97d9126e211.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eI don\u0027t know if they have the rights of using my problem but surely I still have rights on my own problem. And as far as I know, it isn\u0027t a problem to discuss a problem from SPOJ, given that this is the only place I have agreed for my problem to be present.\u003c/p\u003e\u003cp\u003e\u003cstrike\u003ePS: I will also appreciate if someone tells me if they have the right to use my problem in their contest? I don\u0027t know much about these things but it looks nasty to me.\u003c/strike\u003e As Xellos pointed out, SPOJ is mentioned as a problem source (something I didn\u0027t see) so you can ignore this PS :)\u003c/p\u003e\u003c/div\u003e","tags":["cheating","doubt","copyright"]}}