{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1526029229,"rating":41,"authorHandle":"savinova","modificationTimeSeconds":1526032293,"id":59393,"title":"\u003cp\u003eОтчет о деятельности Botan Investments за апрель. Слухи и новости финала ACM ICPC 2018\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003eВ апреле в грантовой программе фонда Виктора Шабурова \u003cstrong\u003eBotan Investments\u003c/strong\u003e для преподавателей приняли участие 19 вузов. Больше всего участников удалось привлечь в ТИУ (Тюмень) и СибГУТИ (Новосибирск) — более двадцати человек. Больше всего тренировок провели в ТПУ (Томск) и КФУ (Казань). Также Botan Investments выступил спонсором летних смен лагеря \u003ca href\u003d\"http://www.formulo.org/ru/\"\u003e“Формула Единства”\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eВ начале мая мы подвели итоги \u003ca href\u003d\"//codeforces.com/blog/entry/56343\"\u003eгрантовой программы в области машинного обучения\u003c/a\u003e и выбрали три вуза, которым предложили на выбор задачу и инвестиции на летние месяцы. Программа продолжает функционировать, и мы ожидаем, что к осени остальные участники тоже добьются хороших результатов. Новый набор участников будет открыт в сентябре. \u003c/p\u003e\u003cp\u003eВ нашей группе ВК можно найти два новых поста от Михаила \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik.ru\" title\u003d\"Мастер MikhailRubinchik.ru\"\u003eMikhailRubinchik.ru\u003c/a\u003e Рубинчика, посвященных \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_326\"\u003eработе со школьниками и олимпиадной информатике\u003c/a\u003e и \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_330\"\u003eправилам прокачки при подготовке к олимпиадам\u003c/a\u003e. Сегодня Михаил подготовил рассказ о новостях и слухах финала ACM ICPC 2018. \u003cbr /\u003e\u003cbr /\u003e \u003c/p\u003e\u003ccenter\u003e \u003cdiv style\u003d\"width: 100.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/b9/9f/b99f1becdb37073edf29e00dc5e27fd594f47bc2.jpg\" style\u003d\"width: 95.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e \u003c/center\u003e \u003cbr /\u003e \u003chr /\u003e Недавно я вернулся с чемпионата мира по программированию, где успел пообщаться с его организаторами, а также с директорами региональных соревнований. В этом посте я хочу поделиться новостями, проблемами и своими мыслями обо всех уровнях чемпионата: от финала до квалификационных туров. \u003cbr /\u003e \u003col\u003e \u003cbr /\u003e \u003cb\u003eНовости финала\u003c/b\u003e \u003cbr /\u003e\u003cbr /\u003e \u003cli\u003eВ этом году на церемонии закрытия не только директор прошедшего чемпионата не пожал руку директору следующего (такое бывает), но и впервые не объявили, где пройдет финал в будущем году. Видимо, не успели выбрать город или заключить договор с новым организатором. \u003cbr /\u003e\u003cbr /\u003e Заявки на проведение последующих финалов пришли из шести городов: Порто (Португалия), Дакка (Бангладеш), Гавана (Куба), Сидней (Австралия), Москва и Новосибирск. \u003cbr /\u003e\u003cbr /\u003e Судя по качеству роликов, самые высокие шансы у Сиднея и Порто. Дальше Новосибирск. \u003c/li\u003e \u003cbr /\u003e \u003cli\u003eЛично мне очень жаль, что не было заявки от Казани (надеюсь, временно). В прошлом году они заявлялись, а в этом году не появились. Вообще, я считаю, что для представленности Северной Евразии (и в частности России) важно, чтобы все города России, которые способны провести финал, провели его :) Например, Красноярск, Владивосток, Хабаровск, Нижний Новгород точно могли бы это сделать. \u003cbr /\u003e\u003cbr /\u003e Я знаю, что некоторые участники нашей тусовки, включая тренеров, считают, что не нужно проводить финалы в России, потому что интереснее съездить в другие страны. Но я считаю, что каждый российский финал — это вклад в развитие нашего суперрегиона, он работает на узнавание бренда и показывает, что в России есть не только Москва и Питер. И ничего страшного, что несколько тренеров и команд увидят на одну страну меньше. Смогут себе позволить съездить и так :)\u003c/li\u003e \u003cbr /\u003e \u003cb\u003eНовости о суперрегионах\u003c/b\u003e \u003cbr /\u003e\u003cbr /\u003e \u003cli\u003eНа прошлом финале организаторы сообщили, что число команд растёт, а вместимость финала нет, поэтому должно стать много финалов континентов, чтобы больше людей почувствовали этот праздник :) Наш финал в северной Евразии (ранее NEERC) Билл Паучер (директор ЧМ) приводит как образец, хотя он пока не проходит на одной площадке. О том, почему это неправильно, я писал в \u003ca href\u003d\"//codeforces.com/blog/entry/55617\"\u003eэтом посте\u003c/a\u003e. \u003cbr /\u003e\u003cbr /\u003e В Южной Америке теперь такая же ситуация, как у нас. Организаторы говорят, что они сделали общий контест, но пока на нескольких площадках. И как только у них появятся деньги, они приведут его в вид, который нужен организаторам финала (перенесут на одну площадку). \u003cbr /\u003e\u003cbr /\u003e Европа “шантажирует” руководителей финала тем, что начнет проводить чемпионат своего суперрегиона сразу после того, как получит право провести чемпионат мира в Португалии в Порто. \u003cbr /\u003e\u003cbr /\u003e Северная Америка жалуется, что нет спонсоров, чтобы провести свой финал. Но они уже несколько лет проводят онлайн-контест для всех (не отборочный). На мой взгляд, им (как и остальным) просто лень искать этих спонсоров :)\u003cbr /\u003e\u003cbr /\u003e Директор трех суперрегионов (не спрашивайте, почему сразу трёх :) ) в Азии говорит, что у них все сложно и они будут проводить чемпионаты, только когда все остальные это сделают. \u003cbr /\u003e\u003cbr /\u003e В итоге Билл год назад сообщил о переходе на новый формат, Европа, Южная Америка и Северная Америка уже думают и обсуждают этапы перехода, а у нас, несмотря на то, что изначально мы были ближе всех, ничего не меняется и даже не обсуждается. Того и гляди чемпионат Европы появится раньше, чем чемпионат Северной Евразии :)\u003c/li\u003e \u003cbr /\u003e \u003cli\u003eЕсть еще одно событие, которое широко обсуждали в кулуарах чемпионата. Я хочу рассказать о нем открыто, чтобы избежать неправильных трактовок и слухов. В суперрегионе Северная Евразия есть три страны из Евросоюза: Эстония, Латвия и Литва. В этом году два эстонских вуза подали заявку на переход из чемпионата Северной Евразии в Европу, а организаторы рассказали об их намерении публично. Пока дальнейшая судьба ситуации неизвестна. Из проблем назывались: языковой барьер (наш суперрегион проходит на русском языке, а в Прибалтике уже не так много молодёжи знает русский), необходимость получать визы для поездки на четвертьфинал в Беларусь и на полуфинал в Питер.\u003cbr /\u003e\u003cbr /\u003e Понятно, что мы заинтересованы в том, чтобы они остались, поэтому обсуждались изменения, которые могут упростить их ситуацию, например, создание доп.площадки в одной из этих стран на западном четвертьфинале (сейчас там только в Минске площадка).\u003c/li\u003e \u003cbr /\u003e \u003cb\u003eНовости четвертьфиналов\u003c/b\u003e \u003cbr /\u003e\u003cbr /\u003e \u003cli\u003eСущественная реформа нашего суперрегиона — появление квалификационных отборов на четвертьфиналы. В этом году они прошли в пяти из шестнадцати четвертьфинальных регионов: Уральском, Восточно-сибирском, Дальневосточном, Южном и Московском. \u003cbr /\u003e\u003cbr /\u003e При общении между директорами четвертьфиналов выяснилось, что в следующем году кволы планируют запустить в Западно-Сибирском (Новосибирск), Центральном (Ярославль, раньше был Рыбинск), Киргизском и Казахском регионах. Беларусь, Армения и Санкт-Петербург пока не планируют проводить, а про планы еще четырех регионов мне ничего не известно (это Узбекистан, Азербайджан, Грузия и Крым). Все это говорит о том, что в ближайший год численность участников нашего суперрегиона продолжит расти. \u003c/li\u003e \u003c/ol\u003e\u003c/div\u003e","tags":["botan investments","виктор шабуров"]}}