{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1485547003,"rating":90,"authorHandle":"Wellwisher","modificationTimeSeconds":1485560251,"id":50058,"title":"\u003cp\u003eНесколько причин НЕ использовать Polygon для подготовки задач\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003e1. Инвокеры.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eВ Полигоне используются общие, глобальные для всех инвокеры. Это приводит к множеству неудобств. Допустим, кто-то, кто еще не очень хорошо знаком с Полигоном, запустил \u003cem\u003epreview tests\u003c/em\u003e, а скрипт написан неправильно и делает не совсем то, что хочет автор задачи — например, генератор тестов каждый раз записывает информацию о всех тестах в файлы, а затем вызывается несколько раз в скрипте:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eTestGenerator \u0026gt; 01\nTestGenerator \u0026gt; 02\n...\nTestGenerator \u0026gt; 42\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eВ результате генератор будет вызван \u003ccode\u003e42\u003c/code\u003e раза, все инвокеры будут заняты на долгое время, и никто другой не сможет ничего сделать, даже простейшие действия вида \u0026quot;изменить файл\u0026quot;, не говоря уже о \u0026quot;пересобрать пакет задачи\u0026quot;.\u003c/p\u003e\u003cp\u003eКто виноват? Конечно, отчасти пользователь, который это все устроил. Но Полигон — открытая система, зарегистрироваться там может любой, а следовательно никто от этого не застрахован.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e2. Информативные ошибки\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eДля чего угодно, написанного не на C++, Полигон вполне может выдать \u0026quot;очень информативные\u0026quot; ошибки, например:\u003c/p\u003e\u003cp\u003e\u003ccode\u003e[ERROR] Unexpected error has been found: Unexpected verdict CRASHED, comment\u003dGenerator %generator_name% returns exit code 11\u003c/code\u003e\u003c/p\u003e\u003cp\u003eЧто произошло, что не так? Что такое \u003ccode\u003eexit code 11\u003c/code\u003e? Конечно, человек, который это уже когда-то видел и разбирался с этим в прошлый раз, возможно догадается, что дело в том, что его генератор тестов создает что-то в системе, что не нужно — например, папки. Однако понять это человеку, который видит такую ошибку впервые, согласитесь, невозможно.\u003c/p\u003e\u003cp\u003eИли же например, если вы переименовали задачу, но забыли переименовать файлы, из которых читают инпут ваши решения, получайте:\u003c/p\u003e\u003cp\u003e\u003ccode\u003eCan\u0027t create statement: Unexpected verdict RUNTIME_ERROR: Exit code is 3\u003c/code\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e3. Только онлайн-действия\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eДопустим, я нахожусь в локальной сети без интернета, но нужно провести контест, или же более жизненная ситуация — Полигон упал/нет свободных инвокеров (см. выше). А мне нужно пересобрать пакеты всех задач, где они не последней версии, и выкачать их. Что же делать? Ничего. Ждать, переносить контест, что угодно, эту проблему никак не решить.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e4. Неудобный UI для задач с групповыми оценками\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eЧтобы поставить у нескольких тестов определенную группу, нужно поставить на них всех галочки, а потом написать, что у них будет группа %group_name%. Казалось бы, почему не добавить функциональность выставления групп сразу в скрипт, зачем столько ручной работы? Непонятно. Также очень весело после добавленного в середину теста менять подгруппы у \u003ccode\u003eO(groups_count)\u003c/code\u003e тестов, потому что все съехало.\u003c/p\u003e\u003cp\u003e\u003cem\u003eТакже на многие действия (это уже относится не к задачам с групповыми оценками, а в целом) Полигон обновляет страницу, и это безумно раздражает. Нажал не ту кнопку — пока, несохраненные изменения.\u003c/em\u003e\u003cbr /\u003e \u003cb\u003eUPD.\u003c/b\u003e Эта претензия была неправильной, с помощью кнопки \u0026quot;Drafts\u0026quot; таких инцидентов можно избежать или почти избежать.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e5. Конфликты\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eВсе. Очень. Плохо.\u003c/p\u003e\u003cp\u003eДопустим, вы изменили файл в Полигоне, но за это время его кто-то тоже уже поменял и сделал коммит. Что предлагает сделать Полигон? Скачать working copy себе локально, потом сделать discard всех твоих только что сделанных изменений на сервере, после этого сделать их заново, взяв из скачанной working copy (предполагается, что ты помнишь, что ты только что поменял, и сейчас сможешь заново это сделать в уже измененной рабочей версии). При конфликте нельзя даже зайти в свою рабочую версию и посмотреть, что ты там наисправлял — ты должен это помнить сам.\u003c/p\u003e\u003cp\u003eMerge conflicts? Нет, не слышали, отменять изменения и добавлять их заново намного удобнее.\u003c/p\u003e\u003ch2\u003eСоветы разработчикам, которые все равно никто не прочитает\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003e1. Зачем столько email-ов?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eСейчас по умолчанию при коммите не стоит флаг \u0026quot;не отсылать email-оповещение\u0026quot;, соответственно почти все его и не ставят. В результате на почту приходит over9000 оповещений о том, что кто-то там закоммитил что-то там в какую-то задачу. При подготовке многих, особенно больших соревнований, часто применяется техника \u0026quot;расшарить все задачи всем\u0026quot;, поэтому количество оповещений получается ну очень большим и, собственно, смысл этих оповещений теряется, потому что найти что-то важное уже невозможно.\u003c/p\u003e\u003cp\u003eПочему бы не поставить флаг по умолчанию на \u0026quot;не отсылать\u0026quot; или хотя бы дать возможность отписаться от этих надоедливых оповещений?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e2. Консольный клиент\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eДалеко не rocket science идея, которая могла бы спасти 99% недовольств пользователей. Вот есть же git. Веб-версия позволяет делать что-то по-быстрому, не открывая ноутбук/компьютер, возможно даже с телефона. Консольная же версия позволяет делать всю остальную работу. И даже без интернета! Закоммитил в метро/поезде/подвале/самолете, а потом запушил на сервер, когда появился интернет. Вот оно! Вот оно решение всех проблем!\u003c/p\u003e\u003cp\u003eСейчас есть несколько консольных клиентов, написанных обычными пользователями Полигона и позволяющие делать некоторые из вещей локально в консоли. Но авторы этих клиентов были мотивированы написать его для своих целей, поэтому многих фич там нет и возможно нет того, что могут реализовать только разработчики Полигона.\u003c/p\u003e\u003cp\u003eОчнитесь! Консольный клиент очень нужен, с ним стало бы жить намного проще. Реализуйте его уже наконец, ну пожалуйста!\u003c/p\u003e\u003ch2\u003eВыводы\u003c/h2\u003e\u003cp\u003eСпорить не буду, у Полигона есть довольно много плюсов, он развивается, допиливается и т.п.\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003ccode\u003e\u0026lt;sarkasm\u0026gt;\u003c/code\u003eНапример, это очень хороший pdf-maker — не надо устанавливать себе latex, если хочешь просто собрать tex-овский файл\u003ccode\u003e\u0026lt;/sarkasm\u0026gt;\u003c/code\u003e;\u003c/li\u003e   \u003cli\u003eТесты к чекерам и валидаторам, автоматическая проверка чекеров на адекватность — очень хорошая идея, это большой плюс Полигона;\u003c/li\u003e   \u003cli\u003eЗапуск сразу нескольких решений в одном invocation-е, то есть параллелизация процесса тестирования — тоже круто;\u003c/li\u003e   \u003cli\u003eПолигон кроссплатформенный, позволяет скачивать пакеты к задачам для разных операционных систем;\u003c/li\u003e   \u003cli\u003eУ Полигона есть API.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eОднако, минусов тоже хватает. И если Полигон так пытаются пропихнуть в массы, доказать, что он лучше всех, доказать, что именно им надо пользоваться для подготовки задач — нужно соответствовать статусу. \u003c/p\u003e\u003cp\u003eЛично мне пока что в большинстве случаев приятнее все сделать и подготовить локально. Пусть я потрачу больше времени на тестирование, пусть я буду вбивать тесты к чекерам руками, но зато я не буду бомбить каждый раз, когда что-то отваливается, когда у меня нет инвокеров, когда я не понимаю, что за ошибка вылетает. Конечно, это все субъективно и дело привычки, но сейчас как никогда захотелось собрать это все и высказаться. У меня все.\u003c/p\u003e\u003c/div\u003e","tags":["полигон","все","очень","плохо"]}}