{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1525079586,"rating":140,"authorHandle":"jonathanirvings","modificationTimeSeconds":1527558298,"id":59182,"title":"\u003cp\u003eInvitation to TOKI Open 2018\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello!\u003c/p\u003e\u003cp\u003eAfter we successfully organized \u003ca href\u003d\"//codeforces.com/blog/entry/12286\"\u003eTOKI Open 2014\u003c/a\u003e and \u003ca href\u003d\"//codeforces.com/blog/entry/51512\"\u003eTOKI Open 2017\u003c/a\u003e, we are going to do the similar thing this year. We will open our current IOI Selection Contest to international participants. We call it \u003cstrong\u003eTOKI Open 2018\u003c/strong\u003e. TOKI stands for Tim Olimpiade Komputer Indonesia, or Indonesian Computing Olympiad Team in English.\u003c/p\u003e\u003cp\u003eObjectives of us opening this contest include, but not limited to:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eMeasure the performance of our IOI trainee compared to other countries\u0027 IOI trainee.\u003c/li\u003e   \u003cli\u003eFoster friendship between Indonesia and other IOI participating countries.\u003c/li\u003e   \u003cli\u003eTest Indonesia\u0027s scientific committee capability in setting IOI-level problems.\u003c/li\u003e   \u003cli\u003eTest Indonesia\u0027s technical committee capability in hosting IOI-level contests.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe contest will have very similar format with IOI, as this contest will be used to select our Top 4 and train our Top 4 for IOI. We expect that the difficulty of the contest is almost the same as IOI. Therefore, this contest is suitable for those who are preparing for IOI. The problems will be available in both Bahasa Indonesia and English. \u003c/p\u003e\u003cp\u003eThe rules of TOKI Open 2018 are\u003c/p\u003e \u003cul\u003e   \u003cli\u003eThere will be 3 IOI-style problems for each competition day.\u003c/li\u003e   \u003cli\u003eYou can only submit at most 50 submissions for a problem.\u003c/li\u003e   \u003cli\u003eYou will get full feedback for each submission.\u003c/li\u003e   \u003cli\u003eFor each problem, there are several subtasks:\u003c/li\u003e   \u003cli\u003eFor each subtask, there are points assigned to it.\u003c/li\u003e   \u003cli\u003eEach subtask contains several test cases.\u003c/li\u003e   \u003cli\u003eYou get the points from that subtask if the program passes all the test cases in that subtask.\u003c/li\u003e   \u003cli\u003eThe score of a submission is the sum of all the points that you get from completing subtasks.\u003c/li\u003e   \u003cli\u003eThe final score for a problem is the maximum of all the submission scores for that problem.\u003c/li\u003e   \u003cli\u003eUnfortunately only C++11 is supported. We will use g++ (Ubuntu 4.8.2-19ubuntu1) 4.8.2 (flags: -std\u003dc++11 -O2 -lm) compiler\u003c/li\u003e   \u003cli\u003eYou will only need to implement several functions described in problem statement (i.e. no I/O is needed)\u003c/li\u003e   \u003cli\u003eYou can submit clarification requests in either Bahasa Indonesia or English.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe contest will be conducted on \u003ca href\u003d\"https://competition.ia-toki.org/contests\"\u003eTLX Online Judge\u003c/a\u003e. You may need to register for a TLX Account if you do not have one. If you have a TLX account, you can login and go to the contest link to register for the contest. There will be two competition days, each having three problems. Each competition day will have two open windows containing the same problemset, so you can participate in either one of the window depending your time preference.\u003c/p\u003e\u003cp\u003eDay 1: Saturday, 26 May 2018\u003c/p\u003e \u003cul\u003e   \u003cli\u003eWindow 1: \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dTOKI+Open+2018+Day+1+Window+1\u0026amp;iso\u003d20180526T0130\u0026amp;ah\u003d5\"\u003e1.30AM — 6.30AM UTC\u003c/a\u003e (8.30AM — 1.30PM Western Indonesian Time). \u003ca href\u003d\"https://competition.ia-toki.org/contests/270\"\u003eContest Link\u003c/a\u003e.\u003c/li\u003e   \u003cli\u003eWindow 2: \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dTOKI+Open+2018+Day+1+Window+2\u0026amp;iso\u003d20180526T12\u0026amp;ah\u003d5\"\u003e12.00PM — 5.00PM UTC\u003c/a\u003e (7.00PM — 12.00AM Western Indonesian Time). \u003ca href\u003d\"https://competition.ia-toki.org/contests/271\"\u003eContest Link\u003c/a\u003e.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eDay 2: Monday, 28 May 2018\u003c/p\u003e \u003cul\u003e   \u003cli\u003eWindow 1: \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dTOKI+Open+2018+Day+2+Window+1\u0026amp;iso\u003d20180528T0130\u0026amp;p1\u003d%3A\u0026amp;ah\u003d5\"\u003e1.30AM — 6.30AM UTC\u003c/a\u003e (8.30AM — 1.30PM Western Indonesian Time). \u003ca href\u003d\"https://competition.ia-toki.org/contests/272\"\u003eContest Link\u003c/a\u003e.\u003c/li\u003e   \u003cli\u003eWindow 2: \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dTOKI+Open+2018+Day+2+Window+2\u0026amp;iso\u003d20180528T12\u0026amp;p1\u003d%3A\u0026amp;ah\u003d5\"\u003e12.00PM — 5.00PM UTC\u003c/a\u003e (7.00PM — 12.00AM Western Indonesian Time). \u003ca href\u003d\"https://competition.ia-toki.org/contests/273\"\u003eContest Link\u003c/a\u003e.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eA practice contest to get familiarised with TLX and the problem format is available \u003ca href\u003d\"https://competition.ia-toki.org/contests/269\"\u003ehere\u003c/a\u003e. The problems of TOKI Open 2017 are available for upsolving in the \u003ca href\u003d\"https://training.ia-toki.org/problemsets/87/problems\"\u003eproblem archive portal\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eIMPORTANT:\u003c/strong\u003e You are not allowed to \u003cstrong\u003eregister\u003c/strong\u003e on both windows for the same competition day, since they will have the same problemset. If you have registered on a wrong window, you can go to the contest link to unregister.\u003c/p\u003e\u003cp\u003eWe invite everyone (especially eligible IOI participants) to participate in this contest. See you at the leaderboard.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD1:\u003c/strong\u003e The day of the second competition day is finalized. It will be on 28 May 2018.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2:\u003c/strong\u003e The preliminary result of TOKI Open Day 1 is available \u003ca href\u003d\"https://docs.google.com/spreadsheets/d/14QKqGf2bMj8CFu3dFMMkr2uxQw-ddCkcrILQpSuSUD8/edit?usp\u003dsharing\"\u003ehere\u003c/a\u003e. For those who registered in both windows, we only consider the score for the first window (including even if you did not make any submission in the first window).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD3\u003c/strong\u003e: The post-contest blog post (includes problems repository, full result, etc.) is available \u003ca href\u003d\"//codeforces.com/blog/entry/59727\"\u003ehere\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}