{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1428597574,"rating":54,"authorHandle":"cgy4ever","modificationTimeSeconds":1428598956,"id":17341,"title":"\u003cp\u003eShort Editorial of SRM 655 Div1 Easy and Hard\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, I\u0027m the writer of SRM 655 Div1 Easy and Hard.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDiv1 — Easy\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe key is to thinking from last operation: it will make the final board have a k by k monochrome rectangle.\u003c/p\u003e\u003cp\u003efor example, if we have: \u003c/p\u003e \u003cpre\u003e\u003ccode\u003eBBBW\nBWWW\nBWWW\nWWWW\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eThen we know in the last step we may paint the right-down 3 by 3 rectangle. And that means, before this step, these 3*3 cells can be any color. So the board will looks like:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eBBBW\nB???\nB???\nW???\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eAnd we can see the previous step could be upper-left 3 by 3 rectangle (because we can change \u0027?\u0027 to \u0027B\u0027 and that is monochrome), so we get:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e???W\n????\n????\nW???\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eAnd we are done, because if we change \u0027?\u0027 to \u0027W\u0027 that is all-white board.\u003c/p\u003e\u003cp\u003eSo the algorithm is: keep finding k by k monochrome rectangles and paint it into \u0027?\u0027, until can\u0027t do it. And check if the board is all-white. You can proof no matter the order of rectangle we choose to paint, we will get the same result.\u003c/p\u003e\u003cp\u003eCode: \u003ca href\u003d\"http://ideone.com/xM13nh\"\u003ehttp://ideone.com/xM13nh\u003c/a\u003e\u003c/p\u003e\u003cp\u003eFun fact: I come up with this idea when I was playing a mobile game: \u003ca href\u003d\"https://play.google.com/store/apps/details?id\u003dcom.graveck.strata\u0026amp;hl\u003den\"\u003eStrata\u003c/a\u003e. Usually puzzle games are NP-Hard, but I find this one is not. :P\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDiv1- Hard\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFirst let\u0027s think about how can I solve it if we change blue points to a circle:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/38/50/385023a30d02cf661a5391fcbc6eb287a02b96ab.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e(If you can\u0027t see the picture, please use this url: \u003ca href\u003d\"http://postimg.org/image/ssvbih7sd/\"\u003ehttp://postimg.org/image/ssvbih7sd/\u003c/a\u003e)\u003c/p\u003e\u003cp\u003eFor a point P, we say it covers the direction [OA, OB] of that circle.\u003c/p\u003e\u003cp\u003eWe can prove: \u0026quot;circle totally in the CH of points\u0026quot; if and only if the union of directions of each point covers is all 360 degree.\u003c/p\u003e\u003cp\u003eThe polygon version is same. We can change the vertex to an infinite small arc of circle. Then P will cover the direction [EF, CD]. The condition will remain same.\u003c/p\u003e\u003cp\u003eSo the problem becomes: we have lots of interval of directions, each one have a certain probability of occur, you are ask the probability that the union will be [-Pi, Pi]. That could be solved by DP (my solution is N^3).\u003c/p\u003e\u003cp\u003eCode: \u003ca href\u003d\"http://ideone.com/Yq4ReK\"\u003ehttp://ideone.com/Yq4ReK\u003c/a\u003e\u003c/p\u003e\u003cp\u003eFun fact: there is a simplified version (2 blue points instead of up to 100, but require n^2 solution) used in \u003ca href\u003d\"http://community.topcoder.com/stat?c\u003dproblem_statement\u0026amp;pm\u003d12110\"\u003eTCO 2012 round 3B Hard\u003c/a\u003e wrote by \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ivan.metelsky\" title\u003d\"Гроссмейстер ivan.metelsky\"\u003eivan.metelsky\u003c/a\u003e, but today he was solving this harder version during the contest!\u003c/p\u003e\u003cp\u003eAnd congratulations to \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Легендарный гроссмейстер tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e! He solved all 3 tasks with highest score with 7 successful challenge!\u003c/p\u003e\u003c/div\u003e","tags":[]}}