{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1525017446,"rating":50,"authorHandle":"gKseni","modificationTimeSeconds":1525017687,"id":59168,"title":"\u003cp\u003eВКонтакте запускает стипендиальную программу для авторов курсов по программированию\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eСоциальная сеть \u003ca href\u003d\"https://vk.com/about\"\u003eВКонтакте\u003c/a\u003e запускает \u003ca href\u003d\"https://vk.com/fellowship\"\u003eVK Fellowship\u003c/a\u003e — cтипендиальную программу для преподавателей из регионов России (кроме Москвы и Санкт-Петербурга), которые являются авторами собственных образовательных курсов по основам программирования. Участвовать в программе могут:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eучителя школ\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eпреподаватели вузов\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eпедагоги дополнительного образования\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eнаставники кружков по программированию.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eВ 2018/2019 учебном году участниками программы станут \u003cstrong\u003e12 российских преподавателей\u003c/strong\u003e. Каждый из них получит \u003cstrong\u003eстипендию в размере 120 тысяч рублей за год\u003c/strong\u003e — то есть 10 тысяч в месяц. Еще стипендиаты могут могут рассчитывать на \u003cstrong\u003eметодическую поддержку\u003c/strong\u003e от ведущих преподавателей по программированию и сотрудников команды ВКонтакте. А еще \u003cstrong\u003eпродвижение\u003c/strong\u003e своей авторской образовательной программы — если захочется. \u003c/p\u003e\u003cp\u003eЗаявки принимаются \u003cstrong\u003eдо 31 мая 2018 года\u003c/strong\u003e на странице: \u003ca href\u003d\"https://vk.com/fellowship\"\u003evk.com/fellowship\u003c/a\u003e. Для участия в конкурсе нужно:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eЗаполнить анкету и рассказать о вашей образовательной практике\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПройти небольшой тест по программированию\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПообщаться с командой программы онлайн (они с вами свяжутся)\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eОтбор пройдёт на конкурсной основе — в экспертный совет, который выберет участников программы, войдут 5 человек: представители ВКонтакте, Codeforces, \u003ca href\u003d\"http://kruzhok.org/\"\u003eКружкового движения НТИ\u003c/a\u003e, Министерства образования и науки РФ и независимый преподаватель-эксперт. Подробнее о конкурсе в положении \u003ca href\u003d\"https://vk.com/doc3173613_464374682\"\u003eвот здесь\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eЗдорово, что программ, которые поддерживают людей, передающих свои знания и навыки, становится все больше. Преподаватели! Принимайте участие. Занимаетесь где-то сами — рассказывайте своим наставникам! Будущее сообщества не только в горящих глазах учеников, но и в заинтересованных преподавателях. А одно без другого не бывает ;)\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/d8/54/d854616622e59308a7f4ce5b9cfc3a8c0eec09d1.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003c/div\u003e","tags":["vk","вконтакте","преподавателям"]}}