{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1484429135,"rating":208,"authorHandle":"gKseni","modificationTimeSeconds":1484434029,"id":49772,"title":"\u003cp\u003eАлексей Борунов: Обучение ребят как проект длиной в жизнь\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eИнтервью с Алексеем Борунов \u003ca href\u003d\"https://42.tut.by/527172\"\u003eопубликовал портал 42.TUT.BY\u003c/a\u003e Текст \u003ca href\u003d\"https://news.tut.by/author/2544.html\"\u003eАнны Ермаченок\u003c/a\u003e, фото \u003ca href\u003d\"https://news.tut.by/author/2512.html\"\u003eДмитрия Брушко\u003c/a\u003e.\u003c/p\u003e \u003chr /\u003e\u003cp\u003eБелорусских программистов в мире знают не только как работящих взрослых, но и как талантливых школьников. Одна из школ подготовки юных программистов находится в Мозыре, руководит ей педагог Алексей Борунов. Среди его учеников — десятки призеров соревнований республиканского и международного уровня.\u003c/p\u003e \u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/91/a3/91a3051f2d2569941d3483c46d4f84d09e667099.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003csmall\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003eАлексей Валентинович Борунов родился в Ленинграде в 1976 году. В 1993 году он стал педагогом дополнительного образования в кружке информатики мозырского Клуба юных пожарных, в 1998-м — закончил Мозырский государственный педагогический институт по специальности «учитель математики и информатики». Сейчас работает по IT-специальности на ОАО «Мозырский НПЗ». Параллельно каждый день готовит детей к олимпиадам и соревнованиям по спортивному программированию.\u003c/p\u003e\u003cp\u003eАлексей Валентинович занимается спортивным программированием со школьниками каждый день. Работал он и в последний день 2016 года, и 1 января 2017-го. «Чуть-чуть поменьше, но приходили», — вспоминает он.\u003c/p\u003e\u003cp\u003eСвое преподавание он называет «проектом», которым он занимается больше двадцати лет. Сейчас в его клубе — больше 50 школьников, которые учатся побеждать.\u003c/p\u003e\u003cp\u003e— Насчет того, что я провожу весь день вне дома, — это правда, — признается он. — Я и работаю на основной работе, и занимаюсь со школьниками каждый день, включая выходные. Но я думаю, проект этого стоит. Нужно вкладывать много сил, чтобы достичь большого результата.\u003c/p\u003e \u003ch4\u003e«Эта победа сравнима с победой местечкового футбольного клуба над „Челси“ или „Реалом“»\u003c/h4\u003e\u003cp\u003eРаньше дети Алексея Валентиновича готовили разработки для ежегодных недель науки и технического творчества, а после узнали о спортивном программировании — и увлеклись.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/99/25/9925b81c9f2863f199f264b286177c9763072eed.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003e Алексей Борунов с учениками во время экскурсии в минский офис «Яндекса»\u003c/small\u003e \u003c/center\u003e\u003cp\u003eПервую серьезную победу одержали в 2007 году. Тогда Алексей \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/aropan\" title\u003d\"Grandmaster aropan\"\u003earopan\u003c/a\u003e Ропан, Евгений \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/qwaker.00\" title\u003d\"Grandmaster qwaker.00\"\u003eqwaker.00\u003c/a\u003e Грицкевич и Александр Кулицкий \u003ca href\u003d\"https://42.tut.by/180066\"\u003eпривезли\u003c/a\u003e золото Всероссийской командной олимпиады школьников по программированию в Санкт-Петербурге.\u003c/p\u003e\u003cp\u003e— В отзывах об этой олимпиаде один из ее основателей, директор ACM-соревнований в Санкт-Петербурге и декан одного из факультетов ИТМО писал: «Я считаю, что победа команды из маленького белорусского города над именитыми командами из Москвы и Санкт-Петербурга сравнима с победой их местечкового футбольного клуба над «Челси» или «Реалом». После этого у наших ребят появилась уверенность в своих силах. Они поняли, что, даже живя не в столице, можно достичь практически такого же результата, как и любой человек. С тех пор ребята начали хорошо выступать. Точнее, они всегда хорошо выступали, просто сейчас у них появилось подтверждение.\u003c/p\u003e\u003cp\u003eПосле этого побед стало намного больше. Сейчас у мозырского клуба 45 дипломов заключительного этапа республиканской олимпиады по информатике, 17 дипломов московской Открытой олимпиады школьников по программированию, 8 дипломов и 4 медали Всероссийской командной олимпиады школьников по программированию, 7 медалей на международных олимпиадах школьников по информатике.\u003c/p\u003e\u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/59/ef/59ef734e9b72f86b2f6e0786f71475c9af7e8d0a.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eВыпускник Алексея Борунова Алексей \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/aropan\" title\u003d\"Grandmaster aropan\"\u003earopan\u003c/a\u003e Ропан. В 2008 году он \u003ca href\u003d\"https://42.tut.by/181731\"\u003eполучил\u003c/a\u003e бронзовую медаль на Международной олимпиадe школьников по информатике, в 2012 — \u003ca href\u003d\"https://42.tut.by/354843\"\u003eвошел\u003c/a\u003e в число 24 сильнейших программистов мира по версии TopCoder Open. Фото: bsuir.by\u003c/small\u003e \u003c/center\u003e \u003ch4\u003eЧто за спортивное программирование?\u003c/h4\u003e\u003cp\u003eАлексей Валентинович учит детей не промышленному программированию, а спортивному — решению нестандартных задач, для которого нужны программы.\u003c/p\u003e\u003cp\u003e— Слова «спортивное программирование» иногда вызывают улыбку у тех, кто впервые сталкивается с таким термином. Суть спортивного программирования не в том, чтобы бегать и при этом решать задачи.\u003c/p\u003e\u003cp\u003eВо время такого соревнования в течение пяти часов участнику необходимо решить от 4 до 12 задач — зависит от формата. Каждая задача — это программа, которую нужно написать. Каждая программа должна работать максимально быстро.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/64/11/6411de9f3846f93d40ac9a804f3be96ef99cd049.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003csmall\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003eПрограмма пишется с нуля. Она должна за секунду-две (в зависимости от ограничений) выполнить обработку некоторого довольно большого объема входных данных, который держат в секрете. Задания оценивают не жюри, а автоматические системы тестирования.\u003c/p\u003e\u003cp\u003eЗадачи для спортивного программирования встречаются на ежегодных олимпиадах, соревнованиях крупных IT-компаний или онлайн на сайтах вроде Codeforces или TopCoder.\u003c/p\u003e \u003ch4\u003e«Дети имеют нулевую точку вхождения»\u003c/h4\u003e\u003cp\u003eИнтересуемся у педагога: какие общие черты у детей-чемпионов?\u003c/p\u003e\u003cp\u003e— Они целеустремленные, готовы работать. Побеждают не те ребята, которым все легко дается, потому что получилось так, что их начальное образование и воспитание дало им небольшой толчок. Такие ребята тоже достигают результатов. Но самых-самых вершин достигают те, кто выложился на полную и достиг большого результата за счет своего трудолюбия.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/e2/69/e269711a61b0f2aafa12232734ad3d864c8be60d.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003e  В центре — Адам \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/subscriber\" title\u003d\"International Grandmaster subscriber\"\u003esubscriber\u003c/a\u003e Бардашевич и Геннадий \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e Короткевич после \u003ca href\u003d\"https://42.tut.by/503058\"\u003eпобеды\u003c/a\u003e в престижном турнире VK Cup 2016. Адам — воспитанник Алексея Борунова, Геннадий — гомельского тренера Михаила Долинского. Оба они сейчас учатся в университете информационных технологий, механики и оптики в Санкт-Петербурге (ИТМО).  \u003c/small\u003e \u003c/center\u003e\u003cp\u003eЗанятия у Алексея Валентиновича бесплатны. Дети начинают обычно в четвертом или пятом классе, однако бывают и исключения.\u003c/p\u003e\u003cp\u003e— Дети имеют нулевую точку вхождения. Они могут прийти с улицы, ничего не зная. У нас есть своеобразная иерархия. Новички — «младшая группа», те, кто показал себя на областном этапе и выше, — «средняя группа», а те, кто достиг результатов на «республике» и международных олимпиадах, — «старшая группа». Так вот, «старшие» имеют возможность влиять на развитие программы обучения, предлагать вставку новых тем, коррекцию и изменение задач в нашем большом учебнике — базовой программе обучения.\u003c/p\u003e \u003ch4\u003e«Оценки мы не ставим»\u003c/h4\u003e\u003cp\u003eДетей обучают индивидуально. Фронтального обучения — когда целый класс работает в одном темпе — здесь нет, каждый может учиться со своей скоростью. Сначала каждый ребенок слушает теорию, после решает задачи по теме.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/79/2a/792a52211cb431c6595e5c5cc26d774b34995037.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003csmall\u003e \u003c/small\u003e \u003c/center\u003e\u003cp\u003e— Пока все похоже на школу, да? Но когда все задачи решаются, о них нужно отчитаться, и затем он (или она) имеет возможность прослушать новую тему. Клубовцы сами решают — хотят они сегодня прослушать или в следующий раз, хотят ли они услышать сегодня или в следующий раз. Они сами определяют скорость продвижения вперед. Бывает, что за одно занятие опытные ребята могут пройти пять простых тем.\u003c/p\u003e\u003cp\u003eАлексей Валентинович выстроил сложную систему рейтингов и мотивации для детей, которая зависит от их возраста.\u003c/p\u003e\u003cp\u003e— Оценки мы не ставим. Для сравнения ребят между собой вполне достаточно номера темы, на которой находится учащийся. У нас по программе обучения разбросаны «пряники». Например, из двух клубовцев занять более мощный компьютер может тот из них, кто прошел дальше по программе обучения. Такого рода комфорт — мелочь — ребят подстегивает немножко.\u003c/p\u003e\u003cp\u003eДля средних и старших действует такой показатель, как «дельта программы обучения» — количество тем, изученных за месяц. Более серьезные рейтинги «средней» и «старшей» групп вычисляют на основе количества достижений — побед на олимпиадах и соревнованиях. Рейтинги постоянно обновляются, а ребята — все время соревнуются между собой.\u003c/p\u003e \u003ch4\u003eНе поехал в Facebook, потому что был школьником\u003c/h4\u003e\u003cp\u003eБольшинство выросших учеников Алексея Валентиновича осело в Минске, часть переехала в Россию. Сейчас они работают в IT-сфере над самыми разными проектами — от нейронных сетей до протоколов передачи данных для беспилотных летательных аппаратов.\u003c/p\u003e\u003cp\u003e— Ребятам — например, Сергею \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/CherryTree\" title\u003d\"Master CherryTree\"\u003eCherryTree\u003c/a\u003e Кулику, Евгению \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/qwaker.00\" title\u003d\"Grandmaster qwaker.00\"\u003eqwaker.00\u003c/a\u003e Грицкевичу — предлагали пройти собеседования для работы в таких компаниях, как Google или Facebook. Но когда они были школьниками. В студенческие годы приглашения тоже приходили. Но, к примеру, наш Сергей \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/CherryTree\" title\u003d\"Master CherryTree\"\u003eCherryTree\u003c/a\u003e Кулик, будучи школьником, по результатам онлайн-соревнований вошел в топ-10 среди, пожалуй, ста тысяч пользователей. И ему пришло приглашение на собеседование в Facebook.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/40/7c/407cf5ac6a3bbfe16bd20f2c104c4942b5cd5f75.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003csmall\u003eУченики Алексея Борунова во время лекции в «Яндексе».\u003c/small\u003e \u003c/center\u003e\u003cp\u003eСережа спрашивал: «Что мне делать?». Я посоветовал ему написать, что сейчас он школьник, он благодарен за приглашение, но хотел бы сначала посвятить годы учебе в университете и будет рад, если подобное приглашение останется в силе во время его учебы в университете. Он так и поступил. Сейчас Сергей не только учится в БГУ, но и работает в «Яндексе» и делает наборы задач для сайтов спортивного программирования.\u003c/p\u003e \u003ch4\u003eПроект длиной в жизнь\u003c/h4\u003e\u003cp\u003eАлексей считает, что достойная жизнь педагога возможна, только если у него будет дополнительный заработок или грант. Что же держит его в образовании?\u003c/p\u003e\u003cp\u003e— Мне интересно посоревноваться с другими тренерами, сравнить силы. Но это, скорее, соревновательная часть, она дает больше интереса в жизни. Вторая цель, к которой приходишь не сразу, но которая оказывается даже более важна — это показать ребятам, что важно в этой жизни и к чему стоит стремиться. То есть дать им некоторую начальную систему ценностей и установки, научить выбирать правильный путь в дальнейшем после учебы.\u003c/p\u003e\u003cp\u003eЯ занимаюсь обучением ребят с 1993 года и не хочу бросать этот проект длиной в жизнь. Я, наоборот, хочу его развивать, а в лучшем случае — развивать территориально.\u003c/p\u003e\u003cp\u003eХочется просто жить для того, чтобы этот проект существовал. Вкладывать все силы в то, чтобы из новых ребят вырастали более сильные участники соревнований. Потом они реализуют себя в жизни и, думаю, вспомнят хорошим словом и как-то помогут нашим новым поколениям.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news","интервью"]}}