{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1470926159,"rating":-7,"authorHandle":"sainiarpit12","modificationTimeSeconds":1470926159,"id":46505,"title":"\u003cp\u003eRandom Question : Minimum sets needed to uniquely identify all of its elements.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI have n boxes n \u0026lt;\u003d 100. There are k fruits k \u0026lt;\u003d 6 , which will be inserted one by one. each fruit will be putted into the different boxes. for each fruits there will array of zeros and ones where 1 represents that box contains this fruit and zero means that it doesn\u0027t contain fruit.\u003c/p\u003e\u003cp\u003eI have to find out how many minimum boxes do I need to uniquely identify the given fruits.\u003c/p\u003e\u003cp\u003eFor example : lets say there are 2 fruits and 9 boxes.\u003c/p\u003e\u003cp\u003eBox No\u0027s: 1 2 3 4 5 6 7 8 9\u003c/p\u003e\u003cp\u003eFruit A : 1 1 1 1 0 0 0 1 0 \u003c/p\u003e\u003cp\u003eFruit B : 1 0 0 0 1 0 1 1 1\u003c/p\u003e\u003cp\u003eIf we choose box such as 2,3,4,5,7,9 any one of them can uniquely identify the given fruits because one exist and other don\u0027t. So answer here is 1.\u003c/p\u003e\u003cp\u003eLets add another fruit here C:\u003c/p\u003e\u003cp\u003e0 1 0 1 1 1 1 0 1\u003c/p\u003e\u003cp\u003eIf you choose any of the above boxes , then you will have conflict and cannot uniquely identify the given fruits.So you will need another box here. Minimum Answer would be 2 here.\u003c/p\u003e\u003cp\u003eSo far I have done that for each box i will put it into the box. then for all boxes we will have some set , element in it say that there is fruit[i] in it.\u003c/p\u003e\u003cp\u003eSo I would have to find out minimum boxes such that if we take subset of those and do intersection of that subset and intersection comes out to be fruit[i] then we can uniquely identify that given fruit.\u003c/p\u003e\u003cp\u003eBut I am stuck on how would I find the minimum boxes .\u003c/p\u003e\u003cp\u003eCan anyone tell whether even my approach is right or wrong ?\u003c/p\u003e\u003cp\u003eAny help or algorithm or any other approach to solve this problem.\u003c/p\u003e\u003cp\u003eThanks in advance. \u003c/p\u003e\u003c/div\u003e","tags":[]}}