{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1512658134,"rating":84,"authorHandle":"MiptLited","modificationTimeSeconds":1513347598,"id":56211,"title":"\u003cp\u003eMoscow Pre-Finals ACM ICPC Workshop 2018\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/a0/46/a046fd0faa1f59749fd4245d555f19b5bef3e527.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003eWe’re glad to tell you that \u003ca href\u003d\"https://it-edu.mipt.ru/en/spring-training-2018\"\u003eMoscow Pre-Finals ACM ICPC Workshop\u003c/a\u003e will be held at Moscow Institute of Physics and Technology from \u003cstrong\u003e21 of March to 1 of April, 2018\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eThe Moscow Pre-Finals ACM ICPC Workshop is the unique event in the world of competitive programming. Many teams participated in this Workshop turn out to be the prize-winners and winners of the the ACM-ICPC World Finals. In 2017 8 out of 12 teams that were awarded medals at the Finals took part in the Moscow Pre-Finals Workshop ACM ICPC at MIPT.\u003c/p\u003e\u003cp\u003eThe Workshop is going to be held in accordance with the \u003cstrong\u003etwo divisions\u003c/strong\u003e scheme. We invite finalists to participate in the \u003cstrong\u003efirst division\u003c/strong\u003e and other teams who want to train before the next season in the \u003cstrong\u003esecond division\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eThe Workshop is organized by MIPT, University ITMO and SPbU.\u003c/p\u003e\u003cp\u003eThe official language is \u003cstrong\u003eEnglish\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eThe participation cost in payment before 12 of February for one person is $630. The cost includes the full curriculum, food and accommodation at the MIPT campus, as well as the sports and sightseeing schedules on days-off. \u003c/p\u003e\u003cp\u003eMore information \u003ca href\u003d\"https://it-edu.mipt.ru/en/spring-training-2018\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe Workshop participants will also have an opportunity to give a try at \u003ca href\u003d\"https://it-edu.mipt.ru/pages/festival/\"\u003eMosCode Festival 2018\u003c/a\u003e which will take place on March 31 and April 1. But we\u0027ll tell you about it later)\u003c/p\u003e\u003c/div\u003e","tags":[]}}