{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1458283476,"rating":0,"authorHandle":"HamidK","modificationTimeSeconds":1458283559,"id":43853,"title":"\u003cp\u003eLand acquisition (USACO contest problem)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eProblem 1: Land Acquisition [Paul Christiano, 2007]\u003c/p\u003e\u003cp\u003eFarmer John is considering buying more land for the farm and has his eye on N (1 \u0026lt;\u003d N \u0026lt;\u003d 50,000) additional rectangular plots, each with integer dimensions (1 \u0026lt;\u003d width_i \u0026lt;\u003d 1,000,000; 1 \u0026lt;\u003d length_i \u0026lt;\u003d 1,000,000).\u003c/p\u003e\u003cp\u003eIf FJ wants to buy a single piece of land, the cost is $1/square unit, but savings are available for large purchases. He can buy any number of plots of land for a price in dollars that is the width of the widest plot times the length of the longest plot. Of course, land plots cannot be rotated, i.e., if Farmer John buys a 3x5 plot and a 5x3 plot in a group, he will pay 5x5\u003d25.\u003c/p\u003e\u003cp\u003eFJ wants to grow his farm as much as possible and desires all the plots of land. Being both clever and frugal, it dawns on him that he can purchase the land in successive groups, cleverly minimizing the total cost by grouping various plots that have advantageous width or length values.\u003c/p\u003e\u003cp\u003eGiven the number of plots for sale and the dimensions of each, determine the minimum amount for which Farmer John can purchase all\u003c/p\u003e\u003cp\u003ePROBLEM NAME: acquire\u003c/p\u003e\u003cp\u003eINPUT FORMAT:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eLine 1: A single integer: N\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eLines 2..N+1: Line i+1 describes plot i with two space-separated  integers: width_i and length_i\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eSAMPLE INPUT:\u003c/p\u003e\u003cp\u003e4 100 1 15 15 20 5 1 100\u003c/p\u003e\u003cp\u003eINPUT DETAILS:\u003c/p\u003e\u003cp\u003eThere are four plots for sale with dimensions as shown.\u003c/p\u003e\u003cp\u003eOUTPUT FORMAT:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eLine 1: The minimum amount necessary to buy all the plots.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eSAMPLE OUTPUT:\u003c/p\u003e\u003cp\u003e500\u003c/p\u003e\u003cp\u003eOUTPUT DETAILS:\u003c/p\u003e\u003cp\u003eThe first group contains a 100x1 plot and costs 100. The next group contains a 1x100 plot and costs 100. The last group contains both the 20x5 plot and the 15x15 plot and costs 300. The total cost is 500, which is minimal.\u003c/p\u003e \u003chr /\u003e\u003cp\u003emy solution gives a O(n^2) algorithm, and it\u0027s not good since n\u0026lt;\u003d5*10^4. my solution sketch:\u003c/p\u003e\u003cp\u003efirst we sort the pairs(from their width) consider 2 pairs the first with width w1 and length l1 and another with width w2 and l2, if w1 \u0026lt;\u003d w2 \u0026amp; l1 \u0026lt;\u003d l2 then we can buy these two lands together without considering the first land and paying w2*l2 so we can simply discard these situations as below\u003c/p\u003e\u003cp\u003eafter we sort the lands we change it so that their width would be increasing and their length would be decreasing(this can be easily done with a stack...), after that we can conclude that any form of buying the lands is decomposing the lands into sequences and paying every sequence, for example if w1 \u0026lt; w2 \u0026lt; w3 \u0026lt; w4 and l1 \u0026gt; l2 \u0026gt; l3 \u0026gt; l4 one form of paying is joining 1 and 2 and then paying for 3 and then paying for 4, the sequnces are: [1..2] , [3..3] , [4..4] we can easily conclude if a form of buying is such that the lands joint, dont form a sequence by including the lands so that we can form a sequence results in decreasing the price,\u003c/p\u003e\u003cp\u003enow we can easily put a dp and update the dp with(O(n)) (how?) giving an algorithm of O(n^2),\u003c/p\u003e\u003cp\u003ethe real dp algorithm should be less , plz help :)\u003c/p\u003e\u003c/div\u003e","tags":["dynamic programming"]}}