{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1528386471,"rating":15,"authorHandle":"MiptLited","modificationTimeSeconds":1528718633,"id":59887,"title":"\u003cp\u003eHurry up to register before June 15 for ICPC boot-camps in Grodno and Vladivostok!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/ec/fe/ecfe1b78e8bd3f03707a6ff3ae47751a089200d4.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eOnly until June 15 there is the discount for participation in Moscow Workshops ICPC, which will be held on 23-30 July 2018 in Grodno (Belorus) and Vladivostok (Russia). The price for one person includes the curriculum, meals and accommodation in the dormitory, the excursion program in days off.\u003c/p\u003e\u003cp\u003eThe State University of Grodno is one of the main training and competitive venues in the field of sports programming in Belarus. The University has a convenient geographical location which allows you to reach it quickly from any place in Europe. In addition a sightseeing program is prepared for participants: Old Castle, New Castle, Mirsky and Nesvizh Castles, Kolozhskaya church, Zhiliber’s Park with exotic plants. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/32/1f/321f11e710fd816904ed98e38c831d089bb77a34.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eMirsky Castle\u003c/p\u003e\u003cp\u003eThe Far Eastern Federal University is an innovative university, located on the Pacific coast in an ecologically clean area of the Russian Island. The program includes not only pleasant rest on the coast after intensive training, but also interesting trips around the main sights: the famous Russian bridge, the unique Vladivostok fortress and the large-scale Primorsky aquarium.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/c6/7b/c67b95020c893a5e434f833771f1c9debdcbd921.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eRussian Bridge\u003c/p\u003e\u003cp\u003e\u0026quot;Moscow Workshops ICPC is the international educational project in competitive programming firstly made on the basis of Moscow Institute of Physics and Technology and expanded to international project, in which 167 universities of 50 counties took part. Moscow Workshops ICPC has no comparable analogues in the world. The outstanding results of Russian students in ICPC prove that systematic training is the secret of success  — since 2000 they get 32 golden medals of ICPC World Finals. For comparison China has 13, USA got 6» — said Vice-Rector for International Programs and Technological Entrepreneurship at MIPT, founder of Moscow Workshops ICPC Alexey Maleev. \u003c/p\u003e\u003cp\u003eMoscow Workshops ICPC includes the boot camps, online courses, championships and programs for school students. For the detailed information visit our \u003ca href\u003d\"http://it-edu.com/21ckpikx33\"\u003eweb-site\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":[]}}