{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1405319574,"rating":94,"authorHandle":"PavelKunyavskiy","modificationTimeSeconds":1405393612,"id":13044,"title":"\u003cp\u003eIOI 2014: открытие\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЗа сегодняшний день прошел пробный тур и открытие. Надо признать заслуги организаторов — первый раз на моей памяти почти все мероприятия начинаются вовремя. Впрочем, запасы времени даже слишком большие, и постоянно приходится ждать очередного мероприятия.\u003c/p\u003e\u003cp\u003eНа пробном туре было на удивление мало проблем по сравнению с прошлыми годами. Кажется даже сразу работали принтеры (видимо в этот раз одинаковые?). Их мелких проблем — положили не актуальную версию одной из задач, мышка очень плохо работает на поверхности стола, система выдает неадекватный вердикт в случае ML. Но с ними всеми достаточно быстро поборолись. Например, обещали на туре выдать больше бумаги, чтобы использовать ее в качестве коврика для мышки.\u003c/p\u003e\u003cp\u003eНа открытии были достаточно красивые представления в стиле национальной культуры и традиционные речи и поздравления всех всеми. Речи почему-то часто на китайском. Впрочем, тут лучше будет просто выложить фотографий.\u003c/p\u003e\u003cp\u003eТакже меня просили немного рассказать о членах сборной\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/KAN\" title\u003d\"International Grandmaster KAN\"\u003eKAN\u003c/a\u003e (Николай Калинин) — выпускник 40 лицея Нижнего Новгорода, абитуриент ННГУ.  Абсолютный победитель Всероссийской олимпиады 2013 года, двукратный абсолютный победитель ВКОШП,  победитель \u003ca href\u003d\"/contest/436\" title\u003d\"Zepto Code Rush 2014\"\u003eZepto Code Rush 2014\u003c/a\u003e, 10-ое место в рейтинге codeforces на текущий момент, 3-е место IOI-2013.  Несмотря на не самое удачное выступление на РОИ этого года (аж 4-ое место!), выиграл три из четырех  отборочных туров на сборах. \u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/dragonic\" title\u003d\"Master dragonic\"\u003edragonic\u003c/a\u003e (Никита Уваров) — выпускник московского лицея \u0026quot;Вторая школа\u0026quot;, абитуриент ФУПМа. Третье место Всероссийской олимпиады 2014 года, победитель \u003ca href\u003d\"/contest/419\" title\u003d\"Coder-Strike 2014 - Finals\"\u003eCoder-Strike 2014 - Finals\u003c/a\u003e. Никита первый раз побывал на сборах в 9-ом классе, однако после не очень удачного выступления в 10-ом классе не был приглашен на сборы снова. Уверенными выступлениями в течении всего последнего года, он доказал, что это было ошибкой и, заняв второе место на сборах, прошел на международную олимпиаду.\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/zemen\" title\u003d\"Grandmaster zemen\"\u003ezemen\u003c/a\u003e (Константин Семенов) — выпускник 41 лицея города Ижевска, абитуриент ФИВТа. Абсолютной победитель Всероссийской олимпиады 2014 года, а также открытой олимпиады 2014. Золотой медалист IOI 2013 (12 место). Если проход на IOI в прошлом году, как и 4-ое место на Всероссийской олимпиаде было для всех неожиданностью, в этом году Костя наравне с Колей был фаворитом всех российских школьных сореванований и выиграл многие из них.\u003c/p\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Umqra\" title\u003d\"Master Umqra\"\u003eUmqra\u003c/a\u003e (Никита Сивухин) — выпускник СУНЦ УрФУ, абитуриент УрФУ. 4-ое место ВКОШПа, участник Петрозаводских сборов в составе команды UrFU 3. Автор \u003ca href\u003d\"/contest/394\" title\u003d\"Codeforces Round 231 (Div. 2)\"\u003eCodeforces Round #231 (Div. 2)\u003c/a\u003e. Никита — первый участник сборной из Екатеринбурга (правда, были участники из Свердловска). И это в год, когда Екатеринбург проводил РОИ и финал.\u003c/p\u003e\u003cp\u003eДостаточно скоро начинается утверждение проблемсета и перевод задач на национальные языки. Первый тур завтра в \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dIOI+2014+first+day\u0026amp;iso\u003d20140715T09\u0026amp;p1\u003d241\"\u003e9 утра по местному времени\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eФотографии от \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/pashka\" title\u003d\"Candidate Master pashka\"\u003epashka\u003c/a\u003e в полной версии \u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["ioi","ioi 2014","ладно кто-то читает"]}}