{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1419356659,"rating":58,"authorHandle":"NYanushkevich","modificationTimeSeconds":1419368566,"id":15335,"title":"\u003cp\u003eGoTo Camp Выездная школа для учащихся 8-11 классов, посвященная проектной работе в области робототехники и прикладного программирования.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПриглашаем школьников в лагерь GoTo Camp, посвященный проектной работе в области робототехники и прикладного программирования. Лагерь пройдет с 3 по 11 января в Подмосковье, заявки принимаются до 25 декабря. Работать с школьниками будут сотрудники Яндекса, ABBYY и Крока, преподаватели МФТИ, ВШЭ и УрФУ. \u003c/p\u003e\u003cp\u003eЧто ждет участников? \u003c/p\u003e \u003cul\u003e   \u003cli\u003eКомандная работа над проектами;\u003c/li\u003e   \u003cli\u003eОсвоение новых технологий, знаний и навыков;\u003c/li\u003e   \u003cli\u003eНовые друзья и единомышленники;\u003c/li\u003e   \u003cli\u003eЗнакомство с интересными людьми, успешно создающими различные проекты;\u003c/li\u003e   \u003cli\u003eЗимние каникулы, в которых будет место самостоятельности и ответственности, отдыху и работе, приключениям и праздникам.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eУ каждого из участников лагеря будет возможность реализовать проект в одной из двух областей на выбор:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eРобототехника на платформе Arduino;\u003c/li\u003e   \u003cli\u003eРазработка приложений: серверных, мобильных, с графическим и web-интерфейсами.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eПроекты могу быть из самых разных областей: компьютерные игры, образование, социальные сети, медицина, домашнее хозяйство, математика, музыка, промышленность, астрономия и т. д. — программирование и робототехника могут оказаться полезными в самых неожиданных ситуациях.\u003c/p\u003e\u003cp\u003eЗа 7 дней проектные команды пройдут все стадии от идеи до реализации и представят проекты экспертам из области IT и робототехники. Подать заявку и узнать подробности можно на сайте \u003ca href\u003d\"http://goto.msk.ru/\"\u003ehttp://goto.msk.ru/\u003c/a\u003e .\u003c/p\u003e\u003cp\u003eПартнеры лагеря GoTo Camp проводят КОНКУРС идей проектов «Улучшить мир за 7 дней».\u003c/p\u003e\u003cp\u003eДесять лучших идей проекта получат скидки на путёвки от 20% до 40%.\u003c/p\u003e\u003cp\u003eПредложите свой проект в области Arduino-робототехники или прикладного программирования, реализуемый за неделю. Выигрывайте и приезжайте в GoTo Camp, чтобы реализовать его! Задуманное должно приносить пользу людям или другим обитателям нашей планеты. Описать свою идею можно до 25 декабря включительно ЗДЕСЬ: \u003ca href\u003d\"http://goo.gl/forms/jGtdWHtA6s\"\u003ehttp://goo.gl/forms/jGtdWHtA6s\u003c/a\u003e \u003c/p\u003e\u003cp\u003eРезультаты будут объявлены 26-ого декабря до 12:00.\u003c/p\u003e\u003c/div\u003e","tags":["abbyy","croc","мфти"]}}