{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1463511820,"rating":229,"authorHandle":"Michael","modificationTimeSeconds":1479160865,"id":44924,"title":"\u003cp\u003eData Structures and Algorithms Specialization at Coursera [fully launched]\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eLast year we\u0027ve won in Request for Proposals from Coursera, and this year we\u0027ve launched the \u003ca href\u003d\"https://goo.gl/bpJ1KC\"\u003eData Structures and Algorithms Specialization at Coursera\u003c/a\u003e. It is now the main option for studying algorithms and data structures on the platform. Specialization is a series of courses ending with a Capston Project which enables to learn the subject much deeper than it is usually possible in the scope of a massive online course.\u003c/p\u003e\u003cp\u003eThe Specialization is launched by \u003ca href\u003d\"https://ucsd.edu\"\u003eUniversity of California, San Diego\u003c/a\u003e (Computer Science program ranked 11-th in the world) and the \u003ca href\u003d\"https://cs.hse.ru/en/\"\u003eComputer Science Department of Higher School of Economics\u003c/a\u003e:\u003c/p\u003e \u003col\u003e   \u003cli\u003eDaniel Kane — Professor at \u003ca href\u003d\"https://ucsd.edu\"\u003eUCSD\u003c/a\u003e, Harvard graduate, PhD from MIT, four times Putnam fellow (US mathematical olympiad for university students), and there is even a \u003ca href\u003d\"https://goo.gl/vmFuJy\"\u003ewikipedia article\u003c/a\u003e about him.\u003c/li\u003e   \u003cli\u003ePavel Pevzner — Professor at \u003ca href\u003d\"https://ucsd.edu\"\u003eUCSD\u003c/a\u003e, last 12 years teaching Algorithms and Bioinformatics there, one of the authors of the \u003ca href\u003d\"https://www.coursera.org/specializations/computational-biology\"\u003eBioinformatics Specialization at Coursera\u003c/a\u003e.\u003c/li\u003e   \u003cli\u003eNeil Rhodes — Lecturer at \u003ca href\u003d\"https://ucsd.edu\"\u003eUCSD\u003c/a\u003e, former Staff Software Engineer at Google, has been teaching for the last 10 years, developed educational programs for Apple.\u003c/li\u003e   \u003cli\u003eAlexander Kulikov — visiting Professor at \u003ca href\u003d\"https://ucsd.edu\"\u003eUCSD\u003c/a\u003e, director of \u003ca href\u003d\"https://compscicenter.ru\"\u003eComputer Science Center\u003c/a\u003e and coordinator of Computer Science club in Saint Petersburg.\u003c/li\u003e   \u003cli\u003eMichael Levin — Chief Data Scientist at \u003ca href\u003d\"http://yandexdatafactory.com\"\u003eYandex Data Factory\u003c/a\u003e, has been teaching algorithms for 8 years at \u003ca href\u003d\"https://yandexdataschool.com\"\u003eYandex School of Data Analysis\u003c/a\u003e.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eOne of the main features of the Specialization is large number of problems which enable the learners to really understand algorithms: you all know that it only seems you\u0027ve solved the problem until you start implementing and submitting it. The same thing is true about specific algorithms and data structures. There are around 70 algorithmic problems in the Specialization. Many of those were prepared by \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Burunduk1\" title\u003d\"International Grandmaster Burunduk1\"\u003eBurunduk1\u003c/a\u003e, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Gassa\" title\u003d\"Master Gassa\"\u003eGassa\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/GlebsHP\" title\u003d\"Grandmaster GlebsHP\"\u003eGlebsHP\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ifsmirnov\" title\u003d\"International Grandmaster ifsmirnov\"\u003eifsmirnov\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ilyakor\" title\u003d\"Grandmaster ilyakor\"\u003eilyakor\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/nk.karpov\" title\u003d\"Candidate Master nk.karpov\"\u003enk.karpov\u003c/a\u003e, \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Perlik\" title\u003d\"Expert Perlik\"\u003ePerlik\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/romanandreev\" title\u003d\"Grandmaster romanandreev\"\u003eromanandreev\u003c/a\u003e, \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Zlobober\" title\u003d\"International Grandmaster Zlobober\"\u003eZlobober\u003c/a\u003e, Paul Melnichuk and Ruslan Savchenko.\u003c/p\u003e\u003cp\u003eThere are two options for the Capstone Project: Finding Shortest Paths in Road Networks and Social Networks using algorithms which are thousands of times faster than the classic ones or Bioinformatics Algorithms that are used to assemble a genome out of millions of small pieces.\u003c/p\u003e\u003cp\u003eIf you\u0027re red or very yellow here, you probably won\u0027t learn lots of new things. However, I\u0027ll just post a few of the \u003ca href\u003d\"https://www.coursera.org/learn/algorithmic-toolbox#ratings\"\u003ereviews\u003c/a\u003e from our learners regarding competitive programming:\u003c/p\u003e\u003cp\u003e\u0026quot;Amazing Course. I have been looking for this kind of course for months. Must for anyone who wants to be good in Competitive Programming and Algorithms\u0026quot;\u003c/p\u003e\u003cp\u003e\u0026quot;An excellent course. Though I have 10 years of experience in software engineering and I\u0027ve participated in programming contests in my undergraduate years, this course gave me a much clearer vision on solutions for typical programming problems.\u0026quot;\u003c/p\u003e\u003cp\u003e\u0026quot;Very good course on algorithms,particularly useful for competitive programming.\u0026quot;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e If you don\u0027t want to submit assignments and get a certificate, to see the videos and readings for free, you can go to a particular course, e.g. \u003ca href\u003d\"https://goo.gl/sOIRO2\"\u003eAlgorithmic Toolbox\u003c/a\u003e, and select the option to \u0026quot;Audit only\u0026quot;. The second course of Specialization is \u003ca href\u003d\"https://goo.gl/V0xxbV\"\u003eData Structures\u003c/a\u003e, it has been launched in April. The other three courses are not launched yet, the next one — \u003ca href\u003d\"https://goo.gl/NYGn7H\"\u003eAlgorithms on Graphs\u003c/a\u003e — will be available in June, next — \u003ca href\u003d\"https://goo.gl/tuKbi5\"\u003eAlgorithms on Strings\u003c/a\u003e — in July, last — \u003ca href\u003d\"https://goo.gl/K9Bcp1\"\u003eAdvanced Algorithms\u003c/a\u003e — in August.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.2\u003c/strong\u003e You can submit problems in one of the following programming languages: C, C++, Java, Python2, Python3, C#, Haskell, Javascript, Ruby, Scala.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.3\u003c/strong\u003e \u003ca href\u003d\"https://goo.gl/NYGn7H\"\u003eAlgorithms on Graphs\u003c/a\u003e course starts on June 6, and you can still enroll.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.4\u003c/strong\u003e \u003ca href\u003d\"https://goo.gl/tuKbi5\"\u003eAlgorithms on Strings\u003c/a\u003e course starts on July 25, you can already enroll.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.5\u003c/strong\u003e \u003ca href\u003d\"https://goo.gl/K9Bcp1\"\u003eAdvanced Algorithms and Complexity\u003c/a\u003e course has started, and I\u0027m going to write a separate about it.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.6\u003c/strong\u003e The \u003ca href\u003d\"https://goo.gl/vsMgFd\"\u003eculminating project on Genome Assembly\u003c/a\u003e has launched, and the project on Advanced Shortest Paths launched as the last optional module of the \u003ca href\u003d\"https://goo.gl/NYGn7H\"\u003eAlgorithms on Graphs\u003c/a\u003e course.\u003c/p\u003e\u003cp\u003eGreetings from \u003ca href\u003d\"http://icpc.baylor.edu\"\u003eACM ICPC World Finals\u003c/a\u003e in Thailand!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/c1/c1/c1c1b84558a9c02455674d5e4c37745757211341.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["algorithms","data structures","acm","acm icpc"]}}