{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1512946889,"rating":5,"authorHandle":"Jasperr","modificationTimeSeconds":1529402814,"id":56275,"title":"\u003cp\u003eCHelper Companion — An alternative to the original CHelper extension\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch2\u003eUpdate: the links in this post may or may not work anymore. Please go to the \u003ca href\u003d\"//codeforces.com/blog/entry/60073\"\u003eupdated blog post\u003c/a\u003e for more information.\u003c/h2\u003e\u003cp\u003eHey there,\u003c/p\u003e\u003cp\u003eI recently switched from Chrome to Firefox (with the release of Firefox Quantum), and CHelper was one of the extensions which caused me to still use Chrome for some specific tasks. I always wanted to make a browser extension, and because the original CHelper extension got a few broken problem parsers, I decided to make my own.\u003c/p\u003e\u003cp\u003eThere are a few differences between the original extension and this one:\u003cbr /\u003e- I fixed (most of?) the broken problem parsers\u003cbr /\u003e- I added contest parsers which can parse an entire contest at once (just like how you would parse a normal problem)\u003cbr /\u003e- It\u0027s available for both Chrome and Firefox (even though the original extension works fine on Firefox, but it is not published on Mozilla\u0027s AMO making it a bit harder to install) \u003c/p\u003e\u003cp\u003eProblem parsers are available for the following websites: - Atcoder\u003cbr /\u003e- Bayan\u003cbr /\u003e- CodeChef\u003cbr /\u003e- Codeforces\u003cbr /\u003e- CSAcademy\u003cbr /\u003e- DevSkill\u003cbr /\u003e- DMOJ\u003cbr /\u003e- E-Olymp\u003cbr /\u003e- Facebook Hacker Cup\u003cbr /\u003e- Google Code Jam (new)\u003cbr /\u003e- HackerEarth\u003cbr /\u003e- HackerRank\u003cbr /\u003e- Kattis\u003cbr /\u003e- LightOJ\u003cbr /\u003e- Panda Online Judge\u003cbr /\u003e- SPOJ\u003cbr /\u003e- Timus\u003cbr /\u003e- URI Online Judge\u003cbr /\u003e- USACO\u003cbr /\u003e- USACO Training\u003cbr /\u003e- Yandex \u003c/p\u003e\u003cp\u003eContest parsers are available for the following websites: - AtCoder\u003cbr /\u003e- CodeChef\u003cbr /\u003e- Codeforces\u003cbr /\u003e- DevSkill\u003cbr /\u003e- DMOJ\u003cbr /\u003e- E-Olymp\u003cbr /\u003e- Google Code Jam (old)\u003cbr /\u003e- HackerEarth\u003cbr /\u003e- HackerRank\u003cbr /\u003e- Kattis\u003cbr /\u003e- LightOJ\u003cbr /\u003e- Timus\u003cbr /\u003e- URI Online Judge \u003c/p\u003e\u003cp\u003eThe reason not to update the original extension is that the original extension is centered around the idea that the Java plugin parses the problem page, while I think JavaScript is a better tool for that job.\u003c/p\u003e\u003cp\u003eAvailable for \u003ca href\u003d\"https://chrome.google.com/webstore/detail/chelper-companion/cjnmckjndlpiamhfimnnjmnckgghkjbl\"\u003eChrome\u003c/a\u003e and \u003ca href\u003d\"https://addons.mozilla.org/en-US/firefox/addon/chelper-companion/\"\u003eFirefox\u003c/a\u003e. The source code is available on \u003ca href\u003d\"https://github.com/jmerle/chelper-companion\"\u003eGitHub\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAny feedback is greatly appreciated.\u003c/p\u003e\u003c/div\u003e","tags":["chelper"]}}