{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1415029990,"rating":47,"authorHandle":"Petruchcho","modificationTimeSeconds":1415032832,"id":14563,"title":"\u003cp\u003eСпортивное программирование, СГАУ-1 и Java проблемы\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДоброго времени суток, дорогой CF! Меня зовут Егор и я представляю \u003ca href\u003d\"/team/2689\"\u003eSamara SAU 1\u003c/a\u003e (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Petruchcho\" title\u003d\"Candidate Master Petruchcho\"\u003ePetruchcho\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Sinner\" title\u003d\"Candidate Master Sinner\"\u003eSinner\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Slamur\" title\u003d\"Candidate Master Slamur\"\u003eSlamur\u003c/a\u003e). По старой доброй традиции каждый год участники из нашего универа пишут посты на CF про поездки на четвертьфиналы в Саратов. В этом году я решил совместить этот увлекательный рассказ с рассказом о нашем выступлении в Новосибирске на Всесибирской олимпиаде. \u003c/p\u003e\u003cp\u003eСаратов в этом году не сказать, что смог нас чем-то удивить/порадовать. В прошлом году наша команда в упорной борьбе с Саратовскими командами вырвала 4 место. Как и \u003ca href\u003d\"/team/212\"\u003eTeddy Bears\u003c/a\u003e в позапрошлом году. Да, да, как и в этом году (\u003ca href\u003d\"http://contest.sgu.ru/monitor/?id\u003d1\"\u003eМонитор\u003c/a\u003e). При этом я бы не стал говорить, что мы были недовольны результатом или организацией. Но вы дочитали до интересного: на контесте у нас возникли java проблемы. А именно мы написали решение с авторской асимптотикой, ухудшив константу примерно в два раза. Получили заслуженный (???) TL, а точнее -16 с TL. Ничего, собственно, необычного для нас не произошло, но, поговорив после контеста с \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/I_love_natalia\" title\u003d\"Master I_love_natalia\"\u003eI_love_natalia\u003c/a\u003e, мы почувствовали, что не все так очевидно. На разборе \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e прогнал наше решение и сказал, что оно отработало за 8.8с вместо 6. Стоит сказать, что хотя эта задача фактически ничего для нас не решала, но неприятное ощущение осталось.\u003c/p\u003e\u003cp\u003eЧерез неделю мы полетели в Новосибирск. Если кто-то не знает, Всесибирская олимпиада состоит из двух пятичасовых контестов: по АСМ правилам и некое подобие марафонной задачи. Для любителей поностальгировать \u003ca href\u003d\"/blog/entry/5807\"\u003e/blog/entry/5807\u003c/a\u003e (не, у нас в этом плане все отлично). \u003c/p\u003e\u003cp\u003eВ первый день мы вновь столкнулись с java проблемами, причем гораздо более серьезными. Вы не поверите, но на java решения с асимптотикой порядка O(6*10^8) по одной из задач или даже O(8*10^7) по другой не очень хорошо упихиваются. При условии, что это авторские решения! Мы за счет  огромного опыта и высокого рейтинга  все-таки справились с этим и \u003cs\u003eвылетели\u003c/s\u003eушли с контеста с 5 сданными задачами. А хотите узнать, как хорошо прошел второй день, когда надо было заоптимизировать перебор по игре \u0026quot;Балда\u0026quot;? К сожалению, нам для тестирования был выдан слишком мощный (???) комп, на котором наше решение укладывалось в отведенные ограничения на макстестах. Это ввело нас в некоторое заблуждение относительно возможностей нашей программы, что само собой привело к проблемам в конце соревнования, а так же к веселому подгону констант MAGIC, MAGIC2, MAGIC3... К слову, мы проиграли лидерам примерно в 10 раз, да.\u003c/p\u003e\u003cp\u003eСобственно, подвожу к главному. \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/lperovskaya\" title\u003d\"Expert lperovskaya\"\u003elperovskaya\u003c/a\u003e, скинь, пожалуйста, фотографии \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Sinner\" title\u003d\"Candidate Master Sinner\"\u003eSinner\u003c/a\u003e в майке Саратовского ГУ.\u003c/p\u003e\u003cp\u003eА если серьезно, в последнее время проблем с java все больше. Отписывайтесь в комментах, если у вас есть подобные истории или вы хотите обвинить нашу команду в \u003cs\u003eкривож\u003c/s\u003eнеспособности писать хороший код. Спасибо за внимание!\u003c/p\u003e\u003c/div\u003e","tags":["ez collections","ssau","java"]}}