{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1471525620,"rating":174,"authorHandle":"gKseni","modificationTimeSeconds":1471645841,"id":46625,"title":"\u003cp\u003eДанил Сагунов — второй координатор задач\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eХорошие новости! Для того, чтобы контесты проходили чаще, качественнее и приносили больше радости, назначен второй координатор задач — Данил \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/dans\" title\u003d\"International master dans\"\u003edans\u003c/a\u003e Сагунов — студент факультета Компьютерных наук и информационных технологий Саратовского ГУ, финалист RCC 2015, КРОК 2016, VK Cup 2016, ACM ICPC 2016.\u003c/p\u003e\u003cp\u003eПообщалась с Данилом, вот что он рассказал: \u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/a9/06/a90616ab522d58b4b5a2d36cf902f4cef3433324.jpg\" style\u003d\"margin: 0 1.0em 1.0em 1.0em;float: right;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e— Какие контесты ты координировал?\u003cbr /\u003e— CFR #358, CFR #361, CFR #362, CFR #365, CFR #368. \u003c/p\u003e\u003cp\u003e— Что получается лучше всего на данном этапе?\u003cbr /\u003e— Я лучше скажу, что получается хуже всего — все успевать. Подготовка набора из пяти задач вдвоем занимает довольно много времени, учитывая еще и некоторую мою неопытность, процесс сейчас скорее выглядит как обучение на ошибках. \u003c/p\u003e\u003cp\u003e— Главное, что процесс идет :) После того, как ты ознакомился с подготовкой задач, изменилось ли твое мышление при их решении?\u003cbr /\u003e— С процессом подготовки задач я знаком уже сравнительно давно, еще с первых лет участия в командах Саратовского ГУ. Я был автором нескольких раундов тогда, сейчас лишь возрос объем работ, требуется больше внимания и ответственность серьезнее. Поэтому роль координатора серьезно на мышление не повлияла. \u003c/p\u003e\u003cp\u003e— Какой вектор развития в роли координатора?\u003cbr /\u003e— Быть внимательнее, успевать все быстрее, увеличить плотность контестов, ничего необычного, в общем. \u003c/p\u003e\u003cp\u003e— Хорошая фотография, весь в процессе :)\u003cbr /\u003e— Вроде того. Раунды я, наверное, с более эмоциональным лицом готовлю :)\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news","интервью","координаторство"]}}