{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1398523612,"rating":8,"authorHandle":"santjuan","modificationTimeSeconds":1398523612,"id":11965,"title":"\u003cp\u003esecond UTP Open Programming Contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eDear Contestants,\u003c/p\u003e\u003cp\u003eWe would like to invite you to the second UTP Open Programming Contest organized by the In-Sílico Group with the support from the Competitive Programming Network (@RedProgramacion). In our contest there will be two divisions: the division 1 for the most advanced competitors and the division 2 is meant for the beginners.\u003c/p\u003e\u003cp\u003eThe problems of the division 1 are going to have the difficulty you would usually expect from a national or regional ACM ICPC contest, and there will be a couple of problems with the difficulty of a world finals ACM ICPC contest. The problems of the division 2 are going to have a difficulty level between warmup and national ACM ICPC contest problems. Indeed, there will be a few problems from the division 1 on the division 2 as well.\u003c/p\u003e\u003cp\u003eThe contest will follow the ICPC rules, with respect to the scoring and judging of problems, but not for the elegibility tree, so that we invite anyone to participate regardless of their age, degree, country (there are no eligibility rules for our contests, everyone is welcome here!)\u003c/p\u003e\u003cp\u003eIn order to participate, you just need an internet connection, no matter where you are. Please enter to \u003ca href\u003d\"http://competitiveprogrammingnetwork.com\"\u003ehttp://competitiveprogrammingnetwork.com\u003c/a\u003e, select the UTP Judge tab and create a user (on the field \u0026quot;code\u0026quot; please put your affiliation: University or place where you work. If you have no affiliation, leave it blank). After you create your user, please search the \u0026quot;Groups\u0026quot; tab and subscribe to the division you want to participate in (the password for the group is the same as the name of the group). Please make sure your email address is valid before you create the user, because the email address is the only direct way of communication we have with you.\u003c/p\u003e\u003cp\u003eWe encourage everyone to participate on this contest and have some fun!. Feel free to invite whoever you think are willing to participate. This contest is absolutely open, so we expect contestants from many countries around the world!\u003c/p\u003e\u003cp\u003eShould you have any questions about our contest, don\u0027t hesitate to contact us at \u003ca href\u003d\"mailto:utpopen@competitiveprogrammingnetwork.com\"\u003eutpopen@competitiveprogrammingnetwork.com\u003c/a\u003e. The contest will take place on Saturday April 26th at 13:00(GTM-5), but we invite you to create your user before and to solve some of the practice problems. Those problems will help you to get familiar with the Judging system before the contest.\u003c/p\u003e \u003chr /\u003e\u003cp\u003eSeñores Maratonistas,\u003c/p\u003e\u003cp\u003eCordial saludo,\u003c/p\u003e\u003cp\u003eEstán cordialmente invitados al Second UTP Open Programming Contest organizada por el Semillero de Investigación In-Sílico, con el apoyo de la Red de Programación Competitiva (@RedProgramacion). En nuestra maratón tendremos dos divisiones: la división 1 para los competidores más avanzados y la división 2 está pensada para los competidores novatos e intermedios.\u003c/p\u003e\u003cp\u003eLos problemas de la división 1 tendrán la misma dificultad que Usted podría esperar de una maratón Nacional o Regional ACM ICPC, y habrá un par de problemas con la dificultad esperada en una maratón mundial ACM ICPC. Los problemas de la división 2 tendrán un nivel de dificultad correspondiente a problemas entre warmup y maratón Nacional ACM ICPC. De hecho, habrá algunos problemas de la división 1 en la división 2.\u003c/p\u003e\u003cp\u003eLa competencia seguirá las reglas de la ICPC con respecto a la puntuación y al juzgamiento de problemas, pero no con respecto al árbol de elegibilidad, así que invitamos a cualquiera que desee participar sin importar su edad, grado, país (no hay reglas de elegibilidad para nuestros participantes, todo el mundo es bienvenido!)\u003c/p\u003e\u003cp\u003ePara participar, Usted solo necesita una conexión a internet, sin importar el lugar donde se encuentre. Por favor ingrese a la página \u003ca href\u003d\"http://redprogramacioncompetitiva.com\"\u003ehttp://redprogramacioncompetitiva.com\u003c/a\u003e, seleccione el menú Juez UTP y cree un usuario (en el campo “code” por favor ingrese su afiliación: Universidad o lugar donde trabaja. Si no tiene afiliación, por favor deje el campo vacío). Después de crear su usuario, ingrese a la pestaña “Groups” y suscríbase a la división en la cual desea participar (el password para el grupo es el mismo nombre del grupo). Por favor asegúrese de que su dirección de correo es válida antes de crear su usuario, pues dicha dirección es la única manera que tenemos para comunicarnos directamente con Usted.\u003c/p\u003e\u003cp\u003eInvitamos a todos a participar en esta competencia, y a pasar un buen rato con nosotros! Siéntase libre de invitar a cualquier persona que Usted considere interesada en participar. Esta competencia es totalmente abierta, de manera que esperamos participantes de muchas partes del mundo!\u003c/p\u003e\u003cp\u003eSi tiene alguna pregunta con respecto a nuestra maratón de programación, no dude en contactarnos al correo \u003ca href\u003d\"mailto:utpopen@redprogramacioncompetitiva.com\"\u003eutpopen@redprogramacioncompetitiva.com\u003c/a\u003e. La maratón de programación se realizará el Sábado 26 de Abril a las 13:00(GTM-5), pero los invitamos a crear un usuario con tiempo en nuestro juez para que resuelva algunos retos de programación como práctica. Estos retos de programación lo ayudarán a familiarizarse con el sistema de juzgamiento antes de la competencia.\u003c/p\u003e\u003cp\u003eCordialmente,\u003c/p\u003e\u003cp\u003eSebastian Gómez Semillero de Investigación In-Sílico Programa de Ingeniería de Sistemas y Computación Universidad Tecnológica de Pereira Colombia\u003c/p\u003e\u003cp\u003eAtentamente,\u003c/p\u003e\u003cp\u003eIng. Hugo Humberto Morales Peña Profesor Asistente Programa de Ingeniería de Sistemas y Computación Universidad Tecnológica de Pereira\u003c/p\u003e\u003c/div\u003e","tags":[]}}