{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1431633483,"rating":5,"authorHandle":"sam721","modificationTimeSeconds":1431821687,"id":17887,"title":"\u003cp\u003eCompute the order of a permutation cycle?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi everybody! I have been training these last months and I have learned a lot of things.\u003c/p\u003e\u003cp\u003eHowever, last weekend I came across with a problem that goes likes this:\u003c/p\u003e\u003cp\u003eThere are N positions and N tokens (numbered from 1 to N, all distinct). There is a machine that moves the token that is in position i to position Pi. Initially the tokens are in the order 1, 2, 3, ..., N. The machine has a button that moves the tokens to the positions Pi\u0027s. After pushing the button for the first time, compute the number of times the button must be pushed in order to get all the tokens to their initial positions (Modulo 10^9 + 7).\u003c/p\u003e\u003cp\u003eFor example, N \u003d 4 and the Pi\u0027s are: 4 1 2 3 The answer is 4:\u003c/p\u003e\u003cp\u003eInitially — 1 2 3 4\u003c/p\u003e\u003cp\u003ePush 1: — 2 3 4 1 (Token 1 goes to position 4, Token 2 goes to position 1, ...)\u003c/p\u003e\u003cp\u003ePush 2: — 3 4 1 2\u003c/p\u003e\u003cp\u003ePush 3: — 4 1 2 3\u003c/p\u003e\u003cp\u003ePush 4: — 1 2 3 4\u003c/p\u003e\u003cp\u003eThe maximum value of N is 10^6\u003c/p\u003e\u003cp\u003eI tried finding the disjoint cycles and computing the LCM of the lengths of them, but got TLE. Because of the modulo 10^9 + 7, the way I compute the LCM is obtaining the prime factorization of the lengths, keeping record of the maximum power of those prime factors, and multiplying them.\u003c/p\u003e\u003cp\u003eAfter receiving lots of Time Limit Exceeded verdicts I looked for help on the internet and found that this is a common Abstract Algebra problem called \u0026quot;The order of a Permutation Cycle\u0026quot;.The answer is the LCM of the lenghts of the disjoint cycles :(\u003c/p\u003e\u003cp\u003eI don\u0027t know if my method is too slow or there are many test cases and the time limit is extremely strict... To compute the length of the cycles I use a simple adhoc algorithm. Iterate over all the Pi\u0027s, if some position is not visited, start the cycle until finding a position already visited. I used fast input to handle large test data, but didn\u0027t worked...\u003c/p\u003e\u003cp\u003eThanks! :)\u003c/p\u003e\u003cp\u003eUPDATE: Here is my \u003ca href\u003d\"http://ideone.com/q6xSKd\"\u003ecode\u003c/a\u003e\u003c/p\u003e\u003cp\u003eUPDATE 2: Finally accepted! Doing the factorization with smallest prime factors and better ways to handle the modular arithmetic were the key to pass the time limit! Thanks all specially user \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Jacob\" title\u003d\"Grandmaster Jacob\"\u003eJacob\u003c/a\u003e for pointing that out :)\u003c/p\u003e\u003c/div\u003e","tags":["permutations","lcm","cycle"]}}