{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1513255605,"rating":31,"authorHandle":"savinova","modificationTimeSeconds":1513776109,"id":56343,"title":"\u003cp\u003eГрантовая программа в области Machine learning от Botan Investments — 3М начальных инвестиций\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ccenter\u003e \u003cdiv style\u003d\"width: 100.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/7f/cb/7fcb641ed9baf540da1129f465838db4cef8cd6c.png\" style\u003d\"width: 100.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e \u003c/center\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003eХочу сообщить о новой программе для преподавателей от Виктора Шабурова и фонда \u003cstrong\u003eBotan Investments\u003c/strong\u003e в области машинного обучения:\u003cbr /\u003e - 20 тысяч в месяц за организацию кружка в университете по машинному обучению\u003cbr /\u003e - 3 миллиона начальных инвестиций \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eУсловия программы:\u003c/strong\u003e\u003cbr /\u003e - Начало программы — январь 2018 г\u003cbr /\u003e - Нужно собрать минимум 6 человек (две команды) и проводить командные очные встречи как минимум два раза в неделю \u003cbr /\u003e - Тренировки проводятся на Kaggle, мы будем следить за количеством контестов и успехами в них. При необходимости будем требовать ежемесячные отчеты по участию в соревнованиях, гипотезах по решению, реализованных подходах и полученных результатах\u003cbr /\u003e - Если к маю 2018 г. студенты показывают хорошие результаты, то фонд готов выделить 3 миллиона рублей на создание прототипа коммерческого проекта\u003cbr /\u003e - Преподаватель получает долю в проекте и продолжает получать грант за организацию работы команд\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eПерспективы:\u003c/strong\u003e\u003cbr /\u003e - Уникальная возможность стать основателем стартапа в области machine learning\u003cbr /\u003e - Мы поможем с регистрацией компании, юридической поддержкой и поиском первых клиентов\u003cbr /\u003e - После успешного запуска прототипа объем финансовой помощи будет увеличен\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eКто может участвовать:\u003c/strong\u003e\u003cbr /\u003e - Преподаватели российских вузов (кроме Москвы)\u003cbr /\u003e - Преподаватель не должен являться студентом, он может быть сотрудником или аспирантом вуза\u003cbr /\u003e - Мы предполагаем, что преподаватель сфокусируется на этом кружке, поэтому участвовать сразу в двух программах Botan Investments для преподавателей нельзя\u003c/p\u003e\u003cp\u003eЕсли Вы набрали заинтересованных студентов и готовы участвовать, заполните \u003ca href\u003d\"https://docs.google.com/forms/d/1qw66yQI0F69jQPXb5xROrf1KBq7QwdddqSo9sCMTQzs/\"\u003eэту форму\u003c/a\u003e, и в середине января мы с Вами свяжемся. Количество участников ограничено, поэтому мы оставляем за собой право отказать в участии в программе без объяснения причины. \u003c/p\u003e\u003cp\u003eВсе вопросы по возможному участию в программе можно задать мне на \u003ca href\u003d\"mailto:edu@botaninvestments.com\"\u003eedu@botaninvestments.com\u003c/a\u003e или в комментариях.\u003c/p\u003e\u003c/div\u003e","tags":["botan investments","виктор шабуров","machine learning"]}}