{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1422530806,"rating":112,"authorHandle":"I_love_Tanya_Romanova","modificationTimeSeconds":1422575819,"id":16096,"title":"\u003cp\u003eSNWS 2015 Round 4 — screencast\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eSome time ago in russian discussion of SNWS 2015 \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ballon\" title\u003d\"Grandmaster ballon\"\u003eballon\u003c/a\u003e said that I should start recording screencasts of my participation in contests. It sounded like a joke for me, and I don\u0027t think that it is interesting for a large number of people; but still I decided to try something new and record one of contests, even if I am not going to do it on a regular basis in future. At least now I can save a lot of time while answering questions like \u0026quot;How are you coding\u0026quot;, \u0026quot;do you use debugger\u0026quot;, \u0026quot;do you prefer CodeBlocks or Visual Studio\u0026quot; and so on.\u003c/p\u003e\u003cp\u003eBelow you can see a screencast of my participation in SNWS 2015 Round 4. Problem statements are in russian. There are nothing interesting after 47th minute, when all tasks are done — only refreshing standings from time to time.\u003c/p\u003e\u003cp\u003e\u003cem\u003eP.S. For those of you who are not familiar with SNWS/SNSS — SnarkNews winter series/SnarkNews summer series is a contest series held every year; it consists of 5 rounds with virtual participation, TCM/Time rules for scoring a single round and Grand Prix 30 rules for overall standings of series. (You can read more about these scoring systems \u003ca href\u003d\"https://contest.yandex.ru/algorithm2014/rules/\"\u003ehere\u003c/a\u003e; starting from current season of SNWS 2nd place is getting 75 points instead of 80).\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eUsually problemset is in russian only, therefore most of contestants are from Post-Soviet states. Problemset usually consists of 6 problems, taken from other contests and rewritten in order to make it impossible to find given tasks using google; usually they are rather easy, comparing to problems from some longer individual contests or ACM ICPC contests, but you have only 80 minutes for whole problemset, so speed matters a lot here.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eYou may find current standings (without Round 5 yet) \u003ca href\u003d\"http://snws2015.snarknews.info/index.cgi?data\u003dsnws15/global\u0026amp;menu\u003dindex\u0026amp;head\u003dindex\u0026amp;mod\u003dsnws15\u0026amp;class\u003dsnws15\"\u003ehere\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003ciframe allowfullscreen\u003d\"\" frameborder\u003d\"0\" height\u003d\"315\" src\u003d\"https://www.youtube.com/embed/AnqTsRKZRfY\" width\u003d\"560\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e","tags":["screencast"]}}