{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1414237589,"rating":0,"authorHandle":"Fcdkbear","modificationTimeSeconds":1414243938,"id":14427,"title":"\u003cp\u003eРазбор задача от 19 октября\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href\u003d\"http://codeforces.ru/gym/100181\"\u003ehttp://codeforces.ru/gym/100181\u003c/a\u003e (Задача С)\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eЗадача может быть решена бором. Добавим все суфиксы строки в бор. Увтерждается, что количество различных подстрок строки равно количеству вершин в боре без учета корневой вершины (которая соответствует пустой строке). Действительно,когда мы добаляем очередной суфикс — мы пройдемся по всем подстрокам, начинающимся в определенной позиции. В случае если очередной переход в боре есть — такая подстрока уже была добавлена ранее, иначе же — она точно никогда не была добавлена и нам нужно ее добавить. Также легко видеть, что мы таким образом рассмотрим все подстроки исходной строки (так как переберем все пары \u0026quot;начало подстроки — конец подстроки\u0026quot;). Сложность решения — O(N^2)\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/2ymEJYjy\"\u003eКод\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href\u003d\"http://codeforces.ru/gym/100168\"\u003ehttp://codeforces.ru/gym/100168\u003c/a\u003e задача D\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eВ задаче требуется найти площадь треугольника. Как известно, модуль векторного произведения двух векторо равен площади параллелограмма, сторонами которого являются заданные вектора. Так же оно равно половине площади соответсвующего треугольника. Значит, просто посчитаем модуль векторного произведения двух векторов и разделим его на 2.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/2tEX6427\"\u003eКод\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"/contest/166/problem/B\" title\u003d\"Codeforces Round 113 (Div. 2)\"\u003e166B - Polygons\u003c/a\u003e\u003c/p\u003e\u003cp\u003eВ задаче требуется проверить, правда ли, что многоугольник В лежит строго нутри выпуклого многоугольника А. Идея решения: Обьеденим вершниы многоугольников в одно множество. Построим по этому множеству выпуклую оболчку (причем если какие-то точки лежат на стороне выпуклой оболочки — их нужно оставить). Если получившаяся оболока содрежит в себе вершины многоугольника В — ответ NO, иначе ответ YES\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/Mpdzz95U\"\u003eКод\u003c/a\u003e \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://contest.yandex.ru/khws2010/contest/229/problems/A/\"\u003ehttp://contest.yandex.ru/khws2010/contest/229/problems/A/\u003c/a\u003e\u003c/p\u003e\u003cp\u003eКак вам наверное рассказывал \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Igel_SK\" title\u003d\"Master Igel_SK\"\u003eIgel_SK\u003c/a\u003e на лекции, чтобы решить задачу, нужно использовать два вложенных тернарных поиска с золотым сечением (по каждой из координат центра нашего круга). Использовать именно такой тернарный поиск нужно для того, чтобы меньше раз пересчитывать целевую функцию (в этом случае ее пересчет — трудоемкая операция). Целевой функцией для первого тернарного поиска есть значение второго тернарного поиска при фиксрованной координате x. Целевой функцией для второго тернарного поиска есть значение минимального расстояния от точки с заданными координатами до сторон многоугольника. Еще, если вы пишите неоптимально, вам, возможно, придется попихать задачу (я, к примеру, перед аксептом получал тл 66, тл 77, тл 83).\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/BEw7wqPE\"\u003eКод\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["разбор"]}}