{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1423231035,"rating":28,"authorHandle":"NYanushkevich","modificationTimeSeconds":1426118774,"id":16241,"title":"\u003cp\u003eGoTo Camp: Выездная школа для учащихся 8-11 классов по робототехнике и прикладному программированию\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПриглашаем школьников на весеннюю выездную школу GoTo Camp, посвященную проектной работе в области робототехники и прикладного программирования. Школа пройдет с 22 по 29 марта в Подмосковье, заявки принимаются до 15 марта включительно. Работать с участниками школы будут сотрудники Яндекса, ABBYY и Крока, преподаватели МФТИ, ВШЭ и УрФУ. \u003c/p\u003e\u003cp\u003eЧто ждет участников? \u003c/p\u003e \u003cul\u003e   \u003cli\u003eОсвоение новых технологий, знаний и навыков;\u003c/li\u003e   \u003cli\u003eКомандная работа над проектами;\u003c/li\u003e   \u003cli\u003eНовые друзья и единомышленники;\u003c/li\u003e   \u003cli\u003eЗнакомство с интересными людьми, успешно создающими различные проекты;\u003c/li\u003e   \u003cli\u003eВесенние каникулы, в которых будет место самостоятельности и ответственности, отдыху и работе, приключениям и праздникам.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eУ каждого из участников лагеря будет возможность реализовать проект в одной из двух областей на выбор:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eРобототехника на платформе Arduino;\u003c/li\u003e   \u003cli\u003eРазработка приложений: серверных, мобильных, с графическим и web-интерфейсами.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eПроекты могу быть из самых разных областей: компьютерные игры, образование, социальные сети, медицина, домашнее хозяйство, математика, музыка, промышленность, астрономия и т. д. — программирование и робототехника могут оказаться полезными в самых неожиданных ситуациях.\u003c/p\u003e\u003cp\u003eЗа 7 дней проектные команды пройдут все стадии от идеи до реализации и представят проекты экспертам из области IT и робототехники. Подать заявку, узнать подробности и посмотреть проекты, сделанные участниками зимней школы GoTo Camp можно на сайте \u003ca href\u003d\"http://goto.msk.ru/\"\u003ehttp://goto.msk.ru/\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["abby","крок","мфти"]}}