{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1425005605,"rating":358,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1425040058,"id":16658,"title":"\u003cp\u003eCodeforces 5 years: Great news!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces!\u003c/p\u003e\u003cp\u003eI am happy to announce that the indicated $10000 support fund was raised in a little more than three days! Thanks you very much friends!\u003c/p\u003e\u003cp\u003eNow it became possible to pay the writers equivalent funds even they are in rubles. It was impossible because of great increase of the dollar exchange rate.\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eRound type\u003c/th\u003e       \u003cth\u003eUSD\u003c/th\u003e       \u003cth\u003eRubles\u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003eDiv 1 + Div 2\u003c/td\u003e       \u003ctd\u003e$250+*$50 \u003c/td\u003e       \u003ctd\u003e18000 rub \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003eDiv 2 \u003c/td\u003e       \u003ctd\u003e$100+*$50 \u003c/td\u003e       \u003ctd\u003e9000 rub \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003e\u003csmall\u003eWe tie the money paid in rubles to the Central Bank of Russia exchange rate, rounded to the closest sum in rubles divisible by 5 (according to the rules of mathematical rounding). The table shows the values that were up-to-date when this post was published. An asterisk marks the bonus that is given if the round is prepared perfectly. \u003c/small\u003e\u003c/p\u003e\u003cp\u003eAnd that is not all! As I said before, we now have the opportunity to adequately support the coordinator of the Codeforces problems Max \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Zlobober\" title\u003d\"Grandmaster Zlobober\"\u003eZlobober\u003c/a\u003e Akhmdov. He started working on his position in the fall of 2014 and more than two dozens of rounds have been conducted under his guidance. Preparing rounds takes a lot of work and he copes brilliantly. I hope to work with him efficiently for many more years to come.\u003c/p\u003e\u003cp\u003eI asked Max to write several words about himself for you to get to know him better and that\u0027s the result:\u003c/p\u003e\u003cp\u003e\u003cem\u003eHi!\u003c/em\u003e \u003cem\u003eSome personal info: I graduated from the Advanced Educational Scientific Center of Moscow State University named after A.N. Kolmogorov. When I was a school student, I went to the IOI 2012, earned the gold medal and the absolute seventh place in the Russian National Team. My biggest achievements include the 5-th place at the Russian Code Cup 2014, the 10-th place in 2013 and the 3-rd place in 2014 on NEERC as a member of the Moscow SU Trinity team. I won the all-Syberian Pottosin’s Olympiad in 2013 and the ICL 2014 cup as the member of the same team.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eI like music. I listen to all sorts of heavy and not so heavy rock, I go to concerts. I play several musical instruments. I am a jury member in many school programming Olympiads. The last book I\u0027ve read is ‘Chapayev and Void’ by Pelevin. It\u0027s hard to choose a favorite movie — I like movies by Quentin Tarantino, Robert Rodríguez and Christopher Nolan.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThat\u0027s about it.\u003cbr /\u003e Max.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eThe fund-raising campaign will continue for quite a while and I sincerely believe that there are other participants who will support us these days. We continue raising funds (that is a standard crowdfunding procedure) and we will be happy to to fulfill all obligations of award the supporters. For example, those who supported us and chose the \u0027badge in profile\u0027 reward option have recently got badges of honor in their profiles, the symbol of your taking part in and being part of the Codeforces development. Certificates and T-shirts will be sent after the fund raising stops. Please, be a little more patient.\u003c/p\u003e\u003cp\u003eAll the raised extra funds will be used to develop and support Codeforces, namely (provided that we\u0027ve got enough of the collected budget):\u003c/p\u003e \u003cul\u003e   \u003cli\u003eincrease the payments for Div1+Div2 rounds — may there be more of them!\u003c/li\u003e   \u003cli\u003eintroduce a content manager into the team who will regularly add and systemize the trainings;\u003c/li\u003e   \u003cli\u003ewe will soon definitely need new hardware and we will be able to get buy it;\u003c/li\u003e   \u003cli\u003ewe will strengthen the team of developers to make you happier with more cool features!\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThanks for your support,\u003cbr /\u003e Mike Mirzayanov\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","5years"]}}