{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1432568425,"rating":9,"authorHandle":"CrazzyBeer","modificationTimeSeconds":1432571781,"id":18096,"title":"\u003cp\u003eA problem.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHowdy! I have an idea for a problem.\u003c/p\u003e\u003cp\u003eCody studies in a special school. Teachers there value children\u0027s work with integer marks from 1 to 10. Soon the teachers will start to calculate the \u003cstrong\u003efinal\u003c/strong\u003e mark. Cody is a principled boy, so he wants his final mark to \u003cstrong\u003ebe equal\u003c/strong\u003e to \u003ccode\u003eM\u003c/code\u003e. He already looked in the mark-book and he knows that he has \u003ccode\u003eN\u003c/code\u003e marks and their values. Cody doesn\u0027t want to work much so he wants to get as few marks, as possible. Help Cody by telling him how many marks should he recieve and list the exact values.\u003c/p\u003e\u003cp\u003eThe \u003cstrong\u003efinal\u003c/strong\u003e mark is calculated this way: the teacher sums all the marks and divides them with the number of marks. Ex: The final mark of : 1 2 3 4 5 will be 3. \u003c/p\u003e\u003cp\u003e\u003ccode\u003eInput\u003c/code\u003e: First line contains numbers \u003ccode\u003eN\u003c/code\u003e and \u003ccode\u003eM\u003c/code\u003e, the number of marks already in the list and the final mark he wants. The second line containts \u003ccode\u003eN\u003c/code\u003e integer numbers — the marks in the list.\u003c/p\u003e\u003cp\u003e\u003ccode\u003eOutput\u003c/code\u003e: First line must contain the number \u003ccode\u003eX\u003c/code\u003e of integer marks he should work at and on the second line you must list them. If the solution doesn\u0027t exist — print -1.\u003c/p\u003e\u003cp\u003eTest 1. Input\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e 5 5\n 1 5 9 7 2\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eOutput\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e 1\n 6\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eTest 2. Input\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e 3 8\n 1 2 3\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eOutput\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e 9\n 10 10 10 10 10 10 10 10 10\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eSuggest your ideas of solving and, the most important, suggest the maximum value of N, for the solution to be within 1 and 3 seconds. Almost sure in the test examples, but if you see a mistake — feel free to write about it in the comments. In my opinion, this problem with relatively small N\u0027s could be in a Div.2 contest as A or B problem.\u003c/p\u003e\u003c/div\u003e","tags":["sums","arithmetic","inequalities"]}}