{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1508016140,"rating":24,"authorHandle":"misis","modificationTimeSeconds":1508099797,"id":55188,"title":"\u003cp\u003eMOSCOW PROGRAMMING CONTEST: КАК ЭТО БЫЛО\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eНаверное, многие из вас знают, что в этом году в Московском регионе четвертьфинал разделили на отборочный и основной туры, 8 и 22 октября, соответственно. В преддверии основного этапа мы решили рассказать, как организовывалась наша площадка к отборочному этапу четвертьфинала, то есть по сути к 1/8. Вообще этот раунд проводился на десяти площадках ведущих московских ВУЗов, в том числе и у нас в НИТУ «МИСиС». В этом году мы приняли 38 команд, из которых 34 представляли наш университет, и тем самым поставили два личных рекорда. Во-первых, мы впервые организовали такую массовую площадку, во-вторых, впервые смогли выставить более 30 команд от ВУЗа.\u003c/p\u003e\u003cp\u003eСоздание площадки для соревнования по программированию — это трудоемкая задача. Для начала требуется найти достаточно компьютеров для проведения соревнования и уговорить кафедры, которым они принадлежат, ими поделиться. Как правило, нам для своих занятий хватает компьютеров своей кафедры, но неожиданно большое количество команд, зарегистрировавшихся в МИСиС, заставило нас задуматься. В итоге в качестве дополнительного кабинета была выбрана библиотека, где стоят компьютеры, доступные студентам для выполнения домашних заданий и просто для отдыха. Но найти компьютеры — это полбеды. На них надо еще установить виртуалки со средами разработки и ограничениями доступа в интернет. Тут можно было бы написать, как наши студенты под руководством Дарьи этим занимались, но фото лучше тысячи слов.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/a2/3a/a23aca39c9f535073f73c750d87ce44ac487469e.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eКонечно, не обошлось без небольших технических накладок, но все они были выявлены на этапе пробного тура, предназначенного как раз для проверки системы, и решены до начала основного соревнования.\u003c/p\u003e\u003cp\u003eМы хотим поблагодарить все команды, пришедшие к нам на площадку, за интерес, проявленный к нашему ВУЗу и соревнованию в целом, и надеемся, что в следующем году вы снова придете к нам и сагитируете товарищей на подобную авантюру :) К тому же мы были приятно удивлены количеством команд МИСиС, пришедших на соревнование, ведь раньше мы не выставляли больше 15 команд! В целом, мы, как тренерский состав, довольны и организацией площадки \u003cstrike\u003eсам не похвалишь, никто не похвалит\u003c/strike\u003e, и выступлением наших команд. По итогам этого раунда 6 команд НИТУ «МИСиС» прошли в следующий раунд, который состоится уже 22 октября на площадках МГУ и МФТИ:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eAstral Squash (Tarannikov, Kodosov, Piskevich)\u003c/li\u003e   \u003cli\u003eDaEtoTak (Lyanov, Dobrynin, Borisov)\u003c/li\u003e   \u003cli\u003eFeministi+Seksistka (Chirvonaya, Mayorov, Vasiljev)\u003c/li\u003e   \u003cli\u003ePomandoro (Ivanov, Kholodiakov, Ilyuhin)\u003c/li\u003e   \u003cli\u003eSeal (Kulagin, Razumnuy, Erdneev)\u003c/li\u003e   \u003cli\u003eNo Ideas (Savelyev, Chernyshova, Gerk)\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/14/05/14050fb8cdcd69007007f6efd59a83d49f380451.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e\u003cp style\u003d\"margin: 0 auto 10.0px;text-align: center;\"\u003e Astral Squash (Tarannikov, Kodosov, Piskevich) \u003c/p\u003e\u003cp\u003eПосле контеста всем участникам были предложены пицца, чай и кофе, а во время самого соревнования в качестве перекуса — сэндвичи, печенье, батончики и питьевая вода.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/9b/26/9b26db272206d6965d703900d86e9e6819f35685.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eВсе это стало возможным благодаря организационным партнерам, которые поддержали нашу площадку в этом году. Такие производители, как ООО \u0026quot;Королевская вода\u0026quot;, КО «Любимый Край», ООО «Матти рус», а также Domino’s Pizza Russia предоставили продукцию для участников соревнования на площадке НИТУ «МИСиС». Мы благодарны им за поддержку и надеемся, что наши партнеры еще не раз в будущем накормят участников 1/8 чемпионата мира по программированию.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/18/be/18be0d4a9acf09924ba1ae3e811945083fad8370.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eТакже для многих приятным сюрпризом стало вручение всем участникам площадки футболок, специально напечатанных для данного мероприятия. Мы хотим поблагодарить нашего спонсора, компанию Cognitive Technologies, благодаря которой этот сюрприз стал возможен. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/87/43/87436576f6f7aab3c8b4df5eeceedab660d25a3f.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}