{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1492461429,"rating":108,"authorHandle":"isaf27","modificationTimeSeconds":1492461429,"id":51614,"title":"\u003cp\u003eНовый тип олимпиадных задач по программированию\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЗдравствуйте.\u003c/p\u003e\u003cp\u003eКак известно, на данный момент существует два распространённых вида олимпиадных задач — стандартная и интерактивная. \u003c/p\u003e\u003cp\u003eНедавно, решая задачи по математике, я наткнулся на задачу следующего вида — ставится фокус с участием зрителя, фокусника и его помощника. Cначала зритель загадывает некоторый объект, который определен в условии задачи (последовательность чисел, строка и тд). После этого помощник как-то его изменяет, что тоже определено в условии. После этого входит фокусник и, по тому что он видит, угадывает то, что загадал зритель. Конечно помощник и фокусник договариваются о том, как помощнику изменить объект, чтобы потом фокусник мог его отгадать. Чаще всего суть задачи состоит в том, чтобы понять, как им договориться.\u003c/p\u003e\u003cp\u003eКак мне кажется, было бы интересно делать такие задачи и по программированию. На простом примере разберем как это можно сделать. Следующая задача: зритель загадывает последовательность из 10 цифр, после чего помощник должен закрыть одну из цифр. Далее фокусник, видя последовательность с одной закрытой цифрой, должен отгадать, какую цифру закрыли. Решение очень простое: пусть помощник, увидев последовательность \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e0\u003c/sub\u003e, \u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e1\u003c/sub\u003e, ..., \u003ci\u003ea\u003c/i\u003e\u003csub class\u003d\"lower-index\"\u003e9\u003c/sub\u003e\u003c/span\u003e, закроет цифру под номером \u003cimg align\u003d\"middle\" class\u003d\"tex-formula\" src\u003d\"/predownloaded/c1/aa/c1aa2a9808fe47bc95601bbd2f0662060a7d922a.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e. Фокусник видя номер закрытой цифры и сумму всех, кроме неё, может вычесть из номера эту сумму по модулю 10 и получить цифру, которая закрыта. Теперь участнику предлагается написать решение следующим образом: сначала ему будет вводиться число 0 или 1. Если число 0, то это будет означать, что его программа выступает в роли помощника в данный момент, 1 если в роли фокусника. После строка длины 10 — сама последовательность. Если первое число 0, то она будет состоять только из цифр, если первое число 1, то закрытый символ будет \u0027x\u0027, например. И тогда, если программа — помощник, нужно вывести номер закрываемой цифры, если фокусник, то назвать загаданную цифру. Чтобы проверить решение нужно будет запустить решение участника с вводом 0 + последовательность, далее считать номер закрытой цифры и ещё раз запустить решение участника с вводом 1 + последовательность с одной закрытой цифрой и сверить ответ участника с правильным. Отличие от обычных задач — то, что требуется запустить программу участника два раза при проверке на одном тесте.\u003c/p\u003e\u003cp\u003eХороших задач по математике такого и похожего типа достаточно много. Мне кажется, что это интересная идея, хотя и очень непросто реализуемая. Было бы круто, если этот или другой вид задач начал развиваться, как это было с интерактивными задачами. \u003c/p\u003e\u003cp\u003eСпасибо за внимание. Буду рад услышать ваши мнения и идеи по этому поводу.\u003c/p\u003e\u003c/div\u003e","tags":["#идея"]}}