{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1491328303,"rating":296,"authorHandle":"Zlobober","modificationTimeSeconds":1491984257,"id":51427,"title":"\u003cp\u003eYandex.Algorithm 2017\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eWe are announcing the annual Yandex.Algorithm 2017 championship! This is a great opportunity to compete with the strongest programmers of the world, win a fancy T-shirt, visit Yandex office or even receive some serious money prize.\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/38/c0/38c0388d08f39e8eefec2144ab040cb12983b5db.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003c/p\u003e\u003ccenter\u003e\u003ch3\u003e\u003ca href\u003d\"https://contest.yandex.com/algorithm2017/schedule/\"\u003eComplete schedule\u003c/a\u003e\u003c/h3\u003e\u003c/center\u003e\u003cp\u003eIn order to take place in the main part of the competition you must participate in at least one of the Warm-Up round (\u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dYandex.Algorithm+2017+Warm-up+round\u0026amp;iso\u003d20170422T16\u0026amp;p1\u003d166\u0026amp;ah\u003d1\u0026amp;am\u003d40\"\u003eApril 22nd, 16:00 Moscow Time\u003c/a\u003e) and Qualification round (\u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dYandex.Algorithm+2017+Qualfication+round\u0026amp;iso\u003d20170429T00\u0026amp;p1\u003d166\"\u003eApril 29nd or 30th, virtual participation\u003c/a\u003e) and solve at least one problem in some of them.\u003c/p\u003e\u003cp\u003eAs you may have noticed, this year we have a new kind of round, the Marathon round. Unlike the rest of the rounds that use our traditional TCM/Time system, in this round you have to implement the most efficient approximate approach for some challenging problem that does not (presumably) allow exact solution. This round lasts for two days, in order for you to be able to choose an appropriate time frame for working on the problem. This round is equivalent to the remaining three elimination rounds in terms of the contribution to your final elimination result.\u003c/p\u003e\u003cp\u003eTop-512 participants according to the result in four elimination rounds (three regular rounds and one marathon round) will receive T-shirts with the competition logo. Also, participants that are interested in the internship opportunity at Yandex during the summer 2017 may participate in the Internship Track of the competition (by choosing the corresponding option in the registration form). The best participants of the Internship Track will be invited to the interview for the intern role in Yandex.\u003c/p\u003e\u003cp\u003eThe Final round of the competition will take place on July 18th in Yandex Moscow office. Aside from top-25 participants, whose housing during the event will be covered by the organizers, we invite everybody from top-100 to come to the competition venue at the Finals day in order to participate in the Final round unofficially and find new friends among the competitive programmers fellowship and the Yandex employees! Those participants among top-25 who decide not to travel to Moscow are allowed to participate in the final round in online.\u003c/p\u003e\u003cp\u003ePrizes for the top contestants in Yandex.Algorithm 2017:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e1st place: 300,000 RUB\u003c/li\u003e   \u003cli\u003e2nd place: 150,000 RUB\u003c/li\u003e   \u003cli\u003e3rd place: 90,000 RUB\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe detailed information about the competition is specified in the \u003ca href\u003d\"https://contest.yandex.com/algorithm2017/rules/\"\u003erules\u003c/a\u003e of championship.\u003c/p\u003e \u003ccenter\u003e\u003ch3\u003e\u003ca href\u003d\"https://contest.yandex.com/algorithm2017/register/\"\u003eRegister!\u003c/a\u003e\u003c/h3\u003e\u003c/center\u003e\u003cp\u003eRegistration is open till the end of qualification round. See you in the competition! :)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD (Apr 7th)\u003c/strong\u003e: Currently authorization with use of social networks \u003cstrong\u003edoesn\u0027t work\u003c/strong\u003e for the English version of site. This is going to be fixed in several days, right now you may register by creating Yandex account.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD (Apr 11th)\u003c/strong\u003e: Registration works fine now.\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/86/a2/86a21016614c7c04ba4be81019fa288fc5f629b7.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["yandex.algorithm 2017","t-shirts","algorithm","internship"]}}