{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1433023640,"rating":71,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1433023788,"id":18238,"title":"\u003cp\u003eЛетняя школа Сазанка-2015\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"//assets.codeforces.com/photos/sazanka-2010/large-IMG_2742.JPG\" style\u003d\"width: 350.0px;float: right;margin: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch3\u003eОбщая информация\u003c/h3\u003e\u003cp\u003eСаратовский государственный университет в первой половине августа проводит международную летнюю студенческую школу по программированию. Продолжительность школы — десять дней, школа пройдет с 3-го по 13-е августа 2015 года.\u003c/p\u003e\u003cp\u003eК участию приглашаются как команды из двух-трех человек, так и индивидуальные участники.\u003c/p\u003e\u003cp\u003eШкола пройдет в живописном месте, на одной из саратовских баз отдыха на берегу Волги. Участники будут расселены в уютных номерах по 2-4 человека и обеспечены трехразовым питанием. На территории базы имеется собственный пляж и спортивные площадки.\u003c/p\u003e\u003cp\u003eВ программе школы запланировано 10 рабочих дней, включающих ежедневные пятичасовые тренировки, разборы задач, дорешивания. Будет прочитана серия лекций. Учебная программа рассчитана на студентов младших и средних курсов, которые хотят достичь значительных успехов на соревнованиях по программированию. \u003cimg src\u003d\"//assets.codeforces.com/files/sazanka-2015/IMG_2604.JPG\" style\u003d\"width: 330.0px;float: left;margin: 1.0em 2.0em 1.0em 0;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eПримерные темы лекций, на все темы будет обширная практика (возможны изменения):\u003c/p\u003e \u003cul\u003e   \u003cli\u003ez-функция строки, свойства, линейный алгоритм построения, задачи\u003c/li\u003e   \u003cli\u003eпрефикс-функция строки, свойства, линейный алгоритм построения, алгоритм Кнута-Морриса-Пратта, задачи\u003c/li\u003e   \u003cli\u003eструктура данных бор, задача о множественном поиске образцов в тексте, алгоритм Ахо-Корасик\u003c/li\u003e   \u003cli\u003eструктура данных суффиксный массив\u003c/li\u003e   \u003cli\u003eструктура данных суффиксное дерево\u003c/li\u003e   \u003cli\u003eструктура данных суффиксное автомат\u003c/li\u003e   \u003cli\u003eдекомпозиция Линдона, алгоритм Дюваля, нахождение наименьшего циклического сдвига\u003c/li\u003e   \u003cli\u003eиспользование строковых хеш-функций\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eБольшинство лекций будут прочитаны Мирзаяновым М.Р. Тренировки будут включать как нетематические, так и тематические контесты/задачи.\u003c/p\u003e\u003cp\u003eОрганизационный сбор составляет 17000 рублей на одного участника. Кроме того, каждая команда или индивидуальный участник должны привезти с собой ноутбук (с поддержкой WI-FI). В стоимость оргвзноса включается проживание на базе отдыха, трехразовое питание, учебная программа.\u003c/p\u003e\u003cp\u003eЗаинтересованным участникам и командам необходимо пройти предварительную регистрацию по адресу \u003ca href\u003d\"http://goo.gl/forms/AAzHnozuEg\"\u003ehttp://goo.gl/forms/AAzHnozuEg\u003c/a\u003e до 20 июня 2015 года. Не откладывайте регистрацию, так как количество мест ограничено. Полностью и аккуратно заполните форму регистрации, введите информацию по каждому члену команды. Обязательно указывайте хэндлы и не игнорируйте пункт об успехах участников.\u003c/p\u003e\u003cp\u003eДополнительную информацию можно получить по телефону 88452522711 или по электронной почте mirzayanovmr-на-гмейле.\u003c/p\u003e\u003ch3\u003eО Саратовском государственном университете\u003c/h3\u003e\u003cp\u003eСаратовский государственный университет регулярно добивается значительных успехов на соревнованиях по программированию.Ниже приведены основные достижения университета на международных соревнованиях: \u003c/p\u003e \u003cul\u003e   \u003cli\u003e2002 г. Титул чемпионов Европы, комплект серебряных медалей на чемпионате мира ACM-ICPC 2002.\u003c/li\u003e   \u003cli\u003e2003 г. Комплект серебряных медалей на чемпионате мира ACM-ICPC 2003.\u003c/li\u003e   \u003cli\u003e2006 г. Титул чемпионов мира, чемпионов Европы, комплект золотых медалей на чемпионате мира ACM-ICPC 2006.\u003c/li\u003e   \u003cli\u003e2007 г. Комплект серебряных медалей на чемпионате мира ACM-ICPC 2007.\u003c/li\u003e   \u003cli\u003e2008 г. Чемпионы России и NEERC.\u003c/li\u003e   \u003cli\u003e2009 г. Комплект золотых медалей на чемпионате мира ACM-ICPC 2009.\u003c/li\u003e   \u003cli\u003e2010 г. Комплект серебряных медалей на чемпионате мира ACM-ICPC 2010.\u003c/li\u003e   \u003cli\u003e2011 г. Комплект серебряных медалей на чемпионате мира ACM-ICPC 2011.\u003c/li\u003e   \u003cli\u003e2013 г. Третье место на полуфинале NEERC чемпионате мира ACM-ICPC 2014.\u003c/li\u003e   \u003cli\u003e2013-2014 г.г. На двух последних полуфиналах NEERC-2013 и NEERC-2014 две команды СГУ в топ-15 (всего таких вузов 4-5).\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eКроме того, студенты и тренеры СГУ неоднократно становились участниками финальных этапов соревнований TopCoder, Google Code Jam, Facebook Hacker Cup и других.\u003c/p\u003e\u003cp\u003eРуководитель Центра олимпиадной подготовки\u003cbr /\u003e Саратовского государственного университета, тренер команд. \u003cbr /\u003e основатель и руководитель Codeforces\u003c/p\u003e\u003cp\u003eМ.Р. Мирзаянов\u003c/p\u003e\u003cp\u003eP.S. Дополнительное представление о школе могут дать \u003ca href\u003d\"https://plus.google.com/photos/114907919772955385569/albums/6047478362347929089\"\u003eфотографии прошлого года\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["сгу","сборы","сазанка","лето","2015","acm"]}}