{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1418223114,"rating":18,"authorHandle":"chaotic_iak","modificationTimeSeconds":1418223114,"id":15102,"title":"\u003cp\u003eAdd edges to a digraph to make it strongly connected\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI was working on an interesting problem. (Tip: Homework of algorithm courses can be fun!)\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eFind the minimum number of (directed) edges to introduce into a directed graph to make it strongly connected (from any vertex you can go to any other vertex). Also, find one configuration of edges to add that satisfies the property and reaches the minimum.\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003eI wonder if this problem is a well-known problem, and if any, what name it is known with? I saw \u003ca href\u003d\"http://stackoverflow.com/questions/14305236/minimal-addition-to-strongly-connected-graph\"\u003ethis Stack Overflow question\u003c/a\u003e which asks about the minimum number of edges only, not finding one such configuration, and it\u0027s said to be \u0026quot;a really classical problem\u0026quot;.\u003c/p\u003e\u003cp\u003eI also wonder if there is a more efficient algorithm. My algorithm works in \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eO\u003c/i\u003e(\u003ci\u003eV\u003c/i\u003e\u003csup class\u003d\"upper-index\"\u003e3\u003c/sup\u003e)\u003c/span\u003e, which involves several steps to reduce the graph in question into a directed acyclic graph, a weakly connected directed acyclic graph, a connected bipartite graph, and finally giving the answer. A friend says that there is a literature on the internet giving \u003cimg align\u003d\"middle\" class\u003d\"tex-formula\" src\u003d\"/predownloaded/13/2f/132fc2337d4e48b80d21b038f6ad0fb0334412f7.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e algorithm, but I haven\u0027t managed to find it. Or is there an even better algorithm?\u003c/p\u003e\u003c/div\u003e","tags":["directed graph","graph","graph theory","strongly connected","construction"]}}