{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1517492369,"rating":74,"authorHandle":"natalia","modificationTimeSeconds":1526639951,"id":57477,"title":"\u003cp\u003eОнлайн-курс \u0026quot;Математика для олимпиад по программированию\u0026quot; — запуск 2\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДорогие посетители Codeforces!\u003c/p\u003e\u003cp\u003eНа платформе Stepik планируется повторный запуск курса Самарского университета \u003ca href\u003d\"https://stepik.org/course/4603\"\u003eМатематика для олимпиад по программированию\u003c/a\u003e. Курс откроется 22 мая.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/25/d2/25d2a31e2ebbdcbfd07c3af5f640d3afdca7d4fc.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eПервый запуск, как мы считаем, прошел довольно успешно. Мы получили много ценных отзывов и комментариев от наших слушателей, и сейчас курс закрыт на доработку. Какие изменения вас ждут после запуска:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eКо всем задачам проверочных тестов добавлены правильные решения.\u003c/li\u003e   \u003cli\u003eДобавлены 35 дополнительных задач повышенной сложности, которые будут интересны в том числе и тем, кто уже прошел курс в первый раз.\u003c/li\u003e   \u003cli\u003eКурс будет запущен без дедлайнов, и это означает, что его можно будет проходить в удобном для себя темпе (тем более, что нас ждут экзамены/лето/...).\u003c/li\u003e   \u003cli\u003eВ связи с добавлением новых задач и снятием дедлайнов, будут немного повышены пороги для получения сертификата, что сделает его получение еще более интересным и почетным.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eИдея этого курса возникла благодаря студенческим математическим кружкам, которые я вела в Саратовском и Самарском университетах. Курс строится на решении и разборе математических задач по темам, полезным для начинающего спортивного программиста:\u003c/p\u003e \u003col\u003e   \u003cli\u003eКомбинаторика.\u003c/li\u003e   \u003cli\u003eТеория чисел.\u003c/li\u003e   \u003cli\u003eГеометрия.\u003c/li\u003e   \u003cli\u003eИнварианты и полуинварианты.\u003c/li\u003e   \u003cli\u003eТеория игр.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eПо своему уровню курс рассчитан на Div 2 и новичков, но, возможно, некоторые задачи поставят в тупик и более опытных участников. Все успешно завершившие курс получат сертификаты Самарского университета.\u003c/p\u003e\u003cp\u003eВ общем, записывайтесь на курс, будет интересно!\u003c/p\u003e\u003c/div\u003e","tags":["онлайн-курс","stepik","математика","самарский университет","привет самарским троллям"]}}