{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1523219937,"rating":71,"authorHandle":"MStrechen","modificationTimeSeconds":1525703274,"id":58826,"title":"\u003cp\u003eРезультаты Всеукраинской олимпиады по информатике 2018 года\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch4\u003eXXXI-ая Всеукраинская олимпиада по информатике проходила в г. Николаев со второго по шестое апреля.\u003c/h4\u003e\u003cp\u003eВ этом году я оказался, можно сказать, по другую сторону баррикад — принимал участие во Всеукраинской олимпиаде в качестве члена жюри, а не участника. Что хотелось бы сказать... Было действительно круто, я познакомился с несколькими действительно интересными людьми, надеюсь на стабильный контакт. Проблемсет, с моей точки зрения, получился удачным и очень-очень интересным. Возможно, некоторым участникам он покажется иным — о вкусах, как говорится, не спорят. Условия проживания участников, увы, оставляли желать лучшего (об этом я, правда, узнал из блога \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Dalgerok\" title\u003d\"Expert Dalgerok\"\u003eDalgerok\u003c/a\u003e). Надеюсь, это штука временная и в последующих годах ситуация будет меняться в лучшую сторону.\u003c/p\u003e\u003cp\u003eК сожалению, таблички, как в прошлом году, в блог выкладывать не буду, однако по ссылке \u003ca href\u003d\"http://bit.ly/UOI-2018\"\u003ehttp://bit.ly/UOI-2018\u003c/a\u003e можно найти материалы олимпиады, в том числе и результаты. Сейчас там отсутствуют тесты и авторские решения, но в скором времени это будет исправлено. Большая часть материалов, правда, на украинском — возможно, кому-то усложнит восприятие.\u003c/p\u003e\u003cp\u003eНадеюсь, что задачи в скором времени появятся на каком-то онлайн джадже (чем смогу, тем поспособствую \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD1\u003c/strong\u003e: по ссылочке \u003ca href\u003d\"https://www.e-olymp.com/ru/contests/10239\"\u003ehttps://www.e-olymp.com/ru/contests/10239\u003c/a\u003e можно решать задачи первого тура олимпиады. Вскоре появится и второй тур!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2\u003c/strong\u003e: второй тур олимпиады доступен по ссылке \u003ca href\u003d\"https://www.e-olymp.com/ru/contests/10279\"\u003ehttps://www.e-olymp.com/ru/contests/10279\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["uoi","uoi2018"]}}