{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1420537328,"rating":33,"authorHandle":"RodionGork","modificationTimeSeconds":1420537385,"id":15619,"title":"\u003cp\u003eHalf-year News from CodeAbbey\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eAbout half a year ago \u003ca href\u003d\"//codeforces.com/blog/entry/12556\"\u003eI posted there announcement\u003c/a\u003e of my site \u003ca href\u003d\"http://www.codeabbey.com\"\u003eCodeAbbey\u003c/a\u003e. Since then the site have been evolving by and by (many thanks to all people who provided invaluable hints and suggestions!) — and few of them looks funny enough to me so that I\u0027m eager to tell a bit about two of them.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCertificates\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThey [are awarded] for certain achievements (currently for 125 problems) — and are shown in profile — though you can also print it and hang above your desk. Of course they are still useless papers, but they are somewhat funny I think:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"Certificate for Nicolas Patrois\" src\u003d\"/predownloaded/a5/72/a572ece3c0496b885e200f2a0098e58ae3407566.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eCertificates bear unique number on them so that their authenticity could be verified on site. You may read more \u003ca href\u003d\"http://www.codeabbey.com/index/certificate\"\u003ehere\u003c/a\u003e about them. \u003c/p\u003e \u003chr /\u003e\u003cp\u003e\u003cstrong\u003eInteractive problems\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThey were introduced recently — to solve the problem user is to play a kind of game against a server. HTTP Post requests are used for interchange (sample code fragments in Python are provided).\u003c/p\u003e\u003cp\u003eCurrently \u003ca href\u003d\"http://www.codeabbey.com/index/task_list/interactive\"\u003ethere are only four such problems\u003c/a\u003e:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eSay 100 — simple test that you can work with HTTP;\u003c/li\u003e   \u003cli\u003eNim Game — also simple but allowing several moves;\u003c/li\u003e   \u003cli\u003eMaze of the Wumpus — by the motives of old game — requiring a bit of heuristic I suppose;\u003c/li\u003e   \u003cli\u003eConnect Four — once popular tic-tac-toe-like game allowing to practice minimax algorithm.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThough of course I hope to add more in future — and to improve clumsy infrastructure of these games also, he-he :)\u003c/p\u003e \u003chr /\u003e\u003cp\u003e\u003cstrong\u003eConcluding\u003c/strong\u003e I\u0027d say it appeared to be a funny matter to try building my own site, though small and puny. Besides other things it made me acquainted with several interesting people all around the world — I hope I\u0027ll be able to write about some of them later in separate posts.\u003c/p\u003e\u003c/div\u003e","tags":["im a cute tag"]}}