{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1425213817,"rating":107,"authorHandle":"allllekssssa","modificationTimeSeconds":1425222712,"id":16699,"title":"\u003cp\u003eOnly Div 2 round \u003d BIG PROBLEM\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello CF community!\u003c/p\u003e\u003cp\u003eThis blog is my way to draw attention and perhaps start an initiative to solve one big problem on Codeforces.\u003c/p\u003e\u003cp\u003eBefore every only div 2 round,CF get hundreds of \u0027new ingenious users\u0027 , and they done all problems, have around 5-6 hacks per round and become candidate masters.That means no opportunity for regular div 2 competitors to jump with rating and feel how to be a winner.Maybe this is unsolved problem , but if we try together to stop this , I belive that we will achieve ceratin results.\u003c/p\u003e\u003cp\u003eNow I will write some of my suggestions , I\u0027d love to read your :)\u003c/p\u003e\u003cp\u003eFirst:\u003c/p\u003e\u003cp\u003eDiv 1 competitions are rarely ,but everybody who prepare tasks for only div 2 contest can ask someone with a high rating to help him around the idea of the most difficult problems.This is certainly reduce only div 2 contest.I think that the best users like \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e ,\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Petr\" title\u003d\"Legendary grandmaster Petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eP\u003c/span\u003eetr\u003c/a\u003e,\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/WJMZBMR\" title\u003d\"International Grandmaster WJMZBMR\"\u003eWJMZBMR\u003c/a\u003e... give some advice and help about preparing(Maybe I am wrong ?!).\u003c/p\u003e\u003cp\u003eSecond:\u003c/p\u003e\u003cp\u003eGiving price for best 2-3 users in unofficial standings.For Codeforces it wouldn\u0027t be a lot of money and number of \u0027new ingenious users\u0027 probably reduce.\u003c/p\u003e\u003cp\u003eThird:\u003c/p\u003e\u003cp\u003eDon\u0027t write winners on blog for competiton.A lot of people imagine to be found on it and and don\u0027t choose the assets to do so.\u003c/p\u003e\u003cp\u003eFourth:\u003c/p\u003e\u003cp\u003eHaving separated rating graph for div 1 and div 2 contest.How would that work exactly I don\u0027t know,but for official competitors it could work as so far , and for div 1 competitors it could be calculated as for big competitions when we have one round for all members.\u003c/p\u003e\u003cp\u003eFifth:\u003c/p\u003e\u003cp\u003eChange time for div 1 contests.In the previous period I done a small number of div 1 contests.A lot of round was held in unusual time of some working day ( for example tommorow is Monday and in 10 am we have contest ?! ). It\u0027s easy to change and fewer people would be hungry for rated contest.\u003c/p\u003e\u003cp\u003eI think that all these things are possible to do , some may have been wrong I love to see your opinion.\u003c/p\u003e\u003cp\u003eAlso it would be nice to see suggestion of some important CF guy like \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e and \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Zlobober\" title\u003d\"Grandmaster Zlobober\"\u003eZlobober\u003c/a\u003e...\u003c/p\u003e\u003cp\u003eThanks for reading and if we are persistent we will surely succeed improve our Codeforces :)\u003c/p\u003e\u003c/div\u003e","tags":["problem","div2 round","change"]}}