{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1520195621,"rating":23,"authorHandle":"0day20hour","modificationTimeSeconds":1520195701,"id":58161,"title":"\u003cp\u003eDIV1-375E and Integer Programming\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eProblem: \u003ca href\u003d\"/contest/375/problem/E\" title\u003d\"Codeforces Round 221 (Div. 1)\"\u003e375E - Красно-черное дерево\u003c/a\u003e\u003c/p\u003e\u003cp\u003eAt first, the editorial seems like using black and red in the opposite meaning than the problem. If someone can edit the editorial than it would be good for newcomer because this problem is really an interesting one and many people will learn the concept of \u003ccode\u003einteger programming\u003c/code\u003e from this at first. (I googled to get some problem on LP and found this. Then read the editorial and a book on IP formulation, and It was really confusing until I really believed, the editorial is not always perfect.)\u003c/p\u003e\u003cp\u003eMy solution: \u003ca href\u003d\"/contest/375/submission/35949315\" title\u003d\"Посылка 35949315 от 0day20hour\"\u003e35949315\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe time limit is 1s and it passed in 935ms. Is it OK for an LP like this? I didn\u0027t wrote the template. And I do not also know its time complexity. There is a entire book on this. Which is not good (for now). Can you give an intuitive idea about the complexity?\u003c/p\u003e\u003cp\u003eI am concerned with 2 cases\u003cbr /\u003e1. This maybe with the simplex implementation. Maybe someone can help to verify this if it is good.\u003cbr /\u003e2. I used n+2 constraints. I don\u0027t know what is the standard technique to replace equality with inequalities without dividing it into 2. Is it the correct approach?\u003c/p\u003e\u003cp\u003eAnd finally,\u003cbr /\u003eSuggest me some problem on linear programming. I have solved 375E, 605C on CF and another one on HackerRank.\u003c/p\u003e\u003cp\u003eThanks for your time. :)\u003c/p\u003e\u003c/div\u003e","tags":["simplex","ip"]}}