{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1412978013,"rating":0,"authorHandle":"m.radwan","modificationTimeSeconds":1412978025,"id":14219,"title":"\u003cp\u003eSuggested Readings in Dynamic Programming\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eAl Salam Alykom All,\u003c/p\u003e\u003cp\u003eDynamic programming is a very important topic in programming competitions, It\u0027s an essential tool if you want to reach yellow on topcoder for example, I don\u0027t know if it\u0027s getting much interest in IOI or not, but I think this is something you should learn before tackling other topics as greedy for example so I recommend those readings, you shouldn\u0027t try to read the solution before you attempt the problem itself and think about it, this way you maximize the benifit, the first tutorial introduces basic dynamic programming in bottom up only fashion, second tutorial shows some flavours of dynamic programming problems (You don\u0027t need to learn a dp type or so to solve the problem, you only need to understand the concept to solve the problem), and the third tutorial teaches you some how to optimize a dynamic programming solution.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://apps.topcoder.com/forums/?module\u003dThread\u0026amp;threadID\u003d700080\u0026amp;start\u003d0\"\u003eIntroduction to dynamic programming\u003c/a\u003e\u003cbr /\u003e \u003ca href\u003d\"http://apps.topcoder.com/forums/?module\u003dThread\u0026amp;threadID\u003d697369\u0026amp;start\u003d0\"\u003eCommonly used dp state domains\u003c/a\u003e\u003cbr /\u003e \u003ca href\u003d\"http://apps.topcoder.com/forums/?module\u003dThread\u0026amp;threadID\u003d697925\u0026amp;start\u003d0\"\u003eOptimizing dp solution\u003c/a\u003e\u003c/p\u003e\u003cp\u003eI Want you to share some of your favourite, recently solved dp problems with each other in order to learn from each other by discussion, I will also share some of mine, also feel free to ask questions if there\u0027s anything you don\u0027t understand.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eThere\u0027s no deadline for this, but make sure you finish it and solve enough problems before the next IOI.\u003c/p\u003e\u003c/div\u003e","tags":[]}}