{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1434990953,"rating":245,"authorHandle":"PikMike","modificationTimeSeconds":1435297955,"id":18798,"title":"\u003cp\u003eCreating Gravity Defied tracks using Codeforces rating graph\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003eIntroduction\u003c/h1\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/f6/1b/f61bb3b37f18630635cda4f35a66b45359b09fc7.jpg\" style\u003d\"float: right;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHi everybody! Recently I have decided to refresh memories about good old times and play Gravity Defied on my phone. It wasn\u0027t really hard to find port of that legendary game from J2ME to modern platforms. It rapidly gained glory among students of past decade. Key points of Gravity Defied success were nice gameplay (biker completing different stages with high cliffs and deep pits), convinient physics (ability to rotate mid-air) and simplicity of modmaking. As for me, it was a bit more than usual game. When I had completed over thousand tracks, I began earning money on helping others to progress. Only later even more difficult games were developed: HOMM 3, Far Cry and Dark Souls...\u003c/p\u003e\u003ch1\u003ePredevel story\u003c/h1\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/db/a2/dba2c1a17db9c9bf4d62ed606aa5fa762cd9e32f.jpg\" style\u003d\"float: right;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eAnd now Gravity Defied is on my phone again! Not original, though, but well-made remake for Android. I can totally declare that atmosphere of game was transferred great! And one more time I got sucked into game so badly that I imagined biker each time I had seen polygonal path. One day, when I was waiting for rating recalculation after Codeforces contest and looking at graph on my profile page, I got an idea to use that graph as track. Just wanted to live through all the victories and defeats of past two years of competitive programming again...\u003c/p\u003e\u003ch1\u003eDevelopment\u003c/h1\u003e\u003cp\u003eWhen I finally start to think about general concept of program, I realized that I know nothing about neither modding itself nor Gravity Defied track creating. So, Internet has everything, I thought... Firstly, I discovered that track files differ in two Android versions of GD (official from CodeBrew and unofficial from VKontakte developers, which is better in my opinion). And while .gdlvl for official was pretty easy (it\u0027s using most appropriate JSON extension), .mrg for unofficial (and for that J2ME game also) was truly comlicated! The thing is that there are very few useful forums (I found only one topic on russian forum and one wiki page which helped me at least in something). I got needed piece of information translated and proceeded with implementation. Python 3 script loads JSON with contests list of certain users and creates array of points using information about rating change and period of time between contests. All libraries used are built-in (os, sys, time, urllib, json). Being executed from console, it can either read handles from file or from command line. Installation guide along with script itself can be found \u003ca href\u003d\"https://github.com/MineGeekYT/CFGD\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eSome screenshots:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/e2/93/e2937f11f9c043e718af167fd5f882c42ae79992.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/9e/6a/9e6a901bb95b20cf2549fc34f12fbb1651edba27.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/34/66/34661ce0ebf47c0a7108004e0ed926bc5aa595da.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/c7/b4/c7b424c669db4edff677db55c0cc476236c239d4.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003ePlease, notify me about found bugs in script and errors in post by PM.\u003c/p\u003e\u003cp\u003eGood luck and have fun!\u003c/p\u003e\u003c/div\u003e","tags":["gravity defied","codeforces","python"]}}