{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1463774388,"rating":42,"authorHandle":"gKseni","modificationTimeSeconds":1463826804,"id":44983,"title":"\u003cp\u003eПредприниматель Виктор Шабуров стал спонсором команд СПбГУ\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВо время прошедшего в Пхукете финала чемпионата мира по программированию было анонсировано, что предприниматель Виктор Шабуров стал спонсором команд СПбГУ (и, в частности, команды чемпионов мира). \u003c/p\u003e\u003cp\u003eПо данным из Wikipedia, СПбГУ — его альма-матер, в 1999 он закончил специалитет Математико-механического факультета СПбГУ с красным дипломом.\u003c/p\u003e\u003cp\u003eВиктор — президент фонда \u003ca href\u003d\"http://botaninvestment.com/\"\u003eBotan Investments\u003c/a\u003e, который инвестирует от $100 тыс. до $2 млн. в команды, прошедшие в финал ACM. Фонд заинтересован в поддержке сообщества спортивных программистов — действуют программы \u003ca href\u003d\"http://botaninvestment.com/teachers-cf/\"\u003eгрантов преподавателям за организацию тренировок на Codeforces\u003c/a\u003e, \u003ca href\u003d\"http://botaninvestment.com/codeforces/\"\u003e50K РУБ для “Гроссмейстеров” с Codeforces\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eШабуров оказал существенную финансовую поддержку десяти командам-участницам чемпионата мира в Пхукете. Среди них команды Уральского федерального университета, Университета Иннополис, Запорожского национального технического университета. \u003c/p\u003e\u003cp\u003e3 года назад он спонсировал одесскую команду программистов, которые позже создали стартап Looksery. В 2015 году эту компанию \u003ca href\u003d\"https://vc.ru/n/looksery\"\u003eвыкупил\u003c/a\u003e Snapchat за $150 млн.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/13/10/13106035c6cbfd6543d2ecd44ba4d9a0c5fca8ae.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news"]}}