{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1419838872,"rating":15,"authorHandle":"Um_nik","modificationTimeSeconds":1419838872,"id":15448,"title":"\u003cp\u003eКто тренирует тренеров?\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eУ многих команд ACM есть тренера. Тренер может составлять план тренировок, следить за состоянием команды, давать советы по тактике, выявлять ошибки и предлагать пути по их исправлению.\u003c/p\u003e\u003cp\u003eНо откуда тренера берутся? ACMщики могут прийти из школьных олимпиад, их могут привести друзья и т.д. А тренер не может прийти из школьных олимпиад.\u003cbr /\u003eКазалось бы, чтобы стать тренером, нужно самому быть звёздным ACMщиком, знать алгоритмы и тонкости тактики. Но мне кажется, что это не главные качества тренера. Зачем тренеру знать все алгоритмы, лучше знать, кто эти алгоритмы хорошо знает и может рассказать. С тактикой сложнее, но опять же, тактика меняется от команды к команде, почему все тактические изыски команд бурной ACM-карьеры тренера подойдут его подопечным?\u003cbr /\u003eВидимо, главным качеством тренера должна быть способность увлечь студентов, дать им толчок к самостоятельной работе. Но это качество присуще чисто характеру человека и никак не связано с ACM. Дак почему же мы решили, что тренер должен быть ACMщиком?\u003c/p\u003e\u003cp\u003eВ защиту традиции можно предъявить следующий аргумент: \u0026quot;Никто ведь не заставляет ACMщиков идти в тренера. Идут те, кому это интересно, те, у кого есть все эти лидерские/тренерские качества.\u0026quot;\u003cbr /\u003eДействительно, если ACMщиков много, то среди них может найтись человек, в той или иной степени обладающий этими замечательными способностями, готовый пойти воспитывать молодёжь. А может и не найтись. Проблема.\u003cbr /\u003eА если ACM-сообщество небольшое, то даже большая вероятность, что может не найтись.\u003c/p\u003e\u003cp\u003eИ что делать?\u003cbr /\u003eВ такой ситуации кто-то из \u0026quot;заканчивающих карьеру\u0026quot; может сказать: \u0026quot;Ну кто-то же должен это делать, давайте я буду.\u0026quot; Это может не очень хорошо закончится, не правда ли?\u003c/p\u003e\u003c/div\u003e","tags":["тренерство"]}}