{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1486483941,"rating":-75,"authorHandle":"wag","modificationTimeSeconds":1486486494,"id":50304,"title":"\u003cp\u003eСпортивное программирование и юмор\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДобрейший вечерочек, уважаемое сообщество Codeforces!\u003c/p\u003e\u003cp\u003eЯ тут новенький, но уже смог решить одну задачу с самого первого раунда и сегодня собираюсь поучаствовать в раунде 396. \u003c/p\u003e\u003cp\u003eМне очень понравился этот сайт, но совершенно не понравилось качество юмора. Такое ощущение, будто программисты совершенно не умеют шутить, а тех, кто умеет, просто не понимают. Я прочитал старые посты и узнал, что тут раньше был шутник \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Bredor\" title\u003d\"Candidate Master Bredor\"\u003eBredor\u003c/a\u003e, но он ушёл, исчерпав себя. Ему на смену пришёл \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Huyum_nik\" title\u003d\"Candidate Master Huyum_nik\"\u003eHuyum_nik\u003c/a\u003e. Он начал за здравие (например, вторая шутка \u003ca href\u003d\"//codeforces.com/blog/entry/18512\"\u003eздесь\u003c/a\u003e была очень хороша), а его последние шутки мне кажутся абсолютно безвкусными. Забавно, что именно в момент его падения с вершины юмора про сайт codeforces узнал я.\u003c/p\u003e\u003cp\u003eЯ люблю английский юмор и собираюсь приучить к нему вас, мои дорогие читатели. Образцами хороших шуток я считаю вот \u003ca href\u003d\"//codeforces.com/blog/entry/14945#comment-198948\"\u003eэту\u003c/a\u003e и \u003ca href\u003d\"//codeforces.com/blog/entry/15093?locale\u003dru#comment-200463\"\u003eэту\u003c/a\u003e. Мне кажется, что их совершенно несправедливо заминусовали, даже написав, что не видят юмора в этих ситуациях. Это наглядно показывает всю ситуацию с чувством юмора в данном сообществе. Рад, что именно мне выпала честь исправить её в лучшую сторону.\u003c/p\u003e\u003cp\u003eДля начала, расскажу один уморительный анекдот\u003c/p\u003e \u003cdiv class\u003d\"spoiler\"\u003e\u003cb class\u003d\"spoiler-title\"\u003eЧто общего у девушки-программиста и морской свинки?\u003c/b\u003e\u003cdiv class\u003d\"spoiler-content\" style\u003d\"display: none;\"\u003e\u003cp\u003eМорская свинка – не морская, и не свинка.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eТакой вот английский юмор, который, к сожалению, пока плохо воспринимает это незрелое сообщество, будет сопровождать вас в моих постах, комментариях и даже раундах, которые я собираюсь проводить по придуманным мной задачам. Разумеется, я прекращу, когда появится кто-то гораздо остроумнее меня. Потом ему на смену придёт кто-то другой и так далее, и это нормально. Что-то меняется быстрее, что-то медленнее. Как говорил Конфуций, жизнь – она как чашка английского чая с 1.5% молоком. \u003c/p\u003e\u003cp\u003eА пока что, к сожалению, я вообще не вижу конкуренции, поэтому именно я буду снабжать вас порциями достойных шуток. Главное, помните: если моя шутка показалось вам несмешной, значит вы её не поняли. В таких случаях можно просить разъяснение в лс или комментариях. Разумеется, я не буду осуждать тех, кто просит объяснить шутку. Это как смеяться над новичками в качалке (\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Huyum_nik\" title\u003d\"Candidate Master Huyum_nik\"\u003eHuyum_nik\u003c/a\u003e поймёт). Наоборот, я буду всячески поддерживать заинтересовавшихся, и, возможно, именно вы станете следующим императором юмора на codeforces, и.о. которого я сейчас поневоле являюсь. \u003c/p\u003e\u003cp\u003eУдачи всем на раунде сегодня, подписывайтесь на мой блог, пишите комментарии, ставьте ПЛЮСИКИ.\u003c/p\u003e\u003c/div\u003e","tags":["юмор","молоко","философия","шутки"]}}