{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1504168225,"rating":4,"authorHandle":"DR.MANHATTAN","modificationTimeSeconds":1504196888,"id":54195,"title":"\u003cp\u003eCodeforces Round #430 (Div. 2) My 9th contest .\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eHighlight\u003c/strong\u003e: Successfully did Problem — B, but failed to do Problem — A( Awkward !! ) \u003c/p\u003e\u003cp\u003eI remember the first time I\u0027d been to an onsite contest ( almost 1 year ago ), the drive to solve the questions the fastest was so high that my brain and my hands literally got paralyzed and I was unable to do anything after attempting the First Question. Thanks to my team mate, we still managed to get the 3rd place and a Cash prize with it ( sweet !! ). What\u0027s sad, is that I did not lack in knowledge or skill to solve all the problems in time ( It was not a hard contest ) and could have easily managed to get the first prize and some SERIOUS BOUNTY !!\u003c/p\u003e\u003cp\u003eHowever, winning the 3rd prize too got me enough bounty to buy this beauty for myself !!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/97/7b/977b111450cf126de957058313f772df2e624aef.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eSince then, thanks to \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/petr\" title\u003d\"Legendary grandmaster petr\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003ep\u003c/span\u003eetr\u003c/a\u003e and his YouTube contest Video\u0027s\u003ca href\u003d\"https://www.youtube.com/watch?v\u003dNfHMqpqQ5-I\u0026amp;t\u003d73s\"\u003e Petr\u0027s competitive programming video with commentary \u003c/a\u003e, I\u0027ve learned the art of staying calm during a contest and got rid of a \u003cstrong\u003eHUGE limitation\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eContest Talk\u003c/strong\u003e : \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/contest/842/problem/A\"\u003eProblem A\u003c/a\u003e The question seemed pretty clear, but it seemed confusing as to how to go about it. (_Fun Fact_: this was the first contest I\u0027d seen in which more people got the Problem B right than the number of people that got Problem A right.) So I was not alone in this conundrum. The limits (b\u0026lt;\u003d10^7 and a\u0026lt;\u003d10^7) ensured that a brute force solution was not gonna work. My initial solution did pass the pre-tests, but was hacked in an instant. I understood how to go about the problem only after reading the official editorial. \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/contest/842/problem/B\"\u003eProblem B\u003c/a\u003e Yay!! A geometry problem (barely though!!). After my initial solution for Problem A got hacked, I moved on the problem B and couldn\u0027t contain my happiness when I found out that it was a geometry problem and one that I could perhaps SOLVE !! There is something magical about geometry problems!! Perhaps it\u0027s because of the images that you form in your mind while solving the problem, the thought process or the imagination that goes into it that if feels kinda STAR-TRECKY !! \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/6e/55/6e5581f18ba947facb9761eb6d83498996e64fb6.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eWhen you finally solve a geometry problem ( or at least when I solve one ) It almost feels like I\u0027ve solved one of the problems that the Star Trek spacecraft encountered along one of its many fantastical voyages :D \u003c/p\u003e\u003cp\u003eHowever, this question had a pizza (Yum!!) in context, but it was still enjoyable to solve. The picture used for explanation was spot on (though I only saw it after I\u0027d already solved and submitted the solution )\u003c/p\u003e\u003cp\u003eAll one had to do was to ensure that the toppings were right within the boundary of the crust. The handy Pythagoras theorem helped to determine the distance of the center of the topping from the origin, subtracting and adding the x coordinate value of the topping to the resulting hypotenuse and checking that the line was within the given boundary ( crust ) ensured that only the right toppings were counted! \u003c/p\u003e \u003cpre\u003e\u003ccode\u003eint  length(double x,double y,double r_s,double r,double d){\n     \tdouble hyp\u003dsqrt(x*x+y*y);\n     \treturn (hyp-r_s\u0026gt;\u003d(r-d) \u0026amp;\u0026amp; hyp+r_s\u0026lt;\u003dr);\n     }\n\n     int main(){fastio\n\n     \tint r,d;\n     \tcin\u0026gt;\u0026gt;r\u0026gt;\u0026gt;d;\n     \tint ct\u003d0;\n     \ttest(t){\n\n     \t\tdouble x,y,r_s;\n     \t\tcin\u0026gt;\u0026gt;x\u0026gt;\u0026gt;y\u0026gt;\u0026gt;r_s;\n\n     \t\tif(length(x,y,r_s,r,d))ct++;\n     \t}\n\n\n     \tcout\u0026lt;\u0026lt;ct;\n     }\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eGot AC in first go !! \u003c/p\u003e\u003cp\u003eMy rating too went up thanks to this problem !! ---------- Rest of the problems were beyond the reach of my knowledge as they were topics from Trees and Tries .. etc ... Will get there one day... !! \u003c/p\u003e\u003c/div\u003e","tags":["#for_beginners"]}}