{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399077499,"rating":-5,"authorHandle":"revenge5","modificationTimeSeconds":1399077499,"id":12089,"title":"\u003cp\u003ethe original village party\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003edivided, removal of the original village party branch secretary, sent under the town served as the first secretary of the village cadres, The village party organizations effectively solve the heavy tasks, work force issues is weak.Centralized party\u003ca href\u003d\"http://www.maxsalesupras.com/nike-air-max-90-c-16.html\"\u003enike air max 90 womens\u003c/a\u003e  organization to carry out rectification work are weak and lax village, Shanshan not \u0026quot;willing\u0026quot; to spend effort and \u0026quot;willing\u0026quot; real thing. By hiring pie, etc., from the counties as units under the township authorities to send eight section-level cadres, 27 reserve cadres to the village Party branch secretary and branch members; organizations are weak and lax on illegal religious activities and can not control, reluctance tube, 21 tubes of the village Party branch secretary and 205 will not work no responsibility incompetent village cadres to be adjusted. Adjust staff accounted for 47%, respectively, 31.8% and village cadres, the village Party branch secretary of the county, the new administrative villages religious coordinators, publicity specifically dry 126 people, villages women advocates, preachers 686, an increase of village cadres 145.8%.In addition, financial assistance to the county office of village funds raised from each village 80,000 yuan to 100,000 yuan, focusing on complex, weak and lax village up to 120,000 yuan. Vigorously develop the village collective economy, the county all administrative village collective economic income of 120,000 yuan, the highest village reached 96 million. Kaner British branch secretary Zi Township Mamat Camille spoke very emboldened force: \u0026quot;In recent years, the village collective land taken with live, the development of specialized farming, utilizing the collective assets, the formation of agricultural cooperatives other \u003c/p\u003e\u003cp\u003eforms, the village collective annual income can reach more than 20 million for village roads to help farmers solve problems that do not have to worry. \u0026quot;One day in March, Shanshan Tuyugou township called Aihemaiti Rozi villagers happily put their children to the door of the nursery, he said: \u0026quot;Children do not worry about the problem of \u003ca href\u003d\"http://www.maxsalesupras.com/nike-air-max-2013-c-10.html\"\u003enike air max 2013 cheap\u003c/a\u003e  school I can go out to earn money secure in the. \u0026quot;This year, Shanshan completed two bilingual kindergartens in rural areas, to complete the 53 bilingual kindergartens in rural planning and design, the new 37 year plan, the implementation of rural self-funded preschool children 1200 yuan / year food subsidy policy, the popularity of the former rural school for two years of free education. Implementation of school enrollment policies restored Lukeqin high school and vocational high schools offer Shanshan, the implementation of the general high school and vocational high schools free tuition, accommodation and transportation subsidy policy, so that the school-age youngsters, is the industry works, there is something to look forward.20.4 km of rural roads, safe drinking water to solve the problem of 1.1 million people, the implementation of farmers\u0027 loan, specialty farming, farmland shelterbelts seedlings grants, employment, reemployment 8 livelihood projects, loans to 143 million yuan Party\u0027s mass line educational practice Since the activity started, Shanshan insist on learning the first change, Charles Li Li changed, a lot of people of all nationalities to solve practical problems. \u0026quot;Golden Waterway\u0026quot; to \u0026quot;Yangtze \u003c/p\u003e\u003cp\u003eRiver Delta\u0026quot; economic growth in China has become an important pole, and now, it will usher in a new development opportunity, \u0026quot;relying on the golden waterway of the Yangtze Economic Zone,\u0026quot; the strategic plan ready.The whole basin of the Yangtze golden waterway fight, relying on the golden waterway of the Yangtze River economic belt construction, so that \u0026quot;Yangtze River Delta\u0026quot;, industrial and infrastructure base and middle reaches of the\u003ca href\u003d\"http://www.maxsalesupras.com/nike-air-max-2014-c-13.html\"\u003enike air max 2014 shoes\u003c/a\u003e  Yangtze River city of Chengdu-Chongqing Economic Zone linking elements flow together, unified market, will become important support for the sustainable development of China\u0027s economy -Promote the construction of the Yangtze River economic belt, will build a new pattern of economic growth in eastern, central and western joint development, the formation of a powerful direct drive along the provinces to develop new powerBuild the Yangtze River Economic Belt rely comprehensively deepen reforms to achieve \u0026quot;industry pick up elements flow together, pass up the market,\u0026quot; the key is to break the administrative barriers, regional segmentationYangtze golden waterway plays a fundamental role in the construction of the Yangtze River economic belt, to further improve the conditions of the Yangtze River waterway, the Yangtze River waterway through enhancing capacity building should be the focus ofYangtze River economic belt is one of the new central collective leadership major layout for regional economic development. April 28, Prime Minister Li Keqiang chaired a symposium in Chongqing, studies relying on the construction of the \u003c/p\u003e\u003c/div\u003e","tags":[]}}