{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1419011548,"rating":128,"authorHandle":"GlebsHP","modificationTimeSeconds":1420505689,"id":15282,"title":"\u003cp\u003eЗаочный этап Открытой олимпиады по программированию 2014-2015\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДоброго времени суток, уважаемые пользователи Codeforces!\u003c/p\u003e\u003cp\u003eХочу ещё раз обратить внимание всех потенциально заинтересованных участников на такое мероприятие как \u003ca href\u003d\"https://olympiads.ru/zaoch/\"\u003eОткрытая всероссийская олимпиада школьников\u003c/a\u003e. Напоминаю я не просто так, а по отличному поводу — сегодня там появились три новые задачи, а в ближайшие дни ожидаются ещё две. Задачи подготовлены жюри московских олимпиад, мы честно старались сделать их интересными и разнообразными.\u003c/p\u003e\u003cp\u003eЕсли кто-то пропустил начало олимпиады, то в этом нет ничего страшного, до конца ещё целый месяц, вполне достаточно, чтобы сдать все предложенные задачи. Время сдачи никак не влияет на положение в таблице. Лучшие \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003eX\u003c/i\u003e\u003c/span\u003e участников будут приглашены поучаствовать в очном финале, для которого задачи отбираются с ещё большей любовью и заботой, так что не упустите свой шанс.\u003c/p\u003e\u003cp\u003eДля тех, кто руководствуется более приземлёнными соображениями, чем качество задач, дополнительно сообщаю, что заключительный этап традиционно имеет первый уровень, а значит призеры и победители могут получить льготы при поступлении в вуз в соответствии с порядком приема в вузы.\u003c/p\u003e\u003cp\u003eПризеры отборочного этапа олимпиады никаких льгот не имеют — поступить не выходя из дома всё-таки не получится.\u003c/p\u003e\u003cp\u003eБолее подробную информацию об олимпиаде вы можете найти по приведённой выше ссылке. Любые оставшиеся вопросы смело задавайте в комментариях. \u003c/p\u003e\u003cp\u003eP.S. Тех, кто будет в комментариях обсуждать решения задач, ждёт справедливое возмездие и отрицательная карма!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e добавлены две новые задачи, больше задачи добавляться не будут.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2:\u003c/strong\u003e Почти наверное традиционного продления олимпиады не будет. Планируется пригласить порядка 400 участников. Обратите внимание, сейчас для попадания в топ-400 требуется набрать совсем немного баллов. Жюри рекомендует прочитать все задачи — почти в каждой имеются простые группы с немалым количеством баллов.\u003c/p\u003e\u003c/div\u003e","tags":[]}}