{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1528104560,"rating":40,"authorHandle":"RodionGork","modificationTimeSeconds":1528105095,"id":59838,"title":"\u003cp\u003eDomain name for e-maxx-eng project\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi Gurus and Colleagues!\u003c/p\u003e\u003cp\u003eSorry for distracting you from coding — but \u003ca href\u003d\"https://e-maxx-eng.appspot.com\"\u003ee-maxx-eng\u003c/a\u003e project needs your advice — as you probably remember, it is a collection of articles on algorithms seen as important for mastering competitive programming :)\u003c/p\u003e\u003cp\u003eSince the past November project have got real boost — especially due to dedicated efforts of \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Jakube\" title\u003d\"Master Jakube\"\u003eJakube\u003c/a\u003e, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/adamant\" title\u003d\"Master adamant\"\u003eadamant\u003c/a\u003e and other wise people. So its statistics grew several times, its content too... Over 100 articles and crawling to 1000 daily pageviews... And probably it is now a time to improve its appearance on the web by choosing a dedicated domain name.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"Puzzled about domain name\" src\u003d\"https://cdn.pbrd.co/images/Hojr1TV.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eCurrently it resides on default appengine\u0027s \u003cstrong\u003ee-maxx-eng.appspot.com\u003c/strong\u003e. It\u0027s all right, but probably not extremely clear for people not aware of who is \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/e-maxx\" title\u003d\"International master e-maxx\"\u003ee-maxx\u003c/a\u003e, it is 3-rd level — and also clashes with \u003ca href\u003d\"https://traxxas.com/products/models/electric/39087-1emaxxbrushless\"\u003eTraxxas E-Maxx\u003c/a\u003e toy %)\u003c/p\u003e\u003cp\u003eSo it is now tricky situation. It seems to be easy to order a dedicated domain name and bind it to the site. But we can\u0027t easily choose one. There were a few suggestions — but probably you\u0027ll be able to advice something better suitable — or vote for one of these variants:\u003c/p\u003e \u003cul\u003e   \u003cli\u003ecompetitive-programming.com — \u003cem\u003ebit too wide, site is not everything about CP\u003c/em\u003e\u003c/li\u003e   \u003cli\u003ecp-algorithms.com — \u003cem\u003elooks good for me, though CP is used for other abbreviations...\u003c/em\u003e\u003c/li\u003e   \u003cli\u003ecompetitive-programming-algorithms.com — \u003cem\u003enot sure anyone will type it in\u003c/em\u003e\u003c/li\u003e   \u003cli\u003ecs-algorithms.com — \u003cem\u003esimilar to cp-algorithms, but more known abbreviation... regretfully more wide too\u003c/em\u003e\u003c/li\u003e   \u003cli\u003ee-maxx-eng.com — \u003cem\u003enot clear whether retaining E-Maxx name is a good move or bad\u003c/em\u003e\u003c/li\u003e   \u003cli\u003ehard-algorithms.com — \u003cem\u003enot very clever (and like tough-algorithms, tricky-algorithms)\u003c/em\u003e\u003c/li\u003e   \u003cli\u003ealgorithms-wiki.com, algorithms-hub, algo-hub — \u003cem\u003ehowever \u0026quot;algohub\u0026quot; is already taken in several variants\u003c/em\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eSo feel free to participate, to suggest, to cast your vote! Also you may express what suffix you feel suits better. Though \u003ccode\u003e.com\u003c/code\u003e seems to be ok — I personally feel \u003ccode\u003e.net\u003c/code\u003e or \u003ccode\u003e.org\u003c/code\u003e may highlight it is not commercial enterprise. Also there is \u003ccode\u003e.info\u003c/code\u003e — probably it may be more descriptive to the nature of the site.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFew Points:\u003c/strong\u003e name should not resemble some existing domain too closely (e.g. differ in suffix and spare dash), not should be already taken of course, probably should express some relation to its content :)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThanks in advance!\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":["domain","e-maxx"]}}