{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1491821728,"rating":28,"authorHandle":"geniucos","modificationTimeSeconds":1492023549,"id":51521,"title":"\u003cp\u003eInfo(1) Cup online mirror usaco style\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everybody!\u003c/p\u003e\u003cp\u003eI know that I\u0027ve updated my first blog regarding Info(1) Cup a lot of times and I might already seem annoying. Well, the fact is that the first blog\u0027s main point was registering new countries in the competition and introducing it. This new blog is for those that might not have seen my updates regarding the online mirrors:\u003c/p\u003e\u003cp\u003eFor about 1 day from now on, you\u0027ll be able to take part in any 5-hours frame that you wish in a virtual contest in the exactly same conditions as the official participants had. We find the problems really interesting and we challenge you to solve them all. I\u0027m sure that taking part in this contest should be a positive experience for everyone, so I invite you to participate. The contest is OI like (with partial score based on subtask) and includes an interactive task. You can register and find the link of the contest \u003ca href\u003d\"http://open.info1cup.com/\"\u003ehere\u003c/a\u003e. The \u003ca href\u003d\"http://open.info1cup.com:8890/Ranking.html\"\u003elive scoreboard\u003c/a\u003e is on. The live scoreboard does not properly work. You may not appear right now on it, but stay calm, after we give it a refresh, you will. We\u0027ll do that at least once after the ending, so that all participants will appear in the final rankings and maybe few more times till the then. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLE: We\u0027ve extended the duration of the online mirror by one day.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eI have just been asked whether we\u0027ll have proper editorials. The answer is a categorical YES, they\u0027ll be published on the \u003ca href\u003d\"http://info1cup.com/\"\u003eofficial site\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOnly a day left from the online mirror. Also, take care at the announcements on the interface, they are really meaningful\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":["oi","new","competition","usaco style"]}}