{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1436049842,"rating":23,"authorHandle":"P_Nyagolov","modificationTimeSeconds":1436117719,"id":19080,"title":"\u003cp\u003eDynamic Segment Trees\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everybody,\u003c/p\u003e\u003cp\u003eLast year I read that dynamic trees exist, that is trees in which we create only the nodes we need since there can be a lot (say we have indices 1,...,10^9). I thought it\u0027s cool and wanted to know more about it. I googled a few times \u0026quot;Dynamic BIT\u0026quot;, \u0026quot;Dynamic trees\u0026quot; or something like that but I found nothing...\u003c/p\u003e\u003cp\u003eRecently I participated in BOI 2015 and there was a problem that required a segment tree for 60 points and dynamic segment tree or AVL Tree which I can\u0027t code for full score so I wasn\u0027t able to get more than 60 on it. Now, I tried googling \u0026quot;Dynamic Segment Tree\u0026quot; but found nothing...\u003c/p\u003e\u003cp\u003eCan somebody please explain how dynamic segment trees work and give me an implementation, I would appreciate your help!\u003c/p\u003e\u003cp\u003eThanks in advance! :)\u003c/p\u003e\u003cp\u003eUPD: Thanks everybody for the help, I understood it! So basically, we initially have the root only which stores the whole interval ([1;10^9] for example). Then the update/query goes exactly like in the normal segment tree but if we don\u0027t have a child of some node but we need it, we just create it and go on. I implemented \u003ca href\u003d\"http://www.spoj.com/problems/HORRIBLE/\"\u003eHorrible Queries\u003c/a\u003e from SPOJ (I know that a normal segment tree is enough, but I wanted to test it). Here is my accepted code, it might be helpful for somebody who has problems with this structure — \u003ca href\u003d\"http://ideone.com/hdI5aX\"\u003ehttp://ideone.com/hdI5aX\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["dynamic trees","segment trees"]}}