{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1414873083,"rating":16,"authorHandle":"shevk","modificationTimeSeconds":1425841830,"id":14539,"title":"\u003cp\u003eIX Открытая олимпиада школьников по программированию\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cem\u003eЧестно говоря, в этом году олимпиада не очень.\u003c/em\u003e \u003cs\u003eИмпатентские\u003c/s\u003e \u003cem\u003eСтранные задачи из серии \u0026quot;вот у вас есть нормальное решение на 50 баллов, забудьте о нём — напишите решение, которое с равной вероятностью делает одно из двух действий — оно зайдёт на 100 баллов\u0026quot; (Да, порталы). Или \u0026quot;вот у вас есть решение с ДП, запихайте в него кучу оптимизации — оно зайдёт дальше. Но вы могли написать жадник со всяким рандомом, и, он зайдёт на 40+ баллов, у нас тут тесты слабые\u0026quot;. И вообще \u0026quot;нам было лень сортировать задачи по сложности — мы забили на это, решайте как хотите\u0026quot;. Фраза \u0026quot;ой, слушай, забей на своё нормальное решение — там какой-то чувак рандом заслал\u0026quot; после тура звучала везде. А учитывая наличие \u0026gt;100 посылок запихать рандом было не так уж и трудно. Я, конечно, понимаю, что меня заминусуют организаторы олимпиады — но очный тур в этом году совсем паршивенький в плане задач. А ещё эта скромная квота...\u003c/em\u003e\u003c/p\u003e\u003cp\u003eВроде, об этом ещё не писали.\u003c/p\u003e\u003cp\u003e1 ноября начался отборочный тур IX Открытой олимпиады школьников по программированию. \u003cem\u003e(разг. — открытка)\u003c/em\u003e Он проходит до 20 января. \u003cem\u003eСпойлер: по традиции, перед окончанием тура объявляют о его продлении на несколько дней.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eУчаствовать в отборочном этапе могут \u003cstrong\u003eвсе\u003c/strong\u003e (не школьники — вне основного зачёта), школьникам бонусы при поступлении (1 уровень и все такое). \u003c/p\u003e\u003cp\u003eКто не знает — там, обычно, хорошие задачи, около 10 на отборочном туре, их выкладывают постепенно, более сложные выкладываются позднее. Самые сложные задачи отборочного тура прошлого года по мне сравнимы со средней третьей задачей контеста Div. 1, самая простая как первая из Div. 2.\u003c/p\u003e\u003cp\u003eОрганизаторы — МФТИ, МГУ, МЦНМО и другие. В прошлом году очный тур проходил при поддержке 1C, в их учебном центре, было здорово.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://olympiads.ru/zaoch/2014-15/info.shtml\"\u003eСайт олимпиады\u003c/a\u003e \u003ca href\u003d\"https://olympiads.ru/zaoch/2014-15/zaoch/problems.shtml\"\u003eУсловия задач\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["олимпиада","школьная"]}}