{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1485150955,"rating":1,"authorHandle":"JVirak","modificationTimeSeconds":1485150955,"id":49951,"title":"\u003cp\u003eQuestion on Round393 Div2 Question B\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHey guys I had about 6 wrong submissions for this question \u003ca href\u003d\"//codeforces.com/problemset/problem/760/B\"\u003ehttp://codeforces.com/problemset/problem/760/B\u003c/a\u003e. On 4 of them I got timeout errors and 2 a wrong answer on test-cases 1. Now the contest is over I got to go over these with the test-cases visible. As usual test case 1 was the first example, which turns out to run perfectly fine on my laptop (gives right answer don\u0027t think it takes too long). \u003c/p\u003e\u003cp\u003eIt turned out I had the same basic idea as the tutorials, figure out how many pillows it will take for Frodo to have p and then do binary search. I have no trouble believing that I made a mistake on either binary search or the number of pillows function itself (i.e. missed an edge case) which is why I kept resubmitting. \u003c/p\u003e\u003cp\u003eAnyway this \u003ca href\u003d\"//codeforces.com/contest/760/submission/24047827\"\u003ehttp://codeforces.com/contest/760/submission/24047827\u003c/a\u003e gives me the wrong answer on test case 1, producing 10000000 on the judge (the giant upper bound I set for my binary search). However on my home laptop it gives 2 (the correct answer). This gives me two related questions. 1. What is going on here? and 2. What does this do on other people\u0027s machines. (I\u0027d be very grateful to anyone else willing to run it).\u003c/p\u003e\u003cp\u003eAlso this \u003ca href\u003d\"//codeforces.com/contest/760/submission/24048597\"\u003ehttp://codeforces.com/contest/760/submission/24048597\u003c/a\u003e version of the code gives me a timeout error. Again on my local machine it manages to do the job (at least on test case 1). While I\u0027m not sure exactly how long it takes to run (runtime output includes typing time) it seems almost instant. \u003c/p\u003e\u003cp\u003eObviously I\u0027d like to avoid this next time so if anyone can help me find this error I\u0027d really appreciate it. \u003c/p\u003e\u003c/div\u003e","tags":["beginner","#timelimit","wrong answer on test 1"]}}