{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1409765714,"rating":39,"authorHandle":"SmartCoder","modificationTimeSeconds":1409765714,"id":13673,"title":"\u003cp\u003eCareer Advice !!! Brainstorming\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHI All ,\u003cbr /\u003e First I\u0027m not seeking for a job I say that (just to avoid misunderstanding of whole entry wrong)\u003cbr /\u003e I graduated from computer science about 3 years ago and I worked about 1.5 year ,I\u0027m solving a lot of problems and participating on various online judges from long period I didn\u0027t make a good training because of work time.\u003cbr /\u003e My work now is really interesting but I didn\u0027t have any clear plan for myself for next few years.\u003cbr /\u003e \u003cstrong\u003eI\u0027m not so good to work at large companies but also I\u0027m not very bad to work on most of Egyptian companies that any normal graduate doesn\u0027t have any problem solving skills work on it.\u003c/strong\u003e\u003cbr /\u003e I like problem solving \u0026amp; I hope to find a good position that know the value of having such skills but here in Egypt it\u0027s hard to find such places.\u003cbr /\u003e I applied for a lot of companies that I hope to work on it or at least make intership but no response.\u003cbr /\u003e What I have to do ?\u003cbr /\u003e Is I have to continue in a specific field like ML , NLP ,Computer Vision and make master ,... but I didn\u0027t like research or at least I didn\u0027t try it \u0026amp; I didn\u0027t find myself in academic part.\u003cbr /\u003e Companies like google or facebook take most of candidates from ICPC contest which I\u0027m not eligible for it because of age.\u003cbr /\u003e Taking part in online contests like GCJ or TCO or FB hacker-cup ... maybe I will Qualify but it need a very good training for next phases and it\u0027s very very hard.\u003cbr /\u003e  \u003cem\u003eCan we make brainstorming and discuss all available options ?\u003c/em\u003e\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["career","brain storm"]}}