{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1410009795,"rating":3,"authorHandle":"HolkinPV","modificationTimeSeconds":1416845547,"id":13704,"title":"\u003cp\u003eТренировки ФТЛ (новости)\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет.\u003c/p\u003e\u003cp\u003eЭтот пост я буду использовать, чтобы сообщать вам различные новости и делать объявления.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e1) Расписание\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eЗанятия будут проходить два раза в неделю в \u003cstrong\u003eпонедельник и четверг в 14:30\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eСоветую всем по возможности посещать оба занятия. В первое время занятия будут совмещенными. Мы будем решать задачи, чтобы быть в форме перед различными грядущими олимпиадами. Впоследствии, думаю, что мы условно разделимся на две группы с более сложным и более простым материалами. Приглашайте ваших друзей и одноклассников.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e2) Информация о вас\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eПрошу всех заполнить форму по указанной ссылке \u003ca href\u003d\"https://docs.google.com/forms/d/1zlONFrLSq7A6fFQdkhXhgLn1cvm3ZakTJGH5JLwrg0E/viewform?c\u003d0\u0026amp;w\u003d1\u0026amp;usp\u003dmail_form_link\"\u003egoogle form link\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e3) Тренировка\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eВ один из выходных дней нужно будет участвовать в \u003cstrong\u003eтренировке\u003c/strong\u003e в этой группе. В контесте желательно участвовать всем. По понедельникам мы возможно будем разбирать некоторые задачи. Не забывайте дорешивать все нерешенные вами задачи. Пожалуйста, укажите в вашем профиле правильную фамилию и имя, а также добавьте организацию ФТЛ №1.\u003c/p\u003e\u003cp\u003eПредварительно планируется провести первую тренировку на будущей неделе (13-14 сентября)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e4) Контактная информация\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eДля всех кто не знает, меня зовут Холкин Павел Витальевич) \u003c/p\u003e\u003cp\u003eЛюбые вопросы пишите на почту \u003ca href\u003d\"mailto:p.v.holkin@gmail.com\"\u003ep.v.holkin@gmail.com\u003c/a\u003e, мне в сообщения на codeforces.ru, оставляйте комментарии к постам. \u003c/p\u003e\u003cp\u003eВ крайних случаях звоните на телефон +7-960-359-67-07\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eВ субботу \u003cstrong\u003e(13 сентября)\u003c/strong\u003e в \u003cstrong\u003e16-00\u003c/strong\u003e состоится первая личная тренировка в соревнованиях в нашей группе. Чтобы участвовать в тренировке нужно быть зарегистрированным на этом сайте и быть участником этой группы (нужно приглашение от меня или Антона). Контест автоматически начнется во вкладке соревнования в 16 часов. Не забудьте написать в профиле вашу правильную фамилию и имя.\u003c/p\u003e\u003cp\u003eФормат тренировки будет похож на школьный этап олимпиады по программированию, который состоится уже скоро (ориентировочно в конце месяца). Однако тренировка будет длиться \u003cstrong\u003e4 часа\u003c/strong\u003e вместе обычных 5 часов. Я специально сделал тренировку чуть короче, поскольку это наша первая тренировка в таком формате (также я старался сделать ее не очень сложной и чтобы всем было интересно). Если вы не можете написать тренировку в субботу, то обязательно постарайтесь написать ее в воскресенье в удобное для вас время (для этого зайдите в раздел соревнований и закажите тренировку виртуально).\u003c/p\u003e\u003cp\u003eПожалуйста, решайте задачи самостоятельно, будьте честными передо мной и перед самими собой. Тренировки нужны именно для того, чтобы повысить свой уровень. Выделите на тренировку положенные 4 часа и постарайтесь решить как можно больше задач (если какая-то задача вызывает затруднение часто имеет смысл переключиться и прочитать условия других задач). Не забывайте проверять какой ввод-вывод в задачах (в этой тренировке он везде стандартный). В понедельник мы проведем разбор и обсудим как все прошло.\u003c/p\u003e\u003cp\u003eЕсли возникнут какие-то проблемы с задачами, доступом или системой, то связывайтесь со мной (также можете обращаться к Антону). Читайте новости в этом посте и напоминайте всем вашим друзьям и одноклассникам о наших занятиях и тренировках. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eБыло решено, что следующие две тренировки (до школьного этапа олимпиады) будут \u003cstrong\u003eличными\u003c/strong\u003e. Командные тренировки планируются ближе к школьной командной олимпиаде. Поучавствовать, как и в прошлый раз, можно будет в нашей группе в субботу онлайн или в воскресенье виртуально. Следите за новостями в этом блоге.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD3\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eИтак, в субботу \u003cstrong\u003e20 сентября в 16:00\u003c/strong\u003e во вкладке соревнования в нашей группе стартует \u003cstrong\u003eвторая личная тренировка\u003c/strong\u003e. Соревнование будет длиться 5 часов и будет похоже на ожидающие вас личные олимпиады. Если вы не можете полностью написать тренировку в субботу, то ее нужно обязательно написать в воскресенье в любое удобное для вас время. Для этого выделите себе положенное время и закажите тренировку виртуально во вкладке соревнования. Если будут какие-то срочные проблемы с системой или доступом к соревнованию, то связывайтесь со мной. В понедельник мы вновь проведем разбор задач. Сообщайте всем участникам кружка о последних новостях и напоминайте о тренировках.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD4\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eЯ добавил в нашу группу разборы на русском языке \u003ca href\u003d\"http://codeforces.ru/group/a4S4I425KW/blog/entry/259\"\u003eпервой\u003c/a\u003e и \u003ca href\u003d\"http://codeforces.ru/group/a4S4I425KW/blog/entry/260\"\u003eвторой\u003c/a\u003e тренировок. Пожалуйста, не забывайте дорешивать задачи. Дорешивание является возможно самым важным процессом в тренировке, поскольку это возможность решить те задачи, которые у вас не получились во время самого соревнования.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD5\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eВ субботу \u003cstrong\u003e27 сентября в 16:00\u003c/strong\u003e пройдет \u003cstrong\u003eтретья личная тренировка\u003c/strong\u003e в соревнованиях в нашей группе. Соревнование будет длиться 5 часов. Уже в ближайший понедельник вас ждет школьная личная олимпиада, а значит это хороший шанс еще раз потренироваться перед ней. Выделите положенное время и решите как можно больше задач. Если у вас не получается это сделать в субботу, то обязательно закажите этот контест в воскресенье в любое время, нажав на \u003cstrong\u003eвиртуальное участие\u003c/strong\u003e. В понедельник занятия не будет. Разбор этой тренировки и возможно еще школьной проведем в дальнейшем как появится время. Передавайте информацию друзьям и читайте новости в этой группе.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD6\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eНа этой неделе вместо четверга кружок пройдет \u003cstrong\u003eзавтра (1 октября, среда) в 14-30.\u003c/strong\u003e Планирую поразбирать задачи школьной олимпиады и возможно последней тренировки. Также обсудим время тренировки в эту субботу (4 октября), которая как и следующие планируется быть \u003cstrong\u003eкомандной\u003c/strong\u003e (перед школьной командной олимпиадой). Не забывайте читать новости и передавать их друзьям.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD7\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eВ эту субботу \u003cstrong\u003e4 октября в 14-00\u003c/strong\u003e пройдет первая \u003cstrong\u003eкомандная тренировка\u003c/strong\u003e. Скорее всего, она будет короче обычного, сообщу чуть позднее. Инструкция, что нужно делать перед участием в тренировке:\u003c/p\u003e\u003cp\u003e1) Узнать своих однокомандников и познакомиться с ними) (списки есть у Татьяны Львовны и у меня).\u003c/p\u003e\u003cp\u003e2) Одному из участников команды (например капитану) открыть свой профиль на codeforces (нажать на свое имя), нажать на вкладку команды\u003c/p\u003e\u003cp\u003e3) Создать команду (лучше новую) с названием \u0026quot;ФТЛ-1: #номер\u0026quot; \u0026quot;PhTL-1: #number\u0026quot;, где номер — это номер вашей команды в общем списке команд (например ФТЛ-1: #10).\u003c/p\u003e\u003cp\u003e4) Рядом с появившейся новой командой справа нажать на значок редактирования, пригласить в нее двух других участников (добавить по их логинам на codeforces) и сохранить изменения.\u003c/p\u003e\u003cp\u003e5) После этого двум другим участникам команды нужно будет подтвердить свое участие в созданной команде. Для этого зайдите на сайт под собой, откройте вкладку команды и примите приглашение.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eТаким образом\u003c/strong\u003e: команда готова, если у вы зайдете на сайт под любым из ее участников и в списке команд будете видеть себя и двух других вашей однокомандников.\u003c/p\u003e\u003cp\u003e6) Как обычно соревнование само начнется в указанное время во вкладке соревнования в нашей группе. Чтобы зарегистрироваться на соревнование нужно зайти на сайт под любым участником команды, нажать кнопку зарегистрироваться, выбрать \u003cstrong\u003eучастие в составе команды\u003c/strong\u003e, отметить галочками всех реальных участников.\u003c/p\u003e\u003cp\u003e7) Не волнуйтесь, создать команду нужно всего лишь один раз. После этого решайте задачи соревнования. В понедельник, думаю, проведем разбор.\u003c/p\u003e\u003cp\u003e8) \u003cstrong\u003eНе забудьте\u003c/strong\u003e обсудить со своими однокомандниками как и где вы будете участвовать в тренировке. Лучше всего собраться в одном месте и использовать один компьютер. Также можете распечатать себе один комплект условий, чтобы было удобнее читать задачи.\u003c/p\u003e\u003cp\u003e9) Во время соревнования, пожалуйста, решайте задачи командно. Обычно в процессе соревнования двое участников пишут решение по задаче, третий в этот момент подготавливает к написанию следующую задачу. В крайних случаях третий им помогает. Старайтесь писать код только после того, как двое из участников уверены в правильности идеи. Участник, который следит за написанием кода, должен быть предельно внимательным, чтобы пишущий не ошибался, а также подсказывать ему, что писать дальше, если он задумывается или останавливается. Если задача не проходит, часто имеет смысл напечатать код, перечитать его, еще раз обдумать идею. Не зацикливайтесь на одной на задаче, переключайтесь на другие.\u003c/p\u003e\u003cp\u003eСообщайте новости всем участникам нашего кружка. С любыми вопросами пишите сообщения на этом сайте, на почту, в крайнем случае звоните на телефон.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD8\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eВажное объявление:\u003c/strong\u003e в качестве первой командной тренировки я решил вам дать порешать первую олимпиаду из цикла тренировочных олимпиад для школьников, подготовленную коллегами из Санкт-Петербурга. Они, традиционно, готовят сильных школьников и студентов, проводят школьный финальный этап командной олимпиады и студенческий четвертьфинал и полуфинал (а значит являются авторами этих задач). \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eКОНТЕСТ НЕ НАЧНЕТСЯ АВТОМАТИЧЕСКИ\u003c/strong\u003e, его нужно заказать виртуально и только потом открывать условия и начинать решать. Для этого нажмите на кнопку \u003cstrong\u003eвиртуальное участие\u003c/strong\u003e, поставьте галочку \u003cstrong\u003eв составе команды\u003c/strong\u003e, отметьте всех участников, которые реально будут писать этот контест (то есть не ставьте три галочки, если вдруг вы пишете вдвоем), выберете \u003cstrong\u003eвремя и дату\u003c/strong\u003e соревнования. Постарайтесь начать тренировку в обговоренное ранее время, то есть \u003cstrong\u003e4 октября в 14-00\u003c/strong\u003e. Однако вы можете начать соревнование в абсолютно любой момент, в том числе и в воскресенье. Обязательно напишите эту тренировку, в понедельник проведем разбор полетов. Обратите внимание, в задачах \u003cstrong\u003eфайловый ввод-вывод и имена файлов меняются\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eНесмотря на то, что контест будет длиться 3 часа, я предлагаю вам сразу после контеста не разбегаться. Сразу после окончания обсудите ваши впечатления, как решались задачи, что получилось, что нет, проанализируйте на чем вы возможно потеряли время. Разумеется все задачи можно будет дорешивать, в том числе сразу после официального окончания тренировки. Поэтому предлагаю еще один час в спокойном режиме обсудить и досдать возможно еще одну-две задачи, на которые не хватило времени. Таким образом, надеюсь, вы потратите примерно 4 часа, коллективно решая задачи.\u003c/p\u003e\u003cp\u003eВсем желаю удачи, с вопросами обращайтесь ко мне.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD9\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eВажное объявление\u003c/strong\u003e: Совсем скоро состоится командный этап школьной олимпиады по программированию. Лучшие участники будут приглашены в Санкт-Петербург на финальный этап этого соревнования. \u003c/p\u003e\u003cp\u003eВ связи с этим в четверг во время кружка было решено провести \u003cstrong\u003eобщую тестовую командную тренировку\u003c/strong\u003e. Целью тренировки является дать возможность абсолютно всем попробывать себя в роли участника команды, наладить взаимоотношения, немножко потренироваться и порешать простые задачи.\u003c/p\u003e\u003cp\u003eТренировка автоматически начнется \u003cstrong\u003eв четверг 9 октября в 14-20\u003c/strong\u003e (чтобы у вас было немножко времени для подготовки после окончания уроков) и будет ориентировочно идти 1 час 20 минут, то есть до 15-40. После этого в оставшееся время мы осбудим как все прошло, быстро разберем эти задачки.\u003c/p\u003e\u003cp\u003eОднако напоминаю, что этот контест пройдет в нашей группе \u0026quot;Тренировки ФТЛ\u0026quot; на сайте codeforces.ru. Это означает:\u003c/p\u003e\u003cp\u003e1) Все участники должны зарегистрироваться на этом сайте (пишите в профиле адекватное имя и фамилию)\u003c/p\u003e\u003cp\u003e2) Все они должны быть приглашены в нашу группу (по этим двум пунктам можно обращаться, например, к Антону или ко мне)\u003c/p\u003e\u003cp\u003e3) Создать себе команду и пригласить в нее своих однокомандников (написать адекватное название, например ФТЛ-1: команда-9)\u003c/p\u003e\u003cp\u003e4) В указанное время открыть сайт, зайти в нашу группу, открыть вкладку соревнования и решать задачи.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eНасчет всех этих пунктов подробно расписано в этом блоге, в том числе участники кружка с этим уже хорошо знакомы.\u003c/strong\u003e Пожалуйста сообщайте эту информацию участникам кружка, своим однокомандникам и всем заинтересованным.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD10\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eВажное объявление:\u003c/strong\u003e На субботу/воскресенье я предлагаю вам очень важную командную тренировку. Это официальное прошедшее соревнование — чемпионат школьников Санкт-Петербурга. Ни в коем случае не решайте ее лично, в крайнем случае вдвоем (но и это тоже плохо). Обязательно выделите полноценные 5 часов и всё это время потратьте на решение задач. Не начинайте соревнование и не читайте условия задач, если вы точно знаете, что не можете полноценно потренироваться всей командой. В комплекте есть простые и сложные задачи, то есть тренировка приближена к будущей командной олимпиаде. Отнеситесь к этому серьезно.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eКОНТЕСТ НЕ НАЧНЕТСЯ АВТОМАТИЧЕСКИ\u003c/strong\u003e, его нужно сначала заказать виртуально и только потом открывать условия и начинать решать (думаю стоит даже напечатать себе один комплект условий). Для начала соревнования нажмите на кнопку \u003cstrong\u003eвиртуальное участие\u003c/strong\u003e, поставьте галочку \u003cstrong\u003eв составе команды\u003c/strong\u003e, отметьте всех участников, которые реально будут писать этот контест (не ставьте три галочки, если вдруг вы пишете вдвоем), выберете \u003cstrong\u003eвремя и дату\u003c/strong\u003e соревнования. Не нажимайте кнопку \u0026quot;войти\u0026quot; в соревнование. Обязательно используйте виртуальное участие.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eОбязательно\u003c/strong\u003e зарегистрируйте на этом сайте всех участников команды, заполните \u003cstrong\u003eадекватное имя и фамилию\u003c/strong\u003e и участвуйте командой. Тренировку можно начать в \u003cstrong\u003e16:00 в субботу\u003c/strong\u003e, либо в \u003cstrong\u003eлюбое время в воскресенье\u003c/strong\u003e. Обязательно постарайтесь написать эту тренировку, в понедельник проведем разбор. Этот контест скорее всего ваша последняя возможность порешать полноценную 5-часовую тренировку перед следующим воскресеньем. Обратите внимание, в задачах \u003cstrong\u003eфайловый ввод-вывод и имена файлов меняются\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD11\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eВ четверг во время кружка как и в прошлый раз пройдет сокращенная \u003cstrong\u003eкомандная тренировка\u003c/strong\u003e. Она \u003cstrong\u003eавтоматически\u003c/strong\u003e начнется \u003cstrong\u003eв 14-20 и продлится 1,5 часа\u003c/strong\u003e. На тренировку приглашаются все, кто в восресенье участвует в школьной командной олимпиаде, места думаю всем хватит, как и в прошлый раз будем использовать два кабинета если потребуется.\u003c/p\u003e\u003cp\u003eУчаствовать нужно командно. Соотвественно нужно быть зарегистрированым на сайте и иметь созданную команду. В контесте будет три задачи попроще и две посложнее, думаю всем будет интересно. Условия скорее всего будут распечатаны для удобства.\u003c/p\u003e\u003cp\u003eВ эту субботу тренировки не будет, чтобы вы чуть отдохнули, возможно что-то повторили перед олимпиадой. В понедельник нашего кружка не будет, поскольку в этот день должно быть официальное закрытие олимпиады.\u003c/p\u003e\u003cp\u003eВозможно в четверг (завтра) меня не будет, либо опоздаю. В любом случае контест автоматически начнется, поэтому не ждите, а самостоятельно открывайте условия и решайте задачи. До школьной олимпиады осталось несколько дней, это наша последняя общая тренировка. Если будут вопросы, пишите, звоните.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD12\u003c/strong\u003e: \u003c/p\u003e\u003cp\u003eВсем добрый день. Я нашел для вас не очень сложную тренировку, она будет длиться \u003cstrong\u003eтри часа\u003c/strong\u003e, участвовать нужно \u003cstrong\u003eлично\u003c/strong\u003e. Соревнование автоматически \u003cstrong\u003eне начнется\u003c/strong\u003e, как обычно его нужно заказать виртуально (сначала выбрать виртуальное участие, а потом уже читать и решать задачи). Вы можете сделать это в \u003cstrong\u003eлюбое время\u003c/strong\u003e в субботу или в воскресенье. По традиции можно начать сегодня (в сб) в 16:00. Если будут вопросы пишите.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD13\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eВсем привет. Я добавил в раздел соревнований новую тренировку. Вернее это не совсем соревнование, а скорее набор нескольких тренировочных упражнений на некоторые известные алгоритмы. Задачи можно решать в формате контеста (виртуальное участие), либо в формате дорешивание (просто открываете, думаете, пишите). Целью является поддержание тонуса и освежение в памяти некоторых стандартных подходов. Другими словами там просто тренировочные задачи, а не реальное соревнование. \u003c/p\u003e\u003cp\u003eТе кто не решал прошлую тренировку, обратите на нее большее внимание и порешайте ее (Третья зимняя олимпиада, Вологда) (см upd12). В ней как раз представлены олимпиадные задачи (потом отдельно обсудим). В понедельник планирую лекцию (скорее всего про sqrt-декомпозицию), приходите. Если будут вопросы, пишите.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD14\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eПриветствую всех. Я добавил в раздел соревнований сразу два тура областной олимпиады 12-13 годов (чтобы был запас). В любой из дней можете заказывать их виртуально и решать. Сначала решайте первый, затем второй. НЕОБЯЗАТЕЛЬНО решить оба за это время. НЕ РЕШАЙТЕ два контеста в один день. Напоминаю, мы готовимся к личной городской олимпиаде (она должна быть уже на следующей неделе), а также к финальному этапу вкошпа (еще через неделю)!\u003c/p\u003e\u003cp\u003eНЕ ЗАБЫВАЙТЕ решать домашнее задание с кружков, ну и в личном порядке решать задачи, изучать и повторять алгоритмы \u003cstrong\u003e(сайт e-maxx.ru/algo вам в помощь)\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD15\u003c/strong\u003e:\u003c/p\u003e\u003cp\u003eДобавил уезжающим на ВКОШП прошлогоднее соревнование. Решайте обязательно командно, желательно все в одно время, раньше времени задачи не палите.\u003c/p\u003e\u003cp\u003eС уважением, Павел Холкин.\u003c/p\u003e\u003c/div\u003e","tags":["phtl","trainings"]}}