{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1465747051,"rating":185,"authorHandle":"Edvard","modificationTimeSeconds":1466111393,"id":45386,"title":"\u003cp\u003eEducational Codeforces Round 13\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eEducational Codeforces Round 13 will take place on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dEducational+Codeforces+Round+13\u0026amp;iso\u003d20160613T1600\"\u003e13 June 2016 at 19:00 MSK\u003c/a\u003e for the first and the second divisions. Almost two months passed from the previous round. That is due the next reasons: 1) I coordinated regular CF-round at the end of April; 2) about whole CP community were busy with preparing and competing in ACM ICPC WF in May; 3) at the beginning of this month I start to work at AimTech (I hope that I\u0027ll have enough time to continue prepare ERs).\u003c/p\u003e\u003cp\u003e\u0026lt;It\u0027s need to read at least once maybe you\u0027ll find something interesting\u0026gt;\u003c/p\u003e\u003cp\u003eThe round will be unrated for all users and it will be held with extented ACM ICPC rules. You will have two hours to solve six problems. After that you will have one day to hack any solution you want. You will have access to copy any solution and test it locally.\u003c/p\u003e\u003cp\u003eIf you have ideas for some problems or maybe already prepared problems that you can\u0027t use in rounds or official competitions, you can write to me.\u003c/p\u003e\u003cp\u003eIt seems that it is harder to invent interesting simple problems (like A and B) than difficult ones. So don\u0027t be afraid to suggest interesting simple or very simple tasks (of course the difficult tasks are also needed). Please send only the problems for which you know the solution with clear statement (the story is not required). And also please add one or two samples to make the problem statement more clear.\u003c/p\u003e\u003cp\u003e\u0026lt;/It\u0027s need to read at least once maybe you\u0027ll find something interesting\u0026gt;\u003c/p\u003e\u003cp\u003eThe problemset was suggested by Codeforces users. The problem А was suggested by user Abdrakhman Ismail \u003ca class\u003d\"rated-user user-gray\" href\u003d\"/profile/Ismail_A\" title\u003d\"Newbie Ismail_A\"\u003eIsmail_A\u003c/a\u003e. The problem B was suggested by Arthur Jaworski \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/KingArthur\" title\u003d\"Expert KingArthur\"\u003eKingArthur\u003c/a\u003e. The problem C was suggested by Sheikh Monir \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/skmonir\" title\u003d\"Specialist skmonir\"\u003eskmonir\u003c/a\u003e. The problem D was suggested by Zi Song Yeoh \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/zscoder\" title\u003d\"Candidate Master zscoder\"\u003ezscoder\u003c/a\u003e (there are a lot of unused his problems). The problem E was suggested and prepared by Alexey Dergunov \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/dalex\" title\u003d\"Candidate Master dalex\"\u003edalex\u003c/a\u003e. The simpler version of the problem F was suggested by AmirMohammad Dehghan \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/amd\" title\u003d\"International master amd\"\u003eamd\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThanks a lot to them and all others who are sending the problems! The number of unused problems are increasing. If I didn\u0027t miss anything I already replied to all who sent me the problems at least 5-6 days ago. Please be patient if your problem was not used a long while.\u003c/p\u003e\u003cp\u003eAs I said the problem E is prepared by Alexey Dergunov \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/dalex\" title\u003d\"Candidate Master dalex\"\u003edalex\u003c/a\u003e. All other problems was prepared by me (Edvard Davtyan). Thanks to Tatiana Semyonova \u003ca class\u003d\"rated-user user-black\" href\u003d\"/profile/Tatiana_S\" title\u003d\"Unrated, Tatiana_S\"\u003eTatiana_S\u003c/a\u003e for checking the English statements. The problems was tested by users suggested them, respectively: Abdrakhman Ismail \u003ca class\u003d\"rated-user user-gray\" href\u003d\"/profile/Ismail_A\" title\u003d\"Newbie Ismail_A\"\u003eIsmail_A\u003c/a\u003e, Arthur Jaworski \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/KingArthur\" title\u003d\"Expert KingArthur\"\u003eKingArthur\u003c/a\u003e, Sheikh Monir \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/skmonir\" title\u003d\"Specialist skmonir\"\u003eskmonir\u003c/a\u003e, Zi Song Yeoh \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/zscoder\" title\u003d\"Candidate Master zscoder\"\u003ezscoder\u003c/a\u003e, Alexey Dergunov \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/dalex\" title\u003d\"Candidate Master dalex\"\u003edalex\u003c/a\u003e and AmirMohammad Dehghan \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/amd\" title\u003d\"International master amd\"\u003eamd\u003c/a\u003e. Thanks a lot to all of them!\u003c/p\u003e\u003cp\u003eI hope you will enjoy the problems! Previous time the problems were too hard. I\u0027ve tried to fix that. The problems should be simpler than usual.\u003c/p\u003e\u003cp\u003eGood luck and have fun!\u003c/p\u003e\u003cp\u003eUPD: The round is finished. The \u003ca href\u003d\"//codeforces.com/blog/entry/45405\"\u003eeditorial\u003c/a\u003e is published.\u003c/p\u003e\u003cp\u003eIt\u0027s the first summer round :-)\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/36/da/36da510d9ce18199ea2f83ece33650861d9ac0e7.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["education round 13","announcement"]}}