{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1501063388,"rating":646,"authorHandle":"fcspartakm","modificationTimeSeconds":1501072960,"id":53486,"title":"\u003cp\u003eCodeforces: Calendar\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eThe latest innovation in Codeforces is introduction Google calendar with information about the upcoming contests. To view calendar you can visit tab \u0026quot;Calendar\u0026quot; in the top menu.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/46/72/4672889a64e2bcef11b18dfbd9661e960441ba34.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThe Codeforces contests are adding in calendar automatically. Also you can add contests from the other programming platforms. Each red user has this option. In addition, we will grant the rights to edit the calendar to employees/enthusiasts of other popular platforms.\u003c/p\u003e\u003cp\u003eIn the tab \u0026quot;Add\u0026quot; you can add information about upcoming contest. The form shown below will help you for this.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/ba/4f/ba4fc2feb02a590efcd342dd3a030d68b959fafc.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003ePlease, add to the calendar classic algorithmic contests which duration does not exceed a day. Also the contest must be publicly available, i. e. had English statements and open for a wide range of participants. We ask you to use short names for competitions, as it is presented in the examples, for convenience and uniformity.\u003c/p\u003e\u003cp\u003eAlso you can edit or remove information about upcoming events in corresponding tabs.\u003c/p\u003e\u003cp\u003eWe hope that the calendar will be useful for you and will help to planning your time and learn about all upcoming programming events.\u003c/p\u003e\u003cp\u003eIn our plans to expand the functionality of the calendar. Write about your ideas for improving it in the comments.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","calendar"]}}