{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1512565143,"rating":26,"authorHandle":"savinova","modificationTimeSeconds":1512592881,"id":56197,"title":"\u003cp\u003eОтчет о деятельности Botan Investments за ноябрь. Системные проблемы NEERC\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, Codeforces!\u003c/p\u003e\u003cp\u003eВ ноябре в грантовой программе фонда Виктора Шабурова \u003cstrong\u003eBotan Investments\u003c/strong\u003e приняли участие 20 вузов. Больше 20 студентов удалось привлечь к тренировкам в УлГТУ (Ульяновск), СГУ (Саратов) и УрФУ (Екатеринбург). Больше всего тренировок провели в КФУ (Казань) и УрФУ (Екатеринбург) — 12 и 9 соответственно. Также \u003cstrong\u003eBotan Investments\u003c/strong\u003e выступил спонсором олимпиады по программированию в рамках фестиваля «IT-Архангельск», который пройдет в середине декабря, и помог команде ДВГУПС с поездкой на полуфинал. \u003c/p\u003e\u003cp\u003eВ группе \u003cstrong\u003eBotan Investments\u003c/strong\u003e в ВК вышли новые посты Михаила \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik\" title\u003d\"Master MikhailRubinchik\"\u003eMikhailRubinchik\u003c/a\u003e Рубинчика \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_270\"\u003eо \u0026quot;старении\u0026quot; тренера и привлечении молодых тренеров\u003c/a\u003e и о том, \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_275\"\u003eкак все-таки правильно называть АСМщиков\u003c/a\u003e. А сегодня Михаил подготовил пост о проблемах и нововведениях в NEERC. \u003cbr /\u003e\u003cbr /\u003e \u003c/p\u003e\u003ccenter\u003e \u003cdiv style\u003d\"width: 70.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/04/d0/04d041aad9131e06b23fcd118997e99228cb2bcd.jpg\" style\u003d\"width: 60.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e \u003c/center\u003e \u003cbr /\u003e\u003cbr /\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e Всем привет! \u003cbr /\u003e\u003cbr /\u003e Каждый год перед полуфиналом я публикую в своем блоге посты о NEERC. В этом году получилось немного по-другому. Во-первых, я делаю это в рамках постов от BotanInvestments, во-вторых, в этот раз чуть позже пф, в-третьих, самую крупную новость про финал лиги я вынес в \u003ca href\u003d\"//codeforces.com/blog/entry/55617\"\u003eотдельный пост\u003c/a\u003e. Год назад был \u003ca href\u003d\"//codeforces.com/blog/entry/48750\"\u003eтакой пост\u003c/a\u003e, а предыдущие два раза я написал сначала про идею кволов, а потом про реализацию. В этот раз пост будет по формату похож на пост прошлого года, но я буду говорить не о только проблемах, но и о нововведениях. \u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003e1. Финал лиги\u003c/strong\u003e\u003cbr /\u003e Самая важная новость — это, конечно, финал лиги (или суперрегион в старых терминах). Правда реальных изменений пока нет, только обещания :) Об этом я сейчас говорить не буду. Можете почитать детально в \u003ca href\u003d\"//codeforces.com/blog/entry/55617\"\u003eпредыдущем посте\u003c/a\u003e. \u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003e2. Существенный рост числа команд\u003c/strong\u003e\u003cbr /\u003e Если верить \u003ca href\u003d\"http://neerc.snarknews.info/index.cgi?data\u003dmacros/summary\u0026amp;menu\u003dindex\u0026amp;head\u003dindex\u0026amp;qf\u003dneerc\u0026amp;class\u003dneerc2017\u0026amp;text\u003dNEERC\u0026amp;year\u003d2017\u0026amp;bayregion\u003dneerc\"\u003eтабличкам от снарка\u003c/a\u003e, то прирост числа команд в нашем полуфинале (вернее, теперь уже в нашей лиге) в этом году составил 316 команд. Это очень круто :) \u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003e3. Массовое появление кволов\u003c/strong\u003e\u003cbr /\u003e Я специально в этом пункте не упоминаю Среднюю Азию и Кавказ. Про них расскажу в последующих пунктах. Главная причина роста числа участников — это, конечно, массовое появление кволов. Если после первого года все говорили о том, что кволы это плохо и их не нужно проводить, то после второго они появились в четырёх новых регионах, и вместе с нашими их стало пять: Дальний Восток, Восточная Сибирь, Урал, Москва, Юг. Без кволов пока Запад, Питер, Центр, Западная Сибирь, т.е. в половине регионов кволы уже проводятся. В кулуарах я слышал, что Запад и Центр в следующем году заинтересованы в проведении кволов у себя :) Надеюсь, что Западная Сибирь и Питер тоже всё-таки решатся. \u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003e4. Отсутствие АСМ ICPC в Таджикистане и Туркменистане\u003c/strong\u003e \u003cbr /\u003e К сожалению, в этом вопросе ничего не сдвинулось с места. В прошлом году я сумел привезти одну команду из Туркменистана на ВКОШП, но не более того. Поэтому по-прежнему очень нужны контакты студентов-олимпиадников и преподавателей программирования в вузах этих стран. \u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003e5. Разные правила на разных площадках полуфинала\u003c/strong\u003e\u003cbr /\u003e Наш полуфинал проходит параллельно на четырёх площадках: Санкт-Петербург, Барнаул, Алматы, Тбилиси. Отбор на полуфинал проходит по результатам четвертьфиналов. Вот только каждый четвертьфинал прикреплён ровно к одной из площадок полуфинала, а правила отбора для каждой площадки очень разные. Я считаю, что правила необходимо сделать одинаковыми, ну или почти одинаковыми. Основная причина проста: только правила отбора на Питерскую площадку стимулируют рост команд полуфинала. Эти правила появились в последние несколько лет. Они подталкивают организаторов и вузы создавать кволы и привлекать больше участников. Благодаря этому, например, наш четвертьфинал получил в этом году квоту аж 26 команд! На трёх других площадках такого поощрения нет или оно не афишируется. Я думаю, что распространение “Питерских” правил отбора на остальные площадки помогло бы решить и проблему отсутствия роста числа команд на других площадках, и ситуацию, когда на полуфинал проходят команды с последних мест. Например, посмотрите: \u003ca href\u003d\"http://neerc.snarknews.info/index.cgi?data\u003d2017/easib/running\u0026amp;menu\u003dindex\u0026amp;head\u003dindex\u0026amp;qf\u003deasib\u0026amp;class\u003deasib2017\u0026amp;year\u003d2017\"\u003ehttp://neerc.snarknews.info/index.cgi?data\u003d2017/easib/running\u0026amp;menu\u003dindex\u0026amp;head\u003dindex\u0026amp;qf\u003deasib\u0026amp;class\u003deasib2017\u0026amp;year\u003d2017\u003c/a\u003e \u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003e6. Нарезка на четвертьфиналы сложилась исторически и теперь сохраняется статус-кво\u003c/strong\u003e\u003cbr /\u003e Про это я уже писал год назад, но в этот раз ещё немного добавлю. Я считаю, что регионы теперь нужно делить так, чтобы учитывались часовые пояса. Ведь теперь появились кволы. К примеру, в Новосибе и Красноярске время одинаковое, поэтому их четвертьфиналы нужно просто объединить (с площадкой и в Новосибе, и в Иркутске, и в Красноярске). С другой стороны, в Омске на час меньше, чем в Новосибирске, поэтому Омск разумнее прикрепить к Уралу. А у Урала в свою очередь было бы полезно забрать Сыктывкар, который имеет московское время. \u003cbr /\u003e\u003cbr /\u003e \u003cstrong\u003e7. И ещё про правила кволов\u003c/strong\u003e\u003cbr /\u003e Все вводили их по-разному. В Москве правила были примерно такие же, как у нас. А вот Дальний Восток и Юг сделали кволы необязательными. На южный чф от каждого вуза можно привезти ещё одну команду, которая не участвовала в кволах. Я считаю, что это вредно для роста, потому что если вуз думает \u003cem\u003e“у меня всего одна команда, я не буду играть кволы”\u003c/em\u003e, то он никогда не создаст площадку. С другой стороны, если вуз думает \u003cem\u003e“хм, кволы делать обязательно, а у меня всего одна команда. Поищу на всякий случай ещё парочку, вдруг пройдут”\u003c/em\u003e, то всё может быть иначе. Мне кажется, такие правила существуют только из-за опасений, что вузы будут недовольны новшествами. Но мы не столкнулись с возмущениями. Активное недовольство в комментариях выражали только в Самаре, но в итоге Самара кволы проводила (не знаю, правда, довольны они этим или нет). \u003cbr /\u003e\u003cbr /\u003e Поэтому я считаю, что кволы всё же нужно делать обязательными везде, это даст нам ещё больше команд в нашей лиге Северной Евразии :) \u003c/p\u003e\u003c/div\u003e","tags":["neerc","botan investments","витор шабуров"]}}