{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1418551214,"rating":82,"authorHandle":"RodionGork","modificationTimeSeconds":1418551214,"id":15156,"title":"\u003cp\u003eЗа что недолюбливаю Google\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cem\u003eПридумал как понизить вклад — нужно поругать Google\u003c/em\u003e\u003c/p\u003e\u003cp\u003eВообще раньше я его оч хвалил, и до сих пор для меня это основной поисковик... Но активная \u003ca href\u003d\"http://codeforces.ru/blog/entry/15144\"\u003eборьба Гугла за демократию\u003c/a\u003e в развивающихся странах и \u003ca href\u003d\"http://www.forbes.com/sites/scottcleland/2012/01/24/the-real-reasons-google-killed-sopapipa/\"\u003eсправедливость интернет законов\u003c/a\u003e мне иногда кажутся искусственными и фальшивыми на фоне их собственных огрехов.\u003c/p\u003e\u003cp\u003eЧем больше я знакомлюсь с многочисленными сервисами гугла, тем больше я порой удивляюсь. Попробовал вспомнить самые загадочные для меня моменты:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eГугл активно борется с сексом и насилием в Google Play (\u003ca href\u003d\"http://geektimes.ru/post/232247/\"\u003egeektimes\u003c/a\u003e). Жертвами борьбы падают мелкие разработчики-одиночки, апелляции которых гугл игнорирует — при этом просто достаточно чтоб на тебя пожаловались, даже если у тебя нет подобного контента (гугл после \u0026quot;тщательной проверки\u0026quot; банит твои приложения) — крупные же дилеры софта явно имеют некие коррупционные договорённости с гуглом, которые позволяют им выкладывать что угодно.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eАналогично гугл борется за права правообладателей. Реагирует на любые жалобы крупных партнёров вроде \u0026quot;Blue Planet Software\u0026quot;, банит без предупреждений, не вникая в детали и не вдаваясь в объяснения — апелляции предлагает направлять к этим же партнёрам. Будьте осторожны со словом \u0026quot;tetris\u0026quot;! :)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eГугл тихонько сливает инфу. Если вы добавляете на сайт хоть баннер Google AdSense, то рейтинг вашего сайта в Alexa ощутимо изменится (обычно в лучшую сторону) — т.е. инфа о количестве загрузок ваших страниц сливается в Амазон владеющий Алексой (так же как если вы рекламу от амазона добавите). В этом почти ничего плохого (особенно если рейтинг в алексе растёт а не падает) — но вы не найдёте чтобы гугл об этом писал. Это в частности одна из причин почему некоторые заказчики даже аналитику просят использовать собственную а не гугловую.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eНесмотря на обещания показывать только качественную рекламу, гугл, особенно на мобильных платформах, отображает и баннеры волшебных программ \u0026quot;для ускорения всего\u0026quot;, и \u0026quot;супер-антивирусы\u0026quot;, и даже рекламирует конкурирующие магазины приложений (что сам запрещает), и сайты которые сам считает небезопасными (\u003ca href\u003d\"http://topvirus.ru/news/business/58/\"\u003eсм. подробнее\u003c/a\u003e). Как результат в какой-то момент пользователи начинают жаловаться что им ваш сайт показывает какую-то хрень, а вы даже не можете разобраться что это за хрень была (т.к. для этого надо от пользователя добиться ряда хитроумных действий, чуть ли не перехода на вредоносный сайт).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eУстановите Поиск Гугл для Сайтов чтобы увидеть насколько он убогий — он не находит на вашем сайте даже той инфы которая явно проиндексирована в обычном поиске гугл — зато вываливает тонну нерелевантной рекламы типа \u0026quot;купить travelling salesman\u0026quot;. К счастью я обнаружил что Поиск от Яндекса лишён обеих этих проблем (\u003ca href\u003d\"http://rodiongork.tumblr.com/post/105062508728/google-custom-search-alternative\"\u003eподробнее описал здесь\u003c/a\u003e). По интернетам я позже нашёл что это известная проблема (\u003ca href\u003d\"https://productforums.google.com/forum/#!topic/customsearch/TsKHps8bpiQ\"\u003eнапример\u003c/a\u003e).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВообще сервисы гугла безобразно плохо интегрированы. Платёжная система Google Wallet не может быть использована для оплаты Google AdWords или для вывода Google AdSense. Для каждого из этих сервисов нужно регаться в какой-нить посторонней системе (вроде ООО Рога и Копыта). Я понимаю что амазон не принимает платежи через PayPal, т.к. это конкуренты. Но в случае с гуглом другого объяснения как затмение в умах на высшем уровне трудно найти.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eГугл проводит политику монополизации андроидного мира и старательно выжимает конкурентов, в частности требуя разработчиков девайсов предустанавливать свои приложения (\u003ca href\u003d\"https://www.theinformation.com/Google-s-Confidential-Android-Contracts-Show-Rising-Requirements\"\u003eссылка\u003c/a\u003e) — в противном случае лишая доступа к своим сервисам.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eГугл предпочитает секретить разработки таких технологий которые Yahoo и Facebook контрибутят в opensource. Типичным примером являются технологии BigData — почти все решения гугла в этой области закрыты (ну как \u003ca href\u003d\"http://en.wikipedia.org/wiki/Google_File_System\"\u003eGFS\u003c/a\u003e и \u003ca href\u003d\"http://en.wikipedia.org/wiki/BigTable\"\u003eBigTable\u003c/a\u003e), так что мы пользуемся их опенсорсными аналогами (вроде HDFS и HBase) лишь благодаря вышеупомянутым конкурентам гугла.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПохоже Гугл не стремился поддержать Google AI Challenge, так что в последний раз они вроде бы прошли уже без названия гугла... И с тех пор по-моему их не видели. Ну да, это общая проблема подобных соревнований — их польза для больших компаний слишком неочевидна. Но всё же \u003ca href\u003d\"http://codeforces.ru/blog/entry/13417\"\u003eэнтузиасты находятся\u003c/a\u003e даже среди куда меньших компаний.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003e\u003cstrong\u003eРезюмируя\u003c/strong\u003e что я хочу сказать. Гугл зайка — но он не годится на пост:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eвсемирного борца за права и свободы (если их нельзя трактовать и использовать в целях увеличения прибыли гугла);\u003c/li\u003e   \u003cli\u003eвеликого радетеля о светлом технологичеком будущем человечества;\u003c/li\u003e   \u003cli\u003eпримера компании которая всё делает идеально.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cem\u003eP.S. Извините что недостаточно много пруфлинков собрал.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e","tags":["google","hatred","минусуйте активнее"]}}