{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1478239421,"rating":0,"authorHandle":"zscoder","modificationTimeSeconds":1478245430,"id":48211,"title":"\u003cp\u003eHack This Code!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi all!\u003c/p\u003e\u003cp\u003eHave you ever joined a Codeforces Round before? Have you ever wondered what the \u0026quot;Hacks\u0026quot; do? You\u0027ve come to the right place! In this group, you\u0027ll get the chance to hack solutions from all over Codeforces!\u003c/p\u003e\u003cp\u003eThe problems will have this format :\u003c/p\u003e\u003cp\u003eProblem : You\u0027ll be a given a link to some existing problem on Codeforces.\u003c/p\u003e\u003cp\u003eCode : You\u0027ll be linked to some submission to that problem, possibly modified.\u003c/p\u003e\u003cp\u003eAdditional Requirements : Might contain some additional requirements for your output.\u003c/p\u003e\u003cp\u003eYour task is to read the problem and the given code, and find a testcase \u003cstrong\u003esatisfying the original problem condition (you must format it as in the original problem)\u003c/strong\u003e for which the given solution fails. Additionally, if the Additional Requirements part is nonempty, your testcase must also satisfy the Additional Requirements to be considered valid.\u003c/p\u003e\u003cp\u003eYou should write a program that writes the testcase to the standard output. Your testcase will be judged as Accepted if the code given in the link generate a wrong answer.\u003c/p\u003e\u003cp\u003eHoepfully through hacking you will learn some common frustrating bugs that people make. Good luck and have fun!\u003c/p\u003e\u003cp\u003eP.S. Please do not cheat or attempt to cheat. This contest is unofficial and is just for fun. You will be moved to Practice Mode if you\u0027re discovered to be cheating. \u003c/p\u003e\u003cp\u003eUPD : It is recommended to use Codeforces Custom Invocation to check whether your hack works, as your system and Codeforces system might have some differences which produces different results.\u003c/p\u003e\u003cp\u003eTip : In case you\u0027re too lazy to write a program that actually outputs the input, here\u0027s a tip. Switch to PHP language, and type the input into the editor like normal.\u003c/p\u003e\u003c/div\u003e","tags":[]}}