{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1426851696,"rating":137,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1426971887,"id":17038,"title":"\u003cp\u003eVK Cup 2015 — Раунд 1\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/vkcup2015/round-1-girl.jpg\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eВ \u003ca href\u003d\"http://timeanddate.com/worldclock/fixedtime.html?day\u003d21\u0026amp;month\u003d3\u0026amp;year\u003d2015\u0026amp;hour\u003d17\u0026amp;min\u003d0\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003eсубботу, 21-го марта, в 17:00\u003c/a\u003e будет дан старт Раунду 1 чемпионата по программированию VK Cup 2015! Не забудьте зарегистрировать вашу команду на раунд, регистрация закроется за пять минут до его старта.\u003c/p\u003e\u003cp\u003eВ этом раунде могут принять все те команды, которые прошли квалификацию. Напомним, что из первой квалификации допущены все те команды, что набрали не менее 1500 баллов. Таких оказалось 789. Вторую квалификацию прошли 504 команды, все те, что набрали не менее 1850 баллов. Таким образом, принять участие в Раунде 1 могут 1293 команды!\u003c/p\u003e\u003cp\u003eУчастников ждет соренование по \u003ca href\u003d\"/blog/entry/4088\"\u003eправилам классических раундов Codeforces\u003c/a\u003e с некоторыми адаптациями:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eзадачи будут исключительно на русском языке (в отличие от интернет-трансляции, где будут и на английском);\u003c/li\u003e   \u003cli\u003eв Раунде 1 будут участвовать команды по 1 или 2 человека, разрешается любая коммуникация внутри команды, но какое-либо общение с другими лицами по прежнему, конечно, запрещено;\u003c/li\u003e   \u003cli\u003eкаждая команда может использовать один или более компьютеров по своему усмотрению (напомним, что в Финале команде будет дана возможность использовать только один компьютер);\u003c/li\u003e   \u003cli\u003eдля членов команды рейтинг будет пересчитан одинаково, исходя из рейтинга команды (учитываются зарегистрированные на раунд члены команды), о подсчете рейтинга команды можно почитать \u003ca href\u003d\"/blog/entry/16986\"\u003eздесь\u003c/a\u003e.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eУчастников ждет обновленная динамическая стоимость задач (смотрите \u003ca href\u003d\"/blog/entry/4172\"\u003eпост\u003c/a\u003e), теперь более плавная, с шагом в 250 баллов.\u003c/p\u003e\u003cp\u003eОтметим, что сразу после окончания Раунда 1 будет проведена интернет-трансляция, поэтому просим участников воздержаться до ее окончания от публичных обсуждений, распространения информации о задачах, идеях и даже ходе соренования.\u003c/p\u003e\u003cp\u003eНапомним, что в Раунд 2 пройдут все те команды, которые наберут положительный балл не меньший, чем у команды на 400-м месте.\u003c/p\u003e\u003cp\u003eЖелаем удачи и интересной борьбы!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.:\u003c/strong\u003e Раунд закончен, спасибо за проявленный интерес. Раунд получился динамичным, жюри с интересом следили за ходом соревнования. Поздравляем победителей и напоминаем, что лучшие 400 команд (т.е. те, кто набрал не менее 796 баллов) получают приглашение в Раунд 2. Остальным еще рано расстраиваться, ведь через неделю вас ждет Вайлд-кард 1, по результатам которого будут разыграны еще 50 приглашений в Раунд 2.\u003c/p\u003e\u003c/div\u003e","tags":["vkcup","vkcup2015"]}}