{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1497949401,"rating":4,"authorHandle":"touristplease","modificationTimeSeconds":1497949401,"id":52769,"title":"\u003cp\u003eWhat is practice/How to practice? [Help]\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eFor the past 1.5 years, I\u0027ve been solving problems in a not-so-regular fashion. I\u0027ve improved (just a little). I can\u0027t solve any fancy problems tho. I can probably solve 2 problems in Div2. Most likely I won\u0027t solve C-Div2 within the contest but maybe some hour(s) after.\u003c/p\u003e\u003cp\u003eWhat is considered practice? Just the exposure to a problem and thinking about a solution (even failure?). Like I will be honest, I enjoy the process and gosh I enjoy it even more when it pays off and you solve the problem. But considering how slow the progress is for me I started thinking two things:- \u003c/p\u003e \u003cul\u003e   \u003cli\u003eI am stupid af and this isn\u0027t for me.\u003c/li\u003e   \u003cli\u003eI am doing something wrong or maybe practicing in a wrong way:\u003c/li\u003e   \u003cli\u003e   \u003cul\u003e     \u003cli\u003e\u003cem\u003eTaking too long in a problem that might just needs some technique or concept that I am yet not familiar with.\u003c/em\u003e\u003c/li\u003e   \u003c/ul\u003e\u003c/li\u003e   \u003cli\u003e   \u003cul\u003e     \u003cli\u003e\u003cem\u003eNot tackling the problems the right way thus, taking too long to get through them.\u003c/em\u003e\u003c/li\u003e   \u003c/ul\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eI strongly wish some of you write about how their process goes until they find a solution. How you guys look at the problems and what you do to come up with (a) proper solution(s). Is it pattern matching? Completely thinking of something new?. I believe a few tips on how to tackle a problem that I haven\u0027t seen anything like would be of much help\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eShould I look up techniques and algorithms and search for related problems or wait until I am exposed to them by chance?\u003c/p\u003e\u003cp\u003eI try to get out of my comfort zone and solve harder problems (currently Div2 C is not easy for me so I try to solve them). Should I limit my thinking time and just look for hints or check the editorial after? Is it any good if you just keep going or is it a waste of time? \u003c/p\u003e\u003cp\u003eJust share your thoughts. Maybe your practice routines from when you started. Something you read that helped. Success stories for perhaps some motivation. \u003c/p\u003e\u003c/div\u003e","tags":["best practices","practice","#help"]}}