{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1485033038,"rating":0,"authorHandle":"1am","modificationTimeSeconds":1485033291,"id":49936,"title":"\u003cp\u003eWeek 4\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIm sorry, im late. I hope everyone is doing well on their exams.\u003c/p\u003e\u003cp\u003eFirst of all, we solved problems from last week\u0027s contest so make sure you have those solved. \u003c/p\u003e\u003cp\u003eThe week 4 contest contains some problems that need arrays, questions C and D. They are not required to be solved. I will be explaining arrays next day inshallah.\u003c/p\u003e\u003ch1\u003eWhile Loops\u003c/h1\u003e\u003cp\u003eWe first talked about while loops and how they continue to loop until the condition is false (0).\u003c/p\u003e\u003cp\u003eWe discussed how you can use while loops to output each digit of a number, the code is here: \u003ca href\u003d\"http://ideone.com/5xJqVs\"\u003ehttp://ideone.com/5xJqVs\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWe also discussed how you can use a while loop to convert a decimal number to its binary representation, which is needed in question A in week 4. Here is the code: \u003ca href\u003d\"http://ideone.com/4RwYYn\"\u003ehttp://ideone.com/4RwYYn\u003c/a\u003e\u003c/p\u003e\u003ch1\u003eBinary Search\u003c/h1\u003e\u003cp\u003eWe also learned how to look for a number using binary search. Binary search is the process of narrowing the range we are searching in by checking its midpoint.\u003c/p\u003e\u003cp\u003eIf the number we are looking for is bigger than the midpoint, the new left of our range is the midpoint. Since we dont need to look at anything less than the midpoint.\u003c/p\u003e\u003cp\u003eIf the number we are looking for is less than the midpoint, the new right of our range is the midpoint. Since we dont need to look at anything greater than the midpoint.\u003c/p\u003e\u003cp\u003eHere is a little game you can play to understand the concept: \u003ca href\u003d\"https://www.cs.usfca.edu/~galles/visualization/Search.html\"\u003ehttps://www.cs.usfca.edu/~galles/visualization/Search.html\u003c/a\u003e\u003c/p\u003e\u003cp\u003eHere is just a brief outline of the code we wrote, but it depends on the question you are asked: \u003ca href\u003d\"http://ideone.com/d3OFlq\"\u003ehttp://ideone.com/d3OFlq\u003c/a\u003e\u003c/p\u003e\u003ch1\u003eD. Forming Teams (B)\u003c/h1\u003e\u003cp\u003eForming Teams (A) is like a warm up for the binary search question. Do solve it first.\u003c/p\u003e\u003cp\u003eLike for example the last problem we solved was a minimization problem. We did a binary search on the number of people that are unsatisfied, and we want to minimize this.\u003c/p\u003e\u003cp\u003eOur left is zero, the minimum number of people unsatisfied. The right is m, which is the number of people who want to sit individually. All the unsatisfied people come from them, so maximum amount is their number.\u003c/p\u003e\u003cp\u003eLet \u0027un\u0027 represent the number of people unsatisfied. We want to check if this is a valid answer. If there is un people unsatisfied, then there is m — un people satisfied. Each of these satisfied people get a computer to themselves. So we decrease from \u0027k\u0027 ( the number of computers) the number of people satisfied. \u003c/p\u003e\u003cp\u003eWe are now left with \u0027c\u0027 computers. We need to fit all the people \u0027n\u0027 and the unsatisfied \u0027un\u0027 into these k computers. It is best to put them into groups of three to see if they fit.\u003c/p\u003e\u003cp\u003eLet \u0027g\u0027 be the number of computers needed to seat the remainder. If it is less than the number of computers left \u0027c\u0027, then they can all be seated with \u0027un\u0027 unsatisfied students. Since we know \u0027un\u0027 is a valid answer and we want to minimize our answer, we wont look at anything larger than \u0027un\u0027 unsatisfied students. Therefore our new right for our binary search is mid-1.\u003c/p\u003e\u003cp\u003eIf we cannot seat them all comfortably, then more people have to be unsatisfied for them to all be seated. Therefore we dont look at anything less than \u0027un\u0027 since we know it wont work either, and our new left is now \u0027un\u0027 (or mid).\u003c/p\u003e\u003cp\u003eHere is the code we wrote for it: \u003ca href\u003d\"http://ideone.com/SQfl2I\"\u003ehttp://ideone.com/SQfl2I\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}