{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1516900204,"rating":72,"authorHandle":"Harbour.Space","modificationTimeSeconds":1517336398,"id":57333,"title":"\u003cp\u003eIDAO — International Data Analysis Olympiad\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/34/8f/348fb7e107fc5eefe799d31ea16d50b08c920c37.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eThe First \u003ca href\u003d\"https://goo.gl/EmSLBg\"\u003eInternational Data Analysis Olympiad (IDAO)\u003c/a\u003e Began Online This January — Finals To Be Held This April in Moscow, Russia.\u003c/p\u003e\u003cp\u003eThis is the best time to join the competition. It will be running until February 11th and the problems will be in English — if you want to take part and win a prize, register now.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.hse.ru/en/\"\u003eHigher School of Economics\u003c/a\u003e, \u003ca href\u003d\"https://www.yandex.com/\"\u003eYandex\u003c/a\u003e and \u003ca href\u003d\"http://www.sberbank.com/\"\u003eSberbank\u003c/a\u003e along with Harbour.Space University are proud to announce an olympiad created by and for data analysts. \u003c/p\u003e\u003cp\u003eThe event aims to bridge the gap between the all-increasing complexity of Machine Learning models and performance bottlenecks of the industry. The participants will strive not only to maximize the quality of their predictions, but also to devise resource-efficient algorithms. \u003c/p\u003e\u003cp\u003eThis will be a team machine learning competition, divided into two stages:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eThe first stage will be online, open to all participants.\u003c/li\u003e   \u003cli\u003eThe second stage will be the offline on-site finals, in which the top 30 performing teams from the online round will compete at the Yandex office in Moscow.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eWe would like to thank the IDAO team for their amazing work in problemsetting — Dmitry Vetrov, Andrey Chertok, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/GlebsHP\" title\u003d\"International Grandmaster GlebsHP\"\u003eGlebsHP\u003c/a\u003e, Alexander Guschin, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Michael\" title\u003d\"International master Michael\"\u003eMichael\u003c/a\u003e, Konstantin Mertsalov, Evgeny Sokolov, Vadim Strijov, Nick Tiden, Dmitry Ulyanov, Andrey Ustyuzhanin.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://goo.gl/EmSLBg\"\u003e\u003cstrong\u003eMore information and register\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSTAGE 1. ONLINE\u003c/p\u003e\u003cp\u003eThere will be two separate tracks during the online stage. From the machine learning perspective, the tracks will be similar, yet the restrictions put on the solutions are different for each track.\u003c/p\u003e\u003cp\u003eWe hope that the two tracks will make the olympiad fascinating for both machine learning competition experts and competitive programming masters, Kaggle winners and ACM champions, as well as everyone eager to solve real world problems with Data. Moreover, we encourage people with different backgrounds, \u003cstrong\u003eML and ACM\u003c/strong\u003e, to team up and push Data Analysis to new frontiers.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe first track will be a traditional data science competition.\u003c/strong\u003e Having a labeled training data set, participants will be asked to make a prediction for the test data and submit their predictions to the leaderboard. In this track, participants can produce arbitrarily complex models. If you like to use 4-level stacking or deep neural networks, this is the right track for you – you will only need to submit test predictions. However, those who qualify for the finals will be asked to submit the full code of the solution for validation by the judges. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eIn real world problems, efficiency is as important as quality.\u003c/strong\u003e Complex and resource-intensive solutions will not fit the strict time and space restrictions often imposed by an application. That is why in the second competition track, your task will be to solve the same problem as was in track one, but with tight restrictions on the time and on the memory used during both learning and inference. You will need to upload the end-to-end code for your solution: both learning and inference. The evaluation server will run training and testing for your model and report the result. Both learning and evaluation must fit into time and memory constraints. \u003cstrong\u003eIf you like the most efficient solutions, this is the right track for you\u003c/strong\u003e. \u003c/p\u003e\u003cp\u003ePRIZES\u003c/p\u003e\u003cp\u003eWinners of the first stage will be invited to Moscow to take part in the on-site competition. Accommodation, and half-board meals are covered by the organising committee.\u003c/p\u003e\u003cp\u003eAll participants have the chance to showcase their skills to the data science community on an international scale — the results will be internships, networking with some of the most passionate and like minded individuals, and job opportunities. \u003c/p\u003e\u003cp\u003eFor winners, valuable prizes will be awarded, with both \u003ca href\u003d\"https://www.hse.ru/en/\"\u003eHigher School of Economics\u003c/a\u003e and \u003ca href\u003d\"https://harbour.space/\"\u003eHarbour.Space University\u003c/a\u003e offering special awards. Students from outside of Russia will have an opportunity to join a Master\u0027s degree programme at HSE, within the Faculty of Computer Science, free of charge. From Harbour.Space University, a 29,000 EUR scholarship will be offered, which also covers living costs in Barcelona, for graduate and undergraduate degrees. \u003c/p\u003e\u003cp\u003eSpecial prizes might be awarded at the discretion of the jury.\u003c/p\u003e\u003cp\u003eThe winners will be determined by the leaderboard ranking based on private test set.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://goo.gl/EmSLBg\"\u003e\u003cstrong\u003eMore information and register\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}