{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1525814508,"rating":0,"authorHandle":"Marcin_smu","modificationTimeSeconds":1525870329,"id":59347,"title":"\u003cp\u003eMistrzostwa Wydziału MIM w Programowaniu 2018: Regulamin\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003col\u003e     \u003cli\u003e Mistrzostwa składają się z trzech rund, które odbędą się w dniach 10.05.2018, 17.05.2018 i 24.05.2018 (czwartki) w godz. 14:30-19:30.\u003c/li\u003e     \u003cli\u003e W mistrzostwach mogą startować wszyscy studenci Wydziału Matematyki Informatyki i Mechaniki Uniwersytetu Warszawskiego, którzy nie posiadają tytułu magistra.      W uzasadnionych przypadkach organizatorzy mogą pozwolić startować w zawodach również innym zawodnikom.\u003c/li\u003e        \u003cli\u003eZawody można pisać w zarezerwowanych laboratoriach komputerowych   (3042, 3043, 3044 i w razie potrzeby wyznaczonych dodatkowych salach).   W uzasadnionych przypadkach można pisać wybrane rundy za pośrednictwem Internetu (należy uprzednio skontaktować się z organizatorami).    Zawodnicy piszący poszczególne rundy zdalnie zostaną odpowiednio oznaczeni w rankingu wynikowym.   \u003c/li\u003e   \u003cli\u003ePo zakończeniu każdej rundy odbędzie się omówienie rozwiązań w sali 2070, na które serdecznie   zapraszamy wszystkich startujących.   W trakcie omówienia rozwiązań będzie zapewniona pizza.\u003c/li\u003e   \u003cli\u003e Po zakończeniu mistrzostw najlepsi zawodnicy zostaną nagrodzeni.\u003c/li\u003e   \u003cli\u003eKażda runda mistrzostw polega na \u003cb\u003esamodzielnym rozwiązaniu 4-8 zadań\u003c/b\u003e.   Konkurs będzie przeprowadzony na zasadach ACM ICPC (zgłoszenia są akceptowane albo odrzucane,   liczone są zgłoszenia zaakceptowane i sumaryczny czas, czas za rozwiązane zadanie liczony   od początku konkursu, 20 minut kary za każdą bombkę w rozwiązanym zadaniu,   zamrażanie rankingu na godzinę przed zakończeniem konkursu itd.).   Gdyby ktoś miał jakieś wątpliwości co do zasad, proszę nas pytać.   Zasady będą zresztą takie same jak na naszych treningach indywidualnych.\u003c/li\u003e   \u003cli\u003ePunkty za pojedynczą rundę mistrzostw będą przydzielane według zasad \u003ca href\u003d\"http://acm.icpc.mimuw.edu.pl/gp30.txt\"\u003eGP30\u003c/a\u003e (tak jak np. w skokach narciarskich).   Łączny wynik dla każdego zawodnika będzie \u003cb\u003e sumą ważoną jego wyników ustalonych zgodnie z tą skalą. Dwa najlepsze wyniki będą sumowane z wagą 1, a trzeci — z wagą 0,5.\u003c/b\u003e   \u003c/li\u003e      \u003cli\u003e   \u003cb\u003eDodatkowe punkty\u003c/b\u003e, maksymalnie 50, można zdobyć za wyniki w konkursach \u003cb\u003eCodeforces\u003c/b\u003e, \u003cb\u003eTopCoder\u003c/b\u003e oraz \u003cb\u003eAtCoder\u003c/b\u003e przeprowadzonych w dniach 10.05.2018 — 26.05.2018.   Konkretniej:      \u003cul\u003e     \u003cli\u003eAlgorytmiczna runda TopCodera przeprowadzona w sobotę 12.05 na naszym wydziale       \u003ca href\u003d\"https://tco18.topcoder.com/regional-events/warsaw-poland/\"\u003eTopCoder Regional Event\u003c/a\u003e       (Należy zawczasu zarejestrować się na wydarzenie).       \u003c/li\u003e     \u003cli\u003e \u003cb\u003e AtCoder Grand Contest 024 \u003c/b\u003e oraz \u003cb\u003e AtCoder Grand Contest 025 \u003c/b\u003e przeprowadzone odpowiednio w dniach 20.05 oraz 26.05.\u003c/li\u003e     \u003cli\u003e Wszystkie rundy \u003cb\u003eCodeforces\u003c/b\u003e \u003ci\u003erated\u003c/i\u003e dla pierwszej dywizji przeprowadzone w dniach 10.05.2018 — 26.05.2018      (miejsca w dywizji 1. będą traktowane jako wyższe niż miejsca w dywizji 2.)     \u003c/li\u003e   \u003c/ul\u003e   Dla każdego konkursu zostanie sporządzony ranking uczestników zarejestrowanych na Mistrzostwa,   a następnie otrzymają oni punkty zgodnie następującą tabelą \u003ca href\u003d\"http://acm.icpc.mimuw.edu.pl/gp8.txt\"\u003ePodwojone GP8\u003c/a\u003e.        \u003c/li\u003e\u003cli\u003eKażda z rund mistrzostw będzie trwała 5 godzin. Czas ten może ulec zmianie w przypadku poważnych problemów technicznych.\u003c/li\u003e   \u003cli\u003eZadania będą miały zróżnicowaną tematykę i stopień trudności.   Treści zadań będą sformułowane w języku angielskim.   Limity pamięci oraz limity czasu będą jawne.   \u003c/li\u003e   \u003cli\u003eW trakcie zawodów \u003cb\u003enie wolno korzystać z Internetu\u003c/b\u003e poza stroną \u003ca href\u003d\"//warsaw.contest.codeforces.com\"\u003ehttp://warsaw.contest.codeforces.com\u003c/a\u003e,   na której będą odbywać się mistrzostwa.   \u003cb\u003eBardzo liczymy na Waszą uczciwość.\u003c/b\u003e   Można jednakże korzystać on-line z dokumentacji do C++ (w tym STL-a) i dokumentacji do FPC.   Można korzystać z materiałów elektronicznych zgromadzonych we własnym katalogu domowym na maszynie students   (\u003ci\u003ew szczególności można kopiować kody źródłowe\u003c/i\u003e).   \u003c/li\u003e   \u003cli\u003eKażdy uczestnik zawodów musi mieć założone konto w systemie codeforces.   Login należy przesłać organizatorom poprzez \u003ca href\u003d\"https://goo.gl/forms/vt4fFp6vG0cgk20p2\"\u003eformularz\u003c/a\u003e.   (Konkurs będzie dostępny tylko dla użytkowników, których loginy zostały podane w formularzu przed rozpoczęciem poszczególnych rund).\u003c/li\u003e   \u003cli\u003eW trakcie zawodów można zadawać pytania związane z zadaniami przez system codeforces.   Na każde pytanie zostanie udzielona odpowiedź (wyjątkiem mogą być pytania typu \u0026quot;zupełnie nie   rozumiem treści\u0026quot; i pytania o sposób rozwiązania zadania; w takich przypadkach możemy udzielić   odpowiedzi \u0026quot;BRAK ODPOWIEDZI\u0026quot;).\u003c/li\u003e   \u003cli\u003eNależy przyjąć, że dane testowe są bezbłędne, zgodne z warunkami zadania i podaną specyfikacją wejścia.\u003c/li\u003e   \u003cli\u003eDane powinny być wczytywane ze standardowego wejścia, a wyniki -- wypisywane na standardowe wyjście.\u003c/li\u003e \u003c/ol\u003e \u003cp\u003eOrganizatorzy mistrzostw:\u003c/p\u003e \u003cul\u003e     \u003cli\u003eAdam Karczmarz (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/dasko1\" title\u003d\"Grandmaster dasko1\"\u003edasko1\u003c/a\u003e)\u003c/li\u003e     \u003cli\u003eTomasz Kociumaka (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/tomasz.kociumaka\" title\u003d\"International Grandmaster tomasz.kociumaka\"\u003etomasz.kociumaka\u003c/a\u003e)\u003c/li\u003e     \u003cli\u003eMarcin Smulewicz (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Marcin_smu\" title\u003d\"International Grandmaster Marcin_smu\"\u003eMarcin_smu\u003c/a\u003e)\u003c/li\u003e \u003c/ul\u003e \u003cp\u003ePatronat:\u003c/p\u003e \u003cul\u003e     \u003cli\u003eprof. Krzysztof Diks\u003c/li\u003e \u003c/ul\u003e \u003cp\u003ePytania i uwagi techniczne związane z mistrzostwami można przesyłać do organizatorów. W razie pojawienia się \u0026quot;dobrych pytań\u0026quot; zastrzegamy sobie możliwość uściślenia regulaminu. Zmiany zostaną wtedy wyróżnione kursywą.\u003c/p\u003e\u003c/div\u003e","tags":[]}}