{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1464257949,"rating":34,"authorHandle":"Balajiganapathi","modificationTimeSeconds":1464258072,"id":45065,"title":"\u003cp\u003eInvitation to SnackDown 2016 Qualification round\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello CodeForces Community!\u003c/p\u003e\u003cp\u003eI’d like to invite you to participate in CodeChef’s global onsite programming contest \u003ca href\u003d\"https://www.codechef.com/snackdown/2016\"\u003eSnackDown 2016 Qualifier\u003c/a\u003e which starts tomorrow i.e \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dSnackDown+2016+Online+Qualifier+\u0026amp;iso\u003d20160527T21\u0026amp;p1\u003d44\"\u003eat 9 PM 27th May\u003c/a\u003e. I took part in SnackDown 2015 and my team was one of the winners (Indian category) of the contest. You can read my complete experience from the contest on \u003ca href\u003d\"https://blog.codechef.com/2016/05/19/ancalagons-tale-of-snackdown-2015-triumph/\"\u003eCodeChef’s blog\u003c/a\u003e. And as you already would have heard the \u003ca href\u003d\"//codeforces.com/blog/entry/44729?#comment-295447\"\u003etimings of online elimination has been changed\u003c/a\u003e and the organizers are contemplating the idea of revoking the team restrictions in future. So, that leaves us with no reason to not take part in the contest. And after being to the onsite finale once, I would strongly suggest that you participate in the contest. Not only for the awesome experience at the finale, but also for the brilliant problems. \u003c/p\u003e\u003cp\u003eFor the qualifiers, the problems have been set and tested by \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/kevinsogo\" title\u003d\"Мастер kevinsogo\"\u003ekevinsogo\u003c/a\u003e (Kevin Charles Atienza), \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Antoniuk\" title\u003d\"Кандидат в мастера Antoniuk\"\u003eAntoniuk\u003c/a\u003e (Vasya Antoniuk), \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Cherrytree\" title\u003d\"Мастер Cherrytree\"\u003eCherrytree\u003c/a\u003e (Sergey Kulik) and the translations were written by \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/huzecong\" title\u003d\"Международный мастер huzecong\"\u003ehuzecong\u003c/a\u003e (Hu Zecong),\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Antoniuk\" title\u003d\"Кандидат в мастера Antoniuk\"\u003eAntoniuk\u003c/a\u003e (Vasya Antoniuk), VNOI Team, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Cherrytree\" title\u003d\"Мастер Cherrytree\"\u003eCherrytree\u003c/a\u003e (Sergey Kulik), with \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/PraveenDhinwa\" title\u003d\"Эксперт PraveenDhinwa\"\u003ePraveenDhinwa\u003c/a\u003e (Praveen Dhinwa) as contest admin. I hope you will enjoy solving the problems.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRegistrations:\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eYou can register in a team of two or can go solo into the contest. The Online Qualifier starts at \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dSnackDown+2016+Online+Qualifier+\u0026amp;iso\u003d20160527T21\u0026amp;p1\u003d44\"\u003e9 PM 27th May\u003c/a\u003e.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIf you are yet to register, you can do so here: \u003ca href\u003d\"https://www.codechef.com/snackdown/2016\"\u003ehttps://www.codechef.com/snackdown/2016\u003c/a\u003e.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe contest format requires you to participate in a team of 2 or you can go solo (and both the team members should be from same instititute/organization). Furthermore, this year, \u003cstrong\u003eCodeChef will be inviting 52 team’s (top 25 global + top 25 Indian + all Girl team + Indian school team) for the onsite finals at Mumbai\u003c/strong\u003e. Of these 52 teams, 32 teams (top 15 each Global \u0026amp; Indian + Girl + Indian school team) will get an all expense paid trip to India, while the remaining 20 teams will be provided with accommodation and local travel in India. However, if any of these 20 teams win the competition, their travel fare will be reimbursed as well. It’s a win-win situation.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eAlong with the cash prizes for Global Winners, there are special prizes for Best School Team, Best Girls team and Best Indian Team (the total cash prizes are worth $22,500). \u003c/p\u003e \u003cul\u003e   \u003cli\u003eThe winning team shall win a whooping cash prize of $10,000.\u003c/li\u003e   \u003cli\u003eAlso, taking into consideration the previous discussions regarding the timing of online elimination round of the contest, the organizers have decided to reschedule the round.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eThe new timings for the SnackDown 2016 Elimination Round are:\u003c/strong\u003e\u003c/p\u003e \u003cul\u003e   \u003cli\u003eTime: \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dSnackDown16+Online+Elimination\u0026amp;iso\u003d20160619T1930\u0026amp;p1\u003d44\u0026amp;ah\u003d5\"\u003e19th June 2016, 7:30 pm to 12:30 am 20th June 2016 IST\u003c/a\u003e.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eIn order to accommodate the new timings, they have also rescheduled the June Cook-Off 2016. And the new timings for the June Cook-Off are:\u003c/p\u003e\u003cp\u003eDate \u0026amp; Time: \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dCodeChef%3A+June+Cook-Off+2016\u0026amp;iso\u003d20160626T2130\u0026amp;p1\u003d44\u0026amp;ah\u003d2\u0026amp;am\u003d30\"\u003e26th June 2016, 21:30 Hrs IST to 00:00 Hrs IST\u003c/a\u003e\u003c/p\u003e\u003cp\u003eI hope you like the new timings and that will enjoy the contest till the very end. That will be all from my side for now. See you all at the contest.\u003c/p\u003e\u003cp\u003eRegards,\u003c/p\u003e\u003cp\u003eBalajiganapathi\u003c/p\u003e\u003c/div\u003e","tags":["snackdown2016","codechef","snackdown"]}}