{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1420017264,"rating":143,"authorHandle":"allllekssssa","modificationTimeSeconds":1420017264,"id":15487,"title":"\u003cp\u003eThis year,my way,from gray to yellow\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cpre\u003e\u003ccode\u003eFirst, congratulations ,to all CF members, the New Year!\n\u003c/code\u003e\u003c/pre\u003e \u003cpre\u003e\u003ccode\u003eMaybe,this blog  will be boring for you,but I have a wish to share with you impressions from this year\u0027s contests.Everything started slowly,I was only newbie and I didn\u0027t see how I can improve my programming skills.Always I spent all  time to solve one or two problem on the contests.However I was sure that I will succeed on our country competition,and then BUM!I didn\u0027t pass the Regional cometition!I was near the border,but had 10 points less!\n\u003c/code\u003e\u003c/pre\u003e \u003cpre\u003e\u003ccode\u003eAfter that I started to work harder,I learned some algorithms,I learned some data structures(BIT,Heap,Segment Tree,dsu...) and I had a lot of codeforces competitions where I can get new experience.Also,one important thing in all contests is hacking.On every competition I thought about some special cases and watching other codes.I won points and also I saw some good ways to implement solution.\n\u003c/code\u003e\u003c/pre\u003e \u003cpre\u003e\u003ccode\u003e\u003cbr /\u003eNow,I know that a long way front of me.I will continue to work and I hope that one day become red!\nIn my country competitons haven\u0027t start yet,but I hope I can at least pass the regional competition :) I will try to solve some harder problems and show that I deserve yellow.\nI\u0027d like to mention If Codeforces team let,my friend and I are going organize one CF round!\n\u003c/code\u003e\u003c/pre\u003e \u003cpre\u003e\u003ccode\u003eThanks for reading,and I hope that  people who are currently weaker than me get one more motive to work.\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e","tags":["experience","gray","yellow"]}}