{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1464412914,"rating":230,"authorHandle":"E621","modificationTimeSeconds":1464412914,"id":45089,"title":"\u003cp\u003eAre you majoring a unique subject for coders?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, I\u0027m writing this article just for fun and there\u0027s no advisory things for problem solving.\u003c/p\u003e\u003cp\u003eI\u0027ve been participating in many programming contest for more than 5 years, and I came to one question: what do competitive programmers major in?\u003c/p\u003e\u003cp\u003eMost competitive programmers would answer, \u0026quot;computer science\u0026quot; of course, \u0026quot;mathematics\u0026quot; (applied? I don\u0027t know much about that), or \u0026quot;engineering\u0026quot;.Some of coders are still high-school students and they haven\u0027t decided their major yet, or maybe some people works after graduating high-school. But is that true that 99 percent of university coders are majoring in those subjects?\u003c/p\u003e\u003cp\u003eIn fact, I\u0027m studying about ecology and environmental sciences at the Faculty of Agriculture in my university (The U of Tokyo). I guess no other competitive programmers are from my faculty, even though U of Tokyo has so many red or yellow coders (as you may know). \u003c/p\u003e\u003cp\u003eHere\u0027s my story: \u003cem\u003eI started competitive programming when I was a junior high school student. I was belonging to mathematics club in the school and my friends taught me about programming, algorithms and where to practice problem solving skills. Then I participated in domestic OI and a few years later I won a silver medal at IOI. At the same time, I\u0027ve become interested in biology, and attended domestic Biological Olympiad things. On programming side, I was (and still am?) interested only about contests and I didn\u0027t have a plan to be engineer or researcher about informatics. Then, I\u0027m studying about ecology now.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eWhen I was a high school student and taking part in domestic OI, I met friends who would major the subject far from computer science, but most of them didn\u0027t keep solving problems or participating in contests. Even I\u0027m not sure how long I can take part in contests (of course I want to compete in the contest as long as I can)\u003cspan style\u003d\"color: rgb(170,170,170);\"\u003e, but I think I may be the best competitive programmer from agriculture areas as long as I keep participating contests ;)\u003c/span\u003e.\u003c/p\u003e\u003cp\u003eSo today, I wonder how many coders from over the world are majoring such a subject, and want to know very unique majors you do or you did. Feel free to comment about coders\u0027 university majors.\u003c/p\u003e\u003c/div\u003e","tags":["major","university"]}}