{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1427104524,"rating":69,"authorHandle":"kllp","modificationTimeSeconds":1427122147,"id":17084,"title":"\u003cp\u003ecodeforces IRC channel\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIRC?? What\u0027s that? --\u0026gt; See the bottom of this blog.\u003c/p\u003e\u003cp\u003eThere have been some discussion about a codeforces chat \u003ca href\u003d\"/blog/entry/82#comment-218753\"\u003ehere.\u003c/a\u003e \u003c/p\u003e\u003cp\u003eI have created channel \u003cstrong\u003e#codeforces\u003c/strong\u003e at network \u003cstrong\u003eIRCNet\u003c/strong\u003e, welcome!\u003c/p\u003e\u003cp\u003eRules:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eDo not talk about problems during contests.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eUse common sense.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eThere should be some channel operators (who are like moderators). However, not everybody can be a operator because the risk that someone does something stupid is too high.\u003c/p\u003e\u003cp\u003eTo become a channel operator you have to:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eHave done at least 15 contests at codeforces\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eHave max rating \u0026gt;\u003d 2200\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eHave a decent contribution on codeforces.com or chat history on #codeforces\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003ePlease comment if you have some suggestions. \u003cstrong\u003eEspecially I would like to hear what you think about the conditions to become a channel operator.\u003c/strong\u003e\u003c/p\u003e\u003ch4\u003eHave never heard about IRC?\u003c/h4\u003e\u003cp\u003eIRC is short for Internet Relay Chat, a very handy instant messaging protocol. The IRC consists of different networks and those networks have many different channels where you can chat with people. \u003c/p\u003e\u003cp\u003eTo connect to some network you have to have a client program. Here are some that I have heard about: \u003c/p\u003e\u003cp\u003eFor Windows: \u003ca href\u003d\"http://www.mirc.com/\"\u003emIRC\u003c/a\u003e\u003c/p\u003e\u003cp\u003eFor Linux: XChat (graphical), irssi (command line)\u003c/p\u003e\u003cp\u003eThere are also some plugins for web browsers that work in different operating systems:\u003c/p\u003e\u003cp\u003eFirefox: ChatZilla\u003c/p\u003e\u003cp\u003eShort instructions for ChatZilla:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eInstall it\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eRestart browser.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIt should have now appered to section \u0026quot;Tools\u0026quot; at menu bar. Open it. (If you don\u0027t see your menu bar, right click and select it there)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThere should be a text \u0026quot;Available networks are ...\u0026quot;. Click \u0026quot;ircnet\u0026quot;. If you want to connect to some specific server, I can be done by writing: /server some.server.address\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eOpen menu \u0026quot;IRC\u0026quot; and then \u0026quot;Join channel\u0026quot;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eWrite there #codeforces and click \u0026quot;join\u0026quot;\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eChrome/Chromium: CIRC\u003c/p\u003e\u003cp\u003eThere is also a very easy to use client \u003ca href\u003d\"https://www.irccloud.com/\"\u003eIRCCloud\u003c/a\u003e that works in any browser.\u003c/p\u003e\u003cp\u003eIf you have trouble connecting, please try to connect to open.ircnet.net If that doesn\u0027t work, try some other servers mentioned in comments.\u003c/p\u003e\u003cp\u003eIf you have any problems, please comment.\u003c/p\u003e\u003c/div\u003e","tags":["chat","irc"]}}