{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1438179906,"rating":44,"authorHandle":"belowthebelt","modificationTimeSeconds":1438179906,"id":19497,"title":"\u003cp\u003eCode Monk: Minimum Spanning Tree\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces community!\u003c/p\u003e\u003cp\u003eFirstly, I want to apologize to all of you for not posting about \u003ca href\u003d\"https://www.hackerearth.com/codemonk/\"\u003eCode Monk\u003c/a\u003e previously. I realize now that it could have probably helped a lot of people who are beginners to competitive programming, but anyway, I don\u0027t think it is still late to introduce it! :)\u003c/p\u003e\u003cp\u003eLet me tell you about Code Monk. I was working with \u003ca href\u003d\"http://hackerearth.com/\"\u003eHackerEarth\u003c/a\u003e for a while in this summer, where \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/chandan111\" title\u003d\"Expert chandan111\"\u003echandan111\u003c/a\u003e and I came up with this idea. \u003c/p\u003e\u003cp\u003eThe truth is that the Internet is full of learning resources for anyone who wants to become a better programmer. However, we felt, that there was no single place, where one could find information and practice as well as on the topics required to feel confident about a lot of topics. This is one of the reasons why many programmers in the pursuit of learning competitive programming attain a level of saturation after a while. They face difficulty in consuming content from different sources.\u003c/p\u003e\u003cp\u003eThis led us to start Code Monk – a weekly series of tutorials on topics, starting from the basics of algorithm and gradually moving on to more complicated concepts. Every tutorial is followed by a short programming challenge to test your understanding!\u003c/p\u003e\u003cp\u003eThat\u0027s how this page was created: \u003ca href\u003d\"https://www.hackerearth.com/codemonk/\"\u003eCode Monk\u003c/a\u003e :) — you guys can take a look at whatever topics have been covered already on this page directly. I know, the categories are not very well arranged as of now. There\u0027s a lot to be done on that page. Don\u0027t worry, the changes will keep happening!\u003c/p\u003e\u003cp\u003e--\u003c/p\u003e\u003cp\u003eBut, here I want to invite you guys to the contest which begins in an hour. (Sorry for such a short notice!) The contest is based on Minimum Spanning Trees. The link to the contest: \u003ca href\u003d\"https://www.hackerearth.com/code-monk-minimum-spanning-tree/\"\u003eCode Monk: Minimum Spanning Tree\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe setter and the translator of the contest is: \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/shef_2318\" title\u003d\"Master shef_2318\"\u003eshef_2318\u003c/a\u003e and the tester and the editorialist is: \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/I_love_Tanya_Romanova\" title\u003d\"Grandmaster I_love_Tanya_Romanova\"\u003eI_love_Tanya_Romanova\u003c/a\u003e. They\u0027ve worked extremely hard on making this contest a unique experience for people who want to strengthen their concepts of Minimum Spanning Trees.\u003c/p\u003e\u003cp\u003eGood luck to everyone, and have fun! :)\u003c/p\u003e\u003cp\u003ePS: Feedback / ideas / criticism — everything is welcome.\u003c/p\u003e\u003c/div\u003e","tags":["hackerearth","codemonk","monk","oldmonk"]}}