{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1520422414,"rating":61,"authorHandle":"savinova","modificationTimeSeconds":1520429579,"id":58219,"title":"\u003cp\u003eОтчет о деятельности Botan Investments за февраль. Нужно ли создавать федерацию спортивного программирования?\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ феврале в грантовой программе фонда Виктора Шабурова \u003cstrong\u003eBotan Investments\u003c/strong\u003e для преподавателей приняли участие 18 университетов. Больше всего активных студентов — 20 человек — удалось привлечь к тренировкам в УрФУ (Екатеринбург). Больше всего тренировок провели в МГУ (Саранск), СибГУТИ (Новосибирск), СОГУ (Владикавказ) и КФУ (Казань). В феврале к нам присоединился Вологодский Государственный Университет, рады видеть нового участника!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBotan Investments\u003c/strong\u003e выступил одним из спонсоров олимпиады Южного Федерального Университета ContestSFedU-2018 (отборочный тур начнется 16 марта), а также спонсировал поездку ПГНИУ на сборы в МФТИ. \u003c/p\u003e\u003cp\u003eВ группе ВК вышли два новых поста Михаила \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik\" title\u003d\"Master MikhailRubinchik\"\u003eMikhailRubinchik\u003c/a\u003e Рубинчика, посвященных работе со школьниками: \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_307\"\u003eвоспитание и креативность\u003c/a\u003e и \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_309\"\u003eорганизация лагерей для школьников\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eВ сегодняшнем посте Михаил рассуждает о создании федерации спортивного программирования: \u003c/p\u003e\u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e Пару месяцев назад Министерство спорта утвердило разряды по киберспорту. Можете прочитать подробности \u003ca href\u003d\"resf.ru/news/minsporta-rf-utverdilo-trebovaniya-k-razryadam\"\u003eздесь\u003c/a\u003e. Хорошая новость для игроков Dota, но почему я пишу об этом здесь? :) Потому что вижу, что сообществу киберспортсменов своя спортивная федерация приносит реальную пользу. И сейчас хочу поговорить о том, какую положительную роль такое представительство могло бы сыграть для нас. \u003cbr /\u003e\u003c/p\u003e\u003cbr /\u003e \u003ccenter\u003e \u003cdiv style\u003d\"width: 80.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/ac/36/ac3635dc15850293318bf5312c57b77d26c4646b.jpg\" style\u003d\"width: 80.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e \u003c/center\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e В спортивном программировании идея создать собственную федерацию обсуждается уже давно, но довольно вяло. Больше всего об этом говорит Анатолий Абрамович Шалыто, зав.кафедрой, на которой учатся все спортивные программисты ИТМО. Но похоже, что только говорит, так как за 10 лет ничего не сдвинулось в этом направлении. Возможно, мой пост подтолкнет кого-то к активным действиям. Итак, почему я считаю, что федерация по спортивному программированию — это хорошо? \u003cbr /\u003e\u003cbr /\u003e Первый плюс — \u003cstrong\u003eпопуляризация сообщества\u003c/strong\u003e. \u003cbr /\u003e\u003cbr /\u003e Если с киберспортом все более-менее понятно, потому что в компьютерные игры может сыграть любой человек, то о программировании большинство людей знают только из фильмов про хакеров. Мы не хотим, чтобы все вокруг программировали, но хотим, чтобы про нас больше знали. И, на мой взгляд, федерация спортивного программирования может стать хорошим подспорьем в этом деле: — Программисты будут знать, что программирование — это еще и спорт. — Непрограммисты просто будут знать, что мы есть. А чем популярнее сообщество, тем проще находить спонсоров, вовлекать новых людей, находить организаторов и т.д. \u003cbr /\u003e\u003cbr /\u003e Второй плюс — \u003cstrong\u003eвозможность общаться с государством на одном языке\u003c/strong\u003e. \u003cbr /\u003e\u003cbr /\u003e Государство привыкло мыслить шаблонами: есть спортивная федерация — это понятные ребята, с ними можно разговаривать, что-то организовывать и т.д. Почему для этого нужно создать именно федерацию спорта, а не образовательный клуб или что-то ещё? Потому что только у федерации понятный юридический статус. \u003cbr /\u003e\u003cbr /\u003e У многих сейчас возник вопрос, а зачем нам общаться с государством? :) Затем, что это самый большой источник ресурсов и финансов. Да, не всегда понятно, в какие отделы их будут распределять при каждом новом планировании бюджета. Но деньги есть, и государство реально может помогать, если понимает, кому и зачем. \u003cbr /\u003e\u003cbr /\u003e Почему нельзя просто попросить денег под отдельные мероприятия? Последние полгода я много общался с госструктурами, организуя детские лагеря, и понял, что не работает стратегия “Давайте просто попросим у государства, чтобы нам регулярно давали деньги”. Но работает общее широкое партнерство с разными структурами внутри Минобра, Минкульта, Минспорта и т.д. Когда мы начали периодически встречаться и рассказывать разным людям, чего добились, то с их стороны стали возникать ответные предложения: а давайте сделаем лагерь или олимпиаду. И ресурсы, и деньги на них находятся, но на каждый лагерь каждый год нужно договариваться отдельно. Поэтому иметь какого-то одного единственного партнёра — не самая удачная стратегия, нужно дружить со всеми. Собственная федерация — это еще один способ напомнить государству о нас. В данном случае через Минспорта. \u003cbr /\u003e\u003cbr /\u003e Третий плюс — \u003cstrong\u003eпонятный статус студенческих чемпионатов\u003c/strong\u003e. \u003cbr /\u003e\u003cbr /\u003e Это частный случай второго, но все же выделю его отдельно. Сейчас Минобр очень хорошо знает, что такое школьные олимпиады. У него есть приказ о проведении, и их централизованно организуют сверху, начиная с отборочных туров до Всероссийской олимпиады по каждому из 20 с лишним предметов.\u003cbr /\u003e\u003cbr /\u003e А со студенческими олимпиадами полный бардак. Может, я чего-то не знаю, но, кажется, ни у Минобра, ни у университетов нет отдельной графы расходов “на олимпиады по спортивному программированию”. Зато студенты-спортсмены ездят на соревнования и получают спортивные стипендии. Если бы у нас была возможность получать разряды, мы бы тоже могли давать стипендии и организовывать поездки. \u003cbr /\u003e\u003cbr /\u003e Нашим олимпиадам мы можем дать статус спорта, потому что для вузов это более понятная терминология. И будет естественное разграничение для общения с государством: у школьников — личные олимпиады (ими занимается Минобр), у студентов — командный спорт с разрядами (это вотчина Минспорта). \u003cbr /\u003e\u003cbr /\u003e Теперь о минусах, с которыми мы можем столкнуться, создавая федерацию. Я вижу такие риски: \u003cbr /\u003e\u003cbr /\u003e — Чтобы создать федерацию, придется провести большую организационную работу. Кто это может сделать в тусовке олимпиадников в России — большой вопрос. Возможно, когда-нибудь я смогу, но это точно произойдет не завтра :) Даже несмотря на все усилия, есть риск, что мы не получим ни денег, ни популярности. Это зависит от человека, который станет президентом федерации спортивного программирования в России, и от того, насколько он будет активен. \u003cbr /\u003e\u003cbr /\u003e — Если мы создадим бюрократическую структуру, она может захотеть контролировать наших креативных ребят: тренеров и участников. Такие проблемы уже появляются в точках соприкосновения с государством. Нужно строить федерацию исходя из этого знания и стараться делиться с бюрократами только общими вопросами: популяризация сообщества и привлечение денег. А жёсткой прослойкой между участниками и бюрократами должны стать наши организаторы из тусовки. \u003cbr /\u003e\u003cbr /\u003e А что вы думаете об этом? Нужна ли нам федерация? Какие плюсы и минусы видите в ее появлении? \u003c/p\u003e\u003c/div\u003e","tags":["виктор шабуров","botan investments"]}}