{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1501666510,"rating":-28,"authorHandle":"DR.MANHATTAN","modificationTimeSeconds":1502009045,"id":53628,"title":"\u003cp\u003eMy first Codeforces contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/contest/811\"\u003econtest — 811\u003c/a\u003e\u003c/p\u003e\u003ch1\u003e\u003cstrong\u003eHighlights\u003c/strong\u003e\u003c/h1\u003e\u003ch2\u003e_ Questions attempted_ : 2\u003c/h2\u003e\u003cp\u003e### ** 1st got accepted \u003ca href\u003d\"//codeforces.com/contest/811/problem/A\"\u003eA. Vladik and Courtesy\u003c/a\u003e  ### ** 2nd got hacked \u003ca href\u003d\"//codeforces.com/contest/811/problem/B\"\u003eB. Vladik and Complicated Book\u003c/a\u003e\u003c/p\u003e\u003ch3\u003eQuestion Discussion:\u003c/h3\u003e\u003cp\u003e\u003cem\u003e\u003ca href\u003d\"//codeforces.com/contest/811/problem/A\"\u003eA. Vladik and Courtesy\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eA fairly easy implementation based question.\u003c/p\u003e\u003ch2\u003e-The one who finished the question first , took about 1 minute to do this question, however, I took about half an hour.Moreover, I got my first submission wrong, as I did not totally understand the question clearly enough. I got it right on the second attempt though.\u003c/h2\u003e\u003cem\u003e\u003ca href\u003d\"//codeforces.com/contest/811/problem/B\"\u003eB. Vladik and Complicated Book\u003c/a\u003e\u003c/em\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eI instinctively knew that the solution I provided was suboptimal, but I knew no other way to attempt this question, other than to use sort again and again for each query.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003eInitially, it did pass the pretests ( I didn\u0027t know that there were more test-cases that would be run on it later ), and I couldn\u0027t believe my luck. Unfortunately, it got hacked in a few minutes :-/.\u003c/li\u003e   \u003cli\u003e\u003cp\u003eAfter the contest ended, I went through the editorial ( quickly understood how I could fix the time complexity bottleneck ) and quickly coded up the solution, got AC !! \u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eRESULT : \u003cstrong\u003eSPECIALIST\u003c/strong\u003e__ (1404) ( seems like codeforces rating system rewards newbies generously ) \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eReflection :\u003c/strong\u003e :\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eTry to read and understand questions quick, keeping in mind the corner cases, and touch the keyboard only after you\u0027re convinced that you\u0027ve thought of all possible corner cases\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIf the solution that you\u0027ve thought of would get a TLE , due to the constraints of the problem, then don\u0027t push your luck. Producing a solution not keeping in mind the constraints is as good as not submitting a solution ( it\u0027s even worse, as you lose points as penalty )\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe first 2 problems are doable by me (considering my present skill level ), as they do not require any algorithmic/ data structure knowledge. Just implementation skill and the skill to spot a pattern / reduce time complexity.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe other problems C ,D ,E , do requre algorithmic knowledge... I\u0027ll get there once I study up those Algo\u0027s and have enough practice to be able to attempt them in competitions. \u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":["first round","#for_beginners"]}}