{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1487628726,"rating":51,"authorHandle":"lucifer2709","modificationTimeSeconds":1487628766,"id":50552,"title":"\u003cp\u003eInvitation to Humblefool Cup\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi everyone !!!\u003c/p\u003e\u003cp\u003eWe at Indian Institute of Information Technology, Allahabad proudly share with you today \u003cstrong\u003eThe Humblefool Cup\u003c/strong\u003e, the flagship event of our \u003cstrong\u003etechfest-Aparoksha’17\u003c/strong\u003e, in memory of \u003cstrong\u003eHarsha Suryanarayana \u003ca href\u003d\"https://www.topcoder.com/members/humblefool/\" style\u003d\"color: red;\"\u003e(humblefool)\u003c/a\u003e\u003c/strong\u003e. This year it gets bigger and better as it is being hosted and sponsored by none other than \u003cstrong\u003eTopCoder\u003c/strong\u003e, with the prizes amounting to 500 USD. \u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/d4/1a/d41a12e8b347eb49a8855ffd07bac3b2d8ebf539.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHumblefool was one of the first Indian red coders on Topcoder. He had been a member of Topcoder since 2005, and he was a proud graduate of Indian Institute of Information Technology, Allahabad. He was a fantastic competitor, participating in challenges across multiple tracks. More than that, he was a great community member and gave back to the community in countless ways. humblefool personally trained and motivated many other members to participate in SRMs and Marathon Matches.\u003c/p\u003e \u003ch3\u003eHow to compete ?\u003c/h3\u003e\u003cp\u003eThis contest is only open to members currently enrolled in a University/College. You must have a valid college/university registration/ID card to claim the prize.\u003c/p\u003e\u003cp\u003eThere will be two rounds : \u003c/p\u003e\u003cul\u003e \u003cli\u003e\u003cb\u003eQualifying Round\u003c/b\u003e – \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dHumblefool+Cup+Round+1\u0026amp;iso\u003d20170221T21\u0026amp;p1\u003d2408\"\u003e21st Feb 2017 9:00 PM IST\u003c/a\u003e \u003cul\u003e \u003cli\u003eThis round will be conducted alongside SRM 709. To participate in the Humblefool Cup you have to enter the Humblefool Cup Round.\u003c/li\u003e \u003cli\u003eThe top 30 students located in India will be invited to compete onsite at Indian Institute of Information Technology, Allahabad.\u003c/li\u003e \u003cli\u003eThe best ranked student in the qualifying round (not located in India) will be awarded $100 prize money.\u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003cli\u003e\u003cb\u003eOnsite Round\u003c/b\u003e \u003cul\u003e \u003cli\u003eThe top 30 best students from the qualifying round will compete onsite to win the Humblefool Cup Trophy and $400 in cash and goodies. The finalists will also receive Topcoder Humblefool Cup t-shirts.\u003c/li\u003e \u003c/ul\u003e \u003c/li\u003e \u003c/ul\u003e \u003ch3\u003ePrizes\u003c/h3\u003e\u003cp\u003e$100 for the best performer not located in India.\u003c/p\u003e\u003cp\u003e$400 for the onsite event winners.\u003c/p\u003e\u003cp\u003e\u003cb\u003eExcited to compete? Register \u003ca href\u003d\"https://aparoksha.iiita.ac.in/humblefoolcup/Register/\"\u003ehere\u003c/a\u003e.\u003c/b\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}