{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1408451650,"rating":15,"authorHandle":"Shivamfrnd","modificationTimeSeconds":1408451650,"id":13454,"title":"\u003cp\u003eCodeforces Stats Android Application\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThe first Codeforces Android Application is now available on the Google Play Store. You can download it here-\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://play.google.com/store/apps/details?id\u003dcom.innsolutions.codeforcesstats\"\u003ehttps://play.google.com/store/apps/details?id\u003dcom.innsolutions.codeforcesstats\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThis application makes extensive use of the Codeforces API which allows you to do the following things-\u003c/p\u003e\u003cp\u003eI. Powerful Problem Filter Search through thousands of Codeforces Problems in the blink of an eye.\u003c/p\u003e \u003col\u003e   \u003cli\u003eProblems Search By Tags Did you study trees yesterday \u0026amp; feel like solving some questions on trees? Well, look no further. This app lets you filter the Codeforces Problems by tags.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eWant to practice questions which involve the concepts of both dynamic programming as well as probability? Just type those tags \u0026amp; only those problems would be shown which involve the knowledge of ALL the tags given.\u003c/p\u003e \u003col\u003e   \u003cli\u003eCustom Problem Search a. Find all the problems of a particular contest. b. Find all the problems of a particular index(A,B,C,D,E,F). c. Find problems which contain the word(string) given by you in the problem name. d. Find all the problems solved by a particular number of people.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eQuestions found are displayed in the form of a list along with the Points, Contest ID, Problem Name, \u0026amp; the Number of people who have already solved it.\u003c/p\u003e\u003cp\u003ePoints give you an idea of the difficulty level of a particular question. Just click a question of your choice to view the problem statement \u0026amp; start solving. Simple, huh?\u003c/p\u003e\u003cp\u003eII. View User Info\u003c/p\u003e\u003cp\u003eDo you want to know how your friend performed in the Codeforces Round last night but don\u0027t want to open the website. With this app you just need to type in the Handle (Username) of a particular user \u0026amp; then you can view the following-\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eUser Info The basic profile info of a particular Codeforces User.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eUser Rating Change History The Rating Change History which includes the details of all the Rated Contests in which the user has participated. On clicking a particular contest in the list, all the submissions of that user in the clicked contest would be shown.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eUser Submissions Last N Submissions of a user where N will be a number given by you. On clicking a particular submission, the problem statement opens.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eIII. Compare Users You can compare Codeforces Users in 2 ways-\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eOverall Info Compare You can compare the basic info of as many users as you want by just entering the Handles of those users.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eHead To Head Comparison. This feature lets you compare up to 4 Codeforces users. It finds the Common Contests, i.e., the contests in which all the specified users have participated \u0026amp; then it displays the ranks of each of those users side by side for easy comparative analysis.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eIV. Search Users \u003cem\u003eWarning- This operation is very slow as it receives the info of all the Codeforces Users \u0026amp; then searches through the whole database. It can take upto 10 minutes on 3G. 2G is not recommended.\u003c/em\u003e You can search for Codeforces Users by just entering anything you remember or just a part of anything you remember. Search by handle, first name, last name, organisation, city or country. If you enter data in more than one fields, then the union of all the search results is displayed.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","android","app","rating","submissions","user","search","problems","tags"]}}