{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1468269363,"rating":98,"authorHandle":"gKseni","modificationTimeSeconds":1468301274,"id":45998,"title":"\u003cp\u003eКоманда MIPT Jinotega победила на олимпиаде «KPI-OPEN 2016»\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e8 июля \u003ca href\u003d\"http://kpi-open.org/results/\"\u003eбыли подведены итоги\u003c/a\u003e Одиннадцатой открытой международной студенческой олимпиады по программированию имени С.А. Лебедева и В.М. Глушкова «KPI-Open 2016», которая проходила в Киевском политехническом институте. \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://kpi-open.org/\"\u003e«KPI-Open»\u003c/a\u003e — одно из крупнейших очных соревнований по программированию в мире и самое крупное в Украине. В этом году \u003ca href\u003d\"http://kpi-open.org/users/\"\u003eучастие в нём приняли\u003c/a\u003e 99 команд 53 университетов из десяти стран: Грузии, Казахстана, Латвии, Литвы, Польши, России, Словакии, Венгрии, Эстонии и Украины.\u003c/p\u003e\u003cp\u003eПри равном рейтинге, равном числе задач, с минимальным перевесом в суммарном штрафном времени чемпионом была признана команда MIPT Jinotega в составе Ивана Смирнова, Артёма Жука, Константина Семёнова, тренера Михаила Тихомирова и руководителя Алексея Малеева.\u003c/p\u003e\u003cp\u003eВторое место заняли команды LNU Penguins и LNU Clouds из Львовского национального университета им. И. Франко, а третье разделили UWr Vegetables (Вроцлавский университет, Польша), namedTeam (университет Тарту, Эстония) и KNU knu (Киевский национальный университет имени Т.Г. Шевченко). \u003c/p\u003e\u003cp\u003eИнтересно, что в мае команда MIPT Jinotega стала золотым призёром международного командного чемпионата мира по программированию ACM ICPC в Пхукете, а команда LNU Penguins завоевала бронзовые медали.\u003c/p\u003e \u003ccenter\u003e\u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/cf/76/cf76e15ed03a51a16bced9e9b61dec1e848ee21f.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/center\u003e\u003c/div\u003e","tags":["codeforces::news"]}}