{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1480350415,"rating":1288,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1480356329,"id":48679,"title":"\u003cp\u003eAbout the Round 382\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eGood afternoon!\u003c/p\u003e\u003cp\u003eI\u0027ve decided to share my thoughts on the round 382.\u003c/p\u003e\u003cp\u003eOf course, it turned upset not only to me, but also to the round coordinator \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/GlebsHP\" title\u003d\"Grandmaster GlebsHP\"\u003eGlebsHP\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eIn this round the main negative feedback were caused by two problems: \u003ca href\u003d\"/contest/735/problem/D\" title\u003d\"Codeforces Round 382 (Div. 2)\"\u003e735D - Taxes\u003c/a\u003e and \u003ca href\u003d\"/contest/735/problem/C\" title\u003d\"Codeforces Round 382 (Div. 2)\"\u003e735C - Tennis Championship\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eRegarding \u003ca href\u003d\"/contest/735/problem/D\" title\u003d\"Codeforces Round 382 (Div. 2)\"\u003e735D - Taxes\u003c/a\u003e. I do not share the criticism to this problem. In fact, to solve it would be nice to be familiar with \u003ca\u003e Goldbach\u0027s Conjecture\u003c/a\u003e and better with \u003ca href\u003d\"https://en.wikipedia.org/wiki/Prime_number_theorem\"\u003ePrime Number Theorem\u003c/a\u003e. These facts are medium-popular in the world of programming contests. Familiarity with them is useful, gives useful insight into primes. It is important: in this problem it was necessary to perform a simple, but nevertheless, additional step to find solution. It seems to me that it\u0027s okay to use problems that have a reduction to some popular and semi-popular topics. Otherwise, it is thrown away a huge number problems.\u003c/p\u003e\u003cp\u003eAs a summary for this problem. I agree that the problem \u003ca href\u003d\"/contest/735/problem/D\" title\u003d\"Codeforces Round 382 (Div. 2)\"\u003e735D - Taxes\u003c/a\u003e is not an example of the best problem. But it has a right to exist as one of the problems in a round. It can not take a role of any argument in favor of unrated round. I personally, would not include it in my contest. But the fact of the use of the Goldbach\u0027s conjecture (and more prime number theorem) is not a reason for me to convict and forbid a problem.\u003c/p\u003e\u003cp\u003eThe situation with the problem \u003ca href\u003d\"/contest/735/problem/C\" title\u003d\"Codeforces Round 382 (Div. 2)\"\u003e735C - Tennis Championship\u003c/a\u003e is much more complicated. It is necessary not to mix the two fundamentally different reasons for occurrence of same problems:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eProblems can be matched randomly, inadvertently. Of course, the coordinator and testers always have a critical look on the problem. At the stage of the contest preparation they immediately react if a problem is familiar to somebody. It is important to understand, that huge number of problems have been invented over the years of existence of sports programming. It is physically impossible to be familiar even with a large part of them. No matter how experienced the jury, sometimes, coincidences happen. Note that if the round is not a stage of a championship and its results do not affect prizes the main reasons for participation in it should be self-development and a desire to get a fan from the competition. None of these goals encourage search in Google.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eDeliberate coincidence or reuse of problems, it is a different story. And here it is what happened. This situation is totally unacceptable (educational rounds do not count), it is necessary to fight with it and to respond rapidly to incidents.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eAs soon as I examined about the incident, immediately called by phone the writer and discussed (and denounced) the situation. I explained the inadmissibility of such cases and their implications. I think Albert made the correct conclusions and will be accurate in future. Unfortunately, I was informed about incident only after the ratings been updated.\u003c/p\u003e\u003cp\u003eTaking into account large number of participants who didn\u0027t notice the issue, who solved problems completely independently, who were happy of upset by their rating changes, shared their results in social networks \u003ci\u003eit does not seem respectful to do to them unrated\u003c/i\u003e. I share the view that it would be better not to be so, but history has already taken place. Note that if I learned the situation during the round or immediately after, the outcome might be different. I think it\u0027s a good idea to report suspected cases through questions to give a chance the coordinator or me react quickly.\u003c/p\u003e\u003cp\u003eAs a conclusion, I do not propose to raise the tragedy, coordinators do not despair. The writers, of course, need to understand the responsibility and importance of taking on the role. Thousands of participants come to solve your problems and, of course, expect something interesting and new.\u003c/p\u003e\u003cp\u003eI urge the community not to forget about respect for the work of authors: to prepare the contest is a big and difficult task. The author takes on a difficult role and if a round took place, so the hard way from the idea to the final implementation has done. Please, be grateful for it, say the authors, coordinators and testers, thank you!\u003c/p\u003e\u003cp\u003eWhatever effort the Codeforces team makes, we can not do rounds without the writers. Therefore, we look forward to your problems. Hope to see good and bright rounds here!\u003c/p\u003e\u003cp\u003eThank you for attention,\u003cbr /\u003e MikeMirzayanov\u003c/p\u003e\u003c/div\u003e","tags":["328","round 382"]}}