{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1414095228,"rating":9,"authorHandle":"404Error","modificationTimeSeconds":1414095286,"id":14401,"title":"\u003cp\u003eWhich to choose Java 8 or Java 7 on codeforces?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI have recently tried to test the different kind of solution both on java 7 and java 8 and I found out that using Collection library or using class like BigInteger take less time in java 8 compare to java 7. But when you run normal program which has does not use class like HashSet, HashMap etc. \u003c/p\u003e\u003cp\u003eFor example I will give you some small example I tested both on java 7 and java 8.\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003e\u003cstrong\u003eUsing BigInteger Class\u003c/strong\u003e  we all know this class is very helpful sometimes for Java users. So I did some multiplication and addition and subtraction for 20000 times to check how much time it takes on codeforces platform to run. \u003ca href\u003d\"/contest/480/submission/8371132\" title\u003d\"Посылка 8371132 от 404Error\"\u003e8371132\u003c/a\u003e it runs in \u003cstrong\u003eJava 8\u003c/strong\u003e and takes \u003cstrong\u003e826ms\u003c/strong\u003e displaying 3192KB memory \u003ca href\u003d\"/contest/480/submission/8371128\" title\u003d\"Посылка 8371128 от 404Error\"\u003e8371128\u003c/a\u003e same code in \u003cstrong\u003eJava 7\u003c/strong\u003e takes \u003cstrong\u003e2292 ms\u003c/strong\u003e displaying 0 KB memory\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIn practice I solved \u003ca href\u003d\"/contest/271/problem/D\" title\u003d\"Codeforces Round 166 (Div. 2)\"\u003e271D - Хорошие подстрочки\u003c/a\u003e using Java Library HashSet on String instead of trie data structure.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003e\u003ca href\u003d\"/contest/271/submission/8356449\" title\u003d\"Посылка 8356449 от 404Error\"\u003e8356449\u003c/a\u003e this code got accepted in \u003cstrong\u003ejava 8\u003c/strong\u003e, and that time codeforces does not have Java 8 environment. \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"/contest/271/submission/8356450\" title\u003d\"Посылка 8356450 от 404Error\"\u003e8356450\u003c/a\u003e same code got TL in \u003cstrong\u003eJava 7\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eI don\u0027t know its Java 8 optimization or it is codeforces server.\u003c/p\u003e\u003cp\u003eSome more example using ArrayList of Integer and String java 8 — \u003ca href\u003d\"/contest/480/submission/8371287\" title\u003d\"Посылка 8371287 от 404Error\"\u003e8371287\u003c/a\u003e 685 ms with 0 KB memory displaying java 7 — \u003ca href\u003d\"/contest/480/submission/8371288\" title\u003d\"Посылка 8371288 от 404Error\"\u003e8371288\u003c/a\u003e 951 ms with approx 33 MB memory\u003c/p\u003e\u003cp\u003eSo using Java 8 in big data is really helpful in codeforces. You can try on your own and use it accordingly.\u003c/p\u003e\u003cp\u003eI hope this article will helpful for those who are solving problems in java and sometimes their code get TL because their code is not that much optimized. If you are using Collection library Java 8 at codeforces gives you little freedom in terms of run time at least.\u003c/p\u003e\u003c/div\u003e","tags":["java","java 8","java 7"]}}