{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1480190110,"rating":14,"authorHandle":"ebanner","modificationTimeSeconds":1480271736,"id":48645,"title":"\u003cp\u003eProblem 617B\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThis is a post describing my solution for \u003ca href\u003d\"/contest/617/problem/B\" title\u003d\"Codeforces Round 340 (Div. 2)\"\u003e617B - Шоколад\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eFor this problem, the key is to view the act of breaking the candy bar as a sequential decision process. In a sequential decision process, we have a number of choices to choose from at each stage. Once we know how many possible choices each stage has, we can apply the \u003ca href\u003d\"https://en.wikipedia.org/wiki/Rule_of_product\"\u003erule of product\u003c/a\u003e and multiply these numbers to arrive at the total number of possible outcomes.\u003c/p\u003e\u003cp\u003eThe candy bar-breaking sequential decision process proceeds as follows:\u003c/p\u003e \u003col\u003e   \u003cli\u003eStart at the left side of the candy bar\u003c/li\u003e   \u003cli\u003eKeep marching until we get between two nuts\u003c/li\u003e   \u003cli\u003eMake a break somewhere between these two nuts\u003c/li\u003e   \u003cli\u003eGo back to step 2\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eIn step 3, there are several legal break points. If there are \u003ccode\u003en\u003c/code\u003e zeros between the two nuts, then we can make a break so as to give \u003ccode\u003e0\u003c/code\u003e zeros to the left nut and \u003ccode\u003en\u003c/code\u003e zeros to the right nut, or we can make a break so as to give \u003ccode\u003e1\u003c/code\u003e zeros to the left nut and \u003ccode\u003en-1\u003c/code\u003e zeros to the right nut, and so on. In total, we have \u003ccode\u003en+1\u003c/code\u003e decisions for this particular break.\u003c/p\u003e\u003cp\u003eTo help visualize this process, consider the sequential decision making process described above on the sequence \u003ccode\u003e10101\u003c/code\u003e:\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/88/2e/882e2ba3b216aa882cb9180966339daa91e4f3c4\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eWe first consider nuts \u003ccode\u003e1\u003c/code\u003e and \u003ccode\u003e2\u003c/code\u003e and see that there is only one zero in between them. Hence we can make a total of \u003ccode\u003e2\u003c/code\u003e different breaks, as pictured by the two branches. After making this first break, we proceed to nuts \u003ccode\u003e2\u003c/code\u003e and \u003ccode\u003e3\u003c/code\u003e. Once again, there is only a single zero between these two nuts, hence the number of breaks we can make here is \u003ccode\u003e2\u003c/code\u003e. Notice the rightmost column enumerates all possible breaks, which is computed by multiplying these numbers for a total of \u003ccode\u003e2*2 \u003d 4\u003c/code\u003e possible breaks.\u003c/p\u003e\u003cp\u003eOne edge case that is useful to consider is when there are leading and/or trailing zeros. Note that for each of these cases there is only one legal break we can make \u003cem\u003eamong these regions of zeros\u003c/em\u003e. To see why this is the case, consider the case of leading zeros; the only legal break point is before the first zero as any other break would result in a piece of chocolate with zero nuts. The same holds for trailing zeros, except the only legal break is after the last zero. Since the number of possible breaks in both of these cases is \u003ccode\u003e1\u003c/code\u003e and multiplication by \u003ccode\u003e1\u003c/code\u003e has no effect on the final answer, I simply stripped leading and trailing zeros instead of explicitly coding for these special cases.\u003c/p\u003e\u003c/div\u003e","tags":[]}}