{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1438111083,"rating":12,"authorHandle":"prathams","modificationTimeSeconds":1438168699,"id":19485,"title":"\u003cp\u003eHow to solve this problem — \u0026quot;Thinking Backward\u0026quot;\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003ePlane division by a common shape is a very well known topic of computer science. The pictures below shows some such diagrams. In figure 1 we find that four circles divide a plane in maximum 14 zones, four ellipses divide a plane in maximum 26 zones and three triangles divide a plane in maximum 20 zones. It is a common practice to find out the maximum number of regions when m shapes of same type intersects. For example the general formula for circles is \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003em\u003c/i\u003e\u003csup class\u003d\"upper-index\"\u003e2\u003c/sup\u003e - \u003ci\u003em\u003c/i\u003e + 2\u003c/span\u003e. When the situation is hybrid (More than one type of shapes intersect) the maximum possible number of regions is also not very difficult to find out.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/39/0a/390a53e11b78923c6c7c96aed247365b2625c91f.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eIn figure 2 we can see that eight regions are created when one ellipse and one triangle intersect. In this problem you will have to think in the reverse direction. You will be given the maximum number of regions created and you will have to find how many ellipses, circles and triangles were involved.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eInput\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe input file contains less than 300 lines of inputs. Each line contains a 32-bit unsigned integer N, which is the maximum number of regions, created by m ellipses, n circles and p triangles. Input is terminated by a line, which contains a –1. This line should not be processed. All input numbers other than the –1 in the last line are positive numbers.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOutput\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFor each line of input you have to produce two or more lines of output. The description of output for each line is given below:\u003c/p\u003e\u003cp\u003eThe first line is the serial number of output. Each of the next lines contains three integers. These three integers are possible values of m, n and p for which maximum N regions is created. When there is more than one solution then the solutions should be sorted in ascending of m and then by ascending order of n. If there is no valid solution output a line “Impossible.” instead. Look at the output for sample input for details. Please note that for a valid solution \u003cstrong\u003e0 ≤ m \u0026lt; 100, 0 ≤ n \u0026lt; 20000 and 0 ≤ p \u0026lt; 100.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eInput Ex\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e20\u003c/p\u003e\u003cp\u003e10\u003c/p\u003e\u003cp\u003e-1\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOutput Ex\u003c/strong\u003e \u003c/p\u003e\u003cp\u003eCase 1:\u003c/p\u003e\u003cp\u003e0 0 3\u003c/p\u003e\u003cp\u003e0 1 2\u003c/p\u003e\u003cp\u003e1 0 2\u003c/p\u003e\u003cp\u003e1 3 0\u003c/p\u003e\u003cp\u003eCase 2:\u003c/p\u003e\u003cp\u003eImpossible. \u003c/p\u003e\u003c/div\u003e","tags":[]}}