{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1413056010,"rating":5,"authorHandle":"kostya_by","modificationTimeSeconds":1413056010,"id":14230,"title":"\u003cp\u003eПятая неделя. Упражнения.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eИ снова, публикую в блоге письмо с заданиями этой недели. \u003d)\u003c/p\u003e \u003chr /\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eВо-первых, ниже вы можете найти ссылки на исходники алгоритмов, которые я реализовал на лекции. Если кто-то недостаточно хорошо осознает эти алгоритмы или же есть трудности с их реализацией, то это ваш шанс поправить положение дел. \u003d)\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e1. LCA: http://pastie.org/9640356\n2. Поиск минимального числа на пути в дереве: http://pastie.org/9640358\n3. Суффиксный массив: http://pastie.org/9640361\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eТакже, возможно еще вот этот исходник поможет вам лучше понять алгоритм построения суффиксного массива: \u003ca href\u003d\"//codeforces.com/contest/452/submission/7412481\"\u003ehttp://codeforces.com/contest/452/submission/7412481\u003c/a\u003e\u003c/p\u003e\u003cp\u003eПотренировать свое умение писать суффмасс вы можете на задачах прошлой недели(которые, к сожалению, не сдаются при помощи суффмасса с бинпоиском и хешами).\u003c/p\u003e\u003cp\u003eВо-вторых, с упражнением прошлой недели “Западный поток” сложилась неприятная ситуация: сдать его можно только на dl.gsu.by, а этот сайт ужасно медленно работает и сдать там это упражнение на 100 баллов не представляется возможным. Поэтому, в качестве АС также будут приниматься все решения, которые не проходят 19 или 20 тесты. Если ваше решение проходит 1-18 тесты, то можно считать, что на оригинальном контесте вы получили бы 100 баллов. Так что шлите свои скриншоты, если у вас сложилась именно такая ситуация.\u003c/p\u003e\u003cp\u003eВ третьих, ниже находятся ссылки на упражнения, которые фигурировали как \u003cem\u003ehidden\u003c/em\u003e в прошлом письме. Напоминаю, что если вы не сдали их на контесте, то они останутся вашими упражнениями и в идеале их надо бы досдать.\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e1. http://codeforces.ru/gym/100091, задача \u0026quot;LCA Продолжение”\n2. http://codeforces.com/gym/100181, задача \u0026quot;Палиндромы\u0026quot;\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eА теперь упражнения и гробы:\u003c/p\u003e\u003cp\u003eУпражнения\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e1. http://codeforces.com/contest/372/problem/C\n2. *hidden*\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eГробы\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e1. http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1752\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eНа этой неделе немного упражнений и всего один гроб. Таким образом, у вас есть время порешать задачи прошлой недели, а также в пятницу я расскажу какую-нибудь хорошую глобальную теорию(времени на которую, обычно, не хватает из-за разбора большого количества упражнений).\u003c/p\u003e\u003cp\u003eВсем удачи!\u003c/p\u003e\u003cp\u003eКонстантин Сокол.\u003c/p\u003e\u003cp\u003ePS. \u003c/p\u003e\u003cp\u003eВот список всех упражнений, который я вам давал за эти 5 недель: \u003ca href\u003d\"https://docs.google.com/document/d/1cHQGm3TcsdnTsPWRLejr2oSWb7JMAm6TKQiSZNOi28g/edit?usp\u003dsharing\"\u003ehttps://docs.google.com/document/d/1cHQGm3TcsdnTsPWRLejr2oSWb7JMAm6TKQiSZNOi28g/edit?usp\u003dsharing\u003c/a\u003e Он будет обновляться каждую неделю, так что у вас будет место, где можно посмотреть полный список задач и что-нибудь из него порешать. \u003d)\u003c/p\u003e\u003c/div\u003e","tags":["упражнения","лицей бгу"]}}