{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1464470480,"rating":123,"authorHandle":"csacademy","modificationTimeSeconds":1464770845,"id":45105,"title":"\u003cp\u003eBeta Round #6 — csacademy.com\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eWe are happy to announce that we\u0027re going to host a new contest at \u003ca href\u003d\"http://csacademy.com\"\u003ecsacademy.com\u003c/a\u003e. Our \u003ca href\u003d\"https://csacademy.com/contest/beta-round-6/\"\u003eBeta Round #6\u003c/a\u003e will take place on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dCS+Academy+Beta+Round+6\u0026amp;iso\u003d20160531T16\u0026amp;p1\u003d%3A\u0026amp;ah\u003d2\"\u003eTuesday, May/31/2016 16:00 (UTC)\u003c/a\u003e. If you want to take part in this round you need to \u003ca href\u003d\"https://csacademy.com/contest/beta-round-6/\"\u003eregister\u003c/a\u003e before the contest begins. Just like the \u003ca href\u003d\"https://csacademy.com/contests/\"\u003eprevious two rounds\u003c/a\u003e, this will be a Div1 + Div2, with 6 tasks of varied difficulty.\u003c/p\u003e\u003ch4\u003ePlatform changes since Beta Round #5:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003eWe added virtual contests. Now you can simulate a past round easily with a single click in the \u003ca href\u003d\"https://csacademy.com/contests/\"\u003econtests page\u003c/a\u003e.\u003c/li\u003e   \u003cli\u003eContestants source code is now public. Go to any scoreboard and click on a check mark.\u003c/li\u003e   \u003cli\u003eThe online editor now support an \u0026quot;Open file\u0026quot; button. No more copy paste when trying to submit.\u003c/li\u003e   \u003cli\u003eWe added some useful shortcuts to the editor. Hover a button to see its shortcut combination.\u003c/li\u003e \u003c/ul\u003e\u003ch4\u003eContest format:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003eYou will have to solve \u003cstrong\u003e6\u003c/strong\u003e tasks in \u003cstrong\u003e2\u003c/strong\u003e hours.\u003c/li\u003e   \u003cli\u003eThere will be full feedback throughout the entire contest.\u003c/li\u003e   \u003cli\u003eTasks will not have partial scoring, so you need to pass all test cases for a solution to count (ACM-ICPC-style).\u003c/li\u003e   \u003cli\u003eTasks will have dynamic scores. According to the number of users that solve a problem the score will vary between 100 and 1000.\u003c/li\u003e   \u003cli\u003eBesides the score, each user will also get a penalty that is going to be used as a tie breaker.\u003c/li\u003e \u003c/ul\u003e\u003ch4\u003eAbout the penalty system:\u003c/h4\u003e \u003cul\u003e   \u003cli\u003eComputed using the following formula: the minute of the last accepted solution + the penalty for each solved task. The penalty for a solved task is equal to log2 (no_of_submissions) * 5.\u003c/li\u003e   \u003cli\u003eSolutions that don\u0027t compile or don\u0027t pass the example test cases are ignored.\u003c/li\u003e   \u003cli\u003eOnce you solve a task you can still resubmit. All the following solutions will be ignored for both the score and the penalty.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eWe still recommend using an updated version of Google Chrome. If you find any bugs please email us at \u003ca href\u003d\"mailto:contact@csacademy.com\"\u003econtact@csacademy.com\u003c/a\u003e\u003c/p\u003e\u003cp\u003eDon\u0027t forget to like us on \u003ca href\u003d\"https://www.facebook.com/csacademy\"\u003eFacebook\u003c/a\u003e, \u003ca href\u003d\"https://vk.com/realcsacademy\"\u003eVK\u003c/a\u003e and follow us on \u003ca href\u003d\"https://twitter.com/realCSAcademy\"\u003eTwitter\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEDIT:\u003c/strong\u003e The \u003ca href\u003d\"https://csacademy.com/ratings/\"\u003eratings\u003c/a\u003e have been updated and the \u003ca href\u003d\"https://csacademy.com/blog/#beta-round-6\"\u003eeditorial\u003c/a\u003e has been published.\u003c/p\u003e\u003c/div\u003e","tags":[]}}