{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1479941491,"rating":77,"authorHandle":"Joe_Pacha","modificationTimeSeconds":1479942751,"id":48584,"title":"\u003cp\u003eMy cheating incident on today\u0027s contest (round #381 DIV 2)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI’m going to share with you my story in today’s contest. After the system test and getting my A B C problems accepted, I was surprised of being removed from the standings board and having my problems skipped. Thanks to Mike Mirzayanov, I knew that there was a cheating incident on my profile, as my solution for problem A was identical to pashka921’s.\u003c/p\u003e \u003cul\u003e   \u003cli\u003eMy solution: \u003ca href\u003d\"//codeforces.com/contest/740/submission/22428028\"\u003ehttp://codeforces.com/contest/740/submission/22428028\u003c/a\u003e (19:39:33)\u003c/li\u003e   \u003cli\u003eSolution of pashka921: \u003ca href\u003d\"//codeforces.com/contest/740/submission/22428017\"\u003ehttp://codeforces.com/contest/740/submission/22428017\u003c/a\u003e (19:39:28)\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe 2 solutions are completely IDENTICAL and There is no probability that this situation happened by coincidence. FYI, his submission was before mine by 5 seconds exactly.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFirst, I’m going to prove that pashka921 is cheating:\u003c/strong\u003e\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eAt every page of submission on his profile (\u003ca href\u003d\"//codeforces.com/submissions/pashka921\"\u003ehttp://codeforces.com/submissions/pashka921\u003c/a\u003e), there are some skipped problems, which means that it’s not the first time he cheated.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eIn today’s contest, he made 2 submissions for problem A, with 2 TOTALLY DIFFERENT codes (he got a WA in the first one, and the second one was actually with my code and was accepted):\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e \u003cul\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/contest/740/submission/22427837\"\u003ehttp://codeforces.com/contest/740/submission/22427837\u003c/a\u003e (19:37:42)\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/contest/740/submission/22428017\"\u003ehttp://codeforces.com/contest/740/submission/22428017\u003c/a\u003e (19:39:28)\u003c/li\u003e \u003c/ul\u003e \u003col\u003e   \u003cli\u003eBy looking at other submissions that this person did, in codeforces round 367 div 2, between time 20:36:09 and time 20:40:13, he was able to make 2 submissions with two TOTALLY different codes, within a time interval of 4 minutes between both:\u003c/li\u003e \u003c/ol\u003e \u003cul\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/contest/706/submission/19802252\"\u003ehttp://codeforces.com/contest/706/submission/19802252\u003c/a\u003e (20:36:09)\u003c/li\u003e   \u003cli\u003e\u003ca href\u003d\"//codeforces.com/contest/706/submission/19803051\"\u003ehttp://codeforces.com/contest/706/submission/19803051\u003c/a\u003e (20:40:13) Even between both timestamps, he made a submission to problem D at time 20:39:31 \u003ca href\u003d\"//codeforces.com/contest/706/submission/19802924\"\u003ehttp://codeforces.com/contest/706/submission/19802924\u003c/a\u003e\u003c/li\u003e \u003c/ul\u003e \u003col\u003e   \u003cli\u003eThese are not the ONLY weird cases found. You can check his profile, and you can spot them easily.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003e\u003cstrong\u003eHow was he able to submit my code?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eDuring contests, I use the online editor \u003ca href\u003d\"www.ideone.com\"\u003ewww.ideone.com\u003c/a\u003e for coding. I just noticed after this incident that the code on ideone is made public by default, which is how this guy could have accessed my code. Those are the links for Problems A and C that I wrote during today’s contest: My problem C: \u003ca href\u003d\"http://ideone.com/ekrSy6\"\u003ehttp://ideone.com/ekrSy6\u003c/a\u003e My problem A: \u003ca href\u003d\"http://ideone.com/qvPbwk\"\u003ehttp://ideone.com/qvPbwk\u003c/a\u003e \u003c/p\u003e\u003cp\u003eThe code for problem A was available on ideone at 19:39:20 (You can open the source of the HTML page and search for “created” and spot the timestamp), so: Code was available on ideone at: 19:39:20 His submission at: 19:39:28 Mine at: 19:39:33\u003c/p\u003e\u003cp\u003eFor my submission: \u003ca href\u003d\"http://ideone.com/qvPbwk\"\u003ehttp://ideone.com/qvPbwk\u003c/a\u003e, I am taking a screenshot of my browser to prove that I’m the OWNER of this code. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/2d/34/2d34871c4ae9446205eb558f0e7386cfa3898b39\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eNotes: - Having the edit button means that I’m the owner of the code. - 19:39:20 is GMT+2\u003c/p\u003e\u003cp\u003eJust to sum up, this was my experience today. Please be careful whenever you use online IDEs during the contest, as your code may be exposed publicly.\u003c/p\u003e\u003c/div\u003e","tags":[]}}