{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1434568721,"rating":29,"authorHandle":"VastoLorde95","modificationTimeSeconds":1434615561,"id":18654,"title":"\u003cp\u003eTackling tricky problems\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi, I am sure we have all come across those problems that have these simple problem statements but are just diabolical to get right. Problems which give you moments like \u003ca href\u003d\"http://imgur.com/H6rIR4S\"\u003ethese\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThese problems are usually hard to get right for the following reasons:\u003c/p\u003e \u003col\u003e   \u003cli\u003eCorner test cases\u003c/li\u003e   \u003cli\u003eTricky implementation\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eTypically problems which involve string manipulation, geometry or problems involving decimal precision are hard to get right in the first go without overlooking some minute details. Sometimes these problems require carefully breaking it up into cases.\u003c/p\u003e\u003cp\u003eRecently I solved the following \u003ca href\u003d\"//codeforces.com/contest/509/problem/C\"\u003eproblem\u003c/a\u003e and had 4 failed attempts before finally getting it right. In a competition, you might spend a ton of time trying to identify your bugs and that can make or break your final rank in the contest.\u003c/p\u003e\u003cp\u003eSo here is what I want to ask the top programmers in the community -\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ.\u003c/strong\u003e How do you approach such problems during live contests? I have seen many top programmers getting AC on such problems in the first try. (Usually their code is short, simple and consistent with the cases)\u003c/p\u003e\u003cp\u003eA. \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/mkirsche\" title\u003d\"Grandmaster mkirsche\"\u003emkirsche\u003c/a\u003e Spend a lot of time thinking before starting to code, and don\u0027t take too many shortcuts (longer code is sometimes better if it\u0027s cleaner and easier for you to keep track of). I don\u0027t know what to tell you about precision — I have problems with that too.\u003c/p\u003e\u003cp\u003eA. \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Junior94\" title\u003d\"Candidate Master Junior94\"\u003eJunior94\u003c/a\u003e They\u0027re experienced, they\u0027ve probably failed many times and know what works best and what doesn\u0027t.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ.\u003c/strong\u003e How do you test your code to ensure that you have not missed any corner test case?\u003c/p\u003e\u003cp\u003eA. \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Junior94\" title\u003d\"Candidate Master Junior94\"\u003eJunior94\u003c/a\u003e You can\u0027t know for sure if your code is 100 % correct until the final system testing but you can still write stress tests with brute force solutions.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ.\u003c/strong\u003e In case the implementation is long and taxing, what is your approach to keep the code neat and simple?\u003c/p\u003e\u003cp\u003eA. \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Junior94\" title\u003d\"Candidate Master Junior94\"\u003eJunior94\u003c/a\u003e Think before coding. Also usually the more time you spent thinking about the problem the better your solution will be (thinking in the right track of course). Experience helps a lot here.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eQ.\u003c/strong\u003e How much time do you invest in such problems before deciding they are too risky to solve in a live contest?\u003c/p\u003e\u003cp\u003eA. \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Junior94\" title\u003d\"Candidate Master Junior94\"\u003eJunior94\u003c/a\u003e Is the code going to be too long or complicated to write for the remaining time? Are there any easier looking problems remaining to solve? Is it too frustrating? There are a lot of questions you can ask yourself at this point but whether you keep working on it or move on it will be a risk you\u0027ll have to take.\u003c/p\u003e\u003cp\u003eThanks!\u003c/p\u003e\u003c/div\u003e","tags":["implementation","codeforces","corner","case"]}}