{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1422985123,"rating":5,"authorHandle":"zamazan4ik","modificationTimeSeconds":1422985123,"id":16193,"title":"\u003cp\u003eЗадача на предположительно максимальный поток\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eДоброго времени суток, уважаемые форумчане. ВОзникла сложность с одной задачей и я прошу у вас помощи.\u003c/p\u003e\u003cp\u003eЗадача: Ограничения : Время работы — 1 секунда Огрничение по памяти — 256 мб.\u003c/p\u003e\u003cp\u003eНедавно на уроке во время контрольной Мария Ивановна перехватила записку Саше от Оли. Мария Ивановна очень хочет знать, что в записке, но, к сожалению, записка зашифрована. Мария Ивановна знает, что её ученики для шифровки заменяют каждую букву исходного сообщения на какую-то другую. Замена происходит таким образом, что одинаковые буквы всегда заменяются одной и той же буквой, а разные — разными.\u003c/p\u003e\u003cp\u003eМария Ивановна подозревает, что записка — это ответы к контрольному тесту (ведь её длина случайно оказалась равной длине строки с правильными ответами). Однако она знает, что ответы Оли не обязательно полностью правильны. На каждый вопрос возможен один из K вариантов ответа. Естественно, Мария Ивановна знает правильные ответы.\u003c/p\u003e\u003cp\u003eМария Ивановна решила расшифровать записку таким способом, чтобы максимизировать количество правильных ответов Оли. Однако, она очень занята, поэтому попросила Вас помочь ей в этом пустяковом деле.\u003c/p\u003e\u003cp\u003eВходные данные\u003c/p\u003e\u003cp\u003eВ первой строке задана длина каждой из строк N (1 ≤ N ≤ 2 000 000) и K — количество возможных ответов на каждый вопрос (1 ≤ K ≤ 52). Ответы нумеруются в порядке abcde...xyzABCDE...XYZ. То есть, при K \u003d 6 возможные ответы выглядят как abcdef, а при K \u003d 30 \u0026quot;— abcde...xyzABCD.\u003c/p\u003e\u003cp\u003eВо второй строке задана зашифрованная записка — строка, состоящая из строчных и заглавных латинских букв.\u003c/p\u003e\u003cp\u003eВ третьей строке заданы правильные ответы — строка той же длины, что и первая, состоящая из строчных и заглавных латинских букв.\u003c/p\u003e\u003cp\u003eВыходные данные\u003c/p\u003e\u003cp\u003eВ первой строке выведите единственное число — максимально возможное количество правильных ответов у Оли.\u003c/p\u003e\u003cp\u003eВо второй строке выведите расшифровку — строчку длины K, где по порядку для каждой буквы из шифра учеников указано, какому ответу она соответствует.\u003c/p\u003e\u003cp\u003eЕсли несколько расшифровок дают правильный ответ, выведите любую.\u003c/p\u003e\u003cp\u003eОчень прошу вас помочь!\u003c/p\u003e\u003c/div\u003e","tags":["потоки"]}}