{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1513798902,"rating":0,"authorHandle":"TheDealer","modificationTimeSeconds":1513844142,"id":56519,"title":"\u003cp\u003eWeek 1\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone!\u003c/p\u003e\u003cp\u003eOn the first day we learned how to create variables with some basic data types (int, string, bool, double, char), how to input them from the user , and how to display them on the console screen. We didn\u0027t have enough time to go through loops, arrays, and strings so don\u0027t worry we\u0027ll go through them first thing next time and for now you can try to understand them alone or just skip them.\u003c/p\u003e\u003cp\u003eFor reference, please refer to the following codes:\u003c/p\u003e\u003cp\u003e1.Declaring and i/o integers: \u003ca href\u003d\"http://ideone.com/Udh0pf\"\u003ehttp://ideone.com/Udh0pf\u003c/a\u003e\u003c/p\u003e\u003cp\u003e2.Declaring and i/o doubles : \u003ca href\u003d\"http://ideone.com/1tFupv\"\u003ehttp://ideone.com/1tFupv\u003c/a\u003e\u003c/p\u003e\u003cp\u003e3.Declaring and i/o boolean : \u003ca href\u003d\"http://ideone.com/qlWE1I\"\u003ehttp://ideone.com/qlWE1I\u003c/a\u003e\u003c/p\u003e\u003cp\u003e4.Declaring and i/o strings: \u003ca href\u003d\"http://ideone.com/S5ps7q\"\u003ehttp://ideone.com/S5ps7q\u003c/a\u003e\u003c/p\u003e\u003cp\u003e5.Declaring and i/o characters : \u003ca href\u003d\"http://ideone.com/VPOX8A\"\u003ehttp://ideone.com/VPOX8A\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIf you want to code at home, you can either use ideone.com , or download visual studio.\u003c/p\u003e\u003cp\u003eOn ideone, you will not get a console that will output and input everything in order, you must write all input beforehand, so i recommend downloading visual studio.\u003c/p\u003e\u003cp\u003eTo create a project in visual studio, look at this under prequisites for reference: \u003ca href\u003d\"https://msdn.microsoft.com/en-us/library/ms235629.aspx\"\u003ehttps://msdn.microsoft.com/en-us/library/ms235629.aspx\u003c/a\u003e\u003c/p\u003e\u003cp\u003eAlso we will soon be solving problems that you might see in competition, so everyone please make sure to stick around a little bit more and i assure you things will get more interesting and fun.\u003c/p\u003e\u003cp\u003eI just wanted everyone to get an understanding of generally how a full program works and what we need to create a detailed program like this (if statements, for loops ). It is okay if you didn\u0027t understand it or any of the above.\u003c/p\u003e\u003cp\u003eThere is no need to know any coding beforehand, if you play around with the following codes and create your own programs, everything will become extremely simple.\u003c/p\u003e\u003cp\u003eLearn to enjoy the error messages. Usually the error message will tell you the line number of the error, or give some sort of description on whats wrong.\u003c/p\u003e\u003cp\u003eCoding is very sensitive and the computer is extremely dumb, any sort of spelling error and the computer wont recognize what you are doing.\u003c/p\u003e\u003cp\u003e“Anyone who has never made a mistake has never tried anything new.” ― Albert Einstein\u003c/p\u003e\u003cp\u003ewritten by \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/1am\" title\u003d\"Expert 1am\"\u003e1am\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}