{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1483305805,"rating":51,"authorHandle":"eku","modificationTimeSeconds":1483454265,"id":49490,"title":"\u003cp\u003eProgram to test solutions to interactive problems\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIt\u0027s difficult to test solutions to interactive problems during or after a contest. For non-interactive problems, I usually redirect input from a file. For interactive problems I have to type out input manually, since input depends on output. If the interaction is long, this can take time.\u003c/p\u003e\u003cp\u003eA more automated way will require 2 more programs:\u003c/p\u003e \u003col\u003e   \u003cli\u003eA judge program with whom our solution will interact.\u003c/li\u003e   \u003cli\u003eA program which connects \u003ccode\u003estdout\u003c/code\u003e of solution to \u003ccode\u003estdin\u003c/code\u003e of judge and \u003ccode\u003estdout\u003c/code\u003e of judge to \u003ccode\u003estdin\u003c/code\u003e of solution. I call this program a \u0027\u003ca href\u003d\"https://en.wikipedia.org/wiki/Croupier\"\u003ecroupier\u003c/a\u003e\u0027.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eThe judge program will have to be written by the user each time since it\u0027s problem-specific. But the croupier is generic and can be reused.\u003c/p\u003e\u003cp\u003eMy implementation of the croupier, apart from connecting inputs and outputs of the two programs, also prints the output from each program so that it\u0027s easier to debug.\u003c/p\u003e\u003cp\u003eYou can find my implementation here: \u003ca href\u003d\"https://github.com/sharmaeklavya2/croupier\"\u003ehttps://github.com/sharmaeklavya2/croupier\u003c/a\u003e\u003c/p\u003e\u003cp\u003eI wrote the croupier so that it could help me debug \u003ca href\u003d\"/contest/750/problem/F\" title\u003d\"Good Bye 2016\"\u003e750F - New Year and Finding Roots\u003c/a\u003e. The croupier helped me find out many mistakes in my solution, but it seems like there are more, because I can\u0027t get my solution accepted. Here is the judge program I used for it: \u003ca href\u003d\"https://gist.github.com/sharmaeklavya2/fb9751ba0d9d5df883d4d29288db8315\"\u003ehttps://gist.github.com/sharmaeklavya2/fb9751ba0d9d5df883d4d29288db8315\u003c/a\u003e\u003c/p\u003e\u003cp\u003eUpdate: There was a small bug in croupier because of which it sometimes printed output incorrectly. Thanks you \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/PikMike\" title\u003d\"Candidate Master PikMike\"\u003ePikMike\u003c/a\u003e for reporting this. \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/PikMike\" title\u003d\"Candidate Master PikMike\"\u003ePikMike\u003c/a\u003e also tested this program on Windows, which I couldn\u0027t do myself because I don\u0027t have Windows. You can find a detailed description of the bug here: \u003ca href\u003d\"https://github.com/sharmaeklavya2/croupier/commit/a2fcd82a52a83df71518dfec248271d752a55b66\"\u003ehttps://github.com/sharmaeklavya2/croupier/commit/a2fcd82a52a83df71518dfec248271d752a55b66\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["interactive","testing"]}}