{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1410343908,"rating":267,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1410344439,"id":13742,"title":"\u003cp\u003eGetting ready for ACM-ICPC 2014-2015: weekly trainings on Codeforces\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/f4/f5/f4f533845ca0508f57127cc8ad7a16e781debe7e.png\" style\u003d\"float: right;margin: 0.5em 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThe new season of a collegiate team championship ACM-ICPC is about to start. For example, the registration for the Southern (Saratov) Subregional Contest is already running. I am sure that many participants of the Codeforces rounds will take part in ACM-ICPC this year.\u003c/p\u003e\u003cp\u003eWe are launching a series of weekly practice trainings on Codeforces. Naturally, they will be held within Codeforces::Gym. Feel free to participate!\u003c/p\u003e\u003cp\u003eThe practice starts on Thursdays at about 12:10 PM (UTC), which is 16:10 Moscow Time. Expected duration is 4-5 hours. We are going to practice using the problems of different contests of the past years. All you need is common sense and observing these simple rules:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eWe will not publish the problem source before the practice starts. We want you to solve the problems on your own in a fair competition. If you use somebody else’s code or cheat in any other way, you will be disqualified. If you don’t want to solve on your own, that’s fine, you don’t have to. But spoiling the practice for others is unacceptable.\u003c/li\u003e   \u003cli\u003eDo not discuss the problems till the practice ends.\u003c/li\u003e   \u003cli\u003eWe will rarely answer the questions about problems. If you’ve found some obvious bug, please let me know. We will fix the bug and send everybody the note about the fix.\u003c/li\u003e   \u003cli\u003eIf you have a coach account (and you do not participate in the practice), we will be grateful for your help.\u003c/li\u003e   \u003cli\u003ePlease register for the practice with the people from your team who actually participates in it.\u003c/li\u003e   \u003cli\u003eFrom time to time, I am going to ask some of the jury of the past contests or coaches from other higher educational institutions to help with preparing or share materials — your understanding and help will be greatly appreciated!\u003c/li\u003e   \u003cli\u003eif you solved the contest problems before just switch to another training or inform us via problem questions form, we will move you to out-of-competition role.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe first contest \u003ca href\u003d\"/gym/100484\"\u003e2014-2015 CT S02E01: Codeforces Trainings Season 2 Episode 1 (NEERC 99 + misc)\u003c/a\u003e takes place on September, 11, at about 12:10 PM (UTC).\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","acm-icpc","gym","training","trainings"]}}