{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1456757032,"rating":97,"authorHandle":"Gassa","modificationTimeSeconds":1456760632,"id":43460,"title":"\u003cp\u003eVeeRoute Marathon: about the company\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg alt\u003d\"pic1en\" src\u003d\"/predownloaded/8d/7d/8d7dddc2d94afe59f4a09366bdb473d2a25a6e8d.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHi all!\u003c/p\u003e\u003cp\u003eVeeRoute Marathon starts today: it is a programming competition that is organized by VeeRoute and lasts from February 29 to March 14. We have already \u003ca href\u003d\"/blog/entry/43350\"\u003eposted\u003c/a\u003e information about the Marathon here on Codeforces, and now we would like to tell more about its organizer.\u003c/p\u003e\u003cp\u003eVeeRoute is a Russian IT-company that develops solutions for logistics optimization. Even though VeeRoute is a young company, its growth has been very rapid: the staff has doubled in the last few months, and the company is preparing to enter the international markets. There are two offices: in Moscow and Saint-Petersburg. VeeRoute is a very attractive workplace for talented and ambitious programmers, because everyday tasks there are challenging and interesting, and the development department is headed by Andrey Lopatin, a two-time world champion in programming.\u003c/p\u003e\u003cp\u003eVeeRoute’s ambition is to become a world leader in the field of IT solutions for logistics optimization. Every day logistics becomes more and more complex, and the key to new challenges is automatization of logistics processes and its management in real time. VeeRoute follows these trends by creating its own Scheduling \u0026amp; Dispatching platform.\u003c/p\u003e\u003cp\u003eIf you get excited about challenging and interesting programming problems, if you are good with algorithms and data structures, then VeeRoute Marathon is for you! Register here: \u003ca href\u003d\"//codeforces.com/contests/636\"\u003ehttp://codeforces.com/contests/636\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eParticipants will have to solve a certain optimization problem, similar to those solved by VeeRoute team daily. Do your best and draw VeeRoute’s attention to your talent! VeeRoute is trying to make the world a better place, and looking for individuals who share the same goals and vision.\u003c/p\u003e\u003cp\u003eGood luck and have a nice contest!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\"pic2en\" src\u003d\"/predownloaded/d7/d5/d7d51cff631a353ff6c7aaddb413065e305792ae.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["marathon","veeroute"]}}