{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1433198405,"rating":192,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1433204315,"id":18274,"title":"\u003cp\u003ePBOX — simple package manager for Windows (written and used in Codeforces)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"http://pbox.me\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/pboxme.png\" style\u003d\"margin: 0 1.0em 1.0em 1.0em;float: right;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eAs you know the Linux package managers make life easier for users and administrators. In the Windows world, this is much worse, although there are some tools (in Windows 10 it will be much better): nuget, chocolatey, wpkg and others.\u003c/p\u003e\u003cp\u003eMaintaining Codeforces testing servers, computers of Programming Competitions Training Center of Saratov SU, installing workstations for different olympiads I finally got tired to write a variety of bat-files and decided to regularize the process.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://chocolatey.org\"\u003eChocolatey\u003c/a\u003e makes good help, but in the details it turned out that it can\u0027t used in some cases: you can not specify the installation directory, there is no support for private repositories, lack of some packages, Chocolatey packages do not contain installers but only links for them (if package\u0027s official is down, one can\u0027t install the package).\u003c/p\u003e\u003cp\u003eThat\u0027s why, in December 2014, I spent out several evenings to work on a package manager most convenient for our purposes (called PBOX, reads like a pi-box). I\u0027m considering using PBOX to install specific software for Codeforces (concrete compilers and tools), but for programs of general purpose it is good idea to use Chocolatey.\u003c/p\u003e\u003cp\u003eIn the coming months all the Codeforces testing servers (and many other computers of the CS department of Saratov State University), I plan to reinstall, and use in particular PBOX.\u003c/p\u003e\u003cp\u003eI have little use it for personal purposes, it seems to me, PBOX may be useful to someone from Codeforces users. The site \u003ca href\u003d\"http://pbox.me\"\u003ehttp://pbox.me\u003c/a\u003e has usage examples. Below are a few explanations.\u003c/p\u003e\u003ch4\u003eInstallation\u003c/h4\u003e\u003cp\u003eVisit \u003ca href\u003d\"http://pbox.me\"\u003ehttp://pbox.me\u003c/a\u003e and in the administrative Windows console (search for cmd.exe, get the context menu by right mouse button, select Run as administrator) run the code from the website home page. PBOX written in Java, if you\u0027re not have it, then it will download JRE automatically. By the way, every time you start PBOX, it will try to self-update, so forget about updating it manually.\u003c/p\u003e\u003cp\u003eI usually turn off UAC, if you do not want you will always need to use administrative console. You can disable UAC by typing \u003ccode\u003epbox -uac\u003c/code\u003e.\u003c/p\u003e\u003ch4\u003eUsage\u003c/h4\u003e\u003cp\u003eDo you want to install exactly the same g++ as Codeforces has? Just run \u003ccode\u003epbox install mingw-tdm-gcc\u003c/code\u003e. It will install it to %HOMEDRIVE%\\Programs\\mingw-tdm-gcc (by default), add to PATH some directories (including MSYS), add environment variable MINGW_HOME. \u003c/p\u003e\u003cp\u003eGenerally, to see exactly what will happen on installation simply visit the site to find the package and click \u003ccode\u003eShow pbox.xml\u003c/code\u003e.\u003c/p\u003e\u003cp\u003eFor now PBOX has only 73 packages. Visit \u003ca href\u003d\"http://pbox.me/packages\"\u003ehttp://pbox.me/packages\u003c/a\u003e to explore them.\u003c/p\u003e\u003cp\u003eI like the collection of useful utilities called \u003ccode\u003etools\u003c/code\u003e, so just run \u003ccode\u003epbox install tools\u003c/code\u003e to install sysinternals tools, windows resource kit, support tools, and others like curl, wget, imdisk (add all of them to PATH). BTW, useful utility \u003ccode\u003erunexe.exe\u003c/code\u003e will also be installed: it is good to run processes and see time/memory usage.\u003c/p\u003e\u003cp\u003eMost compilers and tools will be installed to C:\\Programs (actually to %HOMEDRIVE%\\Programs). Quite convenient to have a path to them short and with no spaces unlike \u0026quot;Program Files\u0026quot;.\u003c/p\u003e\u003cp\u003eYou can use additional options like \u003ccode\u003epbox install far --homedir\u003dC:\\Far --arch\u003d32 --version\u003d3.0.4040\u003c/code\u003e. To uninstall a package you can run: \u003ccode\u003epbox uninstall far\u003c/code\u003e. Here are more examples of usage:\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eDescription \u003c/th\u003e       \u003cth\u003eCommand line \u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003eAsk PBOX to forget that it installed a package (but do not uninstall it) \u003c/td\u003e       \u003ctd\u003e\u003ccode\u003epbox forget \u0026lt;package\u0026gt;\u003c/code\u003e \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003ePrint package information (you can specify the version) \u003c/td\u003e       \u003ctd\u003e\u003ccode\u003epbox info \u0026lt;package\u0026gt;\u003c/code\u003e или \u003ccode\u003epbox info \u0026lt;package\u0026gt; --version\u003dversion\u003c/code\u003e \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003eFind package by title/description/tag \u003c/td\u003e       \u003ctd\u003e\u003ccode\u003epbox find \u0026lt;query\u0026gt;\u003c/code\u003e or \u003ccode\u003epbox search \u0026lt;query\u0026gt;\u003c/code\u003e \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003eFind package (find in all versions, not the latest only) \u003c/td\u003e       \u003ctd\u003e\u003ccode\u003epbox find \u0026lt;query\u0026gt; --all\u003c/code\u003e или \u003ccode\u003epbox search \u0026lt;query\u0026gt; --all\u003c/code\u003e \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003ePrint all the packages in repository (latest versions or all) \u003c/td\u003e       \u003ctd\u003e\u003ccode\u003epbox list\u003c/code\u003e или \u003ccode\u003epbox list --all\u003c/code\u003e \u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003ePrint the list of all the installed packages \u003c/td\u003e       \u003ctd\u003e\u003ccode\u003epbox list-installed\u003c/code\u003e \u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003ch4\u003eDownload a package and explore it\u003c/h4\u003e\u003cp\u003eIt is really easy. Just try: \u003ca href\u003d\"http://repo.pbox.me/1.0/jdk8/1.8.0_45/jdk8$1.8.0_45.pbox.7z\"\u003ehttp://repo.pbox.me/1.0/jdk8/1.8.0_45/jdk8$1.8.0_45.pbox.7z\u003c/a\u003e\u003c/p\u003e\u003ch4\u003eSource code\u003c/h4\u003e\u003cp\u003eVisit: \u003ca href\u003d\"https://github.com/MikeMirzayanov/pbox\"\u003ehttps://github.com/MikeMirzayanov/pbox\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["pbox","packagemanager","software","administration"]}}