{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1407242641,"rating":13,"authorHandle":"Junior94","modificationTimeSeconds":1407358840,"id":13301,"title":"\u003cp\u003eMinimum excluded ordinal\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI\u0027m trying to understand some concepts of game theory. So far I\u0027ve understood how the \u003cstrong\u003egame of nim\u003c/strong\u003e works, at least the most basic form: as long as the current game has \u003cstrong\u003evalue \u0026gt; 0\u003c/strong\u003e the current player can change at least one of the piles such that the next turn will be played with \u003cstrong\u003evalue \u003d 0\u003c/strong\u003e. If the current game has \u003cstrong\u003evalue \u003d 0\u003c/strong\u003e there are only 2 possibilities: Either the game is over and the player lost or he may pick a pile but by doing so in every case will yield \u003cstrong\u003evalue \u0026gt; 0\u003c/strong\u003e for the next player. I understood it by reading this \u003ca href\u003d\"http://community.topcoder.com/tc?module\u003dStatic\u0026amp;d1\u003dtutorials\u0026amp;d2\u003dalgorithmGames\"\u003eTopcoder article\u003c/a\u003e. It clearly explains how to choose a pile when \u003cstrong\u003evalue \u0026gt; 0\u003c/strong\u003e and change it to \u003cstrong\u003evalue \u003d 0\u003c/strong\u003e and that keeping \u003cstrong\u003evalue \u003d 0\u003c/strong\u003e for two turns is impossible.\u003c/p\u003e\u003cp\u003eI am now trying to understand how the minimum excluded cardinal is equivalent to a nim value. How will always choosing the minimum value not appearing in the set always yield the correct result? How can the bigger values be discarded and not accounted for if those values can still be reached? Is there any intuitive way to know why this works?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e Got the answer from \u003ca href\u003d\"http://math.stackexchange.com/questions/888078/minimum-excluded-ordinal\"\u003ehere\u003c/a\u003e. The Topcoder article above also has the answer as \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/kingofnumbers\" title\u003d\"Expert kingofnumbers\"\u003ekingofnumbers\u003c/a\u003e already said but I found it a little bit difficult to understand it with just that \u003cem\u003e(it makes sense when you already understand it of course)\u003c/em\u003e. Just in case someone eventually faces the same problem I left the link that helped me the most. \u003c/p\u003e\u003c/div\u003e","tags":["game theory","nim","minimum excluded ordinal"]}}