{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1422636934,"rating":10,"authorHandle":"13_8_4_3_2_1","modificationTimeSeconds":1422637821,"id":16116,"title":"\u003cp\u003eHow to swap values of two variables \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e(I\u0027m too much infant in case of coding. I\u0027m just writing a blog just out of curiosity)\u003c/p\u003e\u003cp\u003eWe know the process of swapping two variables.\u003c/p\u003e\u003cp\u003eLet\u0027s 1st talk about a very easy process.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e(Swapping with the help of two new variables)\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eSuppose we have two variables(say A \u0026amp; B). A \u0026amp; B have their values. Now we will take one new variables.(With no values)(Say temp) Then we can do the following: C\u003dA; B\u003dD; C \u0026amp; D are two new variables; Now do the following and print the value of A \u0026amp; B: A\u003dD; B\u003dC; You will see A\u003d3; B\u003d2; Bang!! We have successfully swapped. Let me explain. Let, A \u0026amp; B are two buckets(You can compare variables with buckets, right?) Say, in A we have milk and in B there is honey. We just want honey in A bucket, and milk in bucket B. That\u0027s the theory of swapping,right? Okk, now we have brought two new empty buckets C \u0026amp;D(Actually now empty,it has garbage. Let\u0027s wash :p) Then what have we done?? We have just put A bucket\u0027s milk in C bucket \u0026amp; B bucket\u0027s milk in D bucket. Now A\u0026amp; B buckets are empty. Now let\u0027s put D bucket\u0027s honey in A bucket \u0026amp; C bucket\u0027s milk in B bucket Now we have milk in B bucket and honey in A bucket.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e(Swapping with the help of only one new variable)\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eSuppose we have two variables.(say A \u0026amp; B). A \u0026amp; B have their values. Now we will take one new variable.(With no values)(Say temp) Then we can do the following: temp\u003dA; A\u003dB; B\u003dtemp;\u003c/p\u003e\u003cp\u003e1st we have assigned the values of A in temp variable, then we have put value of B in A variable. And after that we have assigned value of temp(actually A) in B.\u003c/p\u003e\u003cp\u003eThen after printing the values of A \u0026amp; C, we will see: A\u003d3; B\u003d2; Bang!!! We\u0027ve successfully swapped two variables.\u003c/p\u003e\u003cp\u003eLet me explain. Let, A \u0026amp; B are two buckets(You can compare variables with buckets, right?) Say, in A we have milk and in B there is honey. We just want honey in A bucket, and milk in bucket B. That\u0027s the theory of swapping,right? Okk, now we have brought one empty bucket temp.(Actually now empty,it has garbage. Let\u0027s wash :p) Then what have we done?? We have just put A bucket\u0027s milk in temp bucket. Now A bucket is empty. Let\u0027s put B bucket\u0027s honey in A bucket. Now B bucket is empty. Let\u0027s just put temp bucket\u0027s milk in B bucket. Now we have milk in B bucket and honey in A bucket. Agaain we have successfully swapped. \u003dD\u003c/p\u003e\u003cp\u003eOkk now let\u0027s try now try this one.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e(Swapping with the help of no extra variables)\u003c/strong\u003e Suppose we have two variables(say A \u0026amp; B). A \u0026amp; B have their values.\u003c/p\u003e\u003cp\u003eNow let\u0027s try this: A\u003dA+B; B\u003dA-B; A\u003dA-B;\u003c/p\u003e\u003cp\u003eI think you have understood. If not , just make comment. ;)\u003c/p\u003e\u003c/div\u003e","tags":[]}}