{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1422729634,"rating":607,"authorHandle":"Seyaua","modificationTimeSeconds":1423266133,"id":16140,"title":"\u003cp\u003eRockethon 2015 Announcement\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"http://rocketfuel.com/\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/rockethon/HZ-LOGO-TAG-RGB-big.png\" style\u003d\"float: right;margin: 0 2.0em 2.0em 2.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e Hello Codeforces community,\u003c/p\u003e\u003cp\u003eI am happy to announce that \u003ca href\u003d\"http://rocketfuel.com/\"\u003eRocket Fuel Inc.\u003c/a\u003e will be hosting a Rockethon competition again! The contest is prepared by Rocket Fuel employees Eldar Bogdanov, Anton Lomonos, Lasha Lakirbaia, Alexander Ruff, Nikhil Goyal and me, Ievgen Soboliev. We hope everyone will find some interesting problems in the contest and everyone will have as much fun solving these problems as we had preparing them. Just like last year, the best participants will receive valuable prizes and top performers will get Rockethon 2015 T-shirts! Also, Rocket Fuel is interested in hiring people after this event, so please fill out the simple form during registration.\u003c/p\u003e\u003ch2\u003eAbout Rocket Fuel\u003c/h2\u003e\u003cp\u003eRocket Fuel is building technology platform to do automatic targeting and optimization of ads across all channels — display, video, mobile and social. Our pitch to advertisers is very simple \u0026quot;If you can measure metrics of success of your campaign, we can optimize\u0026quot;. We run campaigns for many large advertisers and our clients include many top companies within the following industries: autos, airlines, commercial banks, telecom, food services, insurance, etc. Examples include BMW, Pizza Hut, Brooks Running Shoes and many more!\u003c/p\u003e\u003cp\u003eWe buy all our inventory through real time bidding on ad exchanges like Google and Yahoo. Ad exchanges are similar to stock exchanges except the commodity being traded is ad slots on web pages. Our serving systems currently process over 60B bid requests/ day with a response time requirement of 100ms. Our data platform has 64 PBs data that is used for analytics as well as modeling.\u003c/p\u003e\u003cp\u003eOur engineering team is still small (~150) enough for any one person like yourself to make a huge impact. The team represents many top schools in US and outside — Stanford, Carnegie Mellon, MIT, Wisconsin-Madison, IIT (India), Tsinghua (China).\u003c/p\u003e\u003cp\u003eRocket Fuel has been named \u003ca href\u003d\"http://www.google.com/url?q\u003dhttp%3A%2F%2Frocketfuel.com%2Fnewsroom%2Fpress_release%2Frocket-fuel-named-4-on-forbes-most-promising-companies-in-america-list\u0026amp;sa\u003dD\u0026amp;sntz\u003d1\u0026amp;usg\u003dAFQjCNHnAbAHIlJ7i7iAynGuefkb9ETeBA\"\u003e#4 on Forbes Most Promising Companies in America List\u003c/a\u003e in 2013 and \u003ca href\u003d\"http://www.google.com/url?q\u003dhttp%3A%2F%2Frocketfuel.com%2Fnewsroom%2Fpress_release%2Frocket-fuel-ranked-no.-1-fastest-growing-company-in-north-america-on-deloit\u0026amp;sa\u003dD\u0026amp;sntz\u003d1\u0026amp;usg\u003dAFQjCNFgfpeIcAP1pujkMuKPOfmKnvJxFw\"\u003e#1 Fastest Growing Company in North America on Deloitte’s 2013 Tech Fast 500\u003c/a\u003e and our CEO George John was recently named “Most Admired CEO” by the SF Business Times in 2014.\u003c/p\u003e\u003ch2\u003eMy Personal Story\u003c/h2\u003e\u003cp\u003eAbout one year ago I visited CodeForces and saw an announcement of Rockethon 2014. My first thought was \u0026quot;Another competition from a big company, that\u0027s nice!\u0026quot;. I took part in this contest, performed quite well and recruiters from Rocket Fuel have contacted me and scheduled some interviews. I passed the interviews and now I\u0027m here, in Rocket Fuel.\u003c/p\u003e\u003cp\u003eIt has been a nice opportunity to learn advanced concepts of software engineering from a huge amount of smart people working with you. Also, our activities here are not limited only to writing code — we do fun things here like playing basketball, soccer, table tennis. I invite everybody to take a part in the competition and would be glad to hear if any of you thinking about joining Rocket Fuel.\u003c/p\u003e\u003ch2\u003eContest Overview\u003c/h2\u003e\u003cp\u003eThe contest will begin on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dRockethon+2015\u0026amp;iso\u003d20150207T09\u0026amp;p1\u003d224\u0026amp;ah\u003d3\"\u003eFebruary 7, 9AM PST\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe contest length is 3 hours.\u003c/p\u003e\u003cp\u003eThe testing of each submission will be performed as soon as the submission is received and the verdict will be delivered to the submission author right away.\u003c/p\u003e\u003cp\u003eThe problemset will consist of 7 problems. Each problem can contain from one to three subproblems. Each subproblem will be worth a fixed amount of points. The ties between contestants with the same score will be broken by penalty time which is computed similar to ACM scoring system.\u003c/p\u003e\u003ch2\u003ePrizes\u003c/h2\u003e\u003cp\u003eThe top three contestants will receive the following prizes:\u003c/p\u003e\u003cp\u003e1) IPhone 6 (16 Gb)\u003c/p\u003e\u003cp\u003e2) Participant can choose Apple Watch or Samsung Gear S\u003c/p\u003e\u003cp\u003e3) Participant can choose Apple Watch or Samsung Gear S\u003c/p\u003e\u003cp\u003eThe top 150 performers will receive a Rockethon T-shirt designed specially for this contest.\u003c/p\u003e\u003cp\u003eIf you are unable to take part in the competition but are interested in joining Rocket Fuel, we will be screening resumes submitted through the special \u003ca href\u003d\"http://codeforces.ru/rockethon2015/apply?locale\u003den\"\u003eform\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["rockethon 2015","rocket fuel"]}}