{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1497986210,"rating":44,"authorHandle":"Laggy","modificationTimeSeconds":1522200201,"id":52778,"title":"\u003cp\u003eCompetitive Programming Community Discord (1100 Members): Contest Discussions Hub!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eCPC\u003c/strong\u003e or \u003cstrong\u003eC\u003c/strong\u003eompetitive \u003cstrong\u003eP\u003c/strong\u003erogramming \u003cstrong\u003eC\u003c/strong\u003eommunity is a Discord server targeting problem solvers and competitive programmers from all backgrounds and different platforms. \u003c/p\u003e\u003cp\u003eFirst let me briefly introduce \u003cstrong\u003eDiscord\u003c/strong\u003e for those who haven\u0027t heard of it before:\u003cbr /\u003e\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eDiscord is an all-in-one voice and text chat application that works on \u003cstrong\u003ebrowser/desktop/phone\u003c/strong\u003e. Every server can have multiple text \u0026amp; voice channels accessed by members of the server or limited to a certain group of these members. You can share code/text/links/pictures at the text channels and you can talk in the voice channels.\u003c/p\u003e \u003c/blockquote\u003e\u003cp\u003e\u003cstrong\u003eWhy should you join the server?\u003c/strong\u003e\u003c/p\u003e \u003cblockquote\u003e\u003cp\u003eBasically, you get to meet other members and have group discussions without caring about \u003cstrong\u003edown-votes\u003c/strong\u003e. The server is currently active with over 700+ members (still have a long way to go). Also, Discord has nice features such as pinning messages/pinging users/search function and many other cool stuff.\u003c/p\u003e\u003cp\u003eBut most importantly, for all you contest enthusiasts, you will be very interested in joining our post-contest discussions. Those are when the server is most active and everyone is raging about their hacked solutions, bugged code, how they misunderstood the statements and/or all your typical post-contest feelings then, you discuss problems.\u003cbr /\u003e The members are from all ranks and A LOT of them are actually quite humble and love helping others. Well, you will know what I am talking about once you join \u003cstrong\u003e\u003cstrong\u003ewink\u003c/strong\u003e\u003c/strong\u003e. \u003c/p\u003e \u003c/blockquote\u003e \u003chr /\u003e \u003ccenter style\u003d\"margin: 20.0px;\"\u003e \u003ca href\u003d\"https://discord.gg/JkKFCcS\" style\u003d\"font-size: 24.0px;padding: 8.0px 14.0px;background-color: rgb(72,133,237);color: white;\"\u003eJoin Us by visiting this invite →\u003c/a\u003e \u003c/center\u003e\u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"https://discordapp.com/api/guilds/326795829664808960/widget.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e \u003chr /\u003e \u003ccenter\u003e  \u003ch5\u003e\u003cb\u003eAlgo-chan\u003c/b\u003e\u003c/h5\u003e \u003cimg src\u003d\"https://image.prntscr.com/image/nrC1okxRSDKaZOpdSR6RfQ.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e \u003cbr /\u003e \u003cstrong\u003eAlgo-chan\u003c/strong\u003e is a bot I created to assign roles to new members. Roles? Yes, every member get to \u003cstrong\u003everify his identity using a command\u003c/strong\u003e. This feature is exclusive to \u003cstrong\u003eCodeforces\u003c/strong\u003e right now. Depending on your Codeforces \u003cstrong\u003erating\u003c/strong\u003e you get a role with different permissions and access to channels AND a different Color. \u003cbr /\u003e \u003cbr /\u003e \u003ccode\u003eJust like codeforces, you will be assigned a different color once you set your handle successfully.\u003c/code\u003e \u003cbr /\u003e \u003cbr /\u003e Currently, I am working on an algorithm/data-structure database. Soon you will be able to lookup algorithm implementations using a special command: \u003ccode\u003e!algo\u003c/code\u003e \u003ccenter\u003e  \u003ch6\u003e\u003cb\u003eAlgo-chan\u0027s Command List\u003c/b\u003e\u003c/h6\u003e \u003cimg src\u003d\"https://image.prntscr.com/image/QZJYop8zQtav7a4DTCAVlw.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003e\u003cstrong\u003eModerators\u003c/strong\u003e: These are the most active users that are willing to help manage the server in case some user decided to spam/troll/post unwanted material. (Currently: \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/noelnadal\" title\u003d\"Кандидат в мастера noelnadal\"\u003enoelnadal\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/BasselBakr\" title\u003d\"Кандидат в мастера BasselBakr\"\u003eBasselBakr\u003c/a\u003e, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Noam527\" title\u003d\"Кандидат в мастера Noam527\"\u003eNoam527\u003c/a\u003e, \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/tfg\" title\u003d\"Мастер tfg\"\u003etfg\u003c/a\u003e)\u003c/p\u003e\u003cp\u003eThis server is non-profit and is managed by the community. The bot is going to be open source when it\u0027s ready. What I ask of you is to join and help us build this amazing community.\u003c/p\u003e\u003c/div\u003e","tags":["discord","community","programming","competitive programming"]}}