{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1514487663,"rating":0,"authorHandle":"TheDealer","modificationTimeSeconds":1514487799,"id":56697,"title":"\u003cp\u003eWeek 2\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello everyone! Today we learned how to use arrays,strings,and loops.\u003c/p\u003e\u003cp\u003eLoop is an efficient tool used to repeat the same steps on multiple of times. It makes the code smaller in size and easier to understand and debug. There are 3 kinds of loops while,do while,and for. We didn\u0027t explain the do while because its uses are few but in the future we shall learn it. The main difference between the for loop and the while loop is the syntax;their functionality stays the same but due to syntax differences one can be easier to use than other. Sample code for reference \u003ca href\u003d\"https://ideone.com/IyCJ7C\"\u003ehttps://ideone.com/IyCJ7C\u003c/a\u003e\u003c/p\u003e\u003cp\u003eArray is a way to create multiple variables with the same name differentiated by a number inside brackets found beside the the name of the variable. Sample code for reference \u003ca href\u003d\"https://ideone.com/Ukl6Zh\"\u003ehttps://ideone.com/Ukl6Zh\u003c/a\u003e\u003c/p\u003e\u003cp\u003eStrings are used to store characters ,words ,sentences ,and even paragraphs. To use string you first need to add \u003cstrong\u003e#include \u003c/strong\u003e. Here is a sample code with comments for reference \u003ca href\u003d\"https://ideone.com/hhAxsK\"\u003ehttps://ideone.com/hhAxsK\u003c/a\u003e\u003c/p\u003e\u003cp\u003eFake NP: we reached the conclusion that the solution is always 2,since 2 is found every 2 numbers while other numbers are found in larger intervals. we had to handle one case, when the two numbers given where equal , with printing just printing it to avoid it begin odd or prime.\u003c/p\u003e\u003cp\u003ecode: \u003ca href\u003d\"https://ideone.com/0oxFjt\"\u003ehttps://ideone.com/0oxFjt\u003c/a\u003e\u003c/p\u003e\u003cp\u003esolution for L ELEPHANT\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://ideone.com/DJuJA9\"\u003ehttps://ideone.com/DJuJA9\u003c/a\u003e\u003c/p\u003e\u003cp\u003esolution for A TEAM\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://ideone.com/ZLesF0\"\u003ehttps://ideone.com/ZLesF0\u003c/a\u003e\u003c/p\u003e\u003cp\u003esolution for E WAY TOO LONG WORDS\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://ideone.com/PZWdEZ\"\u003ehttps://ideone.com/PZWdEZ\u003c/a\u003e\u003c/p\u003e\u003cp\u003eGood Luck and don\u0027t forget to solve this weeks problems.\u003c/p\u003e\u003c/div\u003e","tags":[]}}