{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1439546355,"rating":42,"authorHandle":"JKeeJ1e30","modificationTimeSeconds":1439546355,"id":19779,"title":"\u003cp\u003eНа заметку организаторам соревнований, разыгрывающих памятные призы.\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eНайдя в своем шкафу футболку с чемпионата Урала, я вдруг решил вспомнить: а когда этот чемпионат проходил? Восстановив цепь событий, я понял, что это было в мае 2013 года, и я \u003ca href\u003d\"//codeforces.com/blog/entry/7542\"\u003eдаже пытался быть блогером этого события\u003c/a\u003e, но не пошло.\u003cbr /\u003eКонечно, у меня память никогда не была идеальной, а знающие меня люди наверняка скажут, что она очень плохая... Но ведь если взять и покопаться в своем шкафу, то наверняка далеко не все смогут вспомнить, с какого события была та или иная футболка, каким образом она была заработана. Как раз по поводу чемпионата Урала — до сих пор можно найти \u003ca href\u003d\"http://russiasport.ru/video_hub/node/534137\"\u003eвидео\u003c/a\u003e с того события, но это лишь потому, что тогда был разыгран очень большой призовой фонд и организация была на достаточно высоком уровне(с известными косяками, но это ладно). В то же время, ранклист найти уже проблематично. А что по поводу более мелких соревнований? На многих футболках не указан ни год, ни номер соревнования — просто подписана компания, которая проводила данный контест.\u003cbr /\u003eА ведь при этом наша память, те мгновения, которые мы переживаем на том или ином событии — это то, что потом будет приятно вспомнить, посиживая с чаем в кругу близких родственников или друзей, или просто решая задачу из \u0026quot;реальной жизни\u0026quot; и представлять, как здорово было бы по ней заработать accepted на контесте. Ведь именно счастливые минуты наших триумфов или мгновения наших неудач, которые заставили нас сказать самим себе \u0026quot;я могу кодить гораздо лучше\u0026quot; потом становятся залогом того, что мы раз за разом возвращаемся в этот прекрасный мир спортивного программирования.\u003cbr /\u003eРазумеется, полностью всю информацию(с ранклистом, с видео, с фотографиями события) оставлять на футболке невозможно. Но, может быть — все-таки стоит оставлять какую-то информацию? Может быть, ссылка на группу в ВК. Или же название события, по которому можно легко нагуглить информацию. QR-код вполне подойдет — это, к тому же, достаточно модно(если, конечно, организаторы заботятся о стиле).\u003cbr /\u003eМожет быть, в этом топике найдутся люди, которые будут совершенно со мной не согласны — я не против, я всего лишь высказал свою точку зрения. Буду рад любым комментариям.\u003c/p\u003e\u003c/div\u003e","tags":[]}}