{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1523445307,"rating":-5,"authorHandle":"harshaga97","modificationTimeSeconds":1523464935,"id":58871,"title":"\u003cp\u003eMinimum rearrangment of boxes to accomodate new box in cartons\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThere are \u003ccode\u003en cartons\u003c/code\u003e. Each carton can have some boxes in it. Each box occupies some space.\u003c/p\u003e\u003cp\u003eWe are given the free space left in each carton and the list of sizes of boxes in each carton. There is no restriction on number/size of boxes in each carton.\u003c/p\u003e\u003cp\u003eNow we have a new box, with \u003ccode\u003esize x\u003c/code\u003e, which needs to be accomodated in any one of the cartons. \u003cstrong\u003eRearrangement of any number of boxes from a carton to any other carton is allowed, provided the new carton has the space left to accomodate the rearranged box.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eI need to find the rearrangement that can be obtained in the least number of box movements \u0026amp; can accomodate the new box. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eI am more interested in the case that the new box cannot be accomodated in any free-space of any carton and some rearrangement is mandatory to make room for the new box.\u003c/strong\u003e\u003c/p\u003e \u003cpre\u003eInput format\nx : size of new box\nn : no of cartons\n    box_no_1 :: free_space, no_of_boxes, box1_size, box2_size, ...\n    box_no_2 :: free_space, no_of_boxes, box1_size, box2_size, ...\n\nexample:\nx : 60\nn : 3\n    1 :: 10 , 3, 10 , 10 , 30\n    2 :: 20 , 2, 20 , 10\n    3 :: 50, 3, 10, 30, 20\n\nAnswer:: box with size 10 in carton 3 can be moved to carton 1. Then new box can then be kept in box 3.\u003c/pre\u003e\u003cp\u003eAn idea is to use bin-packing algorithm to solve this. But bin-packing does not involve rearrangements.\u003c/p\u003e\u003cp\u003eAny ideas on how can bin-packing or any other technique be moulded to solve this? \u003c/p\u003e\u003c/div\u003e","tags":["integer optimization","greedy","dynamic-programming","#algorithms"]}}