{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1432115866,"rating":95,"authorHandle":"YuukaKazami","modificationTimeSeconds":1432144915,"id":17990,"title":"\u003cp\u003eWorld final 2015 Commentary and virtual parcipation\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI and my friend \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/tooSimple\" title\u003d\"Международный гроссмейстер tooSimple\"\u003etooSimple\u003c/a\u003e and \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/vfleaking\" title\u003d\"Гроссмейстер vfleaking\"\u003evfleaking\u003c/a\u003e are going to virtual participate (single machine) the WF 2015 online on \u003ca href\u003d\"https://icpc.kattis.com/\"\u003esite\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eIt might be interesting to record our progress and commentary on the contest and problems here :)\u003c/p\u003e\u003cp\u003e--18:05(in GMT +8): We are still waiting for the problems to be available online :)\u003c/p\u003e\u003cp\u003eMeanwhile, PKU(Peking University) gets the overall first blood. Their team member contains two experienced coders which participated in WF 2013, I guess they will get a good result in this WF :)\u003c/p\u003e\u003cp\u003eIt seems Problem A is quite easy, many teams solve it during the following two minutes :)\u003c/p\u003e\u003cp\u003eForget to mention, there are 13 problems this year. I am wondering if it is all hard problems like last year, or some easier problems? The problem type will definitely affect the result of this fierce competition :)\u003c/p\u003e\u003cp\u003e--18:17 nearly 20 minutes passed, no one solve two problems, and we are still waiting for online problems :)\u003c/p\u003e\u003cp\u003e--18:21 It seems the pdf version is out, but we decide not to look at it since we want a virtual competition :)\u003c/p\u003e\u003cp\u003e--18:24 CMU submits F and got -1, Maybe F is the next problems to solve? \u003c/p\u003e\u003cp\u003eAnd Tsinghua get -1 on C, Zagreb gets -1 on F, I guess C and F will be easier than other problems :)\u003c/p\u003e\u003cp\u003eTHU gets first blood on C, and FCEN get first blood on F.\u003c/p\u003e\u003cp\u003eGood start for THU!(I am from THU too), Hope they can keep up the good work :)\u003c/p\u003e\u003cp\u003ePrinceton gets first blood on D. What are the members of Princeton this year?\u003c/p\u003e\u003cp\u003eAnyway...The problem is still not online...I decide that if it didn\u0027t come before 18:40, we are going to look at the problems first \u0026lt;_\u0026lt;.\u003c/p\u003e\u003cp\u003e\u0026quot;ACM ICPC World Finals 2015 problems to be added shortly after contest start\u0026quot;, it seems I misunderstand the world \u0026quot;shortly\u0026quot;.\u003c/p\u003e\u003cp\u003eITMO and Toky solved D, now the problem being solved are A,C,D F, It should be 4 easy problems, I guess during the next 10 or 20 minutes, many teams will solve them too.\u003c/p\u003e\u003cp\u003e--18:40, the website doesn\u0027t have problem still, well, We decide to still wait without looking at the pdf version:(\u003c/p\u003e\u003cp\u003eUniversity of Warsaw solved L, well, I think this year\u0027s problem will not be like last year, and the first place will end up 10 or 11 problems I guess.\u003c/p\u003e\u003cp\u003eTokyo solved J, I think \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/rng_58\" title\u003d\"Международный гроссмейстер rng_58\"\u003erng_58\u003c/a\u003e\u0027s team are on a good track, they still have more other easy problems to solve :)\u003c/p\u003e\u003cp\u003ePKU solved D and becomes #1, This team is really exciting today :)\u003c/p\u003e\u003cp\u003eNow, 7 teams solved 3 problems :)\u003c/p\u003e\u003cp\u003eTokyo solved C and becomes #1 again, really good competition :), I\u0027m excited too(Where is the problems to submit online \\T_\\T).\u003c/p\u003e\u003cp\u003eITMO got 6 , while Tokyo and Moscow and 5.\u003c/p\u003e\u003cp\u003eThey are the three best team in my opinion:) Thus the result is pretty reasonable.\u003c/p\u003e\u003cp\u003eIt seems all CN teams solved 4 problems at most ,I hope CN teams can do better later :)\u003c/p\u003e\u003cp\u003eTokyo now got 6, and back to #1.\u003c/p\u003e\u003cp\u003eNotice that after tourist start to writing C, ITMO got 4 problems in just 20 minutes, it is just insane...\u003c/p\u003e\u003cp\u003eWell, Since the problem is still not out on kattis, I decide to look at the pdf version first \\T_\\T.\u003c/p\u003e\u003cp\u003eFinally it starts! --19:39 19:53 the log in is broken, so we made a new account. And vfk got problem A. vfk is working on problem D. And he got D soon. I am working on problem F, it is a stupid problem. C is a stupid problem too. I got F and C in a roll.\u003c/p\u003e\u003cp\u003eSo we have 4 problems now.\u003c/p\u003e\u003cp\u003eIt seems J is a simple FFT, L is a simple Huffman, and H is some kind of math problem... We are working on them now. vfk got J right. dyh is working on H. I am going to code L later.\u003c/p\u003e\u003cp\u003edyh got H, we have 6 now.\u003c/p\u003e\u003cp\u003eI got L. We have 7 now.\u003c/p\u003e\u003cp\u003e22:05 -vfk got I. We have 8 now.\u003c/p\u003e\u003cp\u003edyh is coding E, umm, the rest of the problems is quite hard now, we need to be careful.\u003c/p\u003e\u003cp\u003eWe got E, we have 9 now.\u003c/p\u003e\u003cp\u003eIn the last hour we got K. Seems end up 10 problems \u0026lt;_\u0026lt;\u003c/p\u003e\u003cp\u003e...During the last moment, we are switching on 3 remaining problems B G M and got none of them, so sad T_T.\u003c/p\u003e\u003cp\u003eWe got 10 problems and penalty 1066 in the end...\u003c/p\u003e\u003c/div\u003e","tags":[]}}