{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1494748396,"rating":63,"authorHandle":"junkbot","modificationTimeSeconds":1527758987,"id":51981,"title":"\u003cp\u003eInvitation to APIO 2017 Open Contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi Everyone!\u003c/p\u003e\u003cp\u003eThis year Australia is hosting the Asia-Pacific Informatics Olympiad (APIO). Since the official contest window is about to end for contestants, the APIO 2017 Open contest will begin soon! Everyone is invited to participate, and would be good practice for IOI-eligible students.\u003c/p\u003e\u003cp\u003eThe contest has a similar format to the IOI, having 3 tasks over 5 hours and will be hosted on the CMS Contest Management System at \u003ca href\u003d\"contest.apio17.org\"\u003econtest.apio17.org\u003c/a\u003e. The contest will be run in two separate windows, each having the same set of problems as the official contest.\u003c/p\u003e \u003col\u003e   \u003cli\u003eWindow 1 begins \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dAPIO+Open+Contest%3A+Window+1\u0026amp;iso\u003d20170515T15\u0026amp;p1\u003d1440\u0026amp;ah\u003d5\"\u003eUTC+0 15.00, Monday, May 15\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eWindow 2 begins \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dAPIO+Open+Contest%3A+Window+2\u0026amp;iso\u003d20170516T11\u0026amp;p1\u003d1440\u0026amp;ah\u003d5\"\u003eUTC+0 11.00, Tuesday, May 16\u003c/a\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003ePlease note that these times have been pushed back by 24 hours from what was originally advertised on our website.\u003c/p\u003e\u003cp\u003eThe supported languages are C11, C++11 and Pascal only. Task statements will be available in English, Chinese (Simplified), Chinese (Traditional), Hebrew, Bahasa Indonesia, Japanese, Korean, Mongolian, Persian, Russian, Thai, Turkish and Vietnamese, with many thanks to the leaders of the respective delegations for providing task translations. Detailed rules for the contest can be found on the contest website \u003ca href\u003d\"http://apio17.org/competition/rules/\"\u003ehttp://apio17.org/competition/rules/\u003c/a\u003e. Unfortunately, clarifications will not be available during the open contests.\u003c/p\u003e\u003cp\u003eIf you would like to participate, please register using the \u003ca href\u003d\"https://goo.gl/forms/gwvawBBa4P0eB8AH3\"\u003eRegistration Form\u003c/a\u003e. Registration for each contest will close two hours prior to the start of the contest. \u003cstrong\u003eUpdate:\u003c/strong\u003e Once registrations close, you will be emailed a username and password to use to log in to the contest site. Please check your email before the contest begins!\u003c/p\u003e\u003cp\u003eTo ensure that each contest is fair, we kindly ask all participants to refrain from discussing the problems until the end of the second open contest window. \u003cstrong\u003eUpdate:\u003c/strong\u003e As a result, please \u003cstrong\u003edo not\u003c/strong\u003e participate if you have already competed in the official contest. If you did compete and have already registered, please don\u0027t login and compete on the contest system. If you are still competing in the open contest, please only participate and register for one of the two contest windows. Thank you for your co-operation.\u003c/p\u003e\u003cp\u003eLooking forward to your participation!\u003c/p\u003e\u003cp\u003eAPIO 2017 Organising Committee\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate:\u003c/strong\u003e Window 1 registration has closed. Please check your email for login details. The contest site is up and the contest will begin in under two hours\u0027 time! Best of luck for the contest.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate:\u003c/strong\u003e Window 2 registration has closed. Please check your email for login details. The contest site is up and the contest will begin in under an hour\u0027s time! Best of luck for the contest.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpdate:\u003c/strong\u003e The official English problem statements, testdata, contest materials (checkers, graders etc.) and solutions have finally been posted on the \u003ca href\u003d\"http://apio17.org/competition/tasks/\"\u003eofficial website\u003c/a\u003e and also on the \u003ca href\u003d\"http://apio-olympiad.org/\"\u003eAPIO website\u003c/a\u003e. We apologise for the long delay.\u003c/p\u003e\u003c/div\u003e","tags":["apio","apio2017"]}}