{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1399909711,"rating":358,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1399929214,"id":12273,"title":"\u003cp\u003eCormen Medal 2013\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eAfter a short delay (but Oscar is given in spring too, huh?) we are pleased to announce the Cormen Medal laureates for 2013. This year, we’ve decided to slightly upgrade nominations again, so this year\u0027s Cormen Medal is given in two nominations:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eBest Progress\u003c/li\u003e   \u003cli\u003eBest Problemsetter\u003c/li\u003e \u003c/ul\u003e\u003ch2\u003eBest Progress\u003c/h2\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/cormen-2013/scott_wu.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eThe Cormen Medal laureate in this nomination is Scott Wu (\u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/scott_wu\" title\u003d\"International Grandmaster scott_wu\"\u003escott_wu\u003c/a\u003e, USA). Note the \u003ca href\u003d\"/profile/scott_wu\"\u003esharp upward dive his rating line takes\u003c/a\u003e. His achievements in 2013 are not limited by the spectacular dive into the best 10 participants on Codeforces: he got the 5-th place on IOI, won the 2013 season of the USACO contests, got target on TopCoder! We congratulate Scott and wish him many more achievements!\u003c/p\u003e\u003ch2\u003eBest Problemsetter\u003c/h2\u003e \u003ccenter\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/cormen-2013/Sereja-small.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eWe didn\u0027t have to search far and wide for the winner in this nomination. Naturally, the Cormen Medal goes to the most productive and loved by many author of 2013, Sergey Nagin (\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Sereja\" title\u003d\"Master Sereja\"\u003eSereja\u003c/a\u003e, Ukraine). Sergey prepared and conducted 7 rounds (all of them Div1+Div2) on Codeforces. Sergey\u0027s problems gained popularity among the Codeforces coders and we will be happy to see his contests again in the future! Sergey has already been awarded by a Medal and an Award Plate in February in Kharkov training camp.\u003c/p\u003e\u003cp\u003eLooks like it\u0027s becoming a good tradition. The laureates will be sent a book by Thomas Cormen (Introduction to Algorithms or Algorithms Unlocked), signed by the author.\u003c/p\u003e\u003ch2\u003eHistory\u003c/h2\u003e\u003cp\u003eLet us remind you that the Cormen medals have been awarded for the fourth year. \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e (Gennady Korotkievich) became the best participant three years in a row (in all the years when this nomination existed). \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/I_love_ilona\" title\u003d\"Candidate Master I_love_ilona\"\u003eI_love_ilona\u003c/a\u003e (Alexander Kouprin) became the best blogger in both years when this nomination existed. My favourite nomination \u0026quot;Best Problemsetter\u0026quot; was awarded to: \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/natalia\" title\u003d\"Master natalia\"\u003enatalia\u003c/a\u003e (Natalia Bondarenko) in 2010, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Ripatti\" title\u003d\"Candidate Master Ripatti\"\u003eRipatti\u003c/a\u003e (Artyom Ripatti) in 2011, and \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/witua\" title\u003d\"Master witua\"\u003ewitua\u003c/a\u003e (Vitaly Gerasimov) in 2012. Besides, in 2012 there was a medal for \u0026quot;Codeforces Spirit of Community 2012\u0026quot;, the laureate was \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Nickolas\" title\u003d\"Expert Nickolas\"\u003eNickolas\u003c/a\u003e (Mariia Mykhailova).\u003c/p\u003e\u003c/div\u003e","tags":["cormen medal","cormen award","cormen"]}}