{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1482840723,"rating":158,"authorHandle":"PikMike","modificationTimeSeconds":1482843606,"id":49346,"title":"\u003cp\u003eRevoting for comments: dreams come true?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThey do! In some way.\u003c/p\u003e\u003cp\u003eFor eager ones \u003ca href\u003d\"https://openuserjs.org/scripts/MineGeekYT/CF_Voting_Buffer\"\u003elink to userscipt.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eHi everybody!\u003cbr /\u003eYou know, our universe is pretty unfair place. Luckily, some unfairness can be fixed. And I found a method to make this world a bit kinder!\u003c/p\u003e\u003cp\u003eLet me introduce a plugin that can help people overcome difficulties in their lives and develop their self-esteem!\u003cbr /\u003eI believe, every active member of codeforces community at least once faced the problem I\u0027ve faced couple times. It\u0027s when you try to reach that sweet green arrow to support commentator but instead of this you accidentally punch the red one with all of your might! And there is no way to correct the mistake!\u003c/p\u003e\u003cp\u003eSo, I spent some time studying the problem (and jquery, btw) and made a cute little script that changes concept of vote confirmation. While you are on a page, you now can alterate between your decisions as much as you wish (though only on comments you haven\u0027t voted for before entering page). Changes will be applied on site closing (it can be either moving to other site or closing tab/browser).\u003c/p\u003e\u003cp\u003eI\u0027m not sure about the reasons but the fact is that sometimes not every vote is being applied. To prevent loss of your grades I also added special button to save everything. It can be found on panel with new comments counter (or in that place if there are no new comments).\u003c/p\u003e\u003cp\u003eI will dublicate \u003ca href\u003d\"https://openuserjs.org/scripts/MineGeekYT/CF_Voting_Buffer\"\u003elink to script\u003c/a\u003e, if you miss it in the beginning. It\u0027s a simple userscript that can be run in chrome-based browsers (via tampermonkey plugin), firefox (greasemonkey) and opera of older versions (violentmonkey).\u003c/p\u003e\u003cp\u003eIf you found any bugs or have some suggestions feel free to notify me via pm or in comments.\u003c/p\u003e\u003cp\u003eHappy New Year!\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","comments","userscript"]}}