{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1495873377,"rating":3,"authorHandle":"gustokashin","modificationTimeSeconds":1495885194,"id":52212,"title":"\u003cp\u003eЛетнаяя школа по компьютерным наукам\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eФакультет компьютерных наук ВШЭ и центр “Стратегия” во второй раз проводит \u003ca href\u003d\"https://cs.hse.ru/csss2017\"\u003eлетнюю школу по компьютерным наукам\u003c/a\u003e для учеников 7-10 классов, которая пройдет с 5 по 19 августа 2017 года в Липецке. Стоимость участия — 24000 рублей, для победителей и призёров заключительного этапа Всероссийских олимпиад по информатике и математике — бесплатно.\u003c/p\u003e\u003cp\u003eВ школе 4 параллели: C, B’, B и A-ML. По уровню и тематике параллели, примерно, соответствуют параллелям ЛКШ, однако мы стараемся больше внимания и времени уделять практике. Всего в программе школы 13 дней, каждый день 4 часа практических занятий, 2 часа лекций и возможность дорешать задачи или отдохнуть от программирования и заняться спортом или интеллектуальными играми. В каждой группе кроме преподавателя работает ассистент, так что любые вопросы и проблемы будут разрешаться быстро, прямо во время тура.\u003c/p\u003e\u003cp\u003eПреподавать в школе будут сотрудники и студенты ВШЭ, МФТИ и центра “Стратегия”: например, лекции по машинному обучению прочитает Евгений Соколов, руководитель специализации на ФКН, а занятия по алгоритмам в параллели A-ML будет вести Алексей Данилюк (\u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Um_nik\" title\u003d\"Legendary grandmaster Um_nik\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eU\u003c/span\u003em_nik\u003c/a\u003e). В параллели C вести занятия будет Инесса Шуйкова, тренер команды Липецкой области. Также занятия буду вести я (Михаил Густокашин), а ассистентами будут работать Дмитрий Пыркин (ФИВТ МФТИ) и Андрей Климкин (ФКН ВШЭ), выпускники центра “Стратегия”.\u003c/p\u003e\u003cp\u003eЧтобы поступить в школу нужно сделать два не очень простых шага:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eВыбрать для себя интересную и полезную параллель, изучив программу обучения: \u003ca href\u003d\"https://cs.hse.ru/csss2017/parallel_A_ML\"\u003eA-ML\u003c/a\u003e, \u003ca href\u003d\"https://cs.hse.ru/csss2017/parallel_B\"\u003eB\u003c/a\u003e, \u003ca href\u003d\"https://cs.hse.ru/csss2017/parallel_B_shtrikh\"\u003eB’\u003c/a\u003e, \u003ca href\u003d\"https://cs.hse.ru/csss2017/parallel_C\"\u003eC\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eЗаполнить анкету и решить практическое вступительное задание (дедлайн первой волны зачислений — 1 июня, второй — 7 июня, а третьей уже может и не быть)\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eВсе материалы мы публикуем в открытом доступе. Те, кто по каким-то причинам не смог приехать в школу (например, студенты), также могут использовать их для подготовки. Материалы прошлого года опубликованы здесь: \u003ca\u003ettp://informatics.mccme.ru/course/view.php?id\u003d1552\u003c/a\u003e \u003c/p\u003e\u003cp\u003eТем, кто был в школе в прошлом году, понравилось. Мы надеемся, что понравится и вам!\u003c/p\u003e\u003c/div\u003e","tags":[]}}