{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1496558466,"rating":140,"authorHandle":"Endagorion","modificationTimeSeconds":1496585353,"id":52374,"title":"\u003cp\u003eYandex.Algorithm 2017, third elimination round\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi!\u003c/p\u003e\u003cp\u003eIt is my pleasure to inform you that today, \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dRound%203\u0026amp;iso\u003d20170604T1200\u0026amp;ah\u003d1\u0026amp;am\u003d40\"\u003eon June 4 at 15:00 MSK\u003c/a\u003e the third and final elimination round of the Yandex.Algorithm 2017 championship will take place. I\u0027m equally pleased to tell that the problems of the round were prepared by me, Mikhail Tikhomirov. I worked for Yandex for three years, and had a great time in a friendly and professional team. Cheers to Yandex!\u003c/p\u003e\u003cp\u003eThis round wouldn\u0027t take place if not for the work of these great people:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eLidia \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/lperovskaya\" title\u003d\"Expert lperovskaya\"\u003elperovskaya\u003c/a\u003e Perovskaya and her team who are responsible for the \u003ca href\u003d\"https://contest.yandex.ru/\"\u003eYandex.Contest\u003c/a\u003e system,\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eMaxim \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/Zlobober\" title\u003d\"Legendary grandmaster Zlobober\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003eZ\u003c/span\u003elobober\u003c/a\u003e Akhmedov, previously a vigilant Codeforces coordinator, and currently a vigilant Yandex.Algorithm coordinator,\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eMike \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e Mirzayanov and the Codeforces crew who support the \u003ca href\u003d\"https://polygon.codeforces.com/\"\u003ePolygon\u003c/a\u003e problem preparation system,\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eand finally, all Yandex employees who took part in testing the problems of the round (sadly, the margin of this blog is too narrow to contain all their names).\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThe round will feature the standard scheme: 6 \u003cstrong\u003erandomly shuffled\u003c/strong\u003e problems for 100 minutes with TCM/Time ranking system. The last GP30 points will be distributed judging by the round results, and the final round advancers will be determined at last (find current scoreboard \u003ca href\u003d\"https://contest.yandex.ru/algorithm2017/results/\"\u003ehere\u003c/a\u003e). You still have the chance to advance even if you missed the previous rounds!\u003c/p\u003e\u003cp\u003eAn editorial will be published in a separate blogpost after the round is concluded. We wish good luck to all participants, and hope you enjoy the problems!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e: the start is delayed by 15 minutes for technical reasons. Sorry for the inconvenience!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2\u003c/strong\u003e: the round is finished! Here be \u003ca href\u003d\"//codeforces.com/blog/entry/52376\"\u003eeditorial\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":[]}}