{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1500148802,"rating":1,"authorHandle":"V_2","modificationTimeSeconds":1500148802,"id":53320,"title":"\u003cp\u003eFind the minimum angle at a point P such that the convex hull contained within the angle\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"https://toph.co/p/cover-the-points\"\u003eProblem Link\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDescription\u003c/strong\u003e: A set of points P and a set of target points M in 2D space are given,. For each point M[i] in M, find the minimum angle at M[i] such that all the points P[i] in P are contained within this angle. If the angle is not less than 180 degrees, then you just have to output “TOO WIDE”.\u003c/p\u003e\u003cp\u003eConstraints: 1\u0026lt;\u003d N,Q \u0026lt;\u003d100000 \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMy approach:\u003c/strong\u003e First I find the convex hull and then check if the query point is in the convex hull. If it is in the polygon then the answer will be \u0026quot;TOO WIDE\u0026quot; . If not then I do as follows:\u003c/p\u003e\u003cp\u003eFind the centroid of the polygon and then find the angle of the vector \u0026quot;centroid to Pi\u0026quot; with x axis, where Pi represent points of the convex polygon.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEg.\u003c/strong\u003e if centroid \u003d(0,0) and Pi\u003d(1,1) is one of the points of polygon then the angle of the centroid to Pi vector is 45 degree. If Pi\u003d(-1,-1) then the angle \u003d 225 degree.\u003c/p\u003e\u003cp\u003eThen sort the points with respect to their angle. When I got a query point M then I again calculate the angle of the vector \u0026quot;centroid to query point M\u0026quot;. Now I cut the polygon into two half with the line passes through the centroid and M. Then for each half I do ternary search and finally find the point X and Y as shown in the figure.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/70/36/7036b896ff677adc807b836d0a71f253ba23dc65.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e[In figure , C\u003dcentroid , M\u003dquery point and black lines represent the convex polygon]\u003c/p\u003e\u003cp\u003eThus I find the angle (X,M,Y). But my approach is seemed to be incorrect and I cannot figure out what I do wrong here. Was my approach correct? \u003cstrong\u003eIs there any other approach to solve this problem?\u003c/strong\u003e \u003c/p\u003e\u003cp\u003e-Thanks in advance.\u003c/p\u003e\u003c/div\u003e","tags":["#help","#geometry","convex hull"]}}