{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1471026025,"rating":1,"authorHandle":"Death_Scythe","modificationTimeSeconds":1471026025,"id":46524,"title":"\u003cp\u003eRCC 16, WarmUp Round — Problem D. Teams Creation\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi all!\u003c/p\u003e\u003cp\u003eFollowing is the problem:\u003c/p\u003e\u003cp\u003eDr Emmett Brown has decided to change his job and is now working as a Computer Science teacher in a high school. The Dr Brown\u0027s class has n students. Dr Brown wants to run a programming contest for his students. But his classroom only has k computers, so he needs to run a team contest. Dr thinks that the teamwork would be good for the students if the students in the team all have close levels of their skills. For each student Emmett Brown knows its skill level ai. He has decided to create teams in such way that for any two teams there is a number x such that students in one team have skill level at most x, and in the other team all students have skill level at least x. There must be exactly k teams, each team must have at least one student, but there is no upper limit for the number of students in one team. Help Doctor to find out how many ways are there for him to create the teams. Two ways are different if there are two students that are in the same team in of the them, and in different teams in the other. You should output the number of ways modulo 10^9 + 7.\u003c/p\u003e\u003cp\u003eConstraints: 1\u0026lt;\u003dn, k\u0026lt;\u003d2000 1\u0026lt;\u003dai\u0026lt;\u003dn\u003c/p\u003e\u003cp\u003eSample: n\u003d3, k\u003d2, a\u003d[1,2,3] ans \u003d 2\u003c/p\u003e\u003cp\u003en\u003d7, k\u003d3, a\u003d[2,4,3,4,3,3,2] ans \u003d 53\u003c/p\u003e\u003cp\u003eHere is the editorial for the problem: \u003ca href\u003d\"//codeforces.com/blog/entry/44517\"\u003ehttp://codeforces.com/blog/entry/44517\u003c/a\u003e\u003c/p\u003e\u003cp\u003eCan someone please explain the editorial? I do not understand how the dp relation works and the intuition behind it. \u003c/p\u003e\u003cp\u003eHelp is appreciated. Thanks! \u003c/p\u003e\u003c/div\u003e","tags":["rcc 2016","dp","dynamic programming","combinatorics"]}}