{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1478090508,"rating":32,"authorHandle":"gKseni","modificationTimeSeconds":1478090630,"id":48159,"title":"\u003cp\u003eКнига «Справочник спортивного программиста. Часть 1»\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/4a/d0/4ad0a24147278aa5ac409d6275249194dd2238e1.png\" style\u003d\"margin: 0 1.0em 1.0em 1.0em;float: right;max-width: 100.0%;max-height: 100.0%;\" /\u003e Вы идёте писать олимпиаду и наверняка задаётесь вопросом: какие формулы, алгоритмы и структуры данных надо знать? Как их лучше кодировать? Когда на эти вопросы нет ответа, сложно собраться и приступить к делу, просто потому, что не знаешь, с какой стороны этот приступ начать. В книгах содержится структурированный ответ, а это значительно облегчает жизнь и сохраняет нервы, которые обычно портятся при попытках достать информацию отовсюду. \u003c/p\u003e\u003cp\u003eКнига «Справочник спортивного программиста. Часть 1» представляет из себя набор инструментов для улучшения результатов выступлений на олимпиадах, а это именно то, что развивает мозги / помогает чувствовать себя классным / способствует завоёвыванию девушек / твой ответ того, что олимпиады дают самого классного. В этот набор входят ответы на вопросы: какие формулы, алгоритмы и структуры данных надо знать, и рецепты того, как их кодировать на С++.\u003c/p\u003e\u003cp\u003eСтроение книги делает её полезной для разных людей: школьников, учителей информатики, студентов начальных курсов, педагогов дополнительного образования, просто любителей олимпиадного программирования. Особенно это актуально для школьников, а особенно в контексте участия во ВКОШП, потому что это справочник можно взять с собой.\u003c/p\u003e\u003cp\u003eСамые простые алгоритмы (бинарный поиск или быстрая сортировка) описаны более подробно, чтобы начинающие программисты могли основательно в них разобраться. А для продвинутых алгоритмов и структур данных (персистентное дерево отрезков) приводится лишь основная идея, код и пояснения, потому что опытный программист способен в этом разобраться и ему неинтересно читать десятки страниц текста. Всё, чтобы каждый нашёл для себя что-то полезное и новое.\u003c/p\u003e\u003cp\u003eКнигу написали Демиденко \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Bugman\" title\u003d\"Кандидат в мастера Bugman\"\u003eBugman\u003c/a\u003e Виталий и Кормышов \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/kormyshov\" title\u003d\"Кандидат в мастера kormyshov\"\u003ekormyshov\u003c/a\u003e Михаил. \u003c/p\u003e\u003cp\u003eВиталий – студент 4-го курса Института математики и фундаментальной информатики СФУ. Тренер сборной Красноярского края по информатике по подготовке к заключительному этапу ВсОШ. Преподаватель программирования и олимпиадной информатики в МАОУ «Лицей № 6 Перспектива» г. Красноярска. Четырёхкратный чемпион ES NEERC ACM ICPC, трижды призёр NEERC ACM ICPC. Красный на codeforces в момент написания книги. \u003c/p\u003e\u003cp\u003eМихаил – директор тренинг-центра «Профит» (г. Красноярск), тренер сборной команды Красноярского края по информатике. Неоднократно отмечен благодарственными письмами Министерства образования и науки Красноярского края. Лауреат премии главы города Красноярска в области научно-образовательной деятельности. Его воспитанники неоднократно становились призёрами заключительного этап ВсОШ, ВКОШП и NEERC ACM ICPC.\u003c/p\u003e\u003cp\u003eКнига разделена на большие части: структуры данных, алгоритмы и теория чисел — развёрнутый список тем \u003ca href\u003d\"https://vk.com/doc2050608_438587642?hash\u003df900d1c185819613ff\u0026amp;dl\u003dda8eb6446da869b691\"\u003eлежит здесь\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news"]}}