{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1436992756,"rating":90,"authorHandle":"I_love_Tanya_Romanova","modificationTimeSeconds":1437543826,"id":19236,"title":"\u003cp\u003eCompetitive programming streams\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi everybody :)\u003c/p\u003e\u003cp\u003eThere were several topics about live streams recently (24h event by \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Mimino\" title\u003d\"Гроссмейстер Mimino\"\u003eMimino\u003c/a\u003e at HackerRank, live streams with \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/enot.1.10\" title\u003d\"Гроссмейстер enot.1.10\"\u003eenot.1.10\u003c/a\u003e solving Timus...). I already have an experience of making a screencast, and now I am also going to try live streaming. \u003c/p\u003e\u003cp\u003eStreaming real contests isn\u0027t a good idea :) Also I am not a huge fan of solving OJ; so the question of choosing idea for first stream is still open.\u003c/p\u003e\u003cp\u003eRight now I think that the best idea would be to open SPOJ (I was never really active at this OJ, there are not a lot of problems solved at \u003ca href\u003d\"http://www.spoj.com/users/lebron/\"\u003emy account\u003c/a\u003e there — and I have a lot of easy problems remaining) and start solving some tasks there. But I am open to suggestions and ideas) \u003c/p\u003e\u003cp\u003eI am not aiming at making it very interesting/entertaining \u003cem\u003e(so maybe it will be simply about me listening to music and writing code... so boring...);\u003c/em\u003e also I am not going to do some lecturing or things like that — I am both not good enough for it and not interested in it:) \u003c/p\u003e\u003cp\u003eMaybe it will be a long one (24 hours does not sound like a limit) — or maybe it will be too boring for me and I\u0027ll stop very soon. \u003c/p\u003e\u003cp\u003eI\u0027ll update this post with more details later :) Hope to see some nice ideas in comments.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e Probably I\u0027ll start a session on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dStreaming+event\u0026amp;iso\u003d20150720T06\u0026amp;p1\u003d368\"\u003eMonday morning\u003c/a\u003e, I\u0027ll try solving easy SPOJ problems (and maybe also some tasks which you had suggested) and I\u0027ll use Twitch, as \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/heaton\" title\u003d\"Эксперт heaton\"\u003eheaton\u003c/a\u003e suggested. Need to get familiar with it now :) I\u0027ll post a link and any further updates here.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD. #2\u003c/strong\u003e Here is \u003ca href\u003d\"http://www.twitch.tv/lebron_stream\"\u003eTwitch channel\u003c/a\u003e. I\u0027ll start approximately at \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dStreaming+event\u0026amp;iso\u003d20150720T06\u0026amp;p1\u003d368\"\u003e6 A.M.\u003c/a\u003e on Monday.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD. #3\u003c/strong\u003e Approximate schedule of future streams has been published at Twitch channel. \u003c/p\u003e\u003c/div\u003e","tags":["live stream"]}}