{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1456058830,"rating":63,"authorHandle":"allllekssssa","modificationTimeSeconds":1456058830,"id":43263,"title":"\u003cp\u003eClashing ! Why ???\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, \u003c/p\u003e\u003cp\u003eToday I see two interesting contests — HackerRank 101 Hack and CodeChef Cook-off. Usually I am trying to do both, but now I must decide for one (like all other contestants). We have a lot of conflicts in Coders Calendar, a lot of interesting contests are on the same day and many times like this one they are at the same time! I think that shouldn\u0027t happen, month has 30 days and we have at least two times less important contests of big sites.\u003c/p\u003e\u003cp\u003eFor me, priority should have the following rounds :\u003c/p\u003e\u003cp\u003eCodeforces: Div 1 and Div 2 rounds — we around 6 rounds per month\u003c/p\u003e\u003cp\u003eHackerRank: 101 Hack, HourRank — 2 contests\u003c/p\u003e\u003cp\u003eTopCoder: SRM matches — 3 per month ( I think we don\u0027t have more this rounds, but I don\u0027t participe in it ).\u003c/p\u003e\u003cp\u003eCodechef: Cook-off, Lunchtime — 2 contests\u003c/p\u003e\u003cp\u003eHackerEarth: Easy contest — 1 per month\u003c/p\u003e\u003cp\u003eI didn\u0027t mention longer contests, because clashing isn\u0027t important for them. Everyone has long window for showing its skills.\u003c/p\u003e\u003cp\u003eIn total we have 14 short important rounds per month, and we have around 9 free days (weekends : Saturday and Sunday). And we can not forget Fridays afternoon, many rounds can be held then. So why administrators of this sites don\u0027t make deal about distributions and dates for all this contest one month before ? I think that is possible and distribution can be very good for everyone. For example :\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003e3 weekend CF rounds\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e2 HR weekend rounds\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e2 Topcoder weekend round\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e1 Codechef weekend round\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e1 HackerEarth weekend round\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eMaybe another solution is organizing more contests at the weekends but starting time for some rounds can be good for Eastern countries ( like HourRank 3 or many TC contests).\u003c/p\u003e\u003cp\u003eI would like to hear your opinion about this idea, whether it is possible and acceptably for you?\u003c/p\u003e\u003cp\u003eEspecially I glad to hear opinion of administrators of this sites, I talked with many of them before, but we didn\u0027t disscuss about this topic.\u003c/p\u003e\u003cp\u003eRegards.\u003c/p\u003e\u003c/div\u003e","tags":["clashing","why","#codeforces","hackerrank"]}}