{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1404818165,"rating":0,"authorHandle":"naved","modificationTimeSeconds":1404818311,"id":12975,"title":"\u003cp\u003eCan anyone here explain me different ways to solve this problem ?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eMultiple “intervals” are to be given as tasks. Calculate the maximum work time (minutes) to assign to one worker\u003c/p\u003e\u003cp\u003eImplement the method “int Problem2#getMaxWorkingTime(List intervals)”.\u003c/p\u003e \u003cul\u003e   \u003cli\u003eReturn the maximum time to work on a task when one worker takes it.\u003c/li\u003e   \u003cli\u003eTime assignment unit shall be based on tasks. (i.e. Task assignment shall be either to complete the whole task, or to do nothing for it.)\u003c/li\u003e   \u003cli\u003eThe length of the interval, time required to complete the task, is calculated by subtracting \u0026quot;end time\u0026quot; from \u0026quot;start time\u0026quot;. (e.g. If [12:00, 13:00] is given, the length of the task is 60 min.)\u003c/li\u003e   \u003cli\u003eReturn 0 if the argument is null or an empty list.\u003c/li\u003e   \u003cli\u003eThe argument (a list of “intervals”) must not contain null.\u003c/li\u003e   \u003cli\u003eThe number of “intervals” must not exceed 10,000\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e In Figure 3 , work time is maximized when three tasks [“06:00”, “08:30”], [“09:00”, “11:30”], and [“12:30”, “14:00”], are assigned. Therefore, the answer is 390 (minutes).\u003c/p\u003e\u003cp\u003eFigure 3: An example of input and answer\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e6     7     8     9     10      11      12       13       14\n----------------  ---------------            ---------------\n            -------         --------------------------------\n                  -------------------\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eTo me it appears to as a problem whose answer I can find simply by subtracting the Interval with max end-time i.e 14:00 with Interval which has smallest start-time, say 14:00 minus 06:00 answer is 480 minutes (since 6 to 14 has 8 hours in it so 8*60 minutes \u003d 480 minutes) but the correct answer is 390 minutes Can any one please help me explaining how to solve this problem...?\u003c/p\u003e\u003c/div\u003e","tags":["interview","problem solving","math"]}}