{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1479073622,"rating":66,"authorHandle":"misis","modificationTimeSeconds":1479295811,"id":48378,"title":"\u003cp\u003eОткрытая олимпиада по программированию НИТУ «МИСИС», МФТИ и COGNITIVE TECHNOLOGIES 2017\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003e27 ноября 2016 в 12:00\u003c/strong\u003e состоится заочный тур Открытой олимпиады по программированию Национального Исследовательского Технологического Университета «МИСиС», МФТИ и Cognitive Technologies. В этом году олимпиада впервые вошла во всероссийский перечень олимпиад школьников и является олимпиадой второго уровня. Призеры и победители данной олимпиады получают возможность поступить без экзаменов в НИТУ «МИСиС», а также в ряд других ВУЗов. Олимпиада проводится совместно с МФТИ.\u003c/p\u003e\u003cp\u003eЗаочный тур олимпиады будет оцениваться по правилам ACM ICPC. Все участники пишут индивидуально. Длительность тура 5 часов. К участию приглашаются \u003cstrong\u003eшкольники 7-11 классов\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eЛучшие участники будут приглашены в Москву на очный тур олимпиады, который состоится \u003cstrong\u003e15 января 2017 года\u003c/strong\u003e. Очный тур будет проводиться на 2 двух площадках: НИТУ «МИСиС» и МФТИ. Организаторы берут на себя расходы, связанные с проживанием иногородних участников (общежития при университетах). Победителям очного тура будут вручены ценные призы.\u003c/p\u003e\u003cp\u003eДля участия в олимпиаде необходимо пройти \u003cstrong\u003eрегистрацию\u003c/strong\u003e на \u003ca href\u003d\"https://goo.gl/HZiu3D\"\u003ehttps://goo.gl/HZiu3D\u003c/a\u003e \u003cstrong\u003eдо 24 ноября 2016\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eВ этом году заочный тур Открытой олимпиады по программированию НИТУ«МИСиС», МФТИ и Cognitive Technologies \u003cstrong\u003eявляется и одним из отборочных туров\u003c/strong\u003e на \u003cstrong\u003eЗимнюю компьютерную школу МФТИ\u003c/strong\u003e (\u003ca\u003ehttp://it-edu.mipt.ru/ru/zksh2017)\u003c/a\u003e, которая пройдет с 27 февраля по 8 марта 2017 года.\u003c/p\u003e\u003cp\u003eДля того, чтобы ваши результаты были зачтены как результаты второго отборочного тура в ЗКШ, вам необходимо:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eпройти регистрацию на ЗКШ (\u003ca href\u003d\"https://goo.gl/hIG7b1\"\u003ehttps://goo.gl/hIG7b1\u003c/a\u003e)\u003c/li\u003e   \u003cli\u003eв одной из задач контеста (там, где вас явно попросят это сделать) указать электронную почту, которую вы использовали при регистрации на ЗКШ.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eОфициальная страница олимпиады \u003ca href\u003d\"http://acm.misis.ru/olymp2017\"\u003ehttp://acm.misis.ru/olymp2017\u003c/a\u003e\u003c/p\u003e\u003cp\u003eПосмотреть задачи прошлого года можно здесь: \u003ca href\u003d\"//codeforces.com/gym/100957\"\u003ehttp://codeforces.com/gym/100957\u003c/a\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/28/f3/28f3643ab422b92746aca0630ecd9a35d8f09a3e.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}