{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1506931090,"rating":-13,"authorHandle":"ashyk_yigit","modificationTimeSeconds":1506931090,"id":54894,"title":"\u003cp\u003eHorse riding\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi codeforces. Please help me. How to solve this problem \u003ca href\u003d\"http://acmp.ru/asp/do/index.asp?main\u003dtask\u0026amp;id_course\u003d2\u0026amp;id_section\u003d21\u0026amp;id_topic\u003d50\u0026amp;id_problem\u003d648\"\u003eacmp.ru\u003c/a\u003e \u003cbr /\u003e\u003c/p\u003e \u003ch1\u003eHorse riding \u003c/h1\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eIt is required to make a round of a rectangular field, moving in it according to the rules of a chess horse. In the labyrinth there are cells that can not be moved. The initial position of the horse is determined. It is necessary to visit all cells (in which the transition is possible) without repeated calls. It is guaranteed that such a bypass exists.\u003c/p\u003e\u003ch2\u003eInput\u003c/h2\u003e \u003cbr /\u003e\u003cp\u003eThe first line of the input file INPUT.TXT contains two natural numbers N and M — the field sizes (N, M ≤ 100). Next, the map of the field follows: N lines of M characters in each line. The symbol \u0026quot;.\u0026quot; (Dot) denotes an empty space. The symbol \u0026quot;X\u0026quot; indicates that movement to this cell is prohibited. The initial position of the knight is given by the unique \u0026quot;K\u0026quot; in the field. \u003cbr /\u003e\u003c/p\u003e\u003ch2\u003eOutput\u003c/h2\u003e \u003cbr /\u003e\u003cp\u003eIn the output file OUTPUT.TXT output the bypass matrix of the field, in each cell of which the step number of its visit must be entered (starting with one). Cells labeled \u0026quot;X\u0026quot; in the input data should be labeled with a zero value when outputting. Numbers should be separated by spaces, it is allowed to use extra spaces. In the case of an ambiguous solution, you should deduce any.\u003c/p\u003e\u003c/div\u003e","tags":[]}}