{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1415155763,"rating":1,"authorHandle":"avi28","modificationTimeSeconds":1415155763,"id":14590,"title":"\u003cp\u003ehacker\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThe concept of hacking entered the computer culture at the Massachusetts Institute of Technology in the 1960s. Popular opinion at MIT posited that there are two kinds of students, tools and hackers. A \u003ccode\u003etool\u0027\u0027 is someone who attends class regularly, is always to be found in the library when no class is meeting, and gets straight As. A\u003c/code\u003ehacker\u0027\u0027 is the opposite: someone who never goes to class, who in fact sleeps all day, and who spends the night pursuing recreational activities rather than studying. There was thought to be no middle ground.\u003c/p\u003e\u003cp\u003eWhat does this have to do with computers? Originally, nothing. But there are standards for success as a hacker, just as grades form a standard for success as a tool. The true hacker can\u0027t just sit around all night; he must pursue some hobby with dedication and flair. It can be telephones, or railroads (model, real, or both), or science fiction fandom, or ham radio, or broadcast radio. It can be more than one of these. Or it can be computers. [In 1986, the word ``hacker\u0027\u0027 is generally used among MIT students to refer not to computer hackers but to building hackers, people who explore roofs and tunnels where they\u0027re not supposed to be.]\u003c/p\u003e\u003cp\u003eA ``computer hacker,\u0027\u0027 then, is someone who lives and breathes computers, who knows all about computers, who can get a computer to do anything. Equally important, though, is the hacker\u0027s attitude. Computer programming must be a hobby, something done for fun, not out of a sense of duty or for the money. (It\u0027s okay to make money, but that can\u0027t be the reason for hacking.)\u003c/p\u003e\u003c/div\u003e","tags":[]}}