{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1484335663,"rating":128,"authorHandle":"angel_of_death","modificationTimeSeconds":1517645348,"id":49748,"title":"\u003cp\u003eGoogle Chrome extension for automatic sample case testing on Codeforces\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello all, I\u0027d like to share with you a google chrome extension called \u003ca href\u003d\"https://chrome.google.com/webstore/detail/sample-case-tester/dmjempfpjamhmpjmhgadajdogngacegg\"\u003eSample Case Tester\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eLike the name says, it helps you in easily testing your code against the given sample cases for any problem, both in a contest and in practice. It adds an editor to the problem page where you need to just paste your code and run it to see if your code passes the given sample cases for that problem or not.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"https://lh3.googleusercontent.com/kyAfIxNe3pr8rlvovmv8-H31CxH-ifVoDT5_LzDXtzQSgaP5bCkptgBbp2dH-9Job3wICFS-Bw\u003ds640-h400-e365-rw\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eIf your program is giving wrong output for one or more of the sample cases, it\u0027ll show you that case along with your program\u0027s output and also the expected output. If there are any compilation or runtime errors, it\u0027ll show those as well. And ofcourse, if your program gives the right output for all the cases, it\u0027ll tell you that your code passed!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"https://lh3.googleusercontent.com/ilB93VfeFCwEPOJmNPVisrKXRGJPpCiU9mDgtvbFh1MO0GQEAudJyspRO8PYoS56hxqpUsjy\u003ds640-h400-e365-rw\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eIt can be very helpful to save time during contests and also when a problem has multiple sample cases and/or very long inputs and outputs.\u003c/p\u003e\u003cp\u003eCurrently it supports C, C++, Java, Python, Ruby and Perl. This is the very first version of the extension which I released just yesterday. More languages will be added soon along with a lot more useful functionality in the upcoming versions and the extension will update itself whenever a new version is released.\u003c/p\u003e\u003cp\u003eAnother thing I want to mention is that the extension currently does not check your program for TLE. This is one of the things in my to-do list for the coming future. There\u0027s a fixed amount of common execution time limit however which I\u0027ve set in case the code has things like infinite loops.\u003c/p\u003e\u003cp\u003eI\u0027m aware of other tools like hightail but this is just my own addition to the community which is extremely convenient to install and use in a way that you don\u0027t even need to switch tabs or switch to a different program and everything you need will be right there on the problem page in the browser itself.\u003c/p\u003e\u003cp\u003eSo do check it out, rate it on the webstore and let me know if you guys find any bugs. And if you like it, please consider sharing it with your friends. Thank you! \u003ca href\u003d\"https://chrome.google.com/webstore/detail/sample-case-tester/dmjempfpjamhmpjmhgadajdogngacegg\"\u003eLINK HERE\u003c/a\u003e\u003c/p\u003e\u003cp\u003eEDIT: For problems which have multiple correct outputs, it\u0027ll say your code failed unless it gets the same output as the sample one. So watch out for that.\u003c/p\u003e\u003cp\u003eUPDATE: I\u0027ve chosen to DISCONTINUE this extension. It will be unpublished from the chrome store so no new users can install it \u0026amp; will no longer work for existing users either. The reason I chose to do this is because I had built this extension purely out of passion \u0026amp; I\u0027d been spending 20$/month out of my own pocket for the past year to keep the extension running. I was not making any money from the extension \u0026amp; neither did I intend to. My only goal was to make something that\u0027d be helpful to people. When my remote compiler gets overloaded especially during a contest when there are multiple submissions, it\u0027s natural that the compiler takes too long to execute your code \u0026amp; might fail with various errors. I was expecting people to understand this \u0026amp; be forgiving which they clearly were not. Also, not only were the users not thankful for something I\u0027d been providing for free at the expense of my own money, some of them were downvoting my replies here when I try to explain my situation, leaving bad reviews \u0026amp; ratings on the chrome store \u0026amp; demanding that the extension should always work for them 24/7 as if they\u0027d paid me for this service. Considering all the above points I\u0027m no longer going to support this extension.\u003c/p\u003e\u003c/div\u003e","tags":["tester"]}}