{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1487011006,"rating":27,"authorHandle":"rogerioagjr","modificationTimeSeconds":1487039705,"id":50413,"title":"\u003cp\u003eUpsolving JOI 2017 (Japanese Olympiad in Informatics)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI\u0027ve participated in JOI 2017 and I\u0027m trying to find the solutions in English. Why don\u0027t we create a tutorial with brief explainings of the solutions? I\u0027ll contribute by posting the two problems I have solved during the contest, but I\u0027ll update when people comment solutions.\u003c/p\u003e\u003cp\u003eIf someone speaks Japanese, the \u003ca href\u003d\"http://www.ioi-jp.org/joi/2016/2017-ho/index.html\"\u003eofficial JOI website\u003c/a\u003e has posted solutions, but they\u0027re only available in Japanese, so you could translate a brief explanation to us :)\u003c/p\u003e\u003cp\u003eLinks for problem statements (English) are available below. Could you help \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/rng_58\" title\u003d\"Legendary grandmaster rng_58\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003er\u003c/span\u003eng_58\u003c/a\u003e?\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.dropbox.com/s/36aemreva7wnfpu/foehn_phenomena%20%28en%29.pdf?dl\u003d0\"\u003eProblem 1\u003c/a\u003e\u003c/p\u003e\u003cp\u003eKeep an array of differences between consecutive heights, so that delta[i]\u003dA[i]-A[i-1]. Keep the sum of the values of positive differences in a variable pos, and the sum of the absolute values of negative differences in a variable neg. Each time you update a range (l,r), adding X to it, you just need to update differences l and r+1. To update difference i, you reduce its absolute value from pos or neg, depending on its signal, add X to it and adds its absolute value to pos or neg. After each query, the answer will be neg*T-pos*S. Don\u0027t forget to use long long.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://gist.github.com/rogerioagjr/e7a6ed6d99625efc26eb892a89fecaf5\"\u003eCode for Problem 1\u003c/a\u003e\u003c/p\u003e \u003chr /\u003e\u003cp\u003e\u003ca href\u003d\"https://www.dropbox.com/s/8odotxwuum23j37/semiexpress%20%28en%29.pdf?dl\u003d0\"\u003eProblem 2\u003c/a\u003e\u003c/p\u003e\u003cp\u003eYou have to create K-M stops for the semiexpress line (besides the M fixed ones). For each range between two consecutive express stops, analyze the advantage of creating a semiexpress stop on each station of the range. You can easily calculate what are the stations in that range that one can achieve within time T using only the express and local trains. Call the last station of this range i. Check how many new stations one could achieve if the semiexpress train stopped at station i+1. Call it Q. Then, keep this value on a heap. After it, check the new number of stations you could achieve if, after it, you created a new stop at station i+1+Q and add to the heap again. Update the values of i and Q and repeat it at most K-M times (because it\u0027s the number of stops you can create), or until the value of i exceed the limits of the range you\u0027re analyzing.\u003c/p\u003e\u003cp\u003eAfter this, your answer will be all the stations one can reach with express and local trains plus the K-M greatest values of the heap.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://gist.github.com/rogerioagjr/6d512d719f57c05f2d4c6d251f82a41e\"\u003eCode for problem 2\u003c/a\u003e\u003c/p\u003e \u003chr /\u003e\u003cp\u003e\u003ca href\u003d\"https://www.dropbox.com/s/alq1xom6wujtqdg/joioi%20%28en%29.pdf?dl\u003d0\"\u003eProblem 3\u003c/a\u003e — solution posted by \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/kokosha\" title\u003d\"Expert kokosha\"\u003ekokosha\u003c/a\u003e\u003c/p\u003e\u003cp\u003eObservation 1 — Let\u0027s take a look at the point with the minimal value(X) and maximal value(Y). If these two values are inside the territory of JOI or IOI, we are done. So these two values are in different territories.\u003c/p\u003e\u003cp\u003eNow we have two territories, one with minimal value and the other with maximal value.\u003c/p\u003e\u003cp\u003eWe can start the territory of minimal value in one of the four corners of the rectangle, or we can simply rotate the rectangle by 90 degrees. Let make the start point the left-top corner\u003c/p\u003e\u003cp\u003eFact 1 — Suppose the value of answer is K, then the numbers in minimal value territory are less than X+K, and the numbers in the maximal value territory are bigger than Y-K.\u003c/p\u003e\u003cp\u003eUsing this we can use binary search on the answer, using the following greedy algorithm.\u003c/p\u003e\u003cp\u003eFix a column position, the rightest one, this will help us to generate the maximal value territory.\u003c/p\u003e\u003cp\u003eNow we will generate the minimal value territory.\u003c/p\u003e\u003cp\u003eFor each row from top to bottom, find the leftiest position that satisfy less than X+K.\u003c/p\u003e\u003cp\u003eIf the leftiest position is before to the column position, set the column position to the leftiest position and verify the maximal value territory from new column position to old column position and the rows below.\u003c/p\u003e\u003cp\u003eIf the leftiest position is after or equal to the column position, set the leftiest position to the column position.\u003c/p\u003e\u003cp\u003eCredits to tozangezan — \u003ca href\u003d\"http://www.ioi-jp.org/joi/2016/2017-ho/2017-ho-t3-review.pdf\"\u003ehttp://www.ioi-jp.org/joi/2016/2017-ho/2017-ho-t3-review.pdf\u003c/a\u003e\u003c/p\u003e \u003chr /\u003e\u003cp\u003e\u003ca href\u003d\"https://www.dropbox.com/s/bgqsrvf5v016hqf/soccer%20%28en%29.pdf?dl\u003d0\"\u003eProblem 4\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWaiting for comments\u003c/p\u003e \u003chr /\u003e\u003cp\u003e\u003ca href\u003d\"https://www.dropbox.com/s/ovy0br03qehog1h/rope%20%28en%29.pdf?dl\u003d0\"\u003eProblem 5\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWaiting for comments\u003c/p\u003e\u003c/div\u003e","tags":["joi","joi2017","japan","ioi"]}}