{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1517238098,"rating":34,"authorHandle":"sam721","modificationTimeSeconds":1517238098,"id":57411,"title":"\u003cp\u003eHelp Venezuelan team to compete at the ACM ICPC World Finals 2018\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi Codeforces community!\u003c/p\u003e\u003cp\u003eI write on behalf of the team \u0026quot;Super Pollos\u0026quot;, a Venezuelan team who made it to the third place at the ACM ICPC Latin American Regional Contest — South America North region. With this place, the team earned its first qualification to the ACM ICPC World Finals! Which most of us know will be held at the city of Beijing!\u003c/p\u003e\u003cp\u003eRecently we are facing a very stressful situation. We are really short of money and time, and as the date of the competition gets closer, the tickets cost gets higher and higher!\u003c/p\u003e\u003cp\u003eWe don\u0027t have an American Visa, so our trip cannot make stops at the USA, and this make the air tickets even more expensive!\u003c/p\u003e\u003cp\u003eWe need at least three tickets to Beijing, one for each contestant obviously! But we wish to have 4 tickets, in order to make this trip possible for our coach too!\u003c/p\u003e\u003cp\u003eWe have been looking for air tickets prices, and a Caracas-Beijing (Round trip) ticket that doesn\u0027t make any stop at the USA (or a country which requires a visa for transit) has an average price of $3000. In order to make this trip, our cost estimate is $10000-$12000, taking into consideration that, obviously, we are not able to buy the tickets right now (as of January 29th), and the costs increase as the day pass.\u003c/p\u003e\u003cp\u003eFor that matter, we created a crowdfunding, which as of January 29th, has a funding of $1170. \u003c/p\u003e\u003cp\u003e\u003cb\u003eNOTE\u003c/b\u003e \u003c/p\u003e\u003cp\u003eThe funding goal is $20000, which is an over-estimation. The funding states that we need five tickets for the Venezuelan delegation, but in the worst case we \u003cb\u003eNEED\u003c/b\u003e three tickets to participate at the competition.\u003c/p\u003e\u003cp\u003eHere is the \u003ca href\u003d\"https://www.generosity.com/education-fundraising/support-venezuela-team-to-compete-in-icpc-china\"\u003ecrowdfunding link\u003c/a\u003e\u003c/p\u003e\u003cp\u003ePlease if you want to contribute with our cause, you can donate through that link, and you can share it in your social networks too. That would help us a lot!\u003c/p\u003e\u003cp\u003eThank you very much. If we fund more money than needed to the trip, we will use that money to contribute with the improvement of the competitive programming in our country (Venezuela), doing training camps, teaching about CP in order to prepare for IOI and ACM, etc!\u003c/p\u003e\u003c/div\u003e","tags":["venezuela","acm icpc 2018","beijing, china","acm icpc world finals"]}}