{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1492635291,"rating":177,"authorHandle":"shestimerk","modificationTimeSeconds":1492637668,"id":51631,"title":"\u003cp\u003eАнонс Tinkoff Challenge\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003eПро Tinkoff.ru\u003c/h1\u003e\u003cp\u003eМы самый технологичный IT-банк России, работаем онлайн, без отделений. Больше всего похожи на IT-компанию: молодые сотрудники, молодой менеджмент, отсутствие дресс-кода на большинстве позиций, минимум бюрократии, классный офис, высокая зарплата за ум и талант. Мы делаем финансовые продукты, которые упрощают жизнь миллионам людей.\u003c/p\u003e\u003cp\u003eМы заботимся о клиентах и сотрудниках. Недавно переехали в новый офис с огромным спортзалом. В офисе есть несколько переговорных зон для проведения встреч, кухни. В офисе работает сервис по доставке здоровой еды, основанный одним из сотрудников. Работники могут заказать себе обед с вечера, а утром он окажется в холодильнике в офисе. В планах руководства — в ближайшие несколько месяцев открыть в офисе столовую.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/31/d3/31d34da09ee22982cf09610dabe5b5bba7c50a36.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eМы знаем ценность аналитического ума и помогаем талантливым ребятам развиваться дальше. У нас есть своя бесплатная школа для разработчиков, где мы делимся своими знаниями и опытом в области frontend, мобильной разработки и Scala \u003ca href\u003d\"http://fintech.tinkoff.ru/\"\u003efintech.tinkoff.ru\u003c/a\u003e. \u003cbr /\u003e\u003c/p\u003e\u003ch1\u003eПро технологии\u003c/h1\u003e\u003cp\u003eИспользуем Angular 2 и 4, React для фронтенда, Java, Scala, C#, Python для бэкенда и внутренней разработки. Есть несколько команд, занимающихся машинным обучением (антифрод, биометрия, диалоговые системы и др). \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/47/98/4798f6f226a00d03ed75445f479c92ab128bdc24.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch1\u003e￼Про людей\u003c/h1\u003e\u003cp\u003eУ нас отличный коллектив: в аналитиках, IT и топ-менеджменте все крайне адекватно и дружественно (МГУ, МФТИ). Штаб-квартира находится в Москве (метро Водный стадион). Стремительно растем и открываем центры разработки по всей России, уже есть в Санкт-Петербурге, Нижнем Новгороде, Новосибирске. В мае появятся Екатеринбург и Иннополис. \u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/d3/f3/d3f3832f3d68f8a58a027c16a7d5c216a9451f15.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eУ нас работают ребята, побывавшие в ЛКШ, участвовавшие в раундах на Codeforces. Я попросила их рассказать впечатления о работе. \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/aval_vm\" title\u003d\"Expert aval_vm\"\u003eaval_vm\u003c/a\u003e — Владимир Мазлов, закончил ФИВТ МФТИ, разработчик чат-ботов, например @TinkoffMathBot в Telegram:\u003cbr /\u003e «Что сразу стало очевидно в Тинькофф и за что я это место ценю (а оно у меня четвертое): свобода. Никто не держит за ручку, вычитывая правки построчно, никто не придумывает за тебя, как именно должна решаться задача. Обратной стороной медали, естественно, является ответственность, неизбежно вытекающая из свободы действий: я сам должен сделать так, чтобы код был расширяемым и отказоустойчивым; все архитектурные и технологические я должен принимать полностью сам; часто я же сам должен помочь понять, как именно будет выглядеть конечный результат. По мне так оно только интереснее, ибо писать одно и то же по спущенным сверху лекалам скучно; на второй работе от этого волком выть хотелось. Ну, да, иногда, если не рассчитать, бывают рабочие дни часов по 14, ну так я физтех, мне не привыкать) А тут вообще повезло, работа весьма благодарная: автоматизировать при помощи ботов процессы, которые портят людям жизнь. Так что я доволен.»\u003c/li\u003e   \u003cli\u003e\u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/mrshocoladka\" title\u003d\"Expert mrshocoladka\"\u003emrshocoladka\u003c/a\u003e — Карен Манукян, 4 курс ФИВТ МФТИ, разработчик-исследователь:\u003cbr /\u003e «Я занимаюсь в банке диалоговыми системами. Наша работа отличается свободой и нелинейностью. В Тинькоффе любят активность и инициативу, дают простор для мысли и возможности для реализации ваших идей. Тут всегда готовы прислушаться к правильным мыслям. Тинькофф — отличное место для самореализации и всесторонней прокачки своих скиллов. ​Важно, что банк сейчас находится на этапе активного роста, появляется много новых и интересных проектов. Поэтому присоединяйтесь и растите вместе с нашей дружной компанией.»\u003c/li\u003e   \u003cli\u003e\u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/makrusak\" title\u003d\"Candidate Master makrusak\"\u003emakrusak\u003c/a\u003e — Максим Русак, 4 курс ФИВТ МФТИ, разработчик-исследователь:\u003cbr /\u003e «Tinkoff.ru современная технологическая компания, работа тут не похожа на стереотипы о банках. Тут открыты идеям и предложениям, активно используют новые технологии. Нам, студентам, дают возможность работать с гибким графиком и мы комфортно совмещаем работу с учёбой.»\u003c/li\u003e   \u003cli\u003e\u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Who179\" title\u003d\"Expert Who179\"\u003eWho179\u003c/a\u003e — Максим Гришкин, 3 курс ФИВТ МФТИ, фул-стек разработчик \u003ca href\u003d\"http://fintech.tinkoff.ru\"\u003efintech.tinkoff.ru\u003c/a\u003e:\u003cbr /\u003e «Мне норм.»\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eХороший программист может выбрать любую область работы: поисковые системы, социальные сети, создание сайтов. Мы предлагаем взглянуть шире. Мы создали новую область применения знаний накопленных гигантами IT-сферы. Приходите к нам, с нами здорово!\u003c/p\u003e\u003ch1\u003eПро раунд\u003c/h1\u003e\u003cp\u003eЧемпионат пройдет в два раунда. Формат соревнования — по правилам Codeforces. Оба раунда будут рейтинговыми и общими для обоих дивизионов.\u003c/p\u003e\u003cp\u003eОтборочный раунд начнется в воскресенье 23 апреля 2017, в 19:35 по московскому времени. Финальный раунд состоится 13 мая на площадке офиса Tinkoff.ru, время будет уточнено дополнительно. Стоимости задач отборочного раунда будут объявлены ближе к началу раунда.\u003c/p\u003e\u003cp\u003eНа отборочном раунде за первые 30 мест подарим теплые жилетки и мелочи, в духе наклеек и блокнотов. Первые 100 мест приглашаются на экскурсию в московский офис с панорамным видом на Москву. \u003c/p\u003e\u003cp\u003eВ финальный раунд в наш офис приглашаем 20 лучших участников отборочного раунда из числа тех, кто сможет приехать.\u003c/p\u003e\u003c/div\u003e","tags":[]}}