{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1515440629,"rating":191,"authorHandle":"adamant","modificationTimeSeconds":1515451878,"id":56994,"title":"\u003cp\u003eOn convex hull trick and e-maxx-eng\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi everyone!\u003c/p\u003e\u003cp\u003ePerhaps you heard about github \u003ca href\u003d\"https://github.com/e-maxx-eng/e-maxx-eng\"\u003eproject\u003c/a\u003e on translating \u003ca href\u003d\"http://e-maxx.ru\"\u003ee-maxx\u003c/a\u003e. The thing is that project is actually more than just translating it. You see, there are bunch of algorithms and approaches which either \u003ca href\u003d\"//codeforces.com/blog/entry/8219\"\u003edo not have proper elaborations\u003c/a\u003e or have but they\u0027re written in some weird uncommon languages like, you know, \u003ca href\u003d\"https://neerc.ifmo.ru/wiki/index.php?title\u003dЗаглавная_страница\"\u003erussian\u003c/a\u003e or \u003ca href\u003d\"http://www.shuizilong.com/house/archives/hdu-5306-gorgeous-sequence/\"\u003echinese\u003c/a\u003e. And there are some \u003ca href\u003d\"//codeforces.com\"\u003esites\u003c/a\u003e which just don\u0027t fit for this purpose for some reasons. \u003c/p\u003e\u003cp\u003eYears ago when I started doing competitive programming e-maxx.ru was the main resource to learn things. Things changed a bit now. E-maxx is Russian only and it wasn\u0027t updated for years. And now I hope that e-maxx-eng will manage to fill this gap of common resource for everyone to learn new things and keep updated on recent competitive programming tricks and new algorithms. \u003c/p\u003e\u003cp\u003eSo I encourage everyone to collaborate in making e-maxx-eng comprehensive guide into competitive programming, and not only on hacktoberfests :). And to begin with I would like to share with you my \u003ca href\u003d\"https://e-maxx-eng.appspot.com/geometry/convex_hull_trick.html\"\u003earticle\u003c/a\u003e on convex hull trick and Li Chao tree I wrote for this resource. Enjoy!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eIf you were too lazy to read it thoroughly:\u003c/strong\u003e There is a link to CHT and Li Chao tree article just above this sentence!\u003c/p\u003e\u003c/div\u003e","tags":["convex hull","e-maxx"]}}