{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1410915865,"rating":9,"authorHandle":"MDantas","modificationTimeSeconds":1410915865,"id":13821,"title":"\u003cp\u003eHard Game Theory Problem\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eRecently (not so recently) I was the problem setter of one SRM. When I was developing the problems I had the idea of creating the following problem:\u003c/p\u003e\u003cp\u003eGiven N points on a cartesian plane, two players plays the following game in alternate rounds:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eThe player of each round must choose two points and draw a segment of line between them as long as this segment of line doesn\u0027t intersect with any segment created before.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eThe player who can not draw a segment of line anymore loses the game.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eGiven that both players plays optimally, who is the winner?\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eThis problem is almost the same as the Div2Hard from SRM624 ( \u003ca href\u003d\"http://community.topcoder.com/stat?c\u003dproblem_statement\u0026amp;pm\u003d13204\u0026amp;rd\u003d15857\"\u003ehttp://community.topcoder.com/stat?c\u003dproblem_statement\u0026amp;pm\u003d13204\u0026amp;rd\u003d15857\u003c/a\u003e ), but now we don\u0027t have the restriction that the points must be part of a convex polygon. I\u0027ve asked lots of amazing coders (including target coders) but no one found a solution yet or proved that this problem is unsolvable in polynomial time.\u003c/p\u003e\u003cp\u003eThe best solution I could come up with is the most naive one (O(2^N)). My question here is if it\u0027s possible to solve this problem with a better solution or even prove that it\u0027s indeed unsolvable.\u003c/p\u003e\u003c/div\u003e","tags":["hard","gametheory","topcoder"]}}