{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1513578473,"rating":242,"authorHandle":"tmwilliamlin168","modificationTimeSeconds":1513587608,"id":56439,"title":"\u003cp\u003eStrange Situation about IOI eligibility\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello,\u003c/p\u003e\u003cp\u003eI have dual citizenship (Taiwan and USA), and I currently study in an American high school located in Taiwan. I\u0027ve already participated in the regional contest about 7 weeks ago and did pretty well, so I qualified for the national contest.\u003c/p\u003e\u003cp\u003eSo now I\u0027m practicing as much as I can for the national contest, but recently I was told that I could qualify for the training camp but not the national team for Taiwan.\u003c/p\u003e\u003cp\u003eI searched online for IOI rules and found this link on the IOI-2017 site: \u003ca href\u003d\"http://www.ioinformatics.org/rules/reg17.pdf\"\u003ehttp://www.ioinformatics.org/rules/reg17.pdf\u003c/a\u003e. Here are some parts of it that stood out:\u003c/p\u003e\u003cp\u003e\u0026quot;A Contestant is a student who was enrolled in a school at a level not higher than secondary education, in the Country they are representing, for the majority of the period 1 September to 31 December in the year before IOI’n. Students who are studying abroad may represent the Country of their nationality.\u0026quot;\u003c/p\u003e\u003cp\u003eNot only am I studying in Taiwan, I also have Taiwan citizenship, so I definitely fit this criterion.\u003c/p\u003e\u003cp\u003e\u0026quot;The main objectives to be accomplished by the IOI are: \u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eTo discover, encourage, bring together, challenge, and give recognition to young people who are exceptionally talented in the field of informatics;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eTo foster friendly international relationships among computer scientists and informatics educators;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eTo bring the discipline of informatics to the attention of young people;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eTo promote the organisation of informatics competitions for students at schools for secondary education;\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eTo encourage countries to organise a future IOI in their country.\u0026quot;\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eLater, I asked for clarification about why I was ineligible, which doesn\u0027t support the objectives shown above:\u003c/p\u003e\u003cp\u003e\u0026quot;The national teams are supposed to show that Taiwanese education is superior to other education systems. If a student from a foreign school represents Taiwan in an international olympiad, then it defeats the purpose. Thus, you are ineligible to represent Taiwan in international olympiads.\u0026quot;\u003c/p\u003e \u003col\u003e   \u003cli\u003eOther countries, like USA, don\u0027t care about things like the statement above.\u003c/li\u003e   \u003cli\u003eThe statement above only applies if the contestants perform well. Else, they should invite someone \u0026quot;with a different education system\u0026quot; (I don\u0027t know why it matters) to take the blame for not performing well.\u003c/li\u003e   \u003cli\u003eWhich person at IOI would notice which school I came from?\u003c/li\u003e   \u003cli\u003eWhich person at IOI who even noticed which school I came from would bother to know that my school provides American education?\u003c/li\u003e   \u003cli\u003eWhich person at IOI who even noticed which school I came from and that my school provides American education would change their views about Taiwan?\u003c/li\u003e   \u003cli\u003eWhy can\u0027t they credit my results (IF they are even good) to the training that I received in the training camp in Taiwan?\u003c/li\u003e   \u003cli\u003eOf course \u0026quot;Taiwanese education\u0026quot; and \u0026quot;American education\u0026quot; prepares all students for international olympiads (for example for informatics, by teaching topics like Dynamic Programming Optimizations or Heavy-Light Decomposition in school), and it\u0027s not the contestants\u0027 own hard work. Thus, the results for each country accurately reflects how successful the education system in that country is.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eI don\u0027t really have that much experience or knowledge in everything mentioned above. Maybe IOI set a \u0026quot;loose bound\u0026quot; for the eligible contestants, and each country can set its own \u0026quot;tighter bound\u0026quot;, so I came here to ask, what are your thoughts?\u003c/p\u003e\u003cp\u003eHopefully, this can be a precedent that will be explained for all countries and contestants in the future.\u003c/p\u003e\u003c/div\u003e","tags":["ioi","eligibility"]}}