{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1488909255,"rating":161,"authorHandle":"Errichto","modificationTimeSeconds":1489057918,"id":50851,"title":"\u003cp\u003eDeadline24 2017 — Qualifying Round and GYM replay of previous edition\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi everybody.\u003c/p\u003e\u003cp\u003eDeadline24 is an international programming marathon, organized continually since 2009 by Future Processing. During the contest, the teams of three tackle algorithmic problems. \u003c/p\u003e\u003cp\u003eThe marathon is composed of two phases. The qualifying round starts on March 12. For 5 clock hours, the teams will be solving tasks and generating responses assessed by the verification server. This stage of the competition is remote. Then, the best teams of the qualifying round will meet at the 24-hour finals held on April 22-23, 2017, in Katowice (Poland).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe teams can sign up until March 9\u003c/strong\u003e, 2017 (23.59 CET). Registration is available on the contest website \u003ca href\u003d\"//www.deadline24.pl\"\u003ewww.deadline24.pl\u003c/a\u003e.\u003c/p\u003e \u003chr /\u003e\u003cp\u003eYou can get familiar with the type and difficulty level of the tasks in the Qualifying round by competing in the GYM contest on this Thursday and will last 5 hours (check your timezone \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dDeadline24+2016+Eliminations+replay\u0026amp;iso\u003d20170309T12\u0026amp;p1\u003d1447\u0026amp;ah\u003d5\"\u003ehere\u003c/a\u003e). It will be a replay contest of the Qualifying Round 2016. The contest will appear in Codeforces GYM soon. Because of technical limitations, the scoring and final ranking system of that replay contest is not identical to the one used during the qualifying round — don\u0027t forget to visit the contest website (\u003ca href\u003d\"//www.deadline24.pl\"\u003ewww.deadline24.pl\u003c/a\u003e) to read full rules (e.g. submitting time matters and you submit output files instead of codes).\u003c/p\u003e\u003cp\u003eI\u0027m not one of organizers but I competed in some of previous editions and I enjoyed finals a lot. Now I was asked to help a bit with the GYM replay. On behalf of the organizers, I want to thank Mike Mirzayanov for his help in promoting the competition on CF.\u003c/p\u003e\u003cp\u003eDon\u0027t forget that the registration ends on Thursday! Good luck in the qualifying round.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e the GYM contest will start with the delay of 30 minutes. Sorry for the inconvenience.\u003c/p\u003e\u003c/div\u003e","tags":["deadline24","marathon","24-hour","visit poland"]}}