{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1481272478,"rating":11,"authorHandle":"Sandip_Jana","modificationTimeSeconds":1481273257,"id":48953,"title":"\u003cp\u003e25 pages booklet for ACM — ICPC\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eConsidering the fact that acm icpc regionals are on the GO! One of the only advantages in acm apart from the fact that one participates in teams of three is that you also get to carry a \u003c/p\u003e\u003ch2\u003e25 pages booklet\u003c/h2\u003e\u003cp\u003ethat contains templates for some specific algorithms that individuals usually find difficult to code . I tried to google some and found this\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://web.stanford.edu/~liszt90/acm/notebook_official.pdf\"\u003elink- \u003c/a\u003e\u003c/p\u003e\u003cp\u003eIt contains most of the well known complex algorithms that require both time and knowledge to code them accurately without any bugs . So i believe having such a template in hand if someone is lucky enough to get a similar question that requires such complex algorithms to be coded fast then it obviously turns out to be a boon , the simple reason being that you dont have the power to sit and google out things there. :P\u003c/p\u003e\u003cp\u003eI also wonder what the highly rated coders in division 1 who are participating in acm this year and practicing hard for their regionals or finals , whatsoever the case may be :D , keep which algorithms in their booklet prepared because for them its always a matter of how fast and short they can code out bug free (atleast i feel so). \u003c/p\u003e\u003cp\u003eI understand the fact that having a template of an algorithm in hand without understanding how the algorithm actually works is useless but considering the also obvious fact many regionals are yet to take place and with the world finals at stake people might consider learning something complex and therefore even a small knowledge of what the code does can be an added advantage. \u003c/p\u003e\u003cp\u003eAlso for people who code in Java, \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Egor\" title\u003d\"International Grandmaster Egor\"\u003eEgor\u003c/a\u003e github link has many templates of standard data structures and algorithms that one can use easily . \u003ca href\u003d\"https://github.com/EgorKulikov/yaal\"\u003eGithub Link — \u003c/a\u003e Thanks to him.\u003c/p\u003e\u003cp\u003eIt would be helpful if others also share their experiences , if the usage of booklet does serve any help and suggest such templates of algos that if kept would turn out to be beneficial for all because if resources are given to someone i think one might always make the best possible use of it.\u003c/p\u003e\u003ch2\u003eThanks to all in advance .\u003c/h2\u003e\u003c/div\u003e","tags":["#acmicpc","#acmbooklet","#algos"]}}