{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399081966,"rating":-23,"authorHandle":"reign88","modificationTimeSeconds":1399081966,"id":12103,"title":"\u003cp\u003ef anti-riot shields and other\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003ef anti-riot shields and other anti-terrorism and anti-riot equipment, weapons, ammunition and equipment to ensure that urgent and unforeseen circumstances arise once able to respond promptly and effectively.Intern Xu Luping period of several uniformed men armed with sticks continuous video recently busted a car online heat transfer. Publisher said\u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-95-bb-c-35.html\"\u003enike air max 95 bb zapatillas\u003c/a\u003e  the incident Shaoxing City, Zhejiang Province, who smashed cars but local inspectors. According to Southern reporter, what is the cause of Shaoxing city inspectors who Beihaijiedao Jeeves when cleaning their vehicles accounted for a road, smashed vehicles and passengers incur accused persons, and thus lead to conflict.After the incident, the local police have four smashed cars were legally Detention, while Volvo drivers were nine days of administrative detention and fined $ 500.Video: More than man holding a stick Slam sedanHeat transfer video network smashed cars only a few minutes, but the scene is quite intense: more than one meter long sticks hand man to one meter yellow car surrounded unceremoniously punched with a wooden trolley. The whole process is short, but a \u0026quot;pop\u0026quot; sound of continuous hitting very clear, accompanied by flying debris sticks, seeing the glass copilot car breakdown, windshield cracked. Eventually, the car to get out. Uniforms instead grabbed another man wearing a dark man, until they are persuaded to open around them.Southern reporter noted day of the incident, the matter that is in the local \u0026quot;Shaoxing E Network\u0026quot; forum heat transfer. Netizen \u0026quot;nasty female role,\u0026quot; said the incident XINGWEN Shaoxing Bridge Zhijie, there were two cars parked in front of the inspectors Chint next cell, was thwarted by a Volvo car intended to enter the cell, see the \u003c/p\u003e\u003cp\u003epath is block, the driver\u0027s father chased off with theoretical results is surrounded, the driver seeing \u0026quot;on the use of roof inspectors, and then chased the car sticks out, smashed the car.\u0026quot; He also said that there have been well-intentioned people to mediate, has also been chased wounded.Witnesses: Law Enforcement mistakenly thought to hit themPosts mentioned in the \u0026quot;Chint\u0026quot; is a company selling electrical and mechanical equipment. Its staff to accept Southern Reporter interview confirmed the \u0026quot;chased smashed cars\u0026quot; issue. \u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-2013-c-48.html\"\u003enike air max 2013 mujer\u003c/a\u003e  The staff said that the incident at 9:00 on the 28th and more, before the conflict they are unloading front of the store, \u0026quot;the inspectors opened the two cars, a law enforcement vehicle van. Bit to a few people that want something ( collection) move. \u0026quot;When the two sides deadlocked, Volvo car pulled up. Subsequently, the car down an old man, \u0026quot;he said law enforcement officials how you gave the car blocked, so let us live.\u0026quot; At this time, law enforcement officers are involved in human and Chint negotiations, there is no reason the old man, the elderly are likely to be dissatisfaction, \u0026quot;he might have said how do you like a robber, like\u0026quot; The result was a uniformed man\u0027s discontent, put the old Wai live.The staff said that the Volvo driver saw the old man was surrounded, you want the car to separate the two sides, but the people involved in law enforcement mistakenly thought to hit them, after unsuccessful Lakaichemen want to come up with a stick from the van began to fierce hit.Another netizen yesterday declined to be named the south are reporters, Volvo car originally siege may want to frighten old people, I did not expect to incur beaten. The video was later surrounded the man was shot using a mobile phone \u003c/p\u003e\u003cp\u003eonlookers.Street: smashed cars by temporary hiringOn the day in the afternoon, the streets in the North Sea \u0026quot;Shaoxing E Network\u0026quot; for friends \u0026quot;nasty female role,\u0026quot; the statement had to respond. Explained that the Volvo car down the old man, \u0026quot;mouth swearing be abusive,\u0026quot; to persuade people came up with the theory, \u0026quot;reflected his father was surrounded Volvo driver, driving his Volvo car directly toward persuasion personnel, four comrades was injured, \u0026quot;persuasion personnel require drivers to stop,\u0026quot; the driver ignored, but also\u003ca href\u003d\"http://www.airmaxssalomon.es/nike-air-max-lunar-c-57.html\"\u003enike air max lunar baratas\u003c/a\u003e  continue to butt, in order to protect the other players, they picked up a wooden stick used for self-defense, forcing it to stop. \u0026quot;However, the responses released after being questioned. Two local residents in Shaoxing television program, said the car did not hit the inspectors.Beihaijiedao a female staff member on the Southern reporter yesterday afternoon that it was indeed injured. The staff will be smashed cars were described as \u0026quot;persuasion officer\u0026quot;, saying it was not a formal staffing street, but for the recent enforcement actions temporarily hired by the city administration office to the street. As the stick smashed cars, she said was originally used to hold the shovel spade, not enough equipment.In an interview BEIJING interview, Deputy Director in charge of urban management Beihaijiedao Vang Pao Jin said, \u0026quot;This is a public order incident.\u0026quot; Why do \u003c/p\u003e\u003c/div\u003e","tags":[]}}