{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1411691313,"rating":5,"authorHandle":"Lord.of.AMC","modificationTimeSeconds":1413167593,"id":13969,"title":"\u003cp\u003eNOCO Long Contest 2!\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eUPD6.\u003c/strong\u003e The solutions have all been rejudged!! If you have questions about the problems, please post them in the comments.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD5.\u003c/strong\u003e Due to agreement by consensus, the contest will end TODAY at 8:15 PM. I\u0027ll start system testing solutions around 8:30, so make sure to get your testcases in by then.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD4.\u003c/strong\u003e Hmm so no one\u0027s submitting anymore. Does anyone really care if I end this contest now? If you say \u0026quot;no\u0026quot;, then you should submit at least once to show why.\u003c/p\u003e\u003cp\u003eBy the way, I\u0027ve only received one submission for testcases. You should all send me some, unless you believe in my system tests (not recommended).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD3. The contest is about to start. Please remember the following things:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e(1) If you receive \u0026quot;Accepted\u0026quot; during the contest, please do not celebrate. Treat it only as \u0026quot;Pretests passed.\u0026quot;\u003c/p\u003e\u003cp\u003e(2) You may send us up to FIVE testcases per problem that you want to include in the final tests. Email to nationalomsc (at) gmail (dot) com. Please email all testcases in one email; don\u0027t send 13 different emails.\u003c/p\u003e\u003cp\u003e--\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNote: The actual, real, non-edited contest time is Friday, October 10, 2014 at \u003cem\u003e8:15\u003c/em\u003e PM CDT to the same time on Monday, October 13\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eThe scoring distribution is 1 — 1 — 1 — 1 — 1 — 1 — 1. The contest will use ACM-ICPC scoring; every submission you make will be determined on the time since the beginning of the contest with an additional penalty for resubmissions.\u003c/p\u003e\u003cp\u003eSince the problems are all worth the same, naturally they aren\u0027t in any order of difficulty. Therefore we strongly suggest you to read ALL the problems!!!\u003c/p\u003e\u003cp\u003eGood luck in about 12 days!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e I think it\u0027s time to give a small teaser about the problems. Every problem is of the form \u0026quot;Andrew and _________\u0026quot;. The following lists the first characters of each \u0026quot;_________\u0026quot;: D, U, B, D, A, 1, H. This post will be updated with more descriptive hints as the contest date approaches. Good luck in about 5 days!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD2.\u003c/strong\u003e First letter and first vowel.\u003c/p\u003e \u003cpre\u003e\u003ccode\u003eAndrew and Di\nAndrew and Ui\nAndrew and Bo\nAndrew and Di (2 words!)\nAndrew and Ao\nAndrew and 1  (no vowels)\nAndrew and Ho (2 words!)\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e","tags":["contest"]}}