{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1458086652,"rating":116,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1458120616,"id":43821,"title":"\u003cp\u003eCROC 2016 — Qualification\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/croc-champ-eng.png\" style\u003d\"float: left;margin: 0 2.0em 2.0em 0;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThe Qualification Round of the \u0026quot;CROC 2016\u0026quot; Championship will start on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?day\u003d16\u0026amp;month\u003d3\u0026amp;year\u003d2016\u0026amp;hour\u003d12\u0026amp;min\u003d0\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003eMarch, 16, 09:00 (UTC)\u003c/a\u003e.\u003c/p\u003e\u003cp\u003ePlease, read about the Championship by the link \u003ca href\u003d\"//codeforces.com/blog/entry/43229\"\u003ehttp://codeforces.com/blog/entry/43229\u003c/a\u003e\u003c/p\u003e\u003cp\u003eYou need to participate in the Qualification Round to make it to Round 1. All contestants who gain a positive score will advance to the Round 1.\u003c/p\u003e\u003cp\u003eAt the Qualification Round you will find a few problems, roughly ordered by the increasing complexity. During the Qualification Round the problems are judged only on pretests and system testing will take place after the end of the Qualification Round (round continues for 48 hours). The pretests do not cover all possible cases of input data, test your programs carefully! The Qualification Round has no hacks or decreasing values of the problems.\u003c/p\u003e\u003cp\u003eThe round will last for 48 hours, but it does not mean that we encourage you to spend all this time solving of problems. We hope that most participants will cope with the problems (or with most problems) in a shorter period of time. This duration of the round is chosen so that each participant could find a convenient time to participate. The problems will be in English as well as in Russian.\u003c/p\u003e\u003cp\u003eBefore the end of the round it is strictly forbidden to publish the problem statements/solutions/any thoughts and ideas about them elsewhere. It is forbidden to talk about the problems, discuss the statements and so on. Be honest and let the best participants make it into Round 1. When the Qualification Round is over, you can discuss the problems and solutions.\u003c/p\u003e\u003cp\u003eYou can register for the round at any time up to its end.\u003c/p\u003e\u003cp\u003eThe results of the round will not affect the rating. If you are not registered to the Championship officially, you can take part in the round out-of-championship.\u003c/p\u003e\u003cp\u003eBest of luck and enjoy solving the problems!\u003c/p\u003e\u003c/div\u003e","tags":["croc","2016"]}}