{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1474970353,"rating":102,"authorHandle":"gKseni","modificationTimeSeconds":1474970353,"id":47377,"title":"\u003cp\u003eОткрытый университет: Почему пришло время болеть за программистов?\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/e2/a7/e2a7073e9c767fa0fbf268112235d46ea8d16fb6.png\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eПочему пришло время болеть за программистов? Чем чемпионат по программированию отличается от футбольного первенства? Почему российские программисты считаются лучшими в мире? Кем работают чемпионы? И может ли победитель ACM ICPC сделать вам сайт?\u003c/p\u003e\u003cp\u003eНа эти вопросы широкой публики 24 сентября ответили Геннадий Короткевич, магистрант Университета ИТМО, чемпион ACM ICPC, IOI и многих других соревнований по программированию, и Лидия Перовская, куратор академических программ «Яндекс» и тьютор кафедры компьютерных технологий Университета ИТМО. \u003c/p\u003e\u003cp\u003eА мне Лидия ответила на вопросы о лекции:\u003c/p\u003e\u003cp\u003e— Что это было за мероприятие?\u003cbr /\u003e— Это была регулярная лекция \u003ca href\u003d\"http://ouniversity.ru/\"\u003eОткрытого университета\u003c/a\u003e — совместного проекта \u003ca href\u003d\"http://paperpaper.ru/\"\u003eонлайн издания Бумага\u003c/a\u003e, новой сцены Александринского театра и петербургских университетов: ИТМО, Европейского университета и Политеха. Темой очередной серии докладов были Мутации — здесь и пришлось к месту пересечение спорта и программирования.\u003c/p\u003e\u003cp\u003e— Кто был аудиторией?\u003cbr /\u003e— На лекцию приглашаются все желающие, типичная аудитория — специалисты 25-35 лет, которые слышали что-то краем уха о спортивном программировании и хотят узнать больше. Для всех, кто не смог приехать лично, ИТМО проводит онлайн трансляцию.\u003c/p\u003e\u003cp\u003e— Понравилось так выступать? Это был первый опыт подобного рода или нет?\u003cbr /\u003e— Мне часто удается рассказать об олимпиадах людям, которые раньше с ними были не знакомы. Радует, что удается привлечь больше зрителей к соревнованиям, рассказать о том, почему они полезны и как увлекательно болеть за программистов.\u003c/p\u003e\u003cp\u003e\u003ciframe allowfullscreen\u003d\"\" frameborder\u003d\"0\" height\u003d\"315\" src\u003d\"https://www.youtube.com/embed/0pbLFPY-w6c\" width\u003d\"560\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news","итмо"]}}