{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1461013450,"rating":255,"authorHandle":"Edvard","modificationTimeSeconds":1461188899,"id":44435,"title":"\u003cp\u003eEducational Codeforces Round 12\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello, Codeforces!\u003c/p\u003e\u003cp\u003eNote! The day of the contest here was wrong. Now it\u0027s fixed.\u003c/p\u003e\u003cp\u003eEducational Codeforces Round 12 will take place on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dEducational+Codeforces+Round+12\u0026amp;iso\u003d20160420T1500\"\u003e20 april 2016 at 18:00 MSK\u003c/a\u003e for the first and the second divisions.\u003c/p\u003e\u003cp\u003e\u003c/p\u003e\u003cp\u003eThe round will be unrated for all users and it will be held with extented ACM ICPC rules. You will have two hours to solve six problems. After that you will have one day to hack any solution you want. You will have access to copy any solution and test it locally.\u003c/p\u003e\u003cp\u003eIf you have ideas for some problems or maybe already prepared problems that you can\u0027t use in rounds or official competitions, you can write to me.\u003c/p\u003e\u003cp\u003eIt seems that it is harder to invent interesting simple problems (like A and B) than difficult ones. So don\u0027t be afraid to suggest interesting simple or very simple tasks (of course the difficult tasks are also needed). Please send only the problems for which you know the solution with clear statement (the story is not required). And also please add one or two samples to make the problem statement more clear.\u003c/p\u003e\u003cp\u003eThe problemset was suggested by Codeforces users (it\u0027s time to lift this sentence inside the tegs). The problem А was suggested by user \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/unprost\" title\u003d\"Expert unprost\"\u003eunprost\u003c/a\u003e. The problem B was suggested by Ayush Anand \u003ca class\u003d\"rated-user user-gray\" href\u003d\"/profile/FanOfTourist\" title\u003d\"Newbie FanOfTourist\"\u003eFanOfTourist\u003c/a\u003e. The problems C, D and E was suggested by Zi Song Yeoh \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/zscoder\" title\u003d\"Candidate Master zscoder\"\u003ezscoder\u003c/a\u003e. Sheikh Monir \u003ca class\u003d\"rated-user user-green\" href\u003d\"/profile/skmonir\" title\u003d\"Pupil skmonir\"\u003eskmonir\u003c/a\u003e a long ago sent me a problem with difficulty C or D. I improved it by significant increase of the constraints (thanks to Mikhail Tikhomirov \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Endagorion\" title\u003d\"International Grandmaster Endagorion\"\u003eEndagorion\u003c/a\u003e who told how to solve such things). So the problem F was born.\u003c/p\u003e\u003cp\u003eThanks a lot to them and all others who are sending the problems! The number of unused problems are increasing. If I didn\u0027t miss anything I already replied to all who sent me the problems at least 5-6 days ago. Please be patient if your problem was not used a long while.\u003c/p\u003e\u003cp\u003eThe problems was prepared by me (Edvard Davtyan). Thanks to Maria Belova \u003ca class\u003d\"rated-user user-black\" href\u003d\"/profile/Delinur\" title\u003d\"Unrated, Delinur\"\u003eDelinur\u003c/a\u003e for checking the English statements. The problems was tested by users suggested them, respectively: \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/unprost\" title\u003d\"Expert unprost\"\u003eunprost\u003c/a\u003e, Ayush Anand \u003ca class\u003d\"rated-user user-gray\" href\u003d\"/profile/FanOfTourist\" title\u003d\"Newbie FanOfTourist\"\u003eFanOfTourist\u003c/a\u003e, Zi Song Yeoh \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/zscoder\" title\u003d\"Candidate Master zscoder\"\u003ezscoder\u003c/a\u003e and Sheikh Monir \u003ca class\u003d\"rated-user user-green\" href\u003d\"/profile/skmonir\" title\u003d\"Pupil skmonir\"\u003eskmonir\u003c/a\u003e. Thanks a lot to all of them!\u003c/p\u003e\u003cp\u003eI hope you will enjoy the problems! On my mind all the problems except of F is easier than usual, but F is harder.\u003c/p\u003e\u003cp\u003eGood luck and have fun!\u003c/p\u003e\u003cp\u003eOnly 30 days left to the ACM ICPC World Finals!\u003c/p\u003e\u003cp\u003eIt will be difficult to focus on the problems in such a beautiful place :-)\u003c/p\u003e\u003cp\u003eUPD1: The first part of the contest is finished. The open hacks will be opened in a few minutes.\u003c/p\u003e\u003cp\u003eUPD2: The editorial is ready for the problem F.\u003c/p\u003e\u003cp\u003eUPD3: The editorial is \u003ca href\u003d\"//codeforces.com/blog/entry/44466\"\u003eready\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/cd/cf/cdcf7a0c769291d4b3624429fb383d262e4517c0.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["education round 12","announcement"]}}