{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1430434119,"rating":8,"authorHandle":"fresher96","modificationTimeSeconds":1430434119,"id":17645,"title":"\u003cp\u003eseeking for help\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003ehey guys ! i need some tips to organize my methods to study after my little experience in competitive programming, i\u0027m now upon some ways to continue they are just 4 as i think, here they are from the most i follow\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003ewatching videos, then solve problems related to the watched video (usually the video refers to some problems at the end)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003esolving about 100 Div 2-A problem, in case of getting stuck with a problem read the editorial and and if something new is mentioned (data structure, algorithm, ...) go and read about it, then moving to Div 2-B and so on...\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003ereading books, like Competitive Programming 3, and solve some of the listed problems\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eread editorials \u0026amp; tutorials from here (GYM) or Top Coder or somewhere else, then trying to solve the problems mentioned at the end\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eand of course once a while participate in contests to keep fit with time pressure these are the methods i follow, now i have a good knowledge in dynamic programming and the basics of graph traversals, i think that\u0027s all. because of some problems in Code Forces especially for the last certain rounds i think i\u0027m very weak to come up with a greedy approach so i might start learning greedy by method 1 or start doing method 2.\u003c/p\u003e\u003cp\u003edue to your experience what do you suggest ? or any new ideas ?\u003c/p\u003e\u003cp\u003eany help would be appreciated.\u003c/p\u003e\u003c/div\u003e","tags":["question","help","newbie"]}}