{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1513778352,"rating":-15,"authorHandle":"rsampaths16","modificationTimeSeconds":1513778352,"id":56510,"title":"\u003cp\u003eHelp to verify Deep-Q-network, reinforcement learning algorithm source.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003e\u003cem\u003edisclaimer : I do realise this request is not related to the conventional coding contests | problems asked here, but still hope to find people of similar interests, who would like to help.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eI have been into Machine Learning and Deep Learning for a while now and it\u0027s been going smoothly. There is however a catch, that it\u0027s hard for me to verify the working of complex structures due to the limit\u0027s of my hardware compute (quad-core i5-processor, no Nvidia -\u0026gt; no Cuda). I\u0027ve recently implemented Deep-Q-Network reinforcement learning algorithm, and it\u0027s taking eternity to converge (seriously it\u0027s hard to wait that long without results, or at-least a little sign that I was heading in the right direction). What I\u0027m hoping from the community is that little sign, weather I\u0027m heading in the right direction :) , or my implementation is wrong ;-; .\u003c/p\u003e\u003cp\u003eIt would be cool if you could verify the source, and validate it. Even awesome if you could post results after training it.\u003c/p\u003e\u003cp\u003eLink to github repo : \u003ca href\u003d\"https://github.com/rsampaths16/dqn-game-bot\"\u003ehttps://github.com/rsampaths16/dqn-game-bot\u003c/a\u003e clone github repo : \u003ca href\u003d\"mailto:git@github.com:rsampaths16/dqn-game-bot.git\"\u003egit@github.com:rsampaths16/dqn-game-bot.git\u003c/a\u003e\u003c/p\u003e\u003cp\u003eI\u0027m looking forward to any feedback you might have. You could give it here, even better as issues over there.\u003c/p\u003e\u003cp\u003eThank You All;\u003c/p\u003e\u003c/div\u003e","tags":["neural networks","deep learning","deep q rl","game agent"]}}