{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1430508837,"rating":-39,"authorHandle":"NYanushkevich","modificationTimeSeconds":1430508837,"id":17662,"title":"\u003cp\u003eШкола программирования и робототехники GoTо Camp приглашает учащихся 8-11 классов на летние смены! \u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eGoTo Camp вновь соберет школьников со всей России в Подмосковье: первая летняя школа пройдет с 21 июня по 5 июля, вторая – с 27 июля по 10 августа.\u003c/p\u003e\u003cp\u003eУ каждого участника будет возможность реализовать проект в одной из двух областей:\u003c/p\u003e\u003cp\u003e• Прикладное программирование\u003cbr /\u003e • Робототехника\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eВсего за 14 дней команды пройдут все стадии от идеи до реализации и представят свои проекты экспертам из области ИТ. Проекты могут быть из самых разных областей: игры, образование, социальные сети, безопасность, математика, музыка, астрономия, кино, домашнее хозяйство, медицина, промышленность, дизайн и т.д. — программирование и робототехника могут оказаться полезными в любых ситуациях. \u003c/p\u003e\u003cp\u003eПреподавать и курировать проекты будут сотрудники компаний Яндекс, КРОК, ABBYY и Intel, преподаватели МГУ, МФТИ, ВШЭ и УрФУ.\u003c/p\u003e\u003cp\u003eУчастников ждет:\u003c/p\u003e\u003cp\u003e• Командная работа над проектами\u003cbr /\u003e • Мастер-классы и лекции от экспертов из различных областей\u003cbr /\u003e • Экскурсии в компании и профориентационные игры\u003cbr /\u003e • Насыщенная культурная и спортивная программа\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eШкола даст ребятам:\u003c/p\u003e\u003cp\u003e• Возможность претворить в жизнь даже самую смелую идею\u003cbr /\u003e • Мотивацию к получению новых знаний\u003cbr /\u003e • Умение на практике ставить цели и шаг за шагом достигать их\u003cbr /\u003e • Осознание своих возможностей и уверенность для дальнейшего саморазвития\u003cbr /\u003e • Новые друзья и единомышленники\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eЗаявки принимаются до 1 июня. Все подробности на сайте школы: \u003ca href\u003d\"http://goto.msk.ru/\"\u003ehttp://goto.msk.ru/\u003c/a\u003e\u003c/p\u003e\u003cp\u003eУчастие платное. Есть возможность выиграть гранты на бесплатное участие. Для этого необходимо вместе с заявкой прислать 100-секундное видео об идее проекта, который планируется реализовать на школе.\u003c/p\u003e\u003c/div\u003e","tags":["яндекс","крок","abby","урфу","мфти","мгу","вшэ","летняя школа","для школьников","робототехника","програмирование"]}}