{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1466892100,"rating":54,"authorHandle":"jhilary","modificationTimeSeconds":1466892100,"id":45658,"title":"\u003cp\u003eПитон на клетчатом поле\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eНаписала код для задачи \u003ca href\u003d\"//codeforces.com/problemset/problem/680/E\"\u003ehttp://codeforces.com/problemset/problem/680/E\u003c/a\u003e (про медведя на клетчатом поле) на Python. Застряла на 12м тесте с вердиктом \u0026quot;Превышено ограничение времени на тесте 12\u0026quot;. Попробовала максимально оптимизировать написаный код, но все равно не выходило пройти ограничение по времени. Запускала с помощью pypy2 (если запускать python2, то выходит в 6 раз медленнее).\u003c/p\u003e\u003cp\u003eПоследняя попытка здесь: \u003ca href\u003d\"//codeforces.com/contest/680/submission/18710430\"\u003ehttp://codeforces.com/contest/680/submission/18710430\u003c/a\u003e\u003c/p\u003e\u003cp\u003eБудучи уверенной, что в асимптотике все верно, попробовала переписать на плюсах, повторяя логику кода на питоне один в один. \u003c/p\u003e\u003cp\u003eСдала с первой попытки: \u003ca href\u003d\"//codeforces.com/contest/679/submission/18726182\"\u003ehttp://codeforces.com/contest/679/submission/18726182\u003c/a\u003e\u003c/p\u003e \u003cul\u003e   \u003cli\u003e12й тест, который не проходил на pypy2 с ограничением времени в три секунды, прошел за 561ms.\u003c/li\u003e   \u003cli\u003e11й тест(предыдущий) прошел в с++ версии за время вдесятеро меньшее, чем на pypy2\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eВопросы\u003c/strong\u003e:\u003c/p\u003e \u003col\u003e   \u003cli\u003eМожно ли оптимизировать мой питоновский код, чтоб он таки прошел ограничение? При том, что 12й тест не самый тяжелый. В списке сдавших эту задачу нет ни одного питониста\u003c/li\u003e   \u003cli\u003eПочему ограничения на задачу выставлены таким образом, что абсолютно одинаковые решения на двух языках находятся в неравных условиях?\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eЯ пишу впервые, так что не знаю публикуется ли где-то пост в открытом месте. Если никто не прочитает, то вопросы оставляю здесь как риторические\u003c/p\u003e\u003c/div\u003e","tags":["python 2","pypy","c++","вопросы"]}}