{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1425337791,"rating":26,"authorHandle":"Leonid","modificationTimeSeconds":1425338350,"id":16741,"title":"\u003cp\u003eDeadline24, Final Round\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eIt\u0027s the first time we\u0027re competing in the final of Deadline 24. We\u0027re very excited and videos from past contests look like a lot of fun.\u003c/p\u003e\u003cp\u003eWhat advise would you give to fresh-mans? I would be pleased to hear from teams who already have some experience in this contest as well.\u003c/p\u003e \u003cul\u003e   \u003cli\u003eWhat pre-written code would you advise to have?\u003c/li\u003e   \u003cli\u003eWhat tools did you use to visualise games (if any)? Did you run visualisations in parallel?\u003c/li\u003e   \u003cli\u003eWas there a visualisation provided on a shared monitor where you could see the games in action?\u003c/li\u003e   \u003cli\u003eApproximately how many rounds for each game were there during the contest?\u003c/li\u003e   \u003cli\u003eAfter how much time since the start of the contest would teams have a minimal working solution?\u003c/li\u003e   \u003cli\u003eWhat hardware did you bring with you and found useful (router/switch, extra monitors, etc)?\u003c/li\u003e   \u003cli\u003eWhat additional material (language specs, books, language tools/libraries), if any, did you find useful?\u003c/li\u003e   \u003cli\u003eWhat programming language(s) and tools did use to code problems, and why?\u003c/li\u003e   \u003cli\u003eDid you use any machine learning, or it was too tight on time?\u003c/li\u003e   \u003cli\u003eHow did you handle TCP requests/responses (i.e. a wrapper to pass data to stdin/stdout, a library, etc)?\u003c/li\u003e   \u003cli\u003eHow big was the gap between the first/middle/last team?\u003c/li\u003e   \u003cli\u003eHow many teams approximately would submit a working solution? How does this metric change during the course of the contest?\u003c/li\u003e   \u003cli\u003eAre problems from 2014 final available anywhere?\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":["deadline24"]}}