{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1514591151,"rating":38,"authorHandle":"misis","modificationTimeSeconds":1514727578,"id":56730,"title":"\u003cp\u003eИ вновь продолжается бой, или ACM MISIS 2017\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет! Подходит к концу 2017 год. Для нашей секции он был крайне насыщенным самыми разными событиями, о чем мы и хотим рассказать в этом посте. В этом году наши команды поучаствовали в новых для себя соревнованиях, а тренеры — провели несколько новых для себя мероприятий и отказались от одного старого.\u003c/p\u003e\u003cp\u003eВ этом году мы поставили несколько собственных рекордов, а именно: \u003cbr /\u003e - аж 4 наших команды прошли в NEERC; \u003cbr /\u003e - более 30 наших команд поучаствовало в Moscow Programming Contest (1/8 ACM ICPC); \u003cbr /\u003e - мы организовали площадку Moscow Programming Contest, на которой выступило более 40 команд; \u003cbr /\u003e - впервые наши наборы студентов разделились на три дивизиона. \u003cbr /\u003e\u003c/p\u003e\u003cp\u003eИзначально после перечисления собственных рекордов мы хотели рассказать больше о соревнованиях, в которых участвовали наши команды, а потом о мероприятиях, которые мы провели, но так и не поняли, куда отнести Moscow Programming Contest — 1/8 ACM ICPC, так что сначала расскажем о нём, а потом уже обо всем остальном.\u003c/p\u003e\u003cp\u003eИтак, как наверняка всем известно, в этом году в Москве проводилась 1/8 финала. Мы гордимся, что из наших команд целых 6 прошло в четвертьфинал. Всего, как уже говорилось, от нас выступало больше 30 команд, каждая из которых решила минимум 2 задачи. Стоит отдельно отметить, что среди этих 30 команд было много команд первокурсников, которые только начали заниматься олимпиадным программированием, но решили попробовать свои силы. Мы рады, что ребята, только за пару недель до контеста начавшие изучать С++ и за месяц до того узнавшие о спортивном программировании, пошли и поучаствовали в таком мероприятии. Мы искренне надеемся, что в следующем году они смогут по-настоящему проявить себя и достичь высоких результатов! \u003c/p\u003e\u003cp\u003eОднако не только наши студенты приняли активное участие в Moscow Programming Contest. Наши тренеры сделали всё, чтобы организовать площадку, на которой комфортно решать контест и куда хочется вернуться. Нам кажется, что это удалось. Во время основного тура не возникло никаких технических накладок. Нельзя сказать, что проблем не было вообще, но все они были замечены во время пробного контеста, и пару команд даже пересадили за свободные компьютеры. После контеста все участники площадки собрались в библиотеке НИТУ “МИСиС” (она у нас чудесная, там есть большой зал), где смогли пообсуждать результаты и поесть халявной пиццы.\u003c/p\u003e\u003cp\u003eВ этом году наши студенты приняли участие как в давно известных нам соревнованиях, например, в открытом чемпионате БГУИР по программированию, олимпиаде ГрГУ им. Янки Купалы, Открытой Всесибирской Олимпиаде им. Поттосина, так и в новых для нас мероприятиях, а именно в Открытом Чемпионате Юга России и Открытом чемпионате ЯрГУ им. Демидова. Наши команды показали себя с хорошей стороны на всех мероприятиях, а с двух последних привезли кубки за первое место. \u003c/p\u003e\u003cp\u003eНу и конечно, мы участвовали в ACM ICPC. Так, в четвертьфинале приняло участие 6 наших команд, а в NEERC — 4 команды. К сожалению, в этом году наши команды не прошли в финал. Но у нас еще всё впереди:)\u003c/p\u003e\u003cp\u003eТакже наши студенты поучаствовали в различных сборах по спортивному программированию, а именно в Сазанке, Петрозаводских сборах и Moscow Pre-Finals Workshops ACM ICPC, проводимых МФТИ. Со сборов МФТИ наши ребята взяли кубок за абсолютное второе место среди команд младшего дивизиона.\u003c/p\u003e\u003cp\u003eКак всегда, проводились внутренние зимние и летние сборы наших команд. И, как всегда, мы не можем не сказать несколько слов о наших внутренних сборах. Летние сборы уже в третий раз прошли в прекрасном городе Гродно совместно с ГрГУ им. Янки Купалы. Благодарим Юрия Генриховича Степина за помощь и поддержку, без которых вряд ли удалось бы провести такое мероприятие, а также студентов ГрГу, в особенности Арсения Колосова и Эдуарда Вильчевского, которые приняли участие в сборах и показали прекрасные результаты. Зимние же сборы в январе 2017 года прошли в подмосковном городе Пущино. В основном в них принял участие младший дивизион, который ответственно подошел к задаче и усиленно изучал материал. \u003c/p\u003e\u003cp\u003eВот мы и подошли к части о мероприятиях, которые мы организовывали и в которых участвовали как секция.\u003c/p\u003e\u003cp\u003eДля начала о двух абсолютно не важных ни для кого, кроме нас, а именно Дне Открытых Дверей НИТУ “МИСиС” и Дне Первокурсника НИТУ “МИСиС”. Вообще мы очень рады, что после нескольких лет битья головой о стены нас заметили сотрудники ВУЗа, отвечающие за проведение подобных мероприятий, и у нас были собственные стенды, где мы рассказывали школьникам и первокурсникам о нас, наших командах и наших мероприятиях.\u003c/p\u003e\u003cp\u003eДругое мероприятие, имеющее не самое явное отношение к спортивному программированию и проведенное нашей секцией — VisionHack, хакатон по машинному зрению для студенческих команд. Мы уже освещали это соревнование в одном из предыдущих постов, так что только скажем, что вышло по-настоящему крутое мероприятие с командами из множества университетов со всего мира и классными задачами.\u003c/p\u003e\u003cp\u003eА вот следующий факт довольно грустный — в этом году олимпиада НИТУ “МИСиС” по программированию, впервые со дня своего основания в 2012, проходит без нашего участия. Теперь ее организует приемная комиссия. Нам искренне жаль, что бюрократические сложности привели к тому, что мы не имеем возможности порадовать талантливых школьников интересными задачами в этом году. Но мы надеемся, что в следующем году сможем предложить вашему вниманию что-нибудь новое. \u003c/p\u003e\u003cp\u003eА пока поздравляем всех с Новым 2018 Годом! Желаем, чтобы для вас он стал интереснее и продуктивнее, чем все предыдущие!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/71/7f/717f725a4d0695a339e6ea6dcf406ba6233694a6.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}