{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1422197738,"rating":333,"authorHandle":"marat.snowbear","modificationTimeSeconds":1422202704,"id":16011,"title":"\u003cp\u003eCodeforces achievements\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi!\u003c/p\u003e\u003cp\u003eI\u0027d like to introduce my project to Codeforces community. My project\u0027s name is \u0027Codeforces achievements\u0027 and as you can probably guess it is about achievements! Your achievements on Codeforces site. For those who do not like my long posts I should mention that the link to the site is at the end of this post. \u003c/p\u003e\u003ch1\u003eIntroduction\u003c/h1\u003e\u003cp\u003eLast summer I left my last job, so I have quite a lot of spare time which I could invest in my hobby. Also I decided to learn something more or less new for me (for last several years my job was to write desktop software for Windows), so I decided to put my hands on some modern popular web-framework. At that point I chosen Python and Django, cause it was matching one position I applied. So I had a time and I wanted to learn Django. The best way to learn something is to practice in it, so I started looking for the idea for the site to create (didn\u0027t want to write yet another forum engine). Luckily at that point I ran into \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/I_love_Tanya_Romanova\" title\u003d\"Grandmaster I_love_Tanya_Romanova\"\u003eI_love_Tanya_Romanova\u003c/a\u003e\u0027s comment: \u003c/p\u003e \u003cblockquote\u003e   \u003cblockquote\u003e\u003cp\u003eSystem\u0026gt; tourist unsuccessfully challenged LeBron\u0027s 250-point problem.\u003cbr /\u003eAchievement unlocked:) \u003c/p\u003e   \u003c/blockquote\u003e \u003c/blockquote\u003e\u003cp\u003eThat was it! I like the idea of achievements in the games and I decided that I want to something similar for Codeforces. That achievement Bohdan mentioned in his comment became the first achievement I implemented in my CF-achievements. \u003c/p\u003e\u003ch1\u003eAchievements\u003c/h1\u003e\u003cp\u003eThe original idea was to have more funny \u0026amp; unusual achievements and less hard time-consuming achievements like \u0027solve XXX problems\u0027. I think I didn\u0027t really succeed in that, there are not that many achievements there but I still have a couple of ideas for the future (of course I\u0027m open to your ideas as well). Generally at the moment there are two types of achievements implemented. First one is something like \u0027language expert\u0027, in order to get this one you need to solve 50 problems in some particular programming language or language family. The second type of achievements can be rewarded for something you did in a single contest. For example \u003ca class\u003d\"rated-user user-legendary\" href\u003d\"/profile/tourist\" title\u003d\"Legendary grandmaster tourist\"\u003e\u003cspan class\u003d\"legendary-user-first-letter\"\u003et\u003c/span\u003eourist\u003c/a\u003e might try to hack your solution and if he doesn\u0027t succeed you get a \u003ccode\u003eYou didn\u0027t even scratch me!\u003c/code\u003e achievement. Unfortunately Gennady won\u0027t be able to get this achievement himself, I apologise for that. \u003c/p\u003e\u003cp\u003eI was trying to come up with funny \u0026amp; interesting names for achievements, if you do not get the point in some achievement\u0027s name feel free to Google it or ask about it in the comments. \u003c/p\u003e\u003cp\u003eI should also mention here that all the achievements are given only for the online round you take part in, there is nothing for solving the problems after the round has finished. Also some achievements might take only rated rounds into account. There is a description for each achievement on how to get it. \u003c/p\u003e\u003ch1\u003eTechnical side\u003c/h1\u003e\u003cp\u003eThe site at the moment is not automated much, I need to manually start achievement crawling jobs after each contest so please do not blame me if you don\u0027t see your achievement two minutes after contest is over. It might take around 10-15 minutes after the system test phase for me to run all the scripts. I might also be in the gym, stay patient then :-) I\u0027m working on automating the site. \u003c/p\u003e\u003ch1\u003eAnd finally...\u003c/h1\u003e\u003cp\u003eFinally the link: \u003ca href\u003d\"http://cfa.yuldashev.net/\"\u003eCF-achievements\u003c/a\u003e \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://cfa.yuldashev.net/achievement/1\"\u003eLink to \u0027You didn\u0027t even scratch me!\u0027 achievement\u003c/a\u003e\u003c/p\u003e\u003cp\u003eYou start point should be the main page and the user search textbox there, type in your CF handle and see what you have earned. \u003c/p\u003e\u003cp\u003eI should say that the project is in the beta stage at the moment, there is a lot to be done, I just wanted to involve the community into it, get some feedback and maybe some support. I\u0027m open to all ideas about this project, please feel free to post them as comments here. Also you can see that the site was designed by a programmer (me), if you are more talented designer that I am, I would appreciate your help. \u003c/p\u003e\u003cp\u003eInitially I was going to let you know about it after CF round 288, but looks like Div. 1 part of it was cancelled so I decided to introduce it immediately. Also in the last round \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/I_love_Tanya_Romanova\" title\u003d\"Grandmaster I_love_Tanya_Romanova\"\u003eI_love_Tanya_Romanova\u003c/a\u003e got his achievement in CF, the idea of this site was born when I saw his comment so I decided it\u0027s good sign to start. \u003c/p\u003e\u003cp\u003eHope you enjoy it,\u003cbr /\u003eMarat.\u003c/p\u003e\u003c/div\u003e","tags":["cf-achievements"]}}