{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1481134416,"rating":33,"authorHandle":"alkurmtl","modificationTimeSeconds":1481134834,"id":48899,"title":"\u003cp\u003eРазбор Rebusforces Round #1\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eA:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eНа первой картинке изображен \u0026quot;вес\u0026quot;, на второй сортировка. Дальше вспоминаем Python, применяем нехитрые преобразования и получаем \u0026quot;всерос\u0026quot;. \u003cem\u003eИли правильно \u0026quot;всеросс\u0026quot;???\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eB:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eНа первой картинке изображено \u0026quot;суфле\u0026quot;, на второй персонажи мультфильма \u0026quot;фиксики\u0026quot; (тут опять требовалось немного вспомнить Python). Дальше нехитрые преобразования приводят к \u0026quot;суффикс\u0026quot;. Также можно было отгадать ребус по названию, но это гораздо сложнее. Когти Росомахи были сделали из адамантия, что наталкивает на мысль о небезызвестном пользователе \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/adamant\" title\u003d\"Мастер adamant\"\u003eadamant\u003c/a\u003e, прославившемся своими гайдами по суффиксным структурам.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eС:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eЗдесь требовалось нестандартное мышление. Вся картинка, данная в условии — это \u0026quot;ребус\u0026quot;. В левой половине ребуса находится она же (получается такая рекурсия). А значит, левая половина — это тоже \u0026quot;ребус\u0026quot;. Знак сигмы справа обозначает сумму. Применив нехитрые преобразования, получаем... \u0026quot;ребус\u0026quot;.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eD:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eМистер БИН + Эдгар ПО + ИСКовое заявление — \u0026quot;бинпоиск\u0026quot;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eE:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eОдна из самых сложных задач контеста. x2 — это умножение на два, на картинке посередине изображена классическая игра теории игр \u0026quot;ним\u0026quot; с заменой М на Ц. Однако два раза повторять \u0026quot;ниц\u0026quot; было неправильным решением, необходимо было догадаться, что умножение на два можно обозначить латинской приставкой \u0026quot;ди\u0026quot; (как в \u0026quot;дихотомия\u0026quot;). Ну и теперь ответ напрашивается сам собой: \u0026quot;диница\u0026quot; (алгоритм для нахождения максимального потока). Кроме того, это еще один ребус, который можно угадать по названию — Диниц был израильским ученым.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eF:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eСлева — флаг Великобритании, иначе Объединенного Королевства, посередине аниме \u0026quot;K-On\u0026quot;, справа флаг Англии. Вспомнив двухбуквенные названия этих стран (их вы можете видеть, например, когда смотрите на индикатор текущей раскладки), получаем UK + KON + EN \u003d \u0026quot;ukkonen\u0026quot; (алгоритм для построения суффиксного дерева)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eG:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eЭтот ребус внезапно оказался легче, чем думало жюри. Понять, что окончание слова — это \u0026quot;ck\u0026quot;, не составляло труда (на картинке изображен торт, по-английски \u0026quot;cake\u0026quot;). Сложнее было понять начало слова. Слив с помощью мема PPAP Соединенные Штаты Америки и ЕГЭ получаем SAT — американский аналог ЕГЭ. Переставляем буквы, и получаем ответ: \u0026quot;stack\u0026quot;.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eH:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eА эта задач, наоборот, оказалась намного сложнее, чем думало жюри. На первой картинке изображен профессор Ксавьер, известный персонаж вселенной Marvel, а на второй картинки со смехом. Здесь было необходимо вспомнить недавно вошедший в употребление синоним слова \u0026quot;смех\u0026quot; — \u0026quot;ор\u0026quot;. Ответ — \u0026quot;ксор\u0026quot; (булевая операция).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eI:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eНа лице человека, невероятно похожего на Андрея Станкевича, можно увидеть \u0026quot;пот\u0026quot;, а справа изображен жест, обозначающий OK. Ответ — \u0026quot;поток\u0026quot;.\u003c/p\u003e\u003c/div\u003e","tags":[]}}