{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1526323854,"rating":10,"authorHandle":"vova_rakal","modificationTimeSeconds":1526324056,"id":59464,"title":"\u003cp\u003eMake pretests great again!\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ последних нескольких раундах на Codeforces претесты были слишком слабыми и не учитывали разнообразные крайние случаи. Это создает две проблемы:\u003c/p\u003e\u003cp\u003e1) Кто первый придумает хороший тест, тот получает преимущество в целую задачу на контесте (достаточно часты случаи появления 12 (!) удачных взломов на контесте от одного человека одним тестом). Из-за этого человек получает не вполне справедливое преимущество в задачу, а ситуация в итоге не особо отличается от той, если бы данный тест изначально добавили в претесты.\u003c/p\u003e\u003cp\u003e2) Ещё более обидна ситуация когда крайний случай не оказывается найден большинством взломщиков и у огромного числа людей задача валиться на финальных тестах. В этом случае, серьезное преимущество получают люди, находящиеся в одной комнате с сильным взломщиком, так как они застрахованы от того, чтобы свалиться на популярном крайнем случае после контеста и имеют шанс исправить свой код после. Замечу, что в этом случае преимущество еще менне обоснованно (просто дело везения попадания в \u0026quot;хорошую\u0026quot; комнату).\u003c/p\u003e\u003cp\u003eМежду тем, я не говорю что система взломов плоха: безусловно, она бывает полезна, чтобы отыграть штрафное время/штрафные попытки на контесте. Также она дает шанс людям, которые считают, что решили все что могли улучшить свое место. Но я глубоко убежден, что ситуация, когда люди получают преимущество в целую задачу просто придумав сильный взлом или попав в комнату с сильным вщломщиком, ужасна. \u003c/p\u003e\u003cp\u003eХорошим вариантом было бы просто усилить претесты.\u003c/p\u003e\u003cp\u003eВ комментариях к анонсу Codeforces Round #482 (Div. 2) было озвучено несеколько альтернативных способов решения проблемы:\u003c/p\u003e\u003cp\u003e1) \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/teja349\" title\u003d\"Гроссмейстер teja349\"\u003eteja349\u003c/a\u003e предложил ограничить количество взломов по задаче одним человеком тремя. Это интересный вариант, но он только усугубляет вторую проблему, делая неравными людей даже в одной комнате.\u003c/p\u003e\u003cp\u003e2) \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/TooNewbie\" title\u003d\"Кандидат в мастера TooNewbie\"\u003eTooNewbie\u003c/a\u003e помимио прочего предложил сделать 24 часовую фазу открытых взломов после раунда. Этот вариант в какой-то мере решает обе проблемы, но отказ от системы взломов на обычных контестах не кажеться мне хорошим решением, так как убивате изюминку контестов Codeforces и преимущества системы взломов, описанные выше.\u003c/p\u003e\u003cp\u003eТаким образом я призываю проблемсетеров стараться включать побольше крайних случаев в претесты. Надеюсь, что это поможет Codeforces стать лучше.\u003c/p\u003e\u003c/div\u003e","tags":[]}}