{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1480593486,"rating":21,"authorHandle":"savinova","modificationTimeSeconds":1481119058,"id":48754,"title":"\u003cp\u003eОтчет о деятельности Botan Investments за ноябрь + интервью с тренером команд Мордовского ГУ Натальей Плотниковой\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ ноябре фонд Виктора Шабурова Botan Investments выступил \u003ca href\u003d\"//codeforces.com/blog/entry/48301\"\u003eодним из спонсоров сборов по программированию на базе МФТИ Moscow International Workshop ACM ICPC 2016\u003c/a\u003e, также была оказана финансовая поддержка трем командам (САФУ, СГУ, ТПУ), благодаря которой ребята смогли приехать на сборы.\u003c/p\u003e\u003cp\u003eВ этом месяце в грантовой программе фонда приняли участие преподаватели из 18 университетов. Больше всего студентов пришли на тренировки в Саратовском ГУ (31 активный участник), а больше всего тренировок провели в Саратовском ГУ (тренер Михаил \u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e Мирзаянов) и Мордовском ГУ (тренер Наталья \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/linsierra\" title\u003d\"Specialist linsierra\"\u003elinsierra\u003c/a\u003e Плотникова). А еще к нам присоединился новый вуз — СОГУ им. К. Л. Хетагурова.\u003c/p\u003e\u003cp\u003eВ группе Botan Investments ВК выходят новые посты Михаила \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik\" title\u003d\"Master MikhailRubinchik\"\u003eMikhailRubinchik\u003c/a\u003e Рубинчика. Можно почитать про \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_61\"\u003eосновные соревнования, на которые надо ездить\u003c/a\u003e и \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_65\"\u003eна каких студентов стоит в первую очередь ориентироваться\u003c/a\u003e, посмотреть на \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_71\"\u003eклассификацию АСМщиков с точки зрения тренера\u003c/a\u003e и узнать, \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_79\"\u003eкак работать с каждым из них\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eВ этом месяце мы попросили поделиться опытом Наталью \u003ca class\u003d\"rated-user user-cyan\" href\u003d\"/profile/linsierra\" title\u003d\"Specialist linsierra\"\u003elinsierra\u003c/a\u003e Плотникову — тренера команд Мордовского Государственного Университета (Саранск). \u003c/p\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e   \u003ci\u003e — Расскажите, давно ли Вы занимаетесь тренерской деятельностью. Занимался ли кто-нибудь в университете этим раньше? Насколько в целом развито в Мордовском ГУ движение спортивного программирования, каких успехов обычно добиваются команды? \u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e  Команды нашего университета участвуют в соревнованиях по спортивному программированию с 2004 года. Основное соревнование, в котором принимает участие наш ВУЗ — Четвертьфинал чемпионата мира по программированию ACM ICPC. Поначалу целенаправленной подготовки не проводилось. Команды формировались из студентов старших курсов и аспирантов непосредственно перед соревнованиями. Чуть позже появились кружки по программированию на профильных факультетах. Один из таких кружков как раз застала и я, когда меня впервые позвали в команду для выступления на Четвертьфинале в 2009 и 2010 годах (я тогда уже училась в аспирантуре). Понятно, что без особой подготовки выступили мы средне. Но меня настолько зацепили идея этих соревнований, атмосфера, талантливые программисты вокруг, что я решила вплотную заняться этим вопросом в нашем ВУЗе уже со своим видением стратегий подготовки команд.  С 2011 года я начала проводить тренировки по программированию. Сначала участников было немного, буквально полторы команды. Контингент участников ограничивался студентами моего родного факультета электронной техники. Мы пробовали перо, стабильности в составах команд и стратегии подготовки не было.  В конце 2012 года мы достигли консенсуса с другим профильным факультетом (математики и информационных технологий), и усилиями двух факультетов был создан Центр олимпиадной подготовки по программированию. Мы стали тренировать ребят совместно. Но участников было все еще мало — две ACM команды.  В 2013 году мы подобрали удачный состав для команды Mordovia SU #1, ребята побывали на Летней школе по программированию “Сазанка 2013”, выдержали все мои эксперименты с ежедневными тренировками в сентябре и в октябре успешно выступили на Четвертьфинале ACM ICPC в Саратове. В тот год мы впервые вышли в Полуфинал ACM ICPC. Ребят это очень воодушевило. А вот команда Mordovia SU #2 выступила плохо. В основном из-за того, что внимания ей уделялось меньше. Максимум усилий был приложен для подготовки первой команды. И неминуемо ребята из второй команды разбежались.  В 2014 году ребята из Mordovia SU #1 повторили успех Четвертьфинала уже с дипломом второй степени, снова получили право на участие в Полуфинале, где тоже получили диплом третьей степени.  \u003cbr /\u003e\u003cbr /\u003e В 2015 году один из участников завершил обучение, состав первой команды изменился, и по результатам Четвертьфинала команда Mordovia SU #1 немного просела, тем не менее получив диплом третьей степени. В этом году подтянулась по уровню подготовки Mordovia SU #2. Ребятам не хватило лишь одной задачи до диплома. В 2016 году обе команды завоевали дипломы третьей степени, а Mordovia SU #2 вышли в Полуфинал.  Что касается стратегии тренировок, то мы последние несколько лет придерживаемся следующих принципов: второй  семестр (январь — июнь) проводим в основном тематические тренировки 2-3 раза в неделю, разбираем новые темы в зависимости от уровня подготовки ребят; периодически разбавляем тематические тренировки командными контестами, чтобы ребята не потеряли навык; первый же семестр (сентябрь — декабрь) делаем все наоборот — в основном тренируемся командами, изредка разбирая новые темы; и традиционно мы проводим полтора месяца усиленных тренировок перед Четвертьфиналом; если составы команд обновляются сильно, то тренируемся практически каждый день, если нет, то 3-4 раза в неделю.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e \u003cdiv style\u003d\"width: 100.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/ab/59/ab597927ab69ed431abc97ed02b96ccdd8d730a6.jpg\" style\u003d\"width: 49.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg src\u003d\"/predownloaded/7a/0f/7a0f90044b1b98760fb060e67962e0ce87f304e0.jpg\" style\u003d\"width: 44.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003ccenter\u003e\u003csmall\u003eКоманда Мордовского ГУ на четвертьфинале Южного подрегиона в Саратове\u003c/small\u003e\u003c/center\u003e \u003c/div\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e  \u003ci\u003e— На какие сборы/соревнования обычно ездите?\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e  Кроме этапов Чемпионата Мира наши ребята участвуют в Чемпионате Поволжья по спортивному программированию в г. Самара, “Волга-ИТ” в г. Ульяновск, Открытой олимпиаде КФУ по спортивному программированию в г. Казань. Ежегодно мы отправляем троих студентов на Летнюю школу по программированию “Сазанка” в г. Энгельс, которая проводится Центром олимпиадной подготовки СГУ.  \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003e— Как привлекаете новых студентов? \u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e   До этого года мы брали студентов по рекомендациям преподавателей и по результатам нашей ВУЗовской олимпиады. Иногда сами ребята, которые у нас тренируются, приводили однокурсников, знакомых или друзей. В этом году мы провели мини-кампанию по привлечению студентов к тренировкам, собрали дополнительную группу из студентов младших курсов, которых обучаем основам спортивного программирования. Параллельно выделили старшую группу, в которую входят действующие команды ВУЗа и еще несколько ребят, которые не выступают на соревнованиях, а занимаются для себя.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e \u003c/p\u003e\u003cdiv style\u003d\"width: 100.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/d8/b1/d8b11dd3ea36384b7c33828e99ca01658f396ea4.jpg\" style\u003d\"width: 49.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg src\u003d\"/predownloaded/7d/02/7d02afef5454feff220f52ec9f6fa69c8934c662.jpg\" style\u003d\"width: 49.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003ccenter\u003e\u003csmall\u003eРебята на тренировке по спортивному программированию\u003c/small\u003e\u003c/center\u003e \u003c/div\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 1.0em 1.0em;\"\u003e  \u003ci\u003e— С какими основными трудностями сталкиваетесь?\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e  Основные трудности: - “тонкая настройка” командной работы. Не всегда легко ребятам сработаться, нужно это учитывать при формировании команд. Более того, при работе с умными людьми практически к каждому нужен индивидуальный подход; -  сложности при согласовании расписаний у студентов разных курсов, специальностей и факультетов, особенно во время планирования командных пятичасовых тренировок; - много бумажной волокиты при оформлении командировок (хотя все становится человечней с каждым годом).   \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003e—  Вы проводили тренировки почти все лето — как удалось собрать студентов? Было ли это результативно? \u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e   Ребятам нравится это занятие. Они видят, что есть результаты, хотят развиваться дальше, поэтому  особого сопротивления при планировании тренировок летом я не чувствую. Они понимают, что регулярные занятия без сомнения положительно сказываются на результатах.  К тому же, сейчас я стараюсь брать за основу подход большинства IT-компаний и создавать ребятам комфортные условия для занятий. Опытные команды на тренировках у нас сейчас буквально чувствуют себя как дома, время за решением задач летит незаметно. А когда это так, не особо важно, лето за окном или зима. \u003c/p\u003e\u003c/div\u003e","tags":["botan investments","виктор шабуров"]}}