{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1427403188,"rating":140,"authorHandle":"Nickolas","modificationTimeSeconds":1427579196,"id":17138,"title":"\u003cp\u003eVK Cup 2015 Wild Card Round 1\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eThis round features Picat, a language somewhat similar to Prolog. We tried to make most of our problems convenient to solve using declarative approach.\u003c/p\u003e\u003cp\u003eThe traditional A+B program (A and B are space-separated) looks as follows:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003emain \u003d\u0026gt;\n  A \u003d read_int(),\n  B \u003d read_int(),\n  C \u003d A + B,\n  println(C).\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eThe main source of information about language is \u003ca href\u003d\"http://picat-lang.org/\"\u003ehttp://picat-lang.org/\u003c/a\u003e The contest uses version 0.9. If the official site is not available, you can download archive with the compiler \u003ca href\u003d\"//assets.codeforces.com/files/eaa5e45a2309ed2b.7z\"\u003ehere\u003c/a\u003e, the password is b161bb757645d9f0.\u003c/p\u003e\u003cp\u003eSeveral notes:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u0026quot;compilation error\u0026quot; verdict means that syntax is not valid. In most cases (for example, if your program calls unknown function), the verdict will be \u0026quot;wrong answer\u0026quot;\u003c/li\u003e   \u003cli\u003evariable names must start with an uppercase letter or with underscore\u003c/li\u003e   \u003cli\u003eit is recommended to use %n instead of \\n in printf\u003c/li\u003e   \u003cli\u003edon\u0027t use mip module, it writes debug information to stdout\u003c/li\u003e \u003c/ul\u003e \u003chr /\u003e\u003cp\u003e\u003ca href\u003d\"http://timeanddate.com/worldclock/fixedtime.html?day\u003d28\u0026amp;month\u003d3\u0026amp;year\u003d2015\u0026amp;hour\u003d20\u0026amp;min\u003d0\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003eMarch 28 20:00 (Moscow time)\u003c/a\u003e the first Wild-card round of VK Cup 2015 will take place, and it will be a Surprise Language Round. The rules:\u003c/p\u003e \u003cul\u003e   \u003cli\u003eThere are two parallel rounds happening at once: Wild Card Round 1 and Wild Card Round 1 (Online Mirror). The main round is for teams which have passed VK Cup Qualification. Online mirror is open for everybody (not just VK Cup participants) as an individual competition. Teams which have already advanced to Round 2 can take part in the main round out of competition.\u003c/li\u003e   \u003cli\u003e50 additional places in Round 2 will be awarded to top 50 teams of VK Cup who passed Qualification but didn\u0027t advance to Round 2 from Round 1 (regardless of whether they participated in Round 1).\u003c/li\u003e   \u003cli\u003eThe contest will be \u003cstrong\u003eunrated\u003c/strong\u003e for everybody.\u003c/li\u003e   \u003cli\u003eThe round uses ACM ICPC rules: the standing is defined by the number of solved problems, ties are resolved based on penalty time. Initially the penalty is 0, and for each solved problem it is increased by submission time (since the start of the contest) + 20 minutes for each failed submission. The solution is considered to be correct if it passes all tests from a predefined test set; you know whether the solution is right immediately after sending it. There are no hacks\u003c/li\u003e   \u003cli\u003eThe round has 8-10 problems, sorted by estimated complexity, and runs for 2.5 hours.\u003c/li\u003e   \u003cli\u003eSolutions are accepted \u003cstrong\u003eonly in one language\u003c/strong\u003e, which will be announced at the beginning of the contest. The language really exists, we didn\u0027t invent it for this occasion.\u003c/li\u003e   \u003cli\u003ePlease reread this post at the beginning of the contest: we will announce the language and add instructions to install the compiler (the contest interface will provide an option to run your solutions online) and links to useful manuals (in English). Other than that, learning the language is up to the competitor.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eWe hope that the language we chose will be unknown to most of the competitors. For reference, here is the list of Surprise/Unknown Language Rounds which took place on Codeforces earlier.\u003c/p\u003e \u003ctable\u003e   \u003cthead\u003e     \u003ctr\u003e       \u003cth\u003eRound \u003c/th\u003e       \u003cth\u003eLanguage\u003c/th\u003e     \u003c/tr\u003e   \u003c/thead\u003e   \u003ctbody\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca href\u003d\"/blog/entry/13750\"\u003eSurprise Language Round #7\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e\u003ca href\u003d\"http://progopedia.com/language/false/\"\u003eFALSE\u003c/a\u003e\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca href\u003d\"/blog/entry/8808\"\u003eFriday the 13th, Programmers\u0027 Day\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e\u003ca href\u003d\"http://progopedia.com/language/ada/\"\u003eAda\u003c/a\u003e\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca href\u003d\"/blog/entry/4627\"\u003eSurprise Language Round #6\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e\u003ca href\u003d\"http://progopedia.com/language/roco/\"\u003eRoco\u003c/a\u003e\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca href\u003d\"/blog/entry/4133\"\u003eVK Cup 2012 Wild-card Round 1\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e\u003ca href\u003d\"http://progopedia.com/language/factor/\"\u003eFactor\u003c/a\u003e\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca href\u003d\"/blog/entry/3929\"\u003eSurprise Language Round #5\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e\u003ca href\u003d\"http://progopedia.com/language/cobol/\"\u003eCOBOL\u003c/a\u003e\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca href\u003d\"/blog/entry/3214\"\u003eUnknown Language Round #4\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e\u003ca href\u003d\"http://progopedia.com/language/befunge/\"\u003eBefunge\u003c/a\u003e\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca href\u003d\"/blog/entry/2359\"\u003eUnknown Language Round #3\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e\u003ca href\u003d\"http://progopedia.com/language/pike/\"\u003ePike\u003c/a\u003e\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca href\u003d\"/blog/entry/1535\"\u003eUnknown Language Round #2\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e\u003ca href\u003d\"http://progopedia.com/language/io/\"\u003eIo\u003c/a\u003e\u003c/td\u003e     \u003c/tr\u003e     \u003ctr\u003e       \u003ctd\u003e\u003ca href\u003d\"/blog/entry/1316\"\u003eUnknown Language Round #1\u003c/a\u003e \u003c/td\u003e       \u003ctd\u003e\u003ca href\u003d\"http://progopedia.com/language/tcl/\"\u003eTcl\u003c/a\u003e\u003c/td\u003e     \u003c/tr\u003e   \u003c/tbody\u003e \u003c/table\u003e\u003cp\u003eGood luck!\u003c/p\u003e \u003chr /\u003e\u003cp\u003eThe contest is over; congratulations to the winners! The editorial is available \u003ca href\u003d\"/blog/entry/17177\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["vkcup2015","surprise language round","unknown language round"]}}