{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1474382391,"rating":0,"authorHandle":"zscoder","modificationTimeSeconds":1474468025,"id":47236,"title":"\u003cp\u003eIOI 2017 Malaysia Training Group\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi all,\u003c/p\u003e\u003cp\u003eI will upload problems (mostly from CF anyway, but sorted by difficulty/topic) here regularly for practice purposes. I\u0027ll probably compile them into mashup contests as well and upload it here and you can treat it as an actual contest. (either join it during contest time/use virtual participation) There\u0027ll be a rating system too, though I\u0027m not really sure how it works XD\u003c/p\u003e\u003cp\u003eHope you will learn something from these trainings :)\u003c/p\u003e\u003cp\u003eP.S. Warmup + Testing Round is up for really trivial warmups\u003c/p\u003e\u003cp\u003eP.S. Please check the contests section regularly for new contests as I\u0027ll probably not announce them here.\u003c/p\u003e\u003cp\u003eUPD :\u003c/p\u003e\u003cp\u003eThere will be \u003cspan class\u003d\"tex-span\"\u003e4\u003c/span\u003e types of practice contests (if possible, use virtual participation to get \u0026quot;rated\u0026quot; in group and appear on standings :) )\u003c/p\u003e\u003cp\u003eCode it Fast! : Extremely Short Contest consisting of easy problems on CF. The idea of this is to get used to coding simple problems fast and accurately (very important when you join most online contests!)\u003c/p\u003e\u003cp\u003eFormat (subject to change) : 60 minutes, 3 — 4 problems, current level is around Div. 2 A — Div. 2 B difficulty.\u003c/p\u003e\u003cp\u003eRegular Contest : Not sure about what difficulty this is yet (maybe slightly easier than a normal Div 2 Round) This contest will be harder than Code it Fast! and you can probably learn new techniques here. (and practice on old techniques)\u003c/p\u003e\u003cp\u003eFormat (subject to change) : 2 hours, 4 — 6 problems, 1 Div. 2 A, 1 Div. 2 B, 2 Div. 2 C, 1 Div. 2 D (or something around that)\u003c/p\u003e\u003cp\u003eTopic Training : The contest will be based on problems related to a specific topic (will be stated in title)\u003c/p\u003e\u003cp\u003eFormat (subject to change) : 3 days, 3 — 5 problems related to specific topic (sorted from easy to hard)\u003c/p\u003e\u003cp\u003eLong Challenge : This contest will be open (officially) for a long time (maybe a week or so) containing easy problems to harder problems. This contest might contain challenging problems that is meant to help you learn new techniques.\u003c/p\u003e\u003cp\u003eNote : The difficulty might increase from time to time so that you can deal with harder problems faster.\u003c/p\u003e\u003cp\u003eFormat (subject to change) : 1 week (or more), 6 — 8 problems from Div. 2 C to easy Div. 1 D/E (maybe)\u003c/p\u003e\u003c/div\u003e","tags":[]}}