{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1401948487,"rating":74,"authorHandle":"RodionGork","modificationTimeSeconds":1401948487,"id":12556,"title":"\u003cp\u003eMy site for grey coders — CodeAbbey\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"http://www.codeabbey.com\"\u003eCodeAbbey\u003c/a\u003e — is the site which I\u0027m building in my spare time. It is basically a problem set targeted for beginner programmers.\u003c/p\u003e\u003cp\u003eHope you\u0027ll like its archaic design yelling \u0026quot;bring back the internet of mid 90-s!!!\u0026quot; — just a joke, probably I\u0027ll be able to improve it in future :)\u003c/p\u003e\u003cp\u003eFunctionality is after the manner of ProjectEuler:\u003c/p\u003e \u003cul\u003e   \u003cli\u003euser reads the problem statement;\u003c/li\u003e   \u003cli\u003ealong with it he/she receives input data (usually randomized);\u003c/li\u003e   \u003cli\u003ethese data should be processed (so usually user will write some program) to get answer;\u003c/li\u003e   \u003cli\u003eanswer is submitted along with source code (this is optional) and checked by server.\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eUsers are ranked according to number of problems solved (more precisely according to sum of points gained for these problems).\u003c/p\u003e\u003cp\u003eAfter solving the problem one can see other people\u0027s solutions, and probably, can learn something from them.\u003c/p\u003e\u003cp\u003eAmong the recent additions there were two new classes of problems — \u003ca href\u003d\"http://www.codeabbey.com/index/task_list/brainfuck-puzzles\"\u003ebrainfuck puzzles\u003c/a\u003e which require user to submit valid brainfuck code which is tested on server — and \u003ca href\u003d\"http://www.codeabbey.com/index/task_list/challenges\"\u003echallenges\u003c/a\u003e for which users can gain less or more points depending on how optimal the answer is.\u003c/p\u003e\u003cp\u003eI would be glad to receive ideas / suggestions or criticism — and even more I would be glad to cooperate in some way with authors of programming related blogs or people who like inventing problems and puzzles.\u003c/p\u003e\u003c/div\u003e","tags":["problemset","site","side-project"]}}