{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1422260398,"rating":3,"authorHandle":"magieNoire","modificationTimeSeconds":1422297218,"id":16022,"title":"\u003cp\u003eWeekly Training \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e-- This Post was originally posted in another group, and I thought of doing the same here and merge people from both sides, I am the author of it and I just started the idea few days ago --\u003c/p\u003e\u003cp\u003eHello everyone, I though of starting a weekly training program with the collaboration of everyone. Each week, we will assign around 10 interesting problems on a specific topic (e.g: data structure, graph problems, ...). Then, at the end of each week we share our solutions.\u003c/p\u003e\u003cp\u003eWhat do you think ?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD\u003c/strong\u003e: We will be doing contests every week. Try to post your free time slots during the week. Also those of you who are interested in the weekly problems, Suggest the topics you would like to see.\u003c/p\u003e\u003cp\u003eAs Far as I am concerned I would like to see this topics:\u003cbr /\u003e + Dynamic Programming\u003cbr /\u003e + Data Structures\u003cbr /\u003e + Mathematics\u003cbr /\u003e + Combinatorial Games\u003cbr /\u003e + String Problems\u003cbr /\u003e + Graph Problems\u003cbr /\u003e + Shortest Path Problems\u003cbr /\u003e + Network Flow Problems\u003cbr /\u003e\u003c/p\u003e\u003cp\u003ePlease add yours into the comments.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD 2:\u003c/strong\u003e I created a google sheet for interested people: \u003ca href\u003d\"https://docs.google.com/spreadsheets/d/1hoX_cUksscw71crrYRr_0ZZv9KSrnzid-eaoqt4rh68/edit?usp\u003dsharing\"\u003elink\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNOTE:\u003c/strong\u003e Try to visit this page as frequently as you can. I may create a Facebook group or something similar to facilitate communication later.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNOTE 2:\u003c/strong\u003e If you know interested people let them join -- They should add their names into the sheet and I\u0027ll add them to the group later. In order not miss them, tell them to append a \u0027*\u0027 after their names.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNOTE 3:\u003c/strong\u003e If someone have preferences with whom he wants to create a group write their name on the sheet. I added necessary columns.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNOTE 4:\u003c/strong\u003e Try to share your ideas for the training (source of problems, contests, ...) The goal is to make the training as excellent as we can. Problems should not necessary be on codeforces, any platform can be used as long as the problem is good in quality.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNOTE 5:\u003c/strong\u003e we will try to start in 3 days. Time to get more members and prepare for first round.\u003c/p\u003e\u003c/div\u003e","tags":[]}}