{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1407764228,"rating":44,"authorHandle":"yash.15296","modificationTimeSeconds":1407765601,"id":13363,"title":"\u003cp\u003eMy experience at MemSQL Round 2 Online\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eBefore start\u003c/strong\u003e(t\u0026lt;0): \u003cstrong\u003e\u0026quot; If I manage to solve even one problem, then I will get into Div 1 \u0026quot;\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e0:05 :\u003c/strong\u003e After reading first problem,\u0026quot; \u003cem\u003eeasy!\u003c/em\u003e \u0026quot;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e0:15 :\u003c/strong\u003e Then found the relation phi^n\u003dphi^(n-1)+phi^(n-2)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e0:20 :\u003c/strong\u003e Then found that series grows fibonacci to 10^5 terms.\u003c/p\u003e\u003cp\u003eReminder : \u003cstrong\u003eDont submit in this contest. Rating will free fall.\u003c/strong\u003e continue!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e0:35\u003c/strong\u003e \u003cstrong\u003e:\u003c/strong\u003e \u003cem\u003e\u0026quot; ... maybe that\u0027s why this problem is 1000 and not 500\u0026quot;\u003c/em\u003e Move on to problem 2!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e0:45 :\u003c/strong\u003e \u003cem\u003e\u0026quot;i am not able to understand the question\u0026quot;.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eThen I checked the standings and found that tourist had solved the third and not second.\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u0026quot;Probably 2nd is also hard. Lets see the third problem\u0026quot;\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e0:55 :\u003c/strong\u003e \u003cem\u003e\u0026quot;Third one is algorithm based (probably dp+greedy+...). I should focus on second\u0026quot;\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e1:15\u003c/strong\u003e \u003cstrong\u003e:\u003c/strong\u003e \u003cem\u003e\u0026quot;Finally I think of a \u0027solution\u0027: find the lighter table and move it to maximum element of heavier table and then see for remaining elements on heavy table whether they would go to max element or invite the other table. I believe this is a very good solution and this will \u003cem\u003esurely\u003c/em\u003e pass!\u0026quot;\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e1:25 :\u003c/strong\u003e wrong answer on pretest 4\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u003cstrong\u003e\u0026quot;That was why they warned! Dont try to be too smart...\u0026quot;\u003c/strong\u003e\u003c/em\u003e Now I had fallen into trap!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e1:35 :\u003c/strong\u003e \u003cem\u003e\u0026quot;Probably the numbers would have overflowed. This is the only problem that can be solved. So lets try to write it in python!\u0026quot;\u003c/em\u003e\u003c/p\u003e\u003cp\u003eI had \u003cstrong\u003enever\u003c/strong\u003e done more than hello world in python, but had seen a few codes!\u003c/p\u003e\u003cp\u003eWith great difficulty I managed to translate it in 40 minutes after scores of runtime errors during the random inputs. (Too bad that only error in py is runtime error, even if it is because of using an undeclared variable)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e2:15 :\u003c/strong\u003e Again the same result! wrong answer on pretest 6.\u003c/p\u003e\u003cp\u003eNow I did not try to find the error. I had just translated a code from c++ to python!\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u0026quot;Okay I am not getting the problem B but i know that overflow is the problem in A. So I will try to get the pretests passed and then \u003cstrong\u003ehack\u003c/strong\u003e!!\u0026quot;\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e2:25 :\u003c/strong\u003e Pretest failed. wrong answer on pretest 9.\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u0026quot;No problem! Lets write it in python!!\u0026quot;\u003c/em\u003e (Maybe it will treat large fibonacci numbers as normal ones)\u003c/p\u003e\u003cp\u003eThis time I translated in 20 minutes!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e2:45 :\u003c/strong\u003e runtime error on pretest 4\u003c/p\u003e\u003cp\u003eOn first day of python, I guess it is hard to find the cause of runtime errors, especially when you dont know the case causing it. I had no time left to continue this sorry tale and finally decided to stop it.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ebreak;\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAfter contest\u003c/strong\u003e (t\u0026gt;3:00):\u003c/p\u003e\u003cp\u003eNext day I checked my submissions. Runtime error was on 0 0 input. I felt that trivial correction would give me AC. I got TLE. \u003c/p\u003e\u003cp\u003e...\u003c/p\u003e\u003cp\u003e\u003cem\u003e[excuse]\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u0026quot;Probably that warning ruined the confidence for this contest.\u0026quot;\u003c/em\u003e \u003c/p\u003e\u003cp\u003e\u003cem\u003e[/excuse]\u003c/em\u003e\u003c/p\u003e\u003cp\u003e...\u003c/p\u003e\u003cp\u003e\u003cem\u003e[optimism]\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u0026quot;OK. Does not matter. Keep working. Future would be better!(hopefully)\u0026quot;\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u0026quot;This contest was not meant for me. At least I stood up and tried my best (nearly)\u0026quot;\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAt least I had learnt the basic python syntax quite fast!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e[/optimism]\u003c/em\u003e\u003c/p\u003e\u003cp\u003eThats it for now! ...\u003c/p\u003e\u003c/div\u003e","tags":["memsql","experience"]}}