{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1458061596,"rating":144,"authorHandle":"tweety","modificationTimeSeconds":1458593899,"id":43815,"title":"\u003cp\u003eIs university degree important?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e                              \u003c/p\u003e\u003cp style\u003d\"margin-bottom: 0.14in;\"\u003eI was going to write a short post asking you about your opinion on the importance of university degree but ended up writing a really long text about the education system in my country, and I don\u0027t want to delete so if you don\u0027t want to read much please skip to the last paragraph.\u003c/p\u003e \u003cp style\u003d\"margin-bottom: 0.14in;\"\u003eNext year is going to be my last in high school so I was thinking about attending university. The universities where I live (in Syria) are really bad.\u003c/p\u003e \u003cp style\u003d\"margin-bottom: 0.14in;\"\u003eIn the city where I live (which is the capital) there is one very bad (but free!) public university and couple other much worse private universities. Before I tell you how bad they are let me first start by telling you how terrible the application process is here.\u003c/p\u003e \u003cp style\u003d\"margin-bottom: 0.14in;\"\u003eThere is a final exam by the end of the last year in high school which decides what universities you can get into. There\u0027s one school book set that is taught in every single school of the country. Schools can\u0027t teach other book sets by law. The school exams test your ability on memorizing what\u0027s written in the books rather on your understanding. \u003c/p\u003e \u003cp style\u003d\"margin-bottom: 0.14in;\"\u003eFor example, in the English exam there is a task to write a paragraph. The teacher tells us beforehand what the subject of the paragraph is going to be and writes a sample paragraph on the board. Everyone copies it and memorizes it, then writes it on the exam in the exact same way their teacher wrote. Of course you can write your own paragraph, but it\u0027s more guaranteed to write the one that our teacher gave us since our teacher himself is not good enough at English for grading your paragraph (although they think they are).\u003c/p\u003e \u003cp style\u003d\"margin-bottom: 0.14in;\"\u003e In mathematics exams they copy the exact tasks from our school books and just change variables. I don\u0027t know anyone in my school who\u0027s good at maths, they all memorize the solutions for all problems and they are only trained to be adaptable with variable changes. I was once proud of myself for solving a relatively hard problem in the exam then after the exam I realized that the exact same task was featured in our book.\u003c/p\u003e \u003cp style\u003d\"margin-bottom: 0.14in;\"\u003eOn the biology exam there comes a question and you have to answer it \u003ci\u003eexactly \u003c/i\u003eas it\u0027s answered in the book. If you only change the context but keep the meaning you might lose marks. (I know you may not believe me but it\u0027s really like this, you can ask any Syrian and they\u0027d tell you the same)\u003c/p\u003e \u003cp style\u003d\"margin-bottom: 0.14in;\"\u003eThe final school exams are made in like manner. The problem is in how important they are despite how wrong they are made. Your high grade is the only ticket to get you into the university. There are minimal grades (limits) for each faculty. For example, for Medicine you have to have a grade higher than 98%, for Computer Science 95%, Civil Engineering 92%. Yes as you see facilities are as if ranked from what they think is best to what they think is worse. Some of facilities that require lowest grades are Fine Arts, Biology and Philosophy. The university won\u0027t hear you story, nor will they hear anything from you. They only look at your grades. That leads to kids only aiming for Medicine Studies. You (almost) won\u0027t find any freshman in Computer Science studying his degree for having passion in it. They will be studying it because they weren\u0027t able to achieve a higher grade for Medicine (and I guess that is one of the reasons behind the very low number of competitive programmers in Syria).\u003c/p\u003e \u003cp align\u003d\"LEFT\" style\u003d\"margin-top: 0.19in;margin-bottom: 0.19in;line-height: 115.0%;\"\u003e When it comes to the educational system in our universities, they pretty much lack of the same problems of schools. It\u0027s all about memorizing stuff for the exams. I won\u0027t judge any faculty other than Computer Science since I only have friends from that facility, but from what they told me they don\u0027t really learn anything there, they learn everything by themselves from the Internet.\u003c/p\u003e \u003cp align\u003d\"LEFT\" style\u003d\"margin-top: 0.19in;margin-bottom: 0.19in;line-height: 115.0%;\"\u003e I can try admitting to universities abroad, but I guess it\u0027s going to be really hard especially considering our very low budget. But even if I could, is really worth it? From what I see you can learn pretty much everything you need from the Internet. The only thing that would interest me in the university (as of what I\u0027m thinking right now) is the ACM-ICPC (especially since it\u0027s really easy to qualify from our region due to the small amount of skilled participants :D). But then comes the importance of getting a university degree for applying for jobs. But wouldn\u0027t experience (say if I spent 4 years working on a project instead of attending a university) be more worthy than the degree?\u003c/p\u003e\u003c/div\u003e","tags":[]}}