{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1436547615,"rating":14,"authorHandle":"RodionGork","modificationTimeSeconds":1436548296,"id":19158,"title":"\u003cp\u003eMy first cheater and sources comparison\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI\u0027m so pleased — I have first great cheater at my site CodeAbbey. Well... damn! This fellow was not lazy — he copied and slightly refactored about 125 solutions (I believe, shared by his colleague) — and then asked for certificate. Why he want it — no idea! It is not certificate by Oracle or Microsoft. Anyway he spent about 3 weeks and see how it looks like:\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/qtqu6att\"\u003eoriginal source\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/d9yFzZSy\"\u003esource pretending to look different\u003c/a\u003e\u003c/p\u003e\u003cp\u003e(And probably it is only my imagination — their similarity?)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWell, jokes aside — I have a trouble\u003c/strong\u003e — this time it was easy enough to find cheating since there are not too many users — and only few dozens top-users. But if such cases will repeat when there are more people... I may want some automated comparison of sources.\u003c/p\u003e\u003cp\u003eCurrent idea — I can calculate certain metrics / hashes over the solution and save them along with it. They can be, well, amounts of puncuation symbols, operator symbols etc. And when I need to check the user — we would find few with the closest set of metrics. Something like Locality-Sensitive Hashing. But I before trying to experiment with this blindly I decided to ask clever community — perhaps some people already have worked with similar tasks and could hint on some good ideas to look at / learn from?\u003c/p\u003e\u003cp\u003eI believe, for example, that CF administration have their own tools — but as one wise colleague suggested, they probably are not going to share their know-how to avoid sharing secrets with cheaters at the end... :o\u003c/p\u003e\u003c/div\u003e","tags":["text","comparison","cheating"]}}