{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1483030863,"rating":77,"authorHandle":"kingofnumbers","modificationTimeSeconds":1483030863,"id":49396,"title":"\u003cp\u003eInvitation to ACM-ICPC Asia — India Final 2016 Onsite Mirror Contest.\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello CodeForces Community!\u003c/p\u003e\u003cp\u003eAfter a series of four ICPC regionals in India (Amritapuri, Chennai, Kharagpur, Kolkata), the top teams from the respective regionals have been shortlisted and they will now compete at the final leg of the ACM ICPC Asia India regionals — ACM ICPC India Final 2016. Over 90 top teams have geared for the Final which makes it an exciting battle to watch. My best wishes to all the teams who are competing tomorrow.\u003c/p\u003e\u003cp\u003eFurther, I would like to invite you all to the parallel mirror contest which will be take place at \u003ca href\u003d\"https://www.codechef.com/INF16MOS\"\u003eACM-ICPC Asia — India Final Onsite Mirror Contest\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eFor those who are preparing for the ICPC onsite regionals this would serve as an ideal platform to practice as it would simulate the real onsite contest.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eContest Details\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTime:\u003c/strong\u003e 30th December 2016 (1100 hrs) to 30th December 2016 (1600 hrs). (Indian Standard Time — +5:30 GMT) — Check your \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dACM-ICPC+Asia-India+Final+Onsite+Mirror+Contest+2016\u0026amp;iso\u003d20161230T11\u0026amp;p1\u003d44\u0026amp;ah\u003d5\"\u003etimezone\u003c/a\u003e. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eContest link:\u003c/strong\u003e \u003ca href\u003d\"https://www.codechef.com/INF16MOS\"\u003ehttps://www.codechef.com/INF16MOS\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRegistration:\u003c/strong\u003e You just need to register as a Team on CodeChef. For all those, who are interested and do not have a CodeChef handle, are requested to \u003ca href\u003d\"https://www.codechef.com/signup\"\u003eregister\u003c/a\u003e in order to participate.\u003c/p\u003e\u003cp\u003eGood Luck! Hope to see you participating!!\u003c/p\u003e\u003cp\u003eNote: The mirror contest will run in parallel to the main contest with an hour delay. \u003c/p\u003e\u003c/div\u003e","tags":[]}}