{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1523054190,"rating":248,"authorHandle":"MakeRussiaGreatAgain","modificationTimeSeconds":1523056795,"id":58776,"title":"\u003cp\u003eLet\u0027s promote Codeforces among Google Code Jam participants\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi all!\u003c/p\u003e\u003cp\u003eSoon thousands of people will participate in Google Code Jam \u003ca href\u003d\"/blog/entry/58775\"\u003equalification round\u003c/a\u003e. There is a problem though: Code Jam website doesn\u0027t offer a good place to discuss the problems afterwards. There is an \u003ca href\u003d\"https://groups.google.com/group/google-code/subscribe\"\u003eofficial Google group\u003c/a\u003e, but it is a poor place for discussion: not only is it premoderated, but they also reject/delete useful posts, like \u003ca href\u003d\"/blog/entry/54398\"\u003ethis one\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThere is a solution: point people at Codeforces, the best place to discuss programming competitions! If we just start posting messages about Codeforces to the Google group, they will probably delete them. But there is something else that people (sometimes) read: your code. For many years, Code Jam allowed anyone to read any participant\u0027s code after the contest. While the current system doesn\u0027t support this yet, this is something that Code Jam team is willing to resolve. So, my idea is for as many people as possible to add a comment like this to every Code Jam submission:\u003c/p\u003e \u003cpre\u003e\u003ccode\u003e// Discuss this problem on Codeforces: http://codeforces.com/\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eOr better, use a link to a post about the specific round. This way, those who try to learn by looking at other\u0027s code will find out about Codeforces, which is good.\u003c/p\u003e\u003cp\u003eDo you have any similar ideas?\u003c/p\u003e\u003c/div\u003e","tags":["gcj","idea"]}}