{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1517332528,"rating":279,"authorHandle":"pllk","modificationTimeSeconds":1517332528,"id":57445,"title":"\u003cp\u003eGuide to Competitive Programming and CSES Problem Set\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eAlmost a year ago, I released an \u003ca href\u003d\"//codeforces.com/blog/entry/50728\"\u003eonline competitive programming book\u003c/a\u003e. Since then, the book has been downloaded over 500,000 times, and many people are already using it to learn competitive programming. I have also received a large amount of feedback, which has greatly improved the quality of the book. Thank you!\u003c/p\u003e\u003cp\u003eNow I have some news regarding the book. First, there is now a printed version of the book available with the title \u003cem\u003eGuide to Competitive Programming\u003c/em\u003e, published by Springer. So if you want to buy a printed book and support my work, you can do it now. The book is available, for example, through \u003ca href\u003d\"http://www.springer.com/us/book/9783319725468\"\u003eSpringer\u003c/a\u003e and \u003ca href\u003d\"https://www.amazon.com/Guide-Competitive-Programming-Algorithms-Undergraduate/dp/3319725467\"\u003eAmazon\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/2b/55/2b5528a6b3520fe82a5322bb7a9c024a1fc5ad03.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eHow is the printed book different from the online book? Well, they are actually two different books. I have rewritten and restructured many parts of the book, and also added new material. The printed book discusses a selection of more advanced topics, such as suffix arrays, treaps, dynamic programming optimization, and parallel binary search. You can find a detailed table of contents \u003ca href\u003d\"http://www.springer.com/cda/content/document/cda_downloaddocument/9783319725468-t1.pdf?SGWID\u003d0-0-45-1629358-p181292368\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eNote that the online version of the book will be freely available both now and in the future.\u003c/p\u003e\u003cp\u003eThen, there is also a new problem set called \u003cem\u003eCSES Problem Set\u003c/em\u003e. It contains a collection of problems which can be used to practice the techniques explained in the books. The first version of the problem set is available \u003ca href\u003d\"https://cses.fi/problemset/\"\u003ehere\u003c/a\u003e. New problems will be added every now and then; the goal of the problem set is to contain a comprehensive collection of \u0026quot;standard\u0026quot; competitive programming problems.\u003c/p\u003e\u003c/div\u003e","tags":["competitive programming","book","problemset"]}}