{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399521399,"rating":0,"authorHandle":"kofhearts","modificationTimeSeconds":1399566704,"id":12234,"title":"\u003cp\u003ehelp with dp equation\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003ehello everyone,\u003c/p\u003e\u003cp\u003eI am having trouble understanding 3 dimensional dp. I can understand 2 dimensional dp but i am having trouble coming up with the objective function for this dp. Can someone please explain me what the state function will be like? I know the i, j position of the matrix will be two variables and the third variable will be remainder but i don\u0027t get how these three variables can be used to obtain the transition equation. I am especially having problem understanding dp with mod operation like this. I appreciate any help!\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"//codeforces.com/contest/41/problem/D\"\u003ehttp://codeforces.com/contest/41/problem/D\u003c/a\u003e\u003c/p\u003e\u003cp\u003eI will summarize the problem.\u003c/p\u003e\u003cp\u003eSuppose there is a grid with number of coins in each cell.\u003c/p\u003e\u003cp\u003e1 2 3\u003c/p\u003e\u003cp\u003e4 5 6\u003c/p\u003e\u003cp\u003e7 8 9\u003c/p\u003e\u003cp\u003eThere is a pawn in the bottom most row. Now the pawn can move either top right (eg.suppose if the pawn is at 8 he can move to 6(top right)) or top left(eg.suppose if the pawn is at 8 he can move to 4(top left)). The goal is to reach the top most row. Here is one way to do so. 8, 4, 2. Now we add all the coins that we received while landing to a cell. \u003c/p\u003e\u003cp\u003eThe goal is to maximize this sum. The pawn has to start from the bottom most row and we can start from any cell from that row. \u003c/p\u003e\u003cp\u003eIf this was the only question then i think it is straight forward 2 dimensional dp but the twist is that the maximum sum also has to be divisible by k. So, if s is the sum then s % k has to be 0. \u003c/p\u003e\u003cp\u003eI\u0027d appreciate if anyone can explain to me the 3d dp solution. I don\u0027t seem to understand dp with mods. Thanks!\u003c/p\u003e\u003c/div\u003e","tags":["dp"]}}