{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1478709841,"rating":3,"authorHandle":"svineet","modificationTimeSeconds":1478709841,"id":48302,"title":"\u003cp\u003eKefa and Park wrong answer with DFS\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi,\u003c/p\u003e\u003cp\u003eI tried to solve this question: \u003ca href\u003d\"//codeforces.com/problemset/problem/580/C\"\u003eProblem\u003c/a\u003e using a DFS procedure with an extra variable recording the number of consecutive cats we have seen till now.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://paste.fedoraproject.org/476481/78707534/\"\u003eCode\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThis code returned Wrong answer on test case 9. I cannot find test cases for which this solution returns wrong answer. I also tried converting variables to long long in case int was overflowing, but no luck. After some thought I realized there could be a scenario in the problem where visiting a node \u0026quot;cleanses\u0026quot; us of all cats seen. Then we could go back through the parent to the other leaves, with a reduced m.\u003c/p\u003e\u003cp\u003eI implemented it this way: \u003ca href\u003d\"http://paste.fedoraproject.org/476496/14787095/\"\u003eCode\u003c/a\u003e\u003c/p\u003e\u003cp\u003eI basically record the best \u003ccode\u003ecats_seen\u003c/code\u003e that has been obtained till now and if we can beat that we visit the node again. However this too returns WA on test case 9.\u003c/p\u003e\u003cp\u003ePlease help me debug this.\u003c/p\u003e\u003cp\u003eAlso, general question, till what constraint (of n) is recursive DFS feasible? Meaning it won\u0027t cause a stack overflow? I\u0027m not sure where to find help debugging my solutions, so I\u0027m posting it on my blog. Please do give me a link if there\u0027s a dedicated place for this, because it would be really nice to have one.\u003c/p\u003e\u003c/div\u003e","tags":["dfs and similar","#363 (div. 2) c","help needed"]}}