{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1464110122,"rating":212,"authorHandle":"gKseni","modificationTimeSeconds":1464110122,"id":45039,"title":"\u003cp\u003eУниверситет ИТМО рассказывает об Андрее Станкевиче\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eТренер Университета ИТМО по спортивному программированию Андрей Станкевич, с которым студенты ИТМО на протяжении 15 лет становятся чемпионами и призерами ACM ICPC, стал обладателем престижной награды ACM ICPC Senior Coach Award. Международная Ассоциация вычислительной техники не первый раз высоко оценивает вклад петербургского преподавателя в развитие отрасли: на его счету международная премия ACM ICPC Founder’s Award за участие в организации олимпиад программистов в Европе. \u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://www.ifmo.ru/ru/viewnews/5663/pyatnadcat_let_pobed_andrey_stankevich_obladatel_nagrady_ACM_ICPC_Senior_Coach_Award.htm#ixzz49Valb3Kn\"\u003eУниверситет ИТМО вспомнил\u003c/a\u003e самые значимые достижения Андрея Станкевича и получил теплые отзывы о нем от его коллег и студентов, которые называют его на английский манер «Эндрю».\u003c/p\u003e\u003ccenter\u003e \u003cbr /\u003e \u003cimg src\u003d\"/predownloaded/21/49/21496107c9d5a070407b2b0f17881cc4015ec408.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003c/center\u003e Как вспоминает заведущий кафедрой технологии программирования Анатолий Шалыто, талант Андрея Станкевича раскрылся в последние годы обучения в совершенно обычной общеобразовательной школе, когда он неожиданно для многих получил диплом первой степени на Всероссийской олимпиаде школьников по программированию. Позже, во время учебы в Университете ИТМО, куда он поступил благодаря своей победе, он стал призером чемпионатов мира по программированию 2000 и 2001 годов. В те же годы он вошел в число стипендиатов Президента России, а в 2003 году ему была присуждена президентская премия в области образования. По окончании вуза Андрей Станкевич сам стал преподавателем и тренером, вскоре под его руководством начались крупные победы университетских команд на всемирном чемпионате ACM ICPC. Как известно, сборная Университета ИТМО шесть раз выигрывала кубок чемпионов – тренировкам ребят 34-летний Андрей Станкевич посвятил почти половину своей жизни. Помимо Международной ассоциации вычислительной техники, его труд отметила и корпорация IBM, которая в 2008 году наградила его специальной премией за успехи в тренерской работе.\u003cp\u003eАндрей Станкевич также посвящает немалую часть своего времени олимпиадам по программированию для школьников и студентов не только Северной столицы, но и всей России. Он составляет задачи, занимается организацией и является председателем жюри крупных конкурсов городского и федерального масштаба вот уже более пятнадцати лет.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e«Ребята верят в себя благодаря ему – вот секрет успеха», – Анатолий Шалыто, профессор, заведующий кафедрой технологии программирования\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eПомню, на следующий же день после победы на ACM ICPC в 2013 году он поехал на Летнюю компьютерную школу. Согласитесь, не каждый после триумфальной победы поедет учить ребят. Прощаясь, он попросил меня не звонить ему после десяти вечера, объяснив, что будет укладывать детей спать! Я уверен, что профессора и доценты MIT не укладывают спать своих подопечных. Именно поэтому его команды выигрывают: не только из-за невероятного таланта каждого студента, но и благодаря такому отношению к ним.\u003c/p\u003e\u003cp\u003eЕсли человек добивается таких успехов, то и следующее поколение верит, что они смогут этого добиться. Чем больше его личные успехи, тем больше сами парни уверены, что станут чемпионами мира. Благодаря школе Станкевича у нас появился и Гена Короткевич, за которым пришло человек сорок безмерно талантливых и одаренных ребят.\u003c/p\u003e\u003cp\u003eБлагодаря ему на кафедру компьютерных технологий идут амбициозные и талантливые студенты, которых привлекают его имя и талант. Но, к сожалению, он не воспитывает себе замену. Да, нам многие помогают, но он – настоящий уникум, совершенно незаменимый человек. Кто будет столько работать? Кто имеет столько опыта? Нет второго такого талантливого. Словом, второго Станкевича у нас нет.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e«Отличный коллега и надежный друг», – Лидия Перовская, тьютор кафедры компьютерных технологий\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eКогда я поступила в Университет ИТМО в 2007 году, про то, что дискретную математику и алгоритмы будет вести Андрей Станкевич, знала уже давно. Тогда три моих близких друга и одноклассника тренировались у него уже три года, участвовали в олимпиадах, обращались к нему на «ты» и дружески называли его Эндрю. Кажется, Станкевич тогда принимал у нашей группы вступительный проект (тогда порядок поступления в вуз был иным), и все были на нервах – сам Станкевич пришел нас послушать!\u003c/p\u003e\u003cp\u003eС первого по третий курс пары Андрея считаются не только самыми важными в курсе обучения, но и самыми интересными. Всегда можно было обратиться за дополнительным разъяснением, при этом каждый выход к доске становился серьезной проверкой знаний. Помню, только начав участвовать в организации олимпиад, я путалась, как же правильнее обращаться к Андрею Станкевичу: по имени-отчеству, на «вы» или на «ты». Только сейчас понимаю, что он преподавал мне, когда ему было всего 26 лет, – сам еще «вчерашний» студент. Его открытость уже тогда позволяла легко и комфортно общаться с ним на любые внеучебные темы. Когда я стала работать в Университете ИТМО, совместных проектов и поводов для общения стало больше. И сейчас я точно знаю, что Андрей Сергеевич Станкевич – не только отличный коллега, но и мой надежный друг.\u003c/p\u003e\u003cp\u003eАндрей всегда был примером для подражания: дисциплинированный, отдающий себе отчет, знающий, но что еще более важно – умеющий эти знания передавать. У него всегда получается не только собирать вокруг себя дружную и преданную команду из олимпиадников, но и делать ребят стойкими к жизненным трудностям – переездам, напряженному труду. Студенты младших курсов увлеченно тренируются и составляют задачи для школьников, старшие – выигрывают чемпионаты и преподают. Все эти процессы отлажены, надежны и кажутся чем-то само собой разумеющимся. Только после нескольких лет совместной работы становится понятно, каких усилий стоила такая виртуозная стабильность.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e«Он научил меня бороться до конца», – Дмитрий Абдрашитов, чемпион мира по программированию 2008 года\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eАндрей сыграл в моей жизни очень значимую роль. Однажды, еще в школьные годы, я очень неудачно написал теоретический тур городской олимпиады по информатике, и для выхода на следующий этап мне не хватало каких-то жалких двух очков. Андрей был членом жюри, и на апелляции результатов теоретического тура я попал именно к нему. Совместными усилиями мы нашли в моей работе часть, которая была оценена неправильно, и в следующий тур я все-таки попал. Возможно, именно благодаря Андрею, когда у меня в жизни возник выбор между физикой и информатикой, в которых я разбирался одинаково хорошо, свое предпочтение я отдал последней.\u003c/p\u003e\u003cp\u003eОчень важная вещь, которой меня научил Андрей, – бороться до конца. Очень часто к концу соревнования, когда становится очевидно, что за оставшиеся несколько минут ты не успеешь дописать решение, возникает соблазн смириться и расслабиться. Но Андрей всегда заставлял выкладываться до последней секунды. Однажды он продемонстрировал это на собственном примере. В заключительной части TopCoder Open 2006 в Лас-Вегасе я, вылетев на этапе полуфиналов, наблюдал, как Андрей борется за выход в финал. На последних минутах тура он взялся за сложную задачу, которую, по моему мнению, невозможно было решить за оставшееся время. Что самое удивительное, он дописал и послал решение за несколько секунд до конца. Именно благодаря этой задаче он прошел тогда в финал.\u003c/p\u003e\u003cp\u003eБыла и у меня возможность доказать ему, что никогда не поздно. Помню, за пару лет до нашей победы Андрей уже было поставил на нашей команде крест, сказав, что мы «бесперспективные в возрастном плане». Перефразируя, мы были слишком старые для чемпионата, чтобы рассчитывать на высокие результаты. Но нас такая формулировка совершенно не устраивала, и мы приложили максимум усилий, чтобы доказать, что он не прав. Доказали. Под завершение карьеры сначала стали чемпионами России, потом чемпионами Европы и мира. На мой взгляд, получилось убедительно.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e«Спасибо за шоколадку», – Дарья Яковлева, старший лаборант кафедры информационных систем\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eНеделю назад Андрей Сергеевич прочитал нам последнюю лекцию. Я буду скучать по этим занятиям.\u003c/p\u003e\u003cp\u003eПервое слово, которое приходит в голову, когда хочешь охарактеризовать его, – это слово «умный». Андрей читает различные курсы студентам с первого по третий курс по дискретной математике, алгоритмам и структурам данных, теории функциональных языков, теории сложности, методам трансляции. Как много нужно знать, чтобы проводить все эти курсы и делать это хорошо, не просто читать лекции, а устраивать практические занятия, лабораторные и контрольные работы, еще и построить справедливую систему оценивания.\u003c/p\u003e\u003cp\u003eОн просто хороший человек. Его любят дети, студенты и преподаватели. За три года обучения в Университете ИТМО я слышала о нем только добрые отзывы и теплые слова. Кроме того, Андрей – тот человек, который успевает делать все: преподавать, тренировать, проводить сборы, работать с детьми, организовывать соревнования, в свободное время играть в «Что? Где? Когда?» и на фортепиано. И, уверена, это лишь малая толика того, чем он занимается.\u003c/p\u003e\u003cp\u003eНесмотря на мягкость и доброту, Андрей Станкевич – человек строгих правил. Помню, как сдавала ему зачет в 10 классе в Летней компьютерной школе, где мне безумно понравилось. Тогда я не сдала теоретический вопрос, и с тех пор боюсь сдавать ему зачеты. При этом он, несомненно, справедлив. Сейчас, работая на кафедре, я всегда могу попросить у него совета, потому что знаю, что получу справедливый ответ вне зависимости от того, будет ли он одобрением или критикой.\u003c/p\u003e\u003cp\u003eКак-то раз я допоздна работала в университете. Андрей увидел меня, зашел в кабинет и без лишних слов дал мне шоколадку, чем мгновенно улучшил мое настроение. И вот за такое чуткое отношение к ближним большое ему спасибо.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eВладимир Ульянцев, к.т.н., сотрудник Международной лаборатории «Компьютерные технологии»\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eКак по мне, Андрей всегда идет по прямому и честному пути. Он делает все на совесть и находит с годами все больше и больше удовольствия в своем занятии. Мне кажется, что с годами на его лице все чаще появляется улыбка благодаря его общению со школьниками и студентами. За те 10 лет, которые я его знаю, могу сказать, что он стал относиться ко всему легче и проще – думаю, он понимает, что его работу не все смогут оценить и понять. Главное, что с приобретением этой мудрости он не потерял своей душевности. Он с удовольствием выступает на детских спектаклях в Летней компьютерной школе, где ему всегда отведена соответствующая роль. И очень здорово, что в свои 34 года он является одним из топовых спортивных программистов в мире. Далеко не каждый очень талантливый программист может с годами не терять своих позиций в мировом рейтинге. Ни один тренер не имеет такого опыта побед за короткий срок – шесть раз чемпионы мира! Можно объяснить это не только умом и трудолюбием, но и потрясающим системным мышлением. Им выстроен не только тренировочный процесс команд, но и целая «фабрика» по воспитанию талантов: работа Летней компьютерной школы, университетские кружки, в которых занимаются самые одаренные дети Петербурга, проведение сотен олимпиад для школьников и студентов и, разумеется, учебный процесс кафедры компьютерных технологий, где нужно изрядно напрягать мозги.\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news"]}}