{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1425921143,"rating":3,"authorHandle":"abcd1204","modificationTimeSeconds":1425921143,"id":16865,"title":"\u003cp\u003eHow to solve poblem lightOj-1330 by max_flow\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eProblem:\u003c/strong\u003e A binary matrix is an m x n matrix consisting of only zeroes and ones. Now you are given m integers, ith integer indicating the summation of the values of cells in ith row. You are also given n integers, ith integer indicating the summation of the values of cells in jth column.\u003c/p\u003e\u003cp\u003eYour task is to generate the binary matrix. As there can be multiple solutions, we want the solution which is lexicographically smallest. To compare two solutions, we first find the cell (topmost, then leftmost) where the solutions differ; then the solution which contains 0 in that cell is lexicographically smaller. So,\u003c/p\u003e\u003cp\u003e001 001\u003c/p\u003e\u003cp\u003e010 \u0026lt; 100\u003c/p\u003e\u003cp\u003e100 010\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eInput\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eInput starts with an integer T (≤ 125), denoting the number of test cases.\u003c/p\u003e\u003cp\u003eEach case starts with a line containing two integers: m and n (1 ≤ m, n ≤ 50). The next line contains m integers, separated by a single space, denoting the row sums. The next line contains n integers, separated by spaces, denoting the column sum. All the integers will be between 0 and 50 (inclusive).\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOutput\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eFor each case, print the case number first. Then if there is no solution, then print \u0027impossible\u0027 on the same line. Otherwise, from the next line, print m lines each having n characters denoting the binary matrix as stated above.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSample Input\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e5\u003c/p\u003e\u003cp\u003e3 3\u003c/p\u003e\u003cp\u003e1 1 1\u003c/p\u003e\u003cp\u003e1 1 1\u003c/p\u003e\u003cp\u003e3 3\u003c/p\u003e\u003cp\u003e1 1 2\u003c/p\u003e\u003cp\u003e2 2 1\u003c/p\u003e\u003cp\u003e2 3\u003c/p\u003e\u003cp\u003e30 30\u003c/p\u003e\u003cp\u003e30 20 10\u003c/p\u003e\u003cp\u003e2 9\u003c/p\u003e\u003cp\u003e5 5\u003c/p\u003e\u003cp\u003e1 1 2 1 1 1 1 1 1\u003c/p\u003e\u003cp\u003e3 3\u003c/p\u003e\u003cp\u003e1 2 3\u003c/p\u003e\u003cp\u003e3 2 1\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOutput for Sample Input\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eCase 1:\u003c/p\u003e\u003cp\u003e001\u003c/p\u003e\u003cp\u003e010\u003c/p\u003e\u003cp\u003e100\u003c/p\u003e\u003cp\u003eCase 2: impossible\u003c/p\u003e\u003cp\u003eCase 3: impossible\u003c/p\u003e\u003cp\u003eCase 4:\u003c/p\u003e\u003cp\u003e001001111\u003c/p\u003e\u003cp\u003e111110000\u003c/p\u003e\u003cp\u003eCase 5:\u003c/p\u003e\u003cp\u003e100\u003c/p\u003e\u003cp\u003e110\u003c/p\u003e\u003cp\u003e111\u003c/p\u003e\u003cp\u003e/***/ Please give some Hint or pseudocode [if needed] /***/ \u003c/p\u003e\u003c/div\u003e","tags":[]}}