{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1518141666,"rating":135,"authorHandle":"DarthPrince","modificationTimeSeconds":1518151516,"id":57638,"title":"\u003cp\u003eDarth Prince Rises (2018), COMING SOON...\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eBrace yourselves. Winter has come and I\u0027ve lived to see people in competitive programming community become less \u0026quot;passionate\u0026quot; and the competitive programming community become less \u0026quot;alive\u0026quot; as it used to be. I remember more \u0026quot;activity\u0026quot; in the past. Me myself wasn\u0027t any different, I posted some tutorials and wrote some contests before and then, I quit. I left the competitive programming community for a while, to check the waters out there, see what\u0027s going on outside of this community. But as you witnessed, I wrote round #459 as starter, as someone would say, Prince Of Persia COMEBACK MOTHAF***A.\u003c/p\u003e\u003cp\u003eAs this is not an essay (god I\u0027m glad it\u0027s not an assay :(), I\u0027ll make this short. \u003c/p\u003e\u003cp\u003eAs some may remember, in 2015, I founded a website with the help of some of my friends named CodeZilla. Iranian members of the community may remember, as it was only in Persian. We had a contest, a hate-driven DoS attack by a later identified person (who I came to become friends with like a year later) in the middle of the contest, and then, BOOM, shutdown! No actual activity till now, of course besides the CodeHub competitions that were held on CodeZilla, by my friend not me, just using the CodeZilla for authentication. \u003c/p\u003e\u003cp\u003eIn the meantime, something has been going on in the background, for almost 6 months. First of all, now there\u0027s an English version of CodeZilla. In fact, English is the default language of CodeZilla. That\u0027s almost the only change for now. Oh, and also in the past you could only access it via \u003ca href\u003d\"http://codezilla.ir\"\u003ecodezilla.ir\u003c/a\u003e, but now the official address is \u003ca href\u003d\"http://codezil.la\"\u003ecodezil.la\u003c/a\u003e. Stay tuned for our contests, online courses and CODEZILLA CLUB.\u003c/p\u003e\u003cp\u003eBut these aren\u0027t the reason I\u0027m posting this, because they\u0027re all happening in the future (but very very soon). I\u0027m talking about our new \u003cstrong\u003eYOUTUBE SERIES\u003c/strong\u003e!!! \u003cem\u003eaudience clap\u003c/em\u003e This series don\u0027t only include me, my friends Carter, \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/AnPelec\" title\u003d\"Candidate Master AnPelec\"\u003eAnPelec\u003c/a\u003e and others are gonna help making them. In fact, all of us, the community is making the videos. This Youtube series are gonna be discussions about competitive-programming-related concepts, anything slightly related to competitive programming.\u003c/p\u003e\u003cp\u003eSo helps us and share your ideas about the subjects you think we should discuss or talk about. You could either comment your ideas in the comments or fill out \u003ca href\u003d\"https://goo.gl/forms/py4qSBLdqrHbIrDf2\"\u003ethis form\u003c/a\u003e to avoid spamming.\u003c/p\u003e\u003cp\u003eAn uh, stay tuned, a bootcamp\u0027s comming! A \u003cstrong\u003eCodeZilla Bootcamp\u003c/strong\u003e! Who\u0027s ready for a tour of Boston? \u003cem\u003eaudience cheer\u003c/em\u003e. \u003cem\u003emic drop\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e Some may have mistaken this with a tutorial video series, it\u0027s NOT. It\u0027s a discussion, like a talk, for example one subject could be \u0026quot;Do we have enough online judges?\u0026quot; or \u0026quot;Is this much math in competitive programming really necessary?\u0026quot; or even reviewing a website or forum or something. It\u0027s more general, we\u0027re not teaching anything in this series.\u003c/p\u003e\u003c/div\u003e","tags":["princeofpersia","darthprincerises","codezilla","youtube","competitive programming","videos"]}}