{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1424697382,"rating":5,"authorHandle":"burakcetin","modificationTimeSeconds":1424697382,"id":16583,"title":"\u003cp\u003eNeed help on Drazil and Morning Exercise\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003ca href\u003d\"/contest/516/problem/D\" title\u003d\"Codeforces Round 292 (Div. 1)\"\u003e516D - Drazil and Morning Exercise\u003c/a\u003e\u003c/p\u003e\u003cp\u003eHello everyone. I really need some help with this question. I have implemented 3 different solutions. And if there is a logical mistake in them i am ready to code another one from beginning so i will appreciate any kind of help. At each one of them my code calculates the far array from \u003ca href\u003d\"//codeforces.com/blog/entry/16468\"\u003etutorial\u003c/a\u003e. That part is same in all of them.\u003c/p\u003e\u003cp\u003e1) \u003ca href\u003d\"/contest/516/submission/9946947\" title\u003d\"Submission 9946947 by burakcetin\"\u003e9946947\u003c/a\u003e\u003c/p\u003e\u003cp\u003eOn this one i used maps for each node. This one having TLE(unfortunately) but at least i know the far array is correct because this code passed some cases.\u003c/p\u003e\u003cp\u003e2) \u003ca href\u003d\"/contest/516/submission/9946947\" title\u003d\"Submission 9946947 by burakcetin\"\u003e9946947\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThis one calculates when should nodes get popped out from groups with a binary search on a stack as said in tutorial. Then while in dfs3 function it increases a point for the node we find on binary search. And it sums all return values of each child adds one and decreases sum by the point of that node(because we are in the point where some nodes should be kicked out and for that nodes we added a point in this node). And the answer is the biggest return value it have found while dfs. This one gets WA but gives the same answer with the next one so i think they have a common mistake in a way.\u003c/p\u003e\u003cp\u003e3) \u003ca href\u003d\"/contest/516/submission/9969062\" title\u003d\"Submission 9969062 by burakcetin\"\u003e9969062\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThis one uses a segment tree on the tree we have using discovery and finish times. At each node of segment tree there is a sorted vector so i can binary search the number of the nodes which have far value lesser then far[root]+l. As i said this one gives the same output with the previous one so i think there is something common but only thing they have common is calculating the far array and that part must be correct(??) because of the first code. It might be about long long thats the only theory i have right now.\u003c/p\u003e\u003cp\u003eTL;DR: You can ignore the submissions if you want and give me another way to solve this problem.\u003c/p\u003e\u003cp\u003eThanks!\u003c/p\u003e\u003c/div\u003e","tags":[]}}