{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1431335303,"rating":344,"authorHandle":"Alex7","modificationTimeSeconds":1445391329,"id":17828,"title":"\u003cp\u003eThe Psychology of Competition\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eParticipating in a big competition like IOI or ICPC can be intimidating, the worst thing that might happen to you is that you manage to get nervous enough to enter that adrenaline-fueled fight or flight state, you start feeling that you need to get out of the contest fast. An easy bruteforce solution that would take you 2 minutes to code in a normal environment suddenly requires 10 minutes, or at least that\u0027s what happened to me the last 3 major competitions I participated in (APIO 2014, IOI 2014 and APIO 2015), while it wasn\u0027t very noticeable in APIO 2014 -I quickly forgot about it because it was my first medal a bronze one- and I blamed that state on sickness in IOI 2014, after APIO 2015 it became clear to me that I\u0027m making the mistakes over and over.\u003c/p\u003e\u003cp\u003eIf you\u0027re really new to competitive programming, someone who doesn\u0027t really care much about the result, or someone who\u0027s trained since the age of 6 you probably won\u0027t relate to these issues, but after I\u0027ve done some research I realized that this is more common than I expected. The same pattern happened to me every time: I had the right ideas, I got WA on my first submission, I panicked and then my brain basically stopped working (and of course all the known symptoms of the fight or flight state).\u003c/p\u003e\u003cp\u003eI remember talking to someone after day 2 in IOI 2014, he told me: \u0026quot;When I read the problems, my brain stopped working I didn\u0027t even understand them, after the contest I read them again and came up with 243 points worth solutions\u0026quot;. And his solutions were very neat and differ to the tutorials that were given to us after the contest.\u003c/p\u003e\u003cp\u003eSo the point that I\u0027m trying to make is: If I and everybody who suffers from the same problem, could solve problems during a competition as big as IOI with the same level of problem solving skill we usually demonstrate in any other environment, our results would differ greatly.\u003c/p\u003e\u003cp\u003eHave you ever had those issues? Did you manage to fix them?\u003c/p\u003e\u003cp\u003eAlso in case of IOI-like competitions, what is your general strategy?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD: I got a bronze medal in IOI, the advice bellow is really helpful\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":["psychology","ioi","competition"]}}