{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1494849139,"rating":91,"authorHandle":"savinova","modificationTimeSeconds":1494857666,"id":52004,"title":"\u003cp\u003eОтчет о деятельности Botan Investments за апрель. ContestSFedU-2017: интервью с организатором\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ апреле в программе \u003cstrong\u003eBotan Investments\u003c/strong\u003e приняли участие 19 вузов. Больше всего активных участников в Саратовском ГУ и УрФУ (22 человека), а также в Ульяновском ГТУ (19 человек). Больше всего тренировок провели в Волгоградском ГТУ и в УрФУ — 10 и 8 соответственно. \u003cbr /\u003e\u003cbr /\u003e В \u003ca href\u003d\"https://vk.com/botaninvestments\"\u003eгруппе \u003cstrong\u003eBotan Investments\u003c/strong\u003e\u003c/a\u003e вышли новые посты Михаила \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/MikhailRubinchik\" title\u003d\"Master MikhailRubinchik\"\u003eMikhailRubinchik\u003c/a\u003e Рубинчика, посвященные следующим темам: \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_191\"\u003eсобрание первокурсников и его значимость\u003c/a\u003e, \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_195\"\u003eмассовые любительские соревнования\u003c/a\u003e, \u003ca href\u003d\"https://vk.com/botaninvestments?w\u003dwall-115220257_201\"\u003eроль тренера в АСМ\u003c/a\u003e. Приглашаем всех желающих поучаствовать в обсуждении. \u003cbr /\u003e\u003cbr /\u003e Фонд \u003cstrong\u003eBotan Investments\u003c/strong\u003e выступил золотым спонсором Открытого Чемпионата Юга России \u0026quot;ContestSFedU-2017\u0026quot;. Мы попросили Сергея \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Seryi\" title\u003d\"Candidate Master Seryi\"\u003eSeryi\u003c/a\u003e Тарасова, одного из организаторов и членов жюри олимпиады, ответить на несколько вопросов о чемпионате, подробнее осветив организационные моменты. Результаты и другую информацию о чемпионате можно найти \u003ca href\u003d\"http://www.contestsfedu.org/2017\"\u003eздесь\u003c/a\u003e, а на Codeforces также есть \u003ca href\u003d\"//codeforces.com/gym/101364\"\u003eтренировка по задачам финала командного турнира\u003c/a\u003e. \u003cbr /\u003e \u003c/p\u003e\u003cp style\u003d\"background-color: rgb(250,250,250);padding: 0.0em 1.0em;\"\u003e\u003cbr /\u003e\u003ci\u003e — Расскажите в целом о чемпионате, сколько человек участвовало, был ли кто-то из сильных участников? \u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e В нашем чемпионате традиционно участвуют самые разные категории участников — всего чуть более 150 человек во всех очных турнирах. Для школьников не старше 8-го класса мы проводим Junior Contest, а для старших школьников — отдельный личный турнир. Также, в отличие от многих других контестов, мы допускаем к участию в главном командном турнире аспирантов, преподавателей и профессионалов, уже завершивших обучение в ВУЗах. Но наиболее значительной аудиторией, безусловно, являются студенты. \u003cbr /\u003e\u003cbr /\u003e Что же касается сильных участников, то команд-финалистов ACM ICPC в этом году не было, но некоторые участники достаточно сильны, чтобы через год-два побороться за выход в финал. \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003e — Возникали ли сложности в организации чемпионата, связанные с согласованием с вузом?\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e Никаких сложностей, наоборот — руководство понимает значимость проведения соревнований такого уровня в стенах университета и оказывает всестороннюю поддержку. А благодаря активной поддержке спонсоров, мы уже много лет делаем сами соревнования бесплатными для всех участников, что позволяет свести к минимуму бюрократические процедуры. \u003c/p\u003e \u003cbr /\u003e \u003cdiv style\u003d\"width: 100.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/34/d6/34d6bc556e38c06a6eaccc057370bd49e2dca18e.jpg\" style\u003d\"width: 49.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg src\u003d\"/predownloaded/12/89/1289d575f6b1c8bb61f25b0e3302759fd0adec4e.jpg\" style\u003d\"width: 49.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e \u003ccenter\u003e \u003csmall\u003eДемонстрация боев роботов турнира Code Warriors Challenge\u003c/small\u003e \u003c/center\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 0.0em 1.0em;\"\u003e\u003cbr /\u003e\u003ci\u003e — Как организован процесс подготовки к чемпионату? Сколько человек было задействовано, привлекались ли волонтеры?\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e Каждый турнир (Junior, школьный, игровой, командный) готовила отдельная группа авторов. Общее число людей, задействованных в подготовке, подсчитать не возьмусь, потому что их не один десяток: студенты-волонтёры, преподаватели, выпускники. Руководителем и идейным вдохновителем Чемпионата является зав. кафедрой МОП ЭВМ Хусаинов Наиль Шавкятович. \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003e — Какая тестирующая система используется на чемпионате?\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e Уже больше 10 лет мы используем собственную систему тестирования contester.tsure.ru — не слишком удобную и не слишком стабильную. В этом году проблемы с ней были только на пробном туре, но раньше случались и эксцессы посерьёзней, которые негативно влияли на впечатления участников о турнире. Мы давно хотим отказаться от неё и провести соревнования на сторонней системе тестирования, но по разным причинам пришлось отложить переход ещё на один год. К сожалению, Ejudge и Yandex.Contest не поддерживают полноценно Windows-компиляторы, а подавляющее большинство участников в регионе предпочитают среду MS Visual Studio, и крайне желательно, чтобы компилятор на тестирующей системе и рабочих местах участников совпадал. Что же касается Codeforces, то до недавнего времени не было возможности ограничить доступ участников на время контеста к чужим решениям и личным сообщениям, однако буквально на днях была анонсирована \u003ca href\u003d\"//codeforces.com/blog/entry/51787\"\u003eновая функциональность доменов\u003c/a\u003e, которая решает эту проблему. Так что, надеюсь, что в следующем году мы проведём чемпионат на Codeforces. \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003e — Кто готовил задачи основного турнира?\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e Авторами задач главного командного турнира являются выпускники нашего института: Лызь \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Deamon\" title\u003d\"Candidate Master Deamon\"\u003eDeamon\u003c/a\u003e Дмитрий, Бугаев \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/bbugaev\" title\u003d\"Expert bbugaev\"\u003ebbugaev\u003c/a\u003e Богдан и я \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Seryi\" title\u003d\"Candidate Master Seryi\"\u003eSeryi\u003c/a\u003e. Готовить задачи своими силами — это непросто, учитывая, что в Таганроге никогда не было топовых участников, но во-первых, без своих задач Чемпионат проводить неинтересно, а во-вторых, нам, как и всегда, помогали друзья из других городов: Чалышев \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/cmd\" title\u003d\"Master cmd\"\u003ecmd\u003c/a\u003e Владимир, Абизяев \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/Nyatl\" title\u003d\"Expert Nyatl\"\u003eNyatl\u003c/a\u003e Павел и Клевлеев \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Kvark161\" title\u003d\"Candidate Master Kvark161\"\u003eKvark161\u003c/a\u003e Степан. Кстати, если у кого-то есть силы и желание поучаствовать в подготовке в будущем, мы всегда открыты для сотрудничества. \u003cbr /\u003e\u003cbr /\u003e \u003ci\u003e — Сколько задач в среднем решили, насколько они были сложными? Исходя из каких критериев отбирали те или иные задачи?\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e Набор задач по сложности был приблизительно равен четвертьфиналам ACM ICPC. Команда-победитель решила 7 из 10 задач, а большая часть команд справилась как минимум с 4-мя задачами. Особенно приятно, что судьбу первого места решила сложная задача, а не штрафное время. Три задачи комплекта так и остались нерешенными, но будем надеяться, что их решат в тренировках Codeforces. \u003cbr /\u003e\u003cbr /\u003e Критерии отбора задач для пятичасовых командных контестов достаточно своеобразные. С одной стороны, это не раунд, который длится два часа, а значит можно и нужно давать задачи с непростой реализацией. С другой стороны, гораздо интереснее, когда решающим фактором является красивая идея, а на умение быстро набрать 300 строк кода. Мы старались сделать так, чтобы у команд было время подумать над идейными задачами, а не утонуть в бесконечной отладке простых и средних задач.\u003c/p\u003e \u003cbr /\u003e\u003cdiv style\u003d\"width: 100.0%;\"\u003e \u003cimg src\u003d\"/predownloaded/91/d8/91d830f1f7077a5b529fc37ef2ff0ba6d47ba830.jpg\" style\u003d\"width: 49.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cimg src\u003d\"/predownloaded/c6/59/c659636b5869fbadb7373dd552f981d88a23a9ae.jpg\" style\u003d\"width: 49.0%;display: inline;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/div\u003e \u003ccenter\u003e \u003csmall\u003eЦеремония закрытия\u003c/small\u003e \u003c/center\u003e \u003cp style\u003d\"background-color: rgb(250,250,250);padding: 0.0em 1.0em;\"\u003e\u003cbr /\u003e\u003ci\u003e — Чем региональный турнир отличается от четвертьфинала? Зачем нужны подобные соревнования?\u003c/i\u003e \u003cbr /\u003e\u003cbr /\u003e На мой взгляд региональные турниры, такие как Всесибирская олимпиада в Новосибирске, Чемпионат Урала в Уфе и Екатеринбурге, Чемпионат Поволжья в Самаре, ICL в Казани и наш Чемпионат Юга — это важная часть спортивного программирования в России. \u003cbr /\u003e\u003cbr /\u003e Во-первых, это настоящая соревновательная атмосфера, которую трудно смоделировать на онлайн контестах и тренировках. Причем, в отличие от многих четвертьфиналов, состав участников каждый год меняется и у средних команд не возникает ощущения безнадёги при виде 5-10 топовых команд, заведомо разыгрывающих между собой призовые места. На региональном контесте у любой постоянно тренирующейся команды есть шанс зацепиться за призовые места и даже выиграть, а это совсем другие эмоции, нежели очередной диплом третьей степени на четвертьфинале или полуфинале. \u003cbr /\u003e\u003cbr /\u003e Во-вторых, это очное общение с иногородними участниками, способствующее формированию профессионального community. Лучше встречаться чаще, чем 2-3 раза в год на ICPC-турнирах и сборах. \u003cbr /\u003e\u003cbr /\u003e В третьих, каждый региональный турнир имеет свой “авторский” стиль. Над организаторами не висят строгие правила, спущенные сверху, и нет цели отобрать сильнейших для следующего этапа, а поэтому можно давать нестандартные задачи, экспериментировать с форматом и составом участников, проводить игровые туры и т.д. Четвертьфиналы же во многих регионах теперь проводятся на одном и том же наборе задач без побочных мероприятий, а ВУЗы организаторы выполняют чисто техническую роль хоста. Это скорее всего правильно с точки зрения справедливого отбора, но не добавляет красок в жизнь СП-сообщества. \u003cbr /\u003e\u003cbr /\u003e Ну и наконец, региональный турнир — это прямая связь участников со спонсирующими его IT-компаниями, а также один из действенных способов популяризации спортивного программирования в местном IT-сообществе. Мне известны сразу несколько случаев удачного рекрутинга на наших турнирах, которые были бы невозможны в других условиях. И в целом, интерес со стороны спонсоров год от года только растет, что не может не радовать. \u003c/p\u003e\u003c/div\u003e","tags":["виктор шабуров","botan investments","олимпиада юфу"]}}