{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1504384707,"rating":6,"authorHandle":"getitright","modificationTimeSeconds":1504493719,"id":54261,"title":"\u003cp\u003eInterview problem doubt — 2\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi codeforces community,\u003c/p\u003e\u003cp\u003eI have been preparing for interview round for placements. I came across these 2 problems which I have not been able to solve for the past 2 days.\u003c/p\u003e\u003cp\u003eQ1) A and B play a game. They are given an array of positive numbers. Each player in his turn picks up 2 numbers from the array such that the difference of the numbers does not exist in the array. He then places the difference into the array too thus increase the array count by 1. Then the next player repeats the same process. The game continues till there are no 2 numbers such that difference does not exist in the array. The one who’s not able to choose numbers loses. If A starts the game and the game proceeds optimally, find who’ll win the game\u003c/p\u003e\u003cp\u003eExample : Input array : 2,5,3\u003c/p\u003e\u003cp\u003eA: 2,5,3,1\u003c/p\u003e\u003cp\u003eB: 2,5,3,1,4\u003c/p\u003e\u003cp\u003eA has no choice so B wins.\u003c/p\u003e\u003cp\u003eQ2) Given a string containing only lowercase alphabets, you have to convert it into a string such that it contains only vowels by doing minimum number of operations. In one operation, you could select a substring always starting from index 0, and move that substring forward or backward. Example of rolling forward or backward are given :\u003c/p\u003e\u003cp\u003eRolling Forward\u003c/p\u003e\u003cp\u003eInput- axzf\u003c/p\u003e\u003cp\u003eLet index chosen be 0 to 3 and moving it forward\u003c/p\u003e\u003cp\u003eOutput- byag\u003c/p\u003e\u003cp\u003eRolling Backward\u003c/p\u003e\u003cp\u003eInput – axze\u003c/p\u003e\u003cp\u003eLet index chosen be 0 to 2 and moving it backwards\u003c/p\u003e\u003cp\u003eOutput- zwyd\u003c/p\u003e\u003cp\u003ePlease help me in solving the above problems. I would be highly thankful to you all. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPDATE : Doubts are cleared. Thanks everyone for help.\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":["#problem","doubts","#interview"]}}