{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1485281150,"rating":-13,"authorHandle":"habib_rahman","modificationTimeSeconds":1485281968,"id":49993,"title":"\u003cp\u003e\u0026quot;LightOJ 1079 — Just another Robbery\u0026quot; How to calculate the probability and why?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cstrong\u003eProblem:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eAs Harry Potter series is over, Harry has no job. Since he wants to make quick money, (he wants everything quick!) so he decided to rob banks. He wants to make a calculated risk, and grab as much money as possible. But his friends — Hermione and Ron have decided upon a tolerable probability P of getting caught. They feel that he is safe enough if the banks he robs together give a probability less than P.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eInput\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eInput starts with an integer T (≤ 100), denoting the number of test cases.\u003c/p\u003e\u003cp\u003eEach case contains a real number P, the probability Harry needs to be below, and an integer N (0 \u0026lt; N ≤ 100), the number of banks he has plans for. Then follow N lines, where line j gives an integer Mj (0 \u0026lt; Mj ≤ 100) and a real number Pj . Bank j contains Mj millions, and the probability of getting caught from robbing it is Pj. A bank goes bankrupt if it is robbed, and you may assume that all probabilities are independent as the police have very low funds.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOutput\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFor each case, print the case number and the maximum number of millions he can expect to get while the probability of getting caught is less than P.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSample Input\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e3\u003c/p\u003e\u003cp\u003e0.04 3\u003c/p\u003e\u003cp\u003e1 0.02\u003c/p\u003e\u003cp\u003e2 0.03\u003c/p\u003e\u003cp\u003e3 0.05\u003c/p\u003e\u003cp\u003e0.06 3\u003c/p\u003e\u003cp\u003e2 0.03\u003c/p\u003e\u003cp\u003e2 0.03\u003c/p\u003e\u003cp\u003e3 0.05\u003c/p\u003e\u003cp\u003e0.10 3\u003c/p\u003e\u003cp\u003e1 0.03\u003c/p\u003e\u003cp\u003e2 0.02\u003c/p\u003e\u003cp\u003e3 0.05\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSample Output:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eCase 1: 2\u003c/p\u003e\u003cp\u003eCase 2: 4\u003c/p\u003e\u003cp\u003eCase 3: 6\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNote:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eFor the first case, if he wants to rob bank 1 and 2, then the probability of getting caught is 0.02 + (1 — 0.02) * .03 \u003d 0.0494 which is greater than the given probability (0.04). That\u0027s why he has only option, just to rob rank 2.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eI had seen many solution in web where they calculated as:\u003c/strong\u003e\u003c/p\u003e \u003cpre\u003e\u003ccode\u003efor i \u003d sum_of_millions to 1\n\n    for j\u003d1 to all bank\n\n        dp[i][j] ....\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eMy thought is why I should go for millions? Shouldn\u0027t I go by bank or not?\u003c/p\u003e\u003c/div\u003e","tags":["dp"]}}