{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1464206912,"rating":56,"authorHandle":"Michael","modificationTimeSeconds":1464860925,"id":45054,"title":"\u003cp\u003eНовости Факультета Компьютерных Наук ВШЭ\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ этом году первый набор \u003ca href\u003d\"http://bit.ly/25msmZi\"\u003eФакультета Компьютерных Наук\u003c/a\u003e заканчивает второй курс, и на этом фундамент, обязательный для всех, почти заканчивается. Что же ждет их дальше, на 3-4 курсе и в магистратуре? Ниже я расскажу об этом, а также об основных новостях \u003ca href\u003d\"http://bit.ly/25msmZi\"\u003eФКН\u003c/a\u003e: старт специализаций, новая магистерская программа, открытие двух лабораторий, изменения в базовой программе 1-2 курса по итогам первых двух лет существования \u003ca href\u003d\"http://bit.ly/25msmZi\"\u003eФКН\u003c/a\u003e, включая оценки и фидбэк от самих студентов.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD.\u003c/strong\u003e Льготы по олимпиадам опубликованы \u003ca href\u003d\"https://ba.hse.ru/data/2016/06/01/1130397875/Москва.pdf\"\u003eздесь\u003c/a\u003e, а про всероссийские олимпиады написано \u003ca href\u003d\"https://ba.hse.ru/olimp2016\"\u003eздесь\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eНа 3-4 курс все студенты выбирают себе специализацию. Это набор курсов в рамках одной широкой темы, некоторые из которых обязательны для всех, кто выбрал специализацию, а из остальных нужно выбрать определенное количество (не все). Всего у нас будет пять специализаций, про две из них я расскажу подробнее ниже. Кроме курсов специализации, есть обязательные для всех курсы и общие курсы по выбору, а также курсовая работа, которая может быть либо научной работой, либо проходить в форме командного проекта.\u003c/p\u003e\u003ch1\u003eСпециализация по машинному обучению\u003c/h1\u003e\u003cp\u003eОдна из самых горячих тем в Computer Science сегодня и, вероятно, на многие годы вперед – \u003ca href\u003d\"https://ru.wikipedia.org/wiki/Наука_о_данных\"\u003eData Science\u003c/a\u003e, включающая в себя \u003ca href\u003d\"https://ru.wikipedia.org/wiki/Большие_данные\"\u003eBig Data\u003c/a\u003e и \u003ca href\u003d\"https://ru.wikipedia.org/wiki/Машинное_обучение\"\u003eMachine Learning\u003c/a\u003e. Она настолько популярна, что в университетах начинают появляться отдельные программы по Data Science не в рамках Computer Science программ, а параллельно с ними. В последнее время многие постановки задач в теории алгоритмов появляются из Data Science. По \u003ca href\u003d\"http://www.mckinsey.com/business-functions/business-technology/our-insights/big-data-the-next-frontier-for-innovation\"\u003eоценкам McKinsey\u003c/a\u003e, только в США к 2018-му году нехватка Data Scientist’ов составит от 490000 человек, а Harvard Business Review пишет, что Data Scientist — \u003ca href\u003d\"https://hbr.org/2012/10/data-scientist-the-sexiest-job-of-the-21st-century/\"\u003ethe sexiest job of the 21st century\u003c/a\u003e. Могу добавить, что работа в этой области предполагает и программирование, и алгоритмы, и сложную математику, а знания, полученные в университете, пригождаются ежедневно.\u003c/p\u003e\u003cp\u003eВ этом году на \u003ca href\u003d\"http://bit.ly/25msmZi\"\u003eФКН\u003c/a\u003e стартует \u003ca href\u003d\"http://bit.ly/1WPbt4k\"\u003eспециализация по машинному обучению\u003c/a\u003e, создававшаяся таким образом, чтобы отражать взгляд и со стороны науки, и со стороны индустрии. Кураторы специализации — Дмитрий Ветров и Евгений Соколов.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.hse.ru/staff/dvetrov\"\u003eДмитрий Ветров\u003c/a\u003e – профессор Сколтеха — переходит в этом учебном году на полную ставку на \u003ca href\u003d\"http://bit.ly/25msmZi\"\u003eФКН\u003c/a\u003e и становится главой новой лаборатории Байесовских методов — это большая удача для \u003ca href\u003d\"http://bit.ly/25msmZi\"\u003eФКН\u003c/a\u003e! Дмитрий — один из всего нескольких людей в России, работы которых \u003ca href\u003d\"http://bayesgroup.ru/publications/\"\u003eпринимают\u003c/a\u003e на две главные в мире конференции по Machine Learning – \u003ca href\u003d\"http://icml.cc/2016/\"\u003eICML\u003c/a\u003e и \u003ca href\u003d\"https://nips.cc/\"\u003eNIPS\u003c/a\u003e. Еще важнее то, что статьи на эти конференции принимают у учеников Дмитрия – аспирантов и даже магистров: для магистра иметь статью на такой конференции – это прорыв, гарантирующий попадание в аспирантуру в сильнейшие научные группы мира. Дмитрий Ветров будет читать курс по байесовским методам в рамках специализации. В лаборатории Дмитрия будут работать его магистры и аспиранты, а также ученики \u003ca href\u003d\"https://www.hse.ru/staff/akonushin\"\u003eАнтона Конушина\u003c/a\u003e – руководителя академической программы \u003ca href\u003d\"http://bit.ly/1ONMyGB\"\u003eПМИ\u003c/a\u003e на \u003ca href\u003d\"http://bit.ly/25msmZi\"\u003eФКН\u003c/a\u003e и руководителя одной из ведущих научных групп в России в области Computer Vision. Антон Конушин будет читать у нас курс по компьютерному зрению.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"https://www.hse.ru/staff/esokolov\"\u003eЕвгений Соколов\u003c/a\u003e – профессиональный data scientist, руководитель группы в \u003ca href\u003d\"http://yandexdatafactory.com/\"\u003eYandex Data Factory\u003c/a\u003e. Он будет читать общий для всех студентов курс машинного обучения, а также его продвинутое продолжение для студентов специализации. Евгений совместно с Петром Ромовым, Эмели Драль, Виктором Кантором и Евгением Рябенко недавно запустили на Coursera русскоязычную \u003ca href\u003d\"http://bit.ly/1sA6NCW\"\u003eспециализацию по машинному обучению в анализе данных\u003c/a\u003e. Практически все они, а также половина остальных data scientist’ов Yandex Data Factory будут преподавать на специализации. Таким образом, студенты смогут перенять опыт людей, ежедневно применяющих машинное обучение для решения задач в областях от банковской индустрии, мобильных операторов и интернет-торговли до космической индустрии, металлургии и физики высокой энергии в ЦЕРНе.\u003c/p\u003e\u003cp\u003eОписание специализации и ее программу можно посмотреть \u003ca href\u003d\"http://bit.ly/1WPbt4k\"\u003eздесь\u003c/a\u003e. Думаю, что аналогов этой программы нет ни в одном университете в России. В частности, в рамках специализации пройдет новый курс по \u003ca href\u003d\"https://en.wikipedia.org/wiki/Deep_learning\"\u003eDeep Learning\u003c/a\u003e, который будет отражать последние достижения в области и будет все время обновляться с прогрессом глубинного обучения. Для первых выпускников специализации через два года мы в ШАДе будем готовить и создавать новые продвинутые курсы, чтобы студенты не скучали в магистратуре.\u003c/p\u003e\u003cp\u003eТе из вас, кто был на всероссийской олимпиаде по информатике в этом году, могли видеть выступление Евгения Соколова на тему применения машинного обучения для \u003ca href\u003d\"https://nplus1.ru/material/2016/05/10/likemonet\"\u003eрисования картин\u003c/a\u003e в стиле Ван-Гога, игры в Го и предсказания успеваемости абитуриентов по их успехам в олимпиадах. Для тех, кто не был, если вам интересно послушать про другие применения машинного обучения, есть видеозаписи \u003ca href\u003d\"https://www.youtube.com/watch?v\u003dn0zRi9yACMQ\u0026amp;index\u003d1\u0026amp;list\u003dPLO_5DvaQ-gsY5_ieCUPF63TPC05EQy5P_\"\u003eвыступления Евгения\u003c/a\u003e на Открытой олимпиаде и \u003ca href\u003d\"https://www.youtube.com/watch?v\u003dg8nrkZ14Rc4\"\u003eвыступления Петра Ромова\u003c/a\u003e на ЗКШ про предсказание того, кто «затащит катку в доту» :)\u003c/p\u003e\u003cp\u003eЕсли вам интересно «потрогать», что такое машинное обучение, то записывайтесь в \u003ca href\u003d\"http://bit.ly/1ViATGt\"\u003eпараллель ML\u003c/a\u003e летней \u003ca href\u003d\"https://cs.hse.ru/csss2016/\"\u003eшколы ФКН\u003c/a\u003e в августе. Также в июле пройдет \u003ca href\u003d\"http://lksh.ru/sis/2016/parallel-a.shtml\"\u003eпараллель A-ML\u003c/a\u003e в ЛКШ, которую будут вести Евгений Соколов и Петр Ромов. Набор в ЛКШ уже закрыт, но если вас пригласили в другую параллель ЛКШ, у вас там будет возможность сходить на спецкурс по машинному обучению. Ну а для изучения Machine Learning по полной программе – конечно, поступайте на \u003ca href\u003d\"http://bit.ly/1ONMyGB\"\u003eФКН\u003c/a\u003e.\u003c/p\u003e\u003ch1\u003eСпециализация по распределенным системам\u003c/h1\u003e\u003cp\u003eВторое популярное направление, по которому у нас появилась \u003ca href\u003d\"http://bit.ly/1TKVxhu\"\u003eспециализация\u003c/a\u003e,- распределенные системы. Это направление связано с работой со сложными большими системами из огромного числа компьютеров, алгоритмами распределенного консенсуса, алгоритмами для работы с внешней памятью, с распределенными базами данных, которые должны обеспечивать быстрое обновление под большой нагрузкой и при этом поддерживать синхронизацию данных между репликами, с оптимизацией передаваемых по сети данных. Наверно сейчас это наиболее алгоритмизированная область разработки. \u003c/p\u003e\u003cp\u003eКуратор специализации – Иван Пузыревский, \u003ca href\u003d\"https://yandexdataschool.ru/edu-process/teachers\"\u003eпреподаватель ШАД\u003c/a\u003e и руководитель группы в Яндексе. Группа Ивана являются частью отдела \u003ca href\u003d\"https://yandexdataschool.ru/edu-process/teachers\"\u003eМаксима Бабенко\u003c/a\u003e. Отдел Макса работает над созданием и развитием распределенной системы хранения и обработки данных под названием YT (“Ыть”), использующейся во всем Яндексе. В марте \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/Zlobober\" title\u003d\"International Grandmaster Zlobober\"\u003eZlobober\u003c/a\u003e, также работающий в этом отделе, делал небольшой \u003ca href\u003d\"https://www.youtube.com/watch?v\u003dNRc2FrWNghw\u0026amp;index\u003d2\u0026amp;list\u003dPLO_5DvaQ-gsY5_ieCUPF63TPC05EQy5P_\"\u003eрассказ\u003c/a\u003e для школьников на тему вычислений над большими данными.\u003c/p\u003e\u003ch1\u003eБиоинформатика\u003c/h1\u003e\u003cp\u003eС этого учебного года на факультете стартует магистерская программа \u003ca href\u003d\"http://bit.ly/1TzOiKU\"\u003e«Анализ данных в биологии и медицине»\u003c/a\u003e под руководством \u003ca href\u003d\"https://ru.wikipedia.org/wiki/%D0%93%D0%B5%D0%BB%D1%8C%D1%84%D0%B0%D0%BD%D0%B4,_%D0%9C%D0%B8%D1%85%D0%B0%D0%B8%D0%BB_%D0%A1%D0%B5%D1%80%D0%B3%D0%B5%D0%B5%D0%B2%D0%B8%D1%87\"\u003eМихаила Гельфанда\u003c/a\u003e, одного из главных специалистов в России в области биоинформатики. \u003ca href\u003d\"https://en.wikipedia.org/wiki/Bioinformatics\"\u003eБиоинформатика\u003c/a\u003e — активно развивающаяся область на стыке биологии и информатики, в которой уже достигнуты большие успехи, но есть и множество открытых вопросов, связанных с пониманием функций отдельных частей генома. Ответы на эти вопросы могут привести к методам лечения болезней, которые сегодня неизлечимы, а также возможностям усиливать или ослаблять те или иные стороны и способности организма. Если вы когда-нибудь активно изучали строковые алгоритмы, от Кнута-Морриса-Пратта до суффиксных деревьев, массивов и автоматов, то, вероятно, замечали, что \u003ca href\u003d\"http://www.ozon.ru/context/detail/id/1393109/\"\u003eкнига Гасфилда\u003c/a\u003e написана в первую очередь для биоинформатиков.\u003c/p\u003e\u003cp\u003eНа программе математиков (программа-то по направлению \u003ca href\u003d\"http://bit.ly/1ONMyGB\"\u003e\u0026quot;Прикладная математика и информатика\u0026quot;\u003c/a\u003e, при поступлении экзамен только по математике и английскому языку) научат основам биологии (курсы по молекулярной биологии, молекулярной эволюции и сравнительной геномике), а также компьютерным методам и специальным алгоритмам, необходимым для работы в такой междисциплинарной области, как анализ медико-биологических данных. \u003c/p\u003e\u003cp\u003eВводные лекции Гельфанда можно посмотреть \u003ca href\u003d\"https://www.hse.ru/ma/adbm/video\"\u003eздесь\u003c/a\u003e.\u003c/p\u003e\u003ch1\u003eТеоретическая информатика\u003c/h1\u003e\u003cp\u003eНа \u003ca href\u003d\"http://bit.ly/25msmZi\"\u003eФКН\u003c/a\u003e открылась \u003ca href\u003d\"http://bit.ly/1NNAn1L\"\u003eмеждународная лаборатория по теоретической информатике\u003c/a\u003e под руководством \u003ca href\u003d\"https://www.hse.ru/staff/vereshchagin\"\u003eНиколая Константиновича Верещагина\u003c/a\u003e. Николай Константинович — д.ф.-м.н., профессор мехмата МГУ с 1999 года, член Европейской Академии (\u003ca href\u003d\"https://en.wikipedia.org/wiki/Academia_Europaea\"\u003eAcademia Europaea\u003c/a\u003e) по секции информатики, научный руководитель \u003ca href\u003d\"https://yandexdataschool.ru/edu-process/teachers\"\u003eМаксима Бабенко\u003c/a\u003e, много лет читает в ШАДе курсы по теории информации и теории вычислений, которые очень любят наиболее «математические» студенты ШАД. Несколько лет назад он пришел на матфак ВШЭ, а недавно перешел к нам на \u003ca href\u003d\"http://bit.ly/25msmZi\"\u003eФКН\u003c/a\u003e. Николай Константинович ведёт научный семинар “Теоретическая информатика” для студентов 3-4 курсов, читает курсы по математической логике и сложности вычислений. \u003c/p\u003e\u003cp\u003eСотрудник лаборатории и руководитель \u003ca href\u003d\"http://bit.ly/1Z0r8vR\"\u003eспециализации по теоретической информатике\u003c/a\u003e — \u003ca href\u003d\"http://www.lirmm.fr/~ashen/\"\u003eАлександр Ханиевич Шень\u003c/a\u003e, Directeur de Recherche (DR2) du CNRS, наверняка также известный вам как автор книги \u003ca href\u003d\"http://www.mccme.ru/free-books/shen/shen-progbook.pdf\"\u003e“Программирование: теоремы и задачи”\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eВ качестве ведущего зарубежного ученого в лаборатории работает \u003ca href\u003d\"http://rutcor.rutgers.edu/~gurvich/\"\u003eВладимир Александрович Гурвич\u003c/a\u003e, профессор университета \u003ca href\u003d\"http://www.rutgers.edu\"\u003eРатгерс\u003c/a\u003e в США, специалист в области комбинаторной оптимизации и алгоритмической теории игр. Основные научные интересы В.А. Гурвича лежат в областях теории алгоритмов и теории сложности вычислений, алгоритмической теории игр, теории графов.\u003c/p\u003e\u003cp\u003eЕсть предварительные договоренности о визитах профессоров из \u003ca href\u003d\"http://research.microsoft.com/en-us/\"\u003eMicrosoft Research\u003c/a\u003e, \u003ca href\u003d\"http://www.ucla.edu\"\u003eUCLA\u003c/a\u003e (Computer Science программа \u003ca href\u003d\"https://tfetimes.com/2016-computer-science-rankings/\"\u003e#15 в мире\u003c/a\u003e), Institut des Mathématiques de Lille, \u003ca href\u003d\"http://www.umontpellier.fr\"\u003eUniversité de Montpellier\u003c/a\u003e и др.\u003c/p\u003e\u003cp\u003eЛаборатория в целом будет заниматься следующими научными направлениями: сложность вычислений, теория информации, алгоритмическая статистика (один из основателей — Н.К. Верещагин), построение и анализ алгоритмов (один из научных руководителей — М.А. Бабенко), комбинаторная оптимизация и алгоритмическая теория игр. \u003c/p\u003e\u003cp\u003eТеоретическая информатика — не самое массовое направление, но его выбирают некоторые из наших самых сильных студентов, которые параллельно с учёбой имеют возможность работать стажёрами-исследователями в этой лаборатории. \u003c/p\u003e\u003ch1\u003eИзменения в базовой программе обычного и пилотного потоков\u003c/h1\u003e\u003cp\u003eПо результатам первых двух лет мы решили дать студентам больше времени на то, чтобы освоиться и с программированием, и с алгоритмами, и с курсами архитектуры компьютера и операционных систем. Мы выделили дополнительное время на каждый из этих трех курсов в течение первых двух лет обучения, а курсы по сетям и базам данных перенесли на 3-4 курс, где их можно взять по выбору или в рамках специализации.\u003c/p\u003e\u003cp\u003eЧто касается пилотников по программированию, то мы столкнулись с неожиданной проблемой: не все пилотники умели программировать на C++ в достаточной степени, чтобы сразу заниматься продвинутыми алгоритмами на этом языке, и поэтому в 2016-2017 году сначала будет один модуль интенсивного курса C++ от любимого лектора всех студентов \u003ca href\u003d\"https://www.hse.ru/org/persons/132843899\"\u003eАлексея Зобнина\u003c/a\u003e, а затем уже пилотники попадут к \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/GlebsHP\" title\u003d\"Grandmaster GlebsHP\"\u003eGlebsHP\u003c/a\u003e на годовой курс алгоритмов.\u003c/p\u003e\u003cp\u003eКурс архитектуры компьютера и операционных систем будет общим для всех, мы растянули его на 3 модуля, и за счет этого получится лучше синхронизировать лекции и семинары.\u003c/p\u003e\u003cp\u003e11-го мая в Яндексе прошла встреча с победителями олимпиад, на которой рассказывали про программу \u003ca href\u003d\"http://bit.ly/25msmZi\"\u003eФКН\u003c/a\u003e в целом, пилотный поток по программированию и по математике, а также рассказывал о своих ощущениях студент пилотной группы Валентин Бирюков. Видеозапись мероприятия можно посмотреть \u003ca href\u003d\"http://bit.ly/1U8MzXb\"\u003eздесь\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eЧто касается пилотных групп по математике, то у них по всем предметам, кроме одного – курса дифференциальных уравнений – разный подход к изучению, отдельные лекторы и семинаристы. Проще всего объяснить, в чем разница, на примере курса дискретной математики.\u003c/p\u003e\u003cp\u003eСтуденты, прошедшие базовую школьную программу, не участвовавшие в олимпиадах по математике и не обучавшиеся в матшколах, должны начать с конкретных объектов – графов, перестановок и др. и теорем вроде того, что вершин нечетной степени в графе четное число. Олимпиадники эти вещи давно прошли, они уже кажутся очевидными, но для первого знакомства с ними требуется ненулевое время — и получается, что если проходить их совместно, то либо олимпиадники/матшкольники будут скучать, либо остальные не успеют вникнуть. Кроме того, студентам основного потока нужно научиться формальным способам рассуждений, строгим доказательствам. Только после этого для них имеет смысл перейти во втором модуле к более абстрактным и более высокоуровневым вещам – теории множеств, отношениям эквивалентности, отношениям порядка – и увидеть, что конкретные объекты являются частными случаями этих общих объектов.\u003c/p\u003e\u003cp\u003eЕсли бы пилотники тоже начинали с базовых свойств конкретных объектов, они бы заскучали и перестали учиться в первом модуле, после чего, как показывает опыт, крайне тяжело снова начать учиться в нужный момент и не вылететь. Вместо этого они сразу начинают с более абстрактных объектов из 2-го модуля обычного курса, а во втором модуле снова возвращаются к конкретным комбинаторным структурам, но уже с совершенно другой глубиной понимания.\u003c/p\u003e\u003cp\u003eВ третьем модуле оба потока приступают к теории вычислений, и относительно этого направления они уже не так сильно отличаются, ибо это уже слишком далеко от всего, чего можно было коснуться в рамках школьных олимпиад.\u003c/p\u003e\u003cp\u003eОтбор на пилотный поток проводится в августе по результатам \u003ca href\u003d\"https://www.hse.ru/ba/ami/test\"\u003eтестирования по математике и по программированию\u003c/a\u003e. Никого не заставляют идти на пилотный поток, это дело сугубо добровольное, причем можно решить отдельно как про математический трек, так и про программистский (можно выбрать сразу оба). Студенты довольно трезво оценивают свои силы, поэтому «конкурс» на пилотный поток небольшой и составляет не более 1.5 человек на место. Конечно, если вы активный участник соревнований на Codeforces, то мы предлагаем вам попробовать свои силы и поступить на пилотный поток, по крайней мере по программированию, тем более что для этого вам понадобится только выразить желание и хорошо написать контест :)\u003c/p\u003e\u003cp\u003eНу и напоследок, если вам захотелось к нам поступать, то любые вопросы можете задавать прямо в комментариях к посту, личным сообщением Codeforces или \u003ca href\u003d\"http://bit.ly/1ViDxMr\"\u003eВКонтакте\u003c/a\u003e; схема поступления расписана вот \u003ca href\u003d\"http://bit.ly/25muNeA\"\u003eздесь\u003c/a\u003e, а льготы для олимпиадников мы скоро опубликуем вот \u003ca href\u003d\"http://bit.ly/1TEPQ3a\"\u003eтут\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e","tags":["фкн","вшэ","machine learning","биоинформатика","информатика","факультеты","куда поступать","поступление"]}}