{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1403185225,"rating":48,"authorHandle":"jonathanirvings","modificationTimeSeconds":1403185225,"id":12735,"title":"\u003cp\u003eMy comeback story (repost)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cem\u003eI accidentally discard the original post :\u0027( Luckily I have the backup :) (but all of the comments are gone, though :( ). Let me repost it.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eMy target : Being red in TopCoder (or Codeforces also OK) before ACM-ICPC World Finals 2014. I remember watching live scoreboard of last year\u0027s ICPC WF in \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/ahmed_aly\" title\u003d\"Expert ahmed_aly\"\u003eahmed_aly\u003c/a\u003e\u0027s site. In that site, beside the team\u0027s name, there are the TC handles of the team\u0027s members. I want to make my handle red :p\u003c/p\u003e\u003cp\u003eStory : 12 June 2014 (1.5 weeks before ICPC WF), my TopCoder rating is 2182. There are still two more SRMs before WF. One of them, TopCoder SRM 624 was at that night. I failed it because of stupid MOD issue :\u0027( (At practice mode, I resubmit after fixing that issue and got AC). I was very depressed, as I really want to be red that night. (If I got AC, I would be top 100 and definitely be red) My rating decreased to 2138.\u003c/p\u003e\u003cp\u003eSwitch to Codeforces. My Codeforces rating was 2131. I participated Zepto Code Rush yesterday without any desire to make it red. But unpredictably, I got +72 and become red in Codeforces :\u0027) I take this as a comeback! (I failed several last rounds, including SRM624 and GCJ Round 2) I will keep this rating until World Finals (I will rest from Codeforces until WF) :)\u003c/p\u003e\u003cp\u003ePS : This comeback will be complete if I can make my TopCoder handle red at the last SRM before WF, TopCoder SRM 625 :))\u003c/p\u003e\u003cp\u003eUpdate : Comeback complete. I was ranked 29 in SRM625 and become red coder! :)\u003c/p\u003e\u003c/div\u003e","tags":["comeback","revenge"]}}