{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1515510452,"rating":178,"authorHandle":"Errichto","modificationTimeSeconds":1515511012,"id":57011,"title":"\u003cp\u003eShould TC announce a problem setter before the contest?\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eWhat do you think about Topcoder\u0027s policy regarding (not) revealing the author before the round? This time I was allowed to announce I\u0027m an author (btw. do participate in SRM 727!) but it was generally forbidden so far. Should it stay that way? Cons of announcing the author:\u003c/p\u003e \u003col\u003e   \u003cli\u003eEvery problem setter has their own style of problems. Some people will skip rounds of some setters because they don\u0027t like some type of problems. So one should carefully choose rounds in order to maximize their rating.\u003c/li\u003e   \u003cli\u003eKnowing the problem author might help you in solving a problem, e.g. when you know this author loves flows.\u003c/li\u003e   \u003cli\u003eRounds of new setters aren\u0027t that attractive so they might get fewer participants.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eMy opinion is that one\u0027s rating doesn\u0027t matter much so (1) isn\u0027t important. Similarly, I\u0027m fine with the fact that you can read problems in CF but decide not to participate — it doesn\u0027t affect me much.\u003c/p\u003e\u003cp\u003eIf we want to deal with (2), we would also have to forbid any personal references in the statements. I wouldn\u0027t want that.\u003c/p\u003e\u003cp\u003eThe last thing (3) is actually fine in my opinion. The author should try their best to prepare nice problems and his/her reward will be high participation in his/her next round. \u003c/p\u003e\u003cp\u003ePros of announcing:\u003c/p\u003e \u003col\u003e   \u003cli\u003eHopefully more participants in general. As an author, I want my round to get many participants and thus I announce it on CF and I invite my friends on facebook or in person. Let\u0027s also note that usually a problem setter and thus his/her friends are highly rated — in some way they make the contest more prestigious and indirectly increase the participation in the future.\u003c/li\u003e   \u003cli\u003eI don\u0027t have to hide from friends that I\u0027m preparing a round. While it\u0027s normal to not show statements, solutions, etc., it\u0027s very hard to ensure that nobody sees that I use topcoder software or that I\u0027m current coding in Intelli (what implies Java that I use only for TC). I\u0027m talking mainly about programming camps where I\u0027m usually not alone in a room. On the other hand, I once talked with Petr about this and he gave a good counterargument: a setter is paid for their work and there might be some requirements, also about keeping something secret.\u003c/li\u003e   \u003cli\u003eAs a participant, I\u0027m more eager to attend rounds of some authors. If I like their problems, I\u0027m more likely to skip classes or stay awake until 3am. Thus, I prefer to know.\u003c/li\u003e   \u003cli\u003eOther platforms reveal everything and nobody complies.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eMy opinion is that authors or particular problems should be secret only for big important contests like IOI, acm regionals and WF, TCO. We usually know who authors are there but every detail matters there and thus we shouldn\u0027t know the exact author of each problem. And reasons about high/low participation don\u0027t matter there.\u003c/p\u003e\u003cp\u003eWhat is your opinion?\u003c/p\u003e\u003cp\u003eI wrote two comments to create a voting, but I think discussing arguments is much more important.\u003c/p\u003e\u003c/div\u003e","tags":["problem setter","topcoder","revealing author"]}}