{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1424465267,"rating":5,"authorHandle":"kostya_by","modificationTimeSeconds":1424465267,"id":16533,"title":"\u003cp\u003eЛицейские тренировки 2015. Последняя лекция\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсем привет!\u003c/p\u003e\u003cp\u003eСегодня у нас была последняя лекция. Она получилась несколько более обзорной, чем конкретной, так что я вам скину ссылки на теорию, которую можно почитать в случае, если у вас возникли вопросы. Итак:\u003c/p\u003e \u003col\u003e   \u003cli\u003eПоиск минимума в стеке и очереди: \u003ca href\u003d\"http://e-maxx.ru/algo/stacks_for_minima\"\u003ehttp://e-maxx.ru/algo/stacks_for_minima\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eПерсистентный стек: \u003ca href\u003d\"http://neerc.ifmo.ru/wiki/index.php?title\u003dПерсистентный_стек\"\u003ehttp://neerc.ifmo.ru/wiki/index.php?title\u003dПерсистентный_стек\u003c/a\u003e\u003c/li\u003e   \u003cli\u003eПерсистентное дерево отрезков: \u003ca href\u003d\"http://e-maxx.ru/algo/segment_tree#28\"\u003ehttp://e-maxx.ru/algo/segment_tree#28\u003c/a\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eНичего по поиску минимума в деке за O(N) я не нашел, но это довольно экзотическая теория, так что не думаю, что вам когда-нибудь придется его писать. \u003c/p\u003e\u003cp\u003eЖелаю всем удачно съездить в ЗКШ и набраться там новых знаний. В десятом и в одиннадцатом классах ЗКШ здорово помогало мне подняться на новый качественный уровень и, надеюсь, вам тоже удасться унести оттуда как можно больше. По-больше дорешивайте и отдыхайте, по-меньше играйте в компьютерные игры. У вас настает самый интенсивный месяц в этом году, уже буквально через 40 дней все задачи и олимпиады прекратятся — а пока нужно поработать, чтобы улучшить свои навыки и результаты. Если будут какие-нибудь вопросы — можете написать мне, я постараюсь вам помочь. \u003c/p\u003e\u003cp\u003eС моей стороны будет подготовлено еще три контеста: первый из них пройдет завтра(21 февраля), а еще два вас ожидают на сборах к республиканской олимпиаде.\u003c/p\u003e\u003cp\u003eКак я писал в предыдущих письмах, задачи в мой зачет можно сдавать вплоть до последнего тура сборов к республиканской олимпиаде(до 20 марта, если я все правильно посчитал), а лучшие из вас получат от меня призы на память. “Лучшие” — понятие растяжимое, их может быть много, поэтому бороться стоит всем. \u003c/p\u003e\u003cp\u003eЗавтрашний контест начинается ровно в 13:00 и все пишут его из дома, постарайтесь не опоздать к началу. Условия задач будут размещены в отдельном посте в группе лицейских тренировок на codeforces.\u003c/p\u003e\u003cp\u003eКак всегда, можно мне написать вопрос на \u003ca href\u003d\"mailto:kostya.sokol.by@gmail.com\"\u003ekostya.sokol.by@gmail.com\u003c/a\u003e, а можно в скайп kostya-by.\u003c/p\u003e\u003cp\u003eВсем удачи!\u003c/p\u003e\u003cp\u003eКонстантин Сокол\u003c/p\u003e\u003c/div\u003e","tags":["лицей бгу","последняя лекция","ну вот и все"]}}