{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1465053351,"rating":71,"authorHandle":"gKseni","modificationTimeSeconds":1465162998,"id":45235,"title":"\u003cp\u003eТехнологии успеха: Тернистый путь к полуфиналу\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПродолжаем погружаться в историю спортивного программирования в России — с согласия авторов делюсь частями книги В.Н. Васильева и В.Г. Парфенова «Технологии успеха». Рисунки и фотографии — также из книги.\u003c/p\u003e\u003cp\u003eПредыдущая часть:\u003cbr /\u003e\u003ca href\u003d\"//codeforces.com/blog/entry/45199\"\u003eТехнологии успеха: Начало пути\u003c/a\u003e \u003c/p\u003e\u003chr /\u003e\u003chr /\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/4a/1e/4a1e1cba4fa9d5c7af571b84db3acd71667c0700.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eЭта же осень (Прим.: 1994 год — Codeforces::News) ознаменовалась приходом в Россию олимпиад АСМ. В сентябре на кафедру «Компьютерные технологии» (Прим.: Университета ИТМО — Codeforces::News) буквально «ворвался» Антон Суханов, размахивая плохо пропечатанной факсовой лентой, на которой никому не известная у нас организация АСМ приглашала российских студентов в Бухарест на какую-то студенческую олимпиаду по программированию. «Владимир Глебович! -темпераментно рисовал радужные перспективы Антон, — собираем супер команду из Елизарова, Кисловского и Аникина (все трое — ученики Суханова, Денис Кисловский — обладатель диплома первой степени на Всероссийской олимпиаде по информатике и серебряной медали на Международной олимпиаде по физике, Александр Аникин — обладатель диплома первой степени на Всероссийской олимпиаде по информатике) и всех в мире сметаем, и помните, — мотивировал он, — у нас в России, если Вы ничего не выиграете, то Вам ничего и не дадут (имелось в виду — для работы со способными ребятами)». По ходу дела выяснилось, что у Аникина нет иностранного паспорта, и вместо него в итоге поехал очень сильный второкурсник Игорь Середа. Главная проблема заключалась в том, что в этот момент на счету вуза вообще отсутствовали какие-либо деньги. Их не было не то, что на поездку, а даже на зарплату преподавателей и стипендии студентов. Тем не менее, ректор Геннадий Иванович Новиков сказал запомнившиеся В.Г. Парфенову слова: «Слушай (Новиков хорошо знал Парфенова еще со времен его студенческо-аспирантского периода жизни, читал ему курс «Архитектура ЭВМ», принимал экзамены и поэтому обращался на «ты»), денег нет и не предвидится. Но если случайно придет какая-то небольшая сумма, то обещаю оплатить билеты студентам, поскольку ничего существенного для вуза за эту сумму сделать не удастся, а так, может быть, кто знает, из этой олимпиады что-то полезное когда-нибудь и получится». Прошло больше двадцати лет, и теперь можно определенно сказать, что Геннадий Иванович не ошибся. Пошла последняя неделя перед отъездом, крайним сроком которого являлся вечер пятницы, но деньги все не поступали. И, наконец, утром в пятницу на счете вуза появилась небольшая сумма, и Роман Елизаров помчался в билетную кассу за счетом. Так мы стартовали в этой гонке, и началась история участия команд Университета ИТМО в соревнованиях АСМ.\u003c/p\u003e\u003cp\u003eВ марте 1995 Г. В.Г. Парфенов и А.А. Суханов организовали первые в России командные студенческие соревнования, проведенные по правилам олимпиад АСМ — первую Санкт-Петербургскую командную студенческую олимпиаду по программированию. Олимпиада прошла на базе кафедры «Компьютерные технологии». Некоторое представление о тех временах можно получить из опубликованной по результатам олимпиады заметке журналистки Галины Леонтьевой в известной тогда в Санкт-Петербурге газете «Смена» от 21 марта 1995 Г.:\u003c/p\u003e\u003cp\u003e«Пятьдесят самых умных студентов и одна самая умная студентка в области компьютерных технологий в субботу приняли участие в первой Санкт-Петербургской командной студенческой олимпиаде по программированию.\u003c/p\u003e\u003cp\u003eПо мнению экспертов, в нашем городе существует ведущая в стране школа по подготовке одаренных детей, занимающихся в этой сфере. Эти ребята еще в школьном возрасте ездят на всемирные олимпиады и занимают призовые места (кстати, у большинства из них компьютеров дома, конечно же, нет). И среди участников этой субботней студенческой олимпиады были ребята, увенчанные высокими и престижными титулами.\u003c/p\u003e\u003cp\u003eНапример, капитан первой команды Санкт-Петербургского института точной механики и оптики (технического университета) Роман Елизаров. В прошлом он — третий призер чемпионата мира по программированию среди школьников. Нынче его команда из трех человек заняла первое место в Петербурге.\u003c/p\u003e\u003cp\u003eВторое место — у первой команды Санкт-Петербургского государственного университета (капитан — Дмитрий Давыдок), третье — у второй команды Института точной механики и оптики (капитан — Дмитрий Финкельштейн), Четвертое и пятое места — у первой и второй команд Политеха.\u003c/p\u003e\u003cp\u003eДальше у этих одаренных ребят — соревнования восточноевропейской зоны мирового первенства.\u003c/p\u003e\u003cp\u003eЕсли, конечно, их родные вузы достанут денег на поездку. Пока что эти ребята еще сами не понимают, чего стоят на самом деле их умные головы. Ведь за победу в этой олимпиаде они получили ... по коробке конфет. И еще им обещают где-то в апреле подарки долларов за 100-120 (не деньгами, а программным обеспечением)».\u003c/p\u003e\u003cp\u003eВ связи с призами в памяти всплывает случай в начале девяностых годов, когда у организаторов олимпиады по программированию в качестве приза для тройки победителей была только коробочка с десятью дискетами (дискета — носитель информации типа флэшки, но с гораздо меньшим объемом, сейчас не используется). Сразу появилось предложение о распределении призов: первое место — пять дискет, второе — три, третье — две. Правда, В.Г. Парфенов засомневался, не обидится ли занявший третье место Денис Кисловский (в дальнейшем -член команды Университета ИТМО, ставшей первым чемпионом России) такому маленькому призу. И поэтому откровенно спросил Дениса, возьмет ли он без обиды такой маленький приз. «Конечно, возьму и не обижусь!» — уверенно сказал Кисловский, «сняв камень» с души председателя организационного комитета.\u003c/p\u003e\u003cp\u003eЗнаковым событием следующего 1995 г. стала сенсационная победа команды Университета ИТМО, сформированной из студентов кафедры «Компьютерные технологии», на полуфинальных соревнованиях Западно-Европейского региона, прошедших осенью в Амстердаме.\u003c/p\u003e\u003cp\u003eПодготовка к поездке на полуфинал немного напоминала сцену из романа «Преступление и наказание», когда нищий студент Родион Раскольников мечтал о карьере Наполеона. Шла уже четвертая холодная осень перехода России к рыночной экономике. Компьютерные факультеты российских университетов, не выдержав трудностей этого перехода, покинуло большинство наиболее квалифицированных преподавателей программирования и других компьютерных дисциплин, в вузах было очень мало рублей и компьютеров, десять долларов считались большими деньгами, а сто — невероятно большими. И в этих условиях на кафедре «Компьютерные технологии» трое второкурсников Университета ИТМО, профессор этой кафедры и четверокурсник СПБГУ строили планы участия в чемпионате мира. И хотя денег не было даже на билеты до ближайшего места проведения отборочных соревнований, но обсуждались только задачи завоевания мирового первенства. По прямой линии от комнаты, где происходило обсуждение, до стихии тогда еще лоточной торговли близлежащего Сытного рынка, как водится в петербургских романах, было метров пятьдесят. По рынку бродили молодые люди специфической внешности, представлявшие контролирующие рынок криминальные структуры, ярко показанные в известном кинофильме «Брат», в котором одного из руководителей подобной структуры застрелил Данила Багров. На ближайших к вузу улицах, Сытном рынке и в районе лоточной торговли около станции метро «Горьковская» снимали первые (еще хорошие, близкие к реальной жизни) серии известного сериала «Улицы разбитых фонарей». В общем, в город снова вернулись петербургские контрасты времен Ф.М. Достоевского.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/3c/f7/3cf7c4aa11cee82bb20237589dec0f78e62ba4a9.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eЧерез месяц, получив от трех петербургских компьютерных фирм, ставших на ноги без шальных московских денег, отнюдь не лишние для этих фирм средства на билеты, эта компания отправилась ни много ни мало в Амстердам (что было по тем временам фантастически «круто») на полуфинальные соревнования Западно-Европейской отборочной труппы. И все ее члены — и студенты, и профессор, понимали, что место им нужно только первое, гарантирующее выход российской команды впервые в финал. При другом исходе второй попытки могло бы и не быть из-за невозможности собрать от спонсоров во второй раз требуемую сумму. Отступать было некуда и юные члены команды, подготовленные тренером, который был двумя годами старше их, успешно решили «поставленную задачу».\u003c/p\u003e\u003cp\u003eУ В.г. Парфенова и А.А. Суханова на всю жизнь остались в памяти (и душе!) незабываемые впечатления от состоявшегося за день до победного Западно-Европейского полуфинала разговора, в ходе которого Билл Пучер сделал им предложение об организации своих отборочных соревнований чемпионата мира и выделил каждому (!) по тысяче долларов (!) для оплаты авиабилетов и гостиницы на финале, на который они должны были прибыть в качестве будущих руководителей этих соревнований. Как сказал после этого разговора с характерным для него юмором Антон: «Теперь мы с вами, Владимир Глебович, точно поедем на финал. Однако относительно наших ребят этого сказать нельзя. Посмотрим, используют ли они свой шанс и завоюют ли это право и для себя». Успех петербургских студентов не только расширил состав делегации Университета ИТМО для поездки на финал в Филадельфию, но и добавил россиянам уверенности на переговорах с Международным организационным комитетом и по изволил, наконец, получить для России и стран ближнего зарубежья собственную полуфинальную группу — Северо-Восточную Европейскую, выделив ее из существовавшей ранее Восточно-Европейской полуфинальной группы.\u003c/p\u003e\u003cp\u003eТеперь для сбора средств от спонсоров на проведение нового полуфинала надо было решить еще более трудную задачу и выиграть финал.\u003c/p\u003e\u003cp\u003eВ девяностые годы общество испытывало огромный дефицит хоть сколько-нибудь позитивной ин формации. И в этой обстановке победа программистов в Амстердаме нашла большой отклик в Санкт-Петербурге. Практически все газеты опубликовали статьи, петербургский телевизионный «Пятый канал» показал ребят в информационном выпуске новостей, который увидел мэр города А.А. Собчак, наградивший команду почетной грамотой. Особенно впечатляла статья в газете «Деловой Петербург». Две трети страницы газеты занимал портрет тройки победителей. Размер фотографии превращал троих петербуржцев, имевших достаточно скромные физические данные, в тройку былинных богатырей, одержавших победу над вооруженным до зубов «западно-европейским драконом».\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/96/a8/96a869880f0e3483da8e0cae5cda7e24d22cc4e4.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eВсе это облегчило В.Г. Парфенову сбор денег от спонсоров на поездку в Филадельфию. Кроме того, он познакомился со многими корреспондентами и впервые в режиме «боевой учебы» освоил азы работы с прессой и спонсорами, которые весьма пригодились ему в последующие годы.\u003c/p\u003e\u003cp\u003eПервой добившейся заметных успехов команде Университета ИТМО, которая выиграла отборочные полуфинальные соревнования в Амстердаме, были свойственны амбициозность, здоровое честолюбие, неиссякаемый оптимизм и даже некоторое нахальство. Вообще, многолетние наблюдения показывают, что в дальнейшем набор этих качеств стал, в не котором смысле, фирменным для выпускников кафедры «Компьютерные технологии».\u003c/p\u003e\u003cp\u003eВ данном случае эти качества проявились в абсолютной вере тренера и членов команды в безусловную победу в финале 1996 г. Даже гипотетическое завоевание третьего места заранее воспринималось как полная неудача. Возможность выигрыша второго места почему-то вообще не рассматривалась, и, наверное, поэтому за двадцать лет это место команды Университета ИТМО никогда не занимали. Под «гипнотическое» влияние уверенности членов команды и тренера попали даже В.Г. Парфенов и, частично, но в гораздо меньшей степени, ректор Университета ИТМО В.Н. Васильев. Общее мнение всех остальных сомневаюшихся в величии команды хорошо выразила старшая дочь В.Г. Парфенова, которая со свойственной женщинам практичностью и некоторой приземленностью спросила: «Папа, непонятно, как вы там собираетесь разнести всех в пух и прах. Вы ведь, мягко говоря, малоимущие люди по сравнению с остальными участниками и организаторами финала, у вас еще и деньги на билеты не собраны. Вы там будете как бедные родственники». Что на это можно было ответить? Разве только описать впечатляющие результаты команды на последних перед финалом двухнедельных сборах, после которых Суханов оценил возможности команды как фантастические, и сказать, что проведение по справедливости должно помочь умным, но бедным.\u003c/p\u003e\u003cp\u003eФинал 1996 г. был первым для российских команд, и они столкнулись с новой непривычной для них психологической ситуацией.\u003c/p\u003e\u003cp\u003eПо общему мнению, командный чемпионат мира по программированию среди университетов является одним из наиболее трудных в психологическом отношении интеллектуальных состязаний. По уровню соперничества этим состязаниям вряд ли можно найти аналог — престиж компьютерных технологий и программистов фантастически вырос за последние годы, и реальные шансы на победу в финале имеют два-три десятка команд, состоящих из специально отобранных и подготовленных талантливых ребят. В случае сравнительно небольшой страны команда ее главного университета является по существу сборной страны. Команды крупнейших американских университетов во многом укомплектованы собранными со всего мира обучающимися в них способными студентами.\u003c/p\u003e\u003cp\u003eСтарт, и пятьдесят (в последние годы — более ста) троек лучших молодых программистов планеты вскрывают конверты с заданиями и бросаются к своим компьютерам. В течение пяти часов, сменяя друг друга за монитором, они будут придумывать способы решения задач, составлять и отлаживать программы, огорчаться при получении из жюри отрицательных ответов, ликовать при удачных сдачах, мучительно искать возможные ошибки в решениях — и все это — в условиях фантастического дефицита времени и постоянного психологического давления таблицы текущих результатов. Типичную задачу финала сильный выпускник математического факультета университета может при постоянном наличии компьютера решить (если вообще решит) за день. В финале для занятия классного места команда за пять часов должна в настоящее время решить восемь-десять задач. И такое под силу собранным со всего света компьютерным звездам. Даже на классных программистов производит неизгладимое впечатление их способность набирать с огромной скоростью не литературные тексты под диктовку, а компьютерные программы, реализующие сложнейшие математические алгоритмы. Сложность задач год от года непрерывно возрастает. Лучшие команды финала 2015 г. решают самую сложную задачу финала пятнадцатилетней давности минут за десять.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/17/64/17646b7145e56b0f7c08973d43dd27422718904a.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eПримерно через три с половиной часа после начала соревнований лидеры решают по пять-шесть семь задач, и тут наступает критический момент соревнований, когда от наваливающейся от запредельного интеллектуального и нервного напряжения усталости участники уже не могут работать в прежнем темпе. В памяти у В.Г. Парфенова осталась сцена после окончания полуфинала 1995 г. в Амстердаме, когда тренер Антон Суханов спросил у Романа Елизарова, почему они не решили в заключительный час еще одну задачу. «Антон, у меня на последнем часу «поплыл» экран перед глазами, и я просто отключился» — ответил Роман, вполне подготовленный к олимпиадам и физически здоровый молодой человек. Одной из главных целей тренировок является выработка у команды способности продолжать бороться именно в эти последние полтора часа, а также психологической устойчивости — способности не паниковать в трудной ситуации, не суетиться на последних минутах, а как говорят теннисисты, играть в свою игру и, «поспешая, не торопясь», готовить для сдачи последние задачи.\u003c/p\u003e\u003cp\u003eПсихологическое давление усиливает и то обстоятельство, что по условиям чемпионата любой участник может выступить в финале независимо от результата только два раза. Таким образом, для того, чтобы проявить себя и оправдать огромные многолетние тренировки, участник имеет в лучшем случае десять часов финального соревновательного времени. Малейший сбой или заминка в финале могут перечеркнуть все надежды.\u003c/p\u003e\u003cp\u003eВ Филадельфии делегациям Университета ИТМО и МГУ -делегацию МГУ возглавлял Евгений Васильевич Панкратьев — открылась непривычная для россиян, но типичная для тех времен картина финала чемпионата мира — своеобразной «формулы один» современного программирования. Огромный конгресс-зал лучшего пятизвездочного отеля крупного американского города. В отелях такого уровня никто из россиян никогда не бывал. Пять десятков команд ведущих университетов мира. На футболках участников -завораживающие названия их вузов -Stanford University, Harvard University, University of California at Berkeley, Massachusetts Institute of Technology, Princeton University ... Бюджет любого из этих всемирно известных университетов более чем на порядок превосходил в то время бюджет всего высшего образования России. Зарплата уборщицы отеля раз в двадцать превосходила зарплату российского профессора. В такой обстановке почти физически ощущались масштаб мероприятия и количество огромных, по российским меркам того времени, денег, затраченных на его проведение. По многочисленным оценкам участников разных финалов, на этих соревнованиях типичный участник обычно чувствует себя «песчинкой», затерянной среди массы сильных и опасных соперников. Все это, вместе с огромным грузом ответственности, в полной мере испытал на себе и В.Г. Парфенов. И он мог сравнить свое психологическое состояние на финале с теми ощущениями, которые испытывал сам в школьные годы при выступлениях на ленинградских городских олимпиадах. Это состояние было таким, что даже если бы он мог решать предложенные на финале задачи, то вряд ли сумел бы что-нибудь сделать из-за волнения. В ночь перед финалом не только B.Г. Парфенов, но и А.А. Суханов, который имел огромный опыт личных успешных выступлений в олимпиадах самого высокого уровня, так и не смогли заснуть.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/74/df/74df4384e3c96b15de901e2c177dc671eb294d1b.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eВ Филадельфии молодые команды Университета ИТМО и МГУ впервые столкнулись с такими огромными психологическими нагрузками, которые усугубились недостаточно хорошим знанием английского языка, огромными текстами условий задач и несовершенством навязанного спонсором чемпионата мира, компанией Microsoft, своего компилятора Quick-Pascal. В итоге победы у команды Университета ИТМQ в финале не получилось, а получилось только девятнадцатое место с четырьмя решенными задачами. Не сильно лучше обстояли дела и у команды МГУ — те же четыре решенные за дачи и семнадцатое место. О психологическом состоянии россиян в тот момент лучше и не говорить.\u003c/p\u003e\u003cp\u003eТем не менее, надо было двигаться дальше и осенью 1996 г. провести первые полуфинальные соревнования Северо-Восточного Европейского региона. Когда В.Г. Парфенов и А.А. Суханов принимали предложение Билла Пучера об организации полуфинальных соревнований, то при оценке своих возможностей они исходили из опыта проведения олимпиад городского масштаба. Здесь же они столкнулись с нервными нагрузками и проблемами совершенно другого уровня. Первой из них была проблема обеспечения участия в состязаниях в реальном масштабе времени команд сибирских вузов, приезд которых в Санкт-Петербург был нереален из-за больших транспортных расходов. В то время авиасообщение в России практически прекратилось из-за отсутствия у населения средств на авиабилеты. В.Г. Парфенов до сих пор помнит, как он в середине девяностых годов приехал в Пупково-Г, чтобы забрать присланные самолетом документы, и увидел огромный пустынный зал, в котором одиноко бродил десяток человек. В советские времена в этом зале яблоку негде было упасть. Из прибывшего из Чебоксар самолета вышло два (!) пассажира, один из которых передал В.Г. Парфенову присланные документы. Кроме того, летом 1996 г. в России разразился тяжелый бюджетный кризис, и по инициативе А.Б. Чубайса бюджеты всех вузов (и соответственно зарплаты преподавателей), и без того весьма скромные. на второе полугодие были уменьшены на 40 процентов. Возникли опасения, что в Санкт Петербург вообще никто не приедет. В этой тяжелой ситуации было принято решение о проведении соревнований одновременно в двух городах — в Санкт-Петербурге и в Барнауле, в Алтайском государственном техническом университете, с использованием для их связи сети Интернет! По тем временам это было пионерское решение — впервые в мире были проведены соревнования чемпионата мира по программированию в реальном масштабе времени на двух удаленных площадках с использованием Интернет. Преподаватель кафедры «Компьютерные технологии» Ю.В. Гугель, являющийся одним из основных создателей сети RUNNet, обеспечил надежную компьютерную связь с Барнаулом через эту сеть.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/f6/cb/f6cbff69451d9e8346be1ec2e11bb58981ac35f1.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eВ то время программирование осталось чуть ли не единственной областью интеллектуальной деятельности, в которой молодой человек, имеющий способности в области точных наук, имел шансы на получение работы, обеспечивающей хоть сколько-нибудь достойное существование. А соревнования чемпионата мира по программированию оказались своеобразным «лучом света в темном царстве» перехода к так называемой рыночной экономике, организованного известными находящимися в Москве личностями. Этим фактом объясняется неожиданно высокий интерес российских вузов к полуфинальным соревнованиям. Число заявок, поступивших от вузов, входящих в петербургскую группу, в несколько раз превзошло ожидания организаторов и превысило пятьдесят. А это означало, что необходимо собрать сеть из шестидесяти компьютеров. По тому времени сосредоточение в одном месте шестидесяти одинаковых компьютеров было само по себе непростой задачей. К тому же было непонятно, где можно компактно их разместить. К счастью, Санкт-Петербург является городом, в котором традиционно высок престиж интеллектуального труда и интеллектуальных достижений. Благодаря этому удалось сформировать из петербургских государственных образовательных учреждений и частных компаний группу единомышленников, позволивших решить огромные организационные и финансовые проблемы.\u003c/p\u003e\u003cp\u003eПо инициативе генерального директора Санкт-Петербургского городского Дворца творчества юных Владимира Николаевича Киселева, для проведения соревнований были предоставлены прекрасно отремонтированные парадные помещения знаменитого Аничкова дворца. Однако решение задачи по поиску шестидесяти одинаковых компьютеров как-то не просматривалось. В тяжких думах об организации полуфинала В.Г. Парфенов и А.А. Суханов буквально потеряли сон: «Люди на последние деньги приедут в Санкт-Петербург, а мы завалим дело и опозоримся на всю жизнь!» К счастью, им фантастически повезло — в последний момент раздался спасительный телефонный звонок, сообщавший, что один из спонсоров соревнований — петербургская компьютерная компания «Ниеншанц» выделила для проведения полуфинала на четыре дня шестьдесят новых машин! И студенты кафедры «Компьютерные технологии» первого набора под руководством Михаила Бабушкина -ныне президента и генерального директора знаменитой компании DevExperts (более 500 сотрудников), в которой вице-президентом является Роман Елизаров, ударными темпами собрали из этих компьютеров сеть нужной конфигурации. Будущие «начальники» продемонстрировали высокий уровень владения технологиями «обжимания» концов сетевых кабелей.\u003c/p\u003e \u003ccenter\u003e \u003cimg src\u003d\"/predownloaded/70/02/70020870701e18500efbbd4bac5cd5ff4510d141.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/center\u003e\u003cp\u003eПосле проведения соревнований В.Г. Парфенов и А.А. Суханов в течение трех недель ежедневно, просыпаясь утром, испытывали острое чувство облегчения и даже почти счастья — полуфинал прошел!\u003c/p\u003e \u003chr /\u003e\u003cp\u003eСледующая часть: \u003ca href\u003d\"//codeforces.com/blog/entry/45259\"\u003eТехнологии успеха: Как начинался чемпионат Урала по программированию\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codeforces::news","технологии успеха"]}}