{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1495117076,"rating":129,"authorHandle":"manvscode","modificationTimeSeconds":1495117076,"id":52058,"title":"\u003cp\u003eInvitation to Snackdown 2017 Qualification Round\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello CodeForces Community!\u003c/p\u003e\u003cp\u003eI’d like to invite you to participate in CodeChef’s global annual onsite programming contest SnackDown 2017 Qualifier which starts day after tomorrow i.e. \u003ca href\u003d\"https://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dSnackDown+2017+Online+Qualifier+\u0026amp;iso\u003d20170520T17\u0026amp;p1\u003d44\"\u003e20th May, 2017\u003c/a\u003e. This time there are no restrictions on team formation (except max size of two). So, that leaves us with no reason to not take part in the contest. I am certain you will enjoy not only the exciting finale setup but also the brilliant problems.\u003c/p\u003e\u003ch3\u003eRegistrations:\u003c/h3\u003e\u003cp\u003eYou can register in a team of two or can go solo into the contest. The Online Qualifier starts at 20th May,2017.\u003c/p\u003e\u003cp\u003eIf you are yet to register, you can do so here: \u003ca href\u003d\"https://www.codechef.com/snackdown/2017\"\u003ehttps://www.codechef.com/snackdown/2017\u003c/a\u003e\u003c/p\u003e\u003ch3\u003ePrizes:\u003c/h3\u003e\u003cp\u003eAlong with the cash prizes for Global Winners, there are special prizes for Best School Team, Best Girls team and Best Indian Team (the total cash prizes are worth $20,500). The winning team shall win a whooping cash prize of $10,000. Top 300 Teams In the Elimination Round will get a cool SnackDown t-shirt. Every team member of the qualifying teams for the elimination round will get a domain name from \u003ca href\u003d\"https://radix.website/\"\u003eRadix registry\u003c/a\u003e. Certificate of Participation-All the teams advancing from the Qualifiers to further rounds will receive a digital certificate of Participation from CodeChef.\u003c/p\u003e\u003ch3\u003ePrevious Years:\u003c/h3\u003e\u003cp\u003eLast years \u003ca href\u003d\"https://www.codechef.com/snackdown/2016/finalists\"\u003estar-studded final\u003c/a\u003e was won by \u003ca href\u003d\"https://www.codechef.com/users/pattern_avoid\"\u003epattern_avoid\u003c/a\u003e team (Gennady Korotkevich and Borys Minaiev).\u003c/p\u003e\u003ch3\u003eSponsorship for onsite round:\u003c/h3\u003e\u003cp\u003eTravel expenses of the top 25 teams: Top 15 teams will be entitled for an all expense paid trip to Mumbai. The top 15 Indian teams that arrive at the finale will be entitled for an all expense paid trip to Mumbai. (Provided that they do qualify for the onsite finale. The top 10 teams are guaranteed an entry. The next 5 Indian teams have to be in top 100 of the Elimination round to be eligible for onsite finale. See rule 4 above under Onsite Finale).\u003c/p\u003e\u003cp\u003eFor more elaborate rules \u003ca href\u003d\"https://www.codechef.com/snackdown/2017/rules\"\u003eclick here\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAlso, taking into consideration the previous discussions regarding the timing of online elimination round of the contest, the organizers had done a poll beforehand, so as to satisfy time demands by more contestants.\u003c/p\u003e\u003cp\u003eI hope you like the new \u003ca href\u003d\"https://www.codechef.com/snackdown/2017/schedule\"\u003etimings\u003c/a\u003e and that will enjoy the contest till the very end. That will be all from my side for now. See you all at the contest. Regards, Ciao, Siba Prasad Tripathy (\u003ca href\u003d\"//codeforces.com/profile/manvscode\"\u003emanvscode\u003c/a\u003e)\u003c/p\u003e\u003c/div\u003e","tags":["snackdown2017","codechef","india","directi","snackdown"]}}