{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1500925437,"rating":76,"authorHandle":"aatalyk","modificationTimeSeconds":1500973794,"id":53465,"title":"\u003cp\u003ee-maxx for iPhone and iPad \u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eAfter 4 attempts of submission App Store finally has published the app for e-maxx. \u003c/p\u003e\u003cp\u003eHow I came to the idea of developing an app?\u003c/p\u003e\u003cp\u003eDuring riding in a bus I decided to read some algorithms on e-maxx cause have nothing to do rather than watching in the window. I opened the Chrome and started reading some article. After finishing reading decided to switch to another article though I found that it is a little annoying cause fonts are too small and internet connection is a little slow. So I came to question why not to create app which works offline and easy to use from phone. I read that all content in e-maxx are Public Domain so I decided to write the app.\u003c/p\u003e\u003cp\u003eWriting the app did not take much time but parsing the content and rechecking everything is a long process. Thereafter, there were some argument with App Store regarding the design. Finally, the app is in the App Store.\u003c/p\u003e\u003cp\u003eCurrently, the app is in russian and for iOS only. I am not planning to write android version yet though if you want you can, The link to project is below. Thanks for you attention! :-)\u003c/p\u003e\u003cp\u003eP.S. Thanks \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/e-maxx\" title\u003d\"International master e-maxx\"\u003ee-maxx\u003c/a\u003e for copyrights. \u003c/p\u003e\u003cp\u003eThe link to the app: \u003ca href\u003d\"https://itunes.apple.com/us/app/e-maxx/id1255128609?ls\u003d1\u0026amp;mt\u003d8\"\u003ehttps://itunes.apple.com/us/app/e-maxx/id1255128609?ls\u003d1\u0026amp;mt\u003d8\u003c/a\u003e \u003c/p\u003e\u003cp\u003eThe link to github project: \u003ca href\u003d\"https://github.com/aatalyk/e-maxx\"\u003ehttps://github.com/aatalyk/e-maxx\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["e-maxx","ios","app"]}}