{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1466351094,"rating":0,"authorHandle":"I_love_Hoang_Yen","modificationTimeSeconds":1466351250,"id":45538,"title":"\u003cp\u003eEPS\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003eVấn đề\u003c/h1\u003e \u003cul\u003e   \u003cli\u003eSố lưu trong máy tính là hữu hạn\u003c/li\u003e   \u003cli\u003eSố thực là vô hạn --\u0026gt; không thể lưu chính xác\u003c/li\u003e   \u003cli\u003e\u003cp\u003eKhi biểu diện ở hệ cơ số 2, có 1 số số thực không thể biểu diễn chính xác được. Ví dụ:\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e \u003cpre\u003e\u003ccode\u003e1/10 \u003d 0.0001100110011001100110011001100110011001100110011....\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003e\u003cspan class\u003d\"tex-span\"\u003e1 / 10\u003c/span\u003e ở hệ 2 có vô hạn chữ số sau dấu phẩy. (Cái này cũng tương tự như \u003cspan class\u003d\"tex-span\"\u003e1 / 3\u003c/span\u003e có vô hạn chữ số sau dấu phẩy ở hệ 10).\u003c/p\u003e\u003cp\u003e--\u0026gt; khi biểu diễn số thực trên máy tính, luôn có sai số\u003c/p\u003e\u003ch1\u003eEPS\u003c/h1\u003e\u003cp\u003eVì các số thực không được biểu diễn chính xác --\u0026gt; khi so sánh cần sử dụng EPS. Ví dụ:\u003c/p\u003e\u003cp\u003eThay vì \u003ccode\u003eif (a \u003d\u003d b)\u003c/code\u003e thì phải viết là \u003ccode\u003eif (fabs(a - b) \u0026lt; EPS)\u003c/code\u003e.\u003c/p\u003e\u003cp\u003e--\u0026gt; Chọn EPS như nào???\u003c/p\u003e \u003cul\u003e   \u003cli\u003eSố kiểu \u003ccode\u003edouble\u003c/code\u003e có khoảng 12-13 chữ số có nghĩa (cả trước và sau dấu phẩy). Số \u003ccode\u003elong double\u003c/code\u003e có khoảng 14-15 chữ số có nghĩa\u003c/li\u003e \u003c/ul\u003e\u003cp\u003e--\u0026gt; chọn EPS sao cho phù hợp với số chữ số sau dấu phẩy.\u003c/p\u003e\u003cp\u003eVí dụ: giả sử a và b là 2 số double có khoảng 6 chữ số trước dấu phẩy --\u0026gt; 7 chữ số sau dấu phẩy --\u0026gt; nếu chọn \u003ccode\u003eEPS \u003d 1e-9\u003c/code\u003e thì chả có ý nghĩa gì.\u003c/p\u003e\u003cp\u003eChọn EPS chủ yếu là để so sánh bằng nhau, nên cần phải đánh giá là các số mình đang so sánh có thể có bao nhiêu chữ số trước dấu phẩy, bao nhiêu chữ số sau dấu phẩy, từ đó biết đc 2 số có thể coi là bằng nhau nếu lệch EPS là bao nhiêu.\u003c/p\u003e\u003ch1\u003eChú ý\u003c/h1\u003e \u003cul\u003e   \u003cli\u003eNếu trong 1 bài mà có nhiều loại số với nhiều miền giá trị khác nhau, thì phải để EPS khác nhau cho các phần code. Ví dụ 1 bài Hình có 1 phần tính toán tọa độ điểm các thứ, tọa độ \u003cspan class\u003d\"tex-span\"\u003e10\u003csup class\u003d\"upper-index\"\u003e6\u003c/sup\u003e\u003c/span\u003e với 1 phần khác tính các góc (--\u0026gt; toàn 1 chữ số trước dấu phẩy), thì ta phải để EPS khác nhau cho 2 phần code này.\u003c/li\u003e   \u003cli\u003eKhi code hạn chế so sánh 2 số thực bằng nhau nếu có thể. Ví dụ giả sử mình cần sort 1 đống các số thực theo thứ tự tăng dần --\u0026gt; ko cần EPS, cứ để nó sort tự nhiên như thế. (nếu dùng EPS linh tinh có thể làm tăng sai số).   \u003cul\u003e     \u003cli\u003eNhưng ví dụ mình cần sort \u003ccode\u003epair\u0026lt;double,int\u0026gt;\u003c/code\u003e, nếu cái double bằng nhau thì sort theo cái int, thì chỗ này cần phải so sánh EPS.\u003c/li\u003e     \u003cli\u003eThông thường các bài mà chỉ thuần túy tính toán, thường sẽ ít khi dùng đến EPS. Nếu đặt EPS vào thì hãy suy nghĩ cẩn thận xem có thể code khác đi tí hoặc bỏ EPS đi không.\u003c/li\u003e     \u003cli\u003eLuôn ưu tiên dùng số nguyên nếu có thể.\u003c/li\u003e   \u003c/ul\u003e\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":[]}}