{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1432383233,"rating":86,"authorHandle":"votick","modificationTimeSeconds":1432431917,"id":18052,"title":"\u003cp\u003eUsers With Inspirational Progress Charts\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eI often enjoy looking through the top rated users here on CF and seeing the progress chart on their profile, it is really motivating to see where the current grandmasters where say 2,3,4+ years ago.\u003c/p\u003e\u003cp\u003eFor example there are users I\u0027ve found such as \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/RAVEman\" title\u003d\"Гроссмейстер RAVEman\"\u003eRAVEman\u003c/a\u003e who just launched out of the starting line with force as shown: \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/ad/99/ad996aa36cd0fa29c5ac9c8e2be2c31c0b17b8c8.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThere are also users who started off with a consistent pace, and then hit a peak somewhere midway (I always wonder what caused this). For example \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/ACRush\" title\u003d\"Международный гроссмейстер ACRush\"\u003eACRush\u003c/a\u003e \u003cimg alt\u003d\" \" src\u003d\"/predownloaded/72/4d/724dc26f3ef46019a4bb195ed2c8c8ba464eabb6.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eLastly my personal favorite profile to look at for inspiration is \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/matrix\" title\u003d\"Гроссмейстер matrix\"\u003ematrix\u003c/a\u003e. This user started just a bit higher than I have, with early days greatly resembling my own progress chart. I especially like how much it bounces around, purple/green/back to purple. Shows the determination of the user!\u003c/p\u003e\u003cp\u003e\u003cimg alt\u003d\" \" src\u003d\"/predownloaded/c4/65/c4654bcd944cd6e1825b0fc785ec67c0796d7bda.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eI know that there is a lot more than just a picture to tell the story; but these charts can be a good indicator of the mindset behind the coder, in my opinion. \u003c/p\u003e\u003cp\u003eAre there any progress charts you found particularly interesting? Perhaps anyone who you look to for motivation, a friend, or even your own if you have a story to tell?\u003c/p\u003e\u003cp\u003eI\u0027m personally shifting between green/grey as my profile shows; but I\u0027d like to think that with some hard (smart) training, I can progress over the next few years like some of you. Only time will tell.\u003c/p\u003e\u003c/div\u003e","tags":["motivation","progress"]}}