{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1476376259,"rating":94,"authorHandle":"gKseni","modificationTimeSeconds":1476376259,"id":47722,"title":"\u003cp\u003eНачался прием заявок на участие в ЛКШ.Зима 2016-2017\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/97/31/97319a4b4053b17996c9440d9a0e79a30325ba16.png\" style\u003d\"float: right;margin: 0 1.0em 1.0em 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eСмена ЛКШ.Зима пройдет в Московской области на базе \u003ca href\u003d\"http://www.solpolyana.ru/\"\u003eпансионата “Солнечная поляна”\u003c/a\u003e c 29 декабря 2016 года (заезд в первой половине дня, после обеда — начало занятий) по 7 января 2017 года (отъезд, учебных мероприятий нет). Принять участие в ЛКШ.Зима могут только школьники, которые были в одной из летних смен ЛКШ 2016 года.\u003c/p\u003e\u003cp\u003eЗаявки на участие в ЛКШ.Зима принимаются с 13 октября по 24 октября \u003ca href\u003d\"https://docs.google.com/forms/d/e/1FAIpQLSebRf83rmmlmIP5HbPU_91xkiA36G1DSY6aZOvrUAxa6Ajc4A/viewform#start\u003dopenform\"\u003eздесь\u003c/a\u003e. После заполнения заявки подождите пять минут и проверьте себя в конце \u003ca href\u003d\"https://docs.google.com/spreadsheets/d/1I022zmbnWb-7fLtKYDivJDwPWLbBqYiURHwHtT1tAE0/pubhtml?gid\u003d420697985\u0026amp;single\u003dtrue\"\u003eсписка подавших заявку\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eОрганизационный взнос с одного школьника составляет 22500 рублей. Он включает проживание, питание, организацию учебного процесса и досуга, экскурсии и походы в театр. Основной заезд и отъезд будет происходить через Москву и далее на электричке. Билеты до Москвы и обратно, а также на электричку приобретаются и оплачиваются самостоятельно.\u003c/p\u003e\u003cp\u003eЕсли вы не в состоянии оплатить полный оргвзнос, родителям школьника необходимо до 5 ноября написать \u003ca href\u003d\"https://lksh.ru/sis/2016/contacts.shtml\"\u003eписьмо в оргкомитет\u003c/a\u003e, указав причины обращения за скидкой, 2-3 наиболее значимых достижения школьника в области программирования или математики и максимальную приемлемую сумму оргвзноса.\u003c/p\u003e\u003cp\u003eОбращаем внимание на следующие ограничения:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003eВ школе запрещено курение и употребление спиртных напитков (в том числе и в новогоднюю ночь).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eУчастие в школе возможно только в полном объеме (нельзя приехать позже, уехать раньше или во время школы съездить домой). Исключение может быть сделано только для школьников из Москвы и Московской области, которые захотят провести новогоднюю ночь дома с семьей. В этом случае родители должны забрать их из пансионата вечером 31 декабря и привезти обратно в первой половине дня 1 января.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eУ нас нет возможности разместить сопровождающих, а также организовать их доступ и доступ родителей в место проведения ЛКШ.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eПараллели ЛКШ.Зима будут соответствовать параллелям летних смен: для каждой летней параллели будет соответствующая зимняя, обозначенная знаком “+”. Например, для школьников, учившихся летом в параллели B\u0027, будет параллель B\u0027+. Каждый школьник может быть зачислен только в параллель, соответствующую той параллели, где он учился летом.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eДля школьников, обучавшихся летом в параллелях A, A-AA, A-ML, будет организована общая параллель A+.\u003c/p\u003e\u003cp\u003eРешение об организации параллели Р+ будет принято после рассмотрения заявок. В случае, если параллель P+ организована не будет, школьники, обучавшиеся летом в параллели P, могут быть в индивидуальном порядке зачислены в другие параллели.\u003c/p\u003e\u003cp\u003eКлючевые даты проведения ЛКШ.Зима:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003e13 октября: начало приема заявок.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e24 октября: окончание приема заявок.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e1 ноября: публикация списков зачисленных и подробной информации для зачисленных, включая заезд и отъезд.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eС 30 октября доступны билеты на некоторые фирменные поезда в Москву с отправлением 28 декабря.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e14 ноября: начало продажи билетов на все поезда в Москву с отправлением 28 декабря.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e15 ноября: окончание заполнения анкеты зачисленного.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e9 ноября: начало продажи билетов на некоторые фирменные поезда из Москвы с отправлением 7 января.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e24 ноября: начало продажи билетов на поезда из Москвы с отправлением 7 января.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e29 декабря: день заезда (первая половина дня).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e7 января: день отъезда (в течение дня).\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e","tags":["codeforces::news","лкш"]}}