{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1399079431,"rating":-22,"authorHandle":"dustr80","modificationTimeSeconds":1399079431,"id":12098,"title":"\u003cp\u003ehis desire to play abroad\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003ehis desire to play abroad, he also pointed out that Chinese football and the national team is too complex, too unprofessional.Zhang Lin has been considered the most likely to gain a foothold in the European League of Chinese players, nearly every interview, he will be asked questions related with Liuyang, but Lippi had this half in jest, said: \u0026quot; \u003ca href\u003d\"http://www.freeasicscheap.co.uk/nike-free-30-v5-c-7.html\"\u003enike free 3.0 v5 mens\u003c/a\u003e  there will be no players left in my term of office of the team. \u0026quot;in a radio interview in Hong Kong, Zhang Lin admits Liuyang is his biggest dream,\u0026quot; family and teammates think I stay in the country development will be better, be more profitable But I do not earn even a penny, let me play I will go abroad. \u0026quot;And when it comes to the national team, ZhangLinPeng outspoken Chinese football is too complicated, \u0026quot;I do not know if I should say, the team is still too complicated, I cite one example, the Saudi national team and played in the Asian Cup qualifiers, the race day morning to open more than three hours will be from the leadership to the coach, everyone talking, and some are about football, and some is not about football, this is too career. to the national team is to match everyone should just concentrate on the game above, but such an important time, we are in a meeting! \u0026quot;as Orangemen absolute main, ZhangLinPeng think the team scored in 2018 World Cup hope not,\u0026quot; I think 2022 can enter the World Cup finals it, I hope the Football Association can give a young coach Fan Zhiyi this opportunity. \u0026quot;In East Asia, from Shanghai to Guangzhou Evergrande after the transfer, ZhangLinPeng the team to take the championship to get soft, which he said: \u0026quot;In fact, we get such good results, not because there are so many good players, but with the relevant training. Heng brigade everyone \u003c/p\u003e\u003cp\u003edoing all in training, to be honest, the training also tired than the competition. while Lippi on the pitch control is indeed very calm, very magical, so we can make achievements. \u0026quot;Hengda unlike the previous year, years so smoothly, ZhangLinPeng think about leaving the team with the hole card, \u0026quot;the new foreign aid need to run, just like the original El Eriksson when I first arrived, we felt that he would not play, the first game is also played very bad, But from the beginning of the second, he becomes a man from Egypt, \u003ca href\u003d\"http://www.freeasicscheap.co.uk/nike-free-40-v3-c-13.html\"\u003enike free 4.0 v3 cheap\u003c/a\u003e  God! \u0026quot;yesterday, in the other two games, the Warriors at home yesterday, the eighth round of Super League matches all over, but eight games, almost half Competition comes to controversial penalty. The APB Luneng 2-1 victory over the game, two goals are suspected Luneng is false. In addition, Guangzhou R \u0026amp; F and Dalian Bin Al\u0027s game, because of a questionable penalty, the team played almost all martial arts. Round of Super League, only a world-class referee, and this is because the first seven league too much controversy, the Football Association had to change a whole batch of referees. Yangzi Evening News reporter Zhang HaoLu Yu dispute referee upstageLuneng and Jianye game, Lowe opened the scoring with a penalty to help Luneng, but the slow-motion playback, the Lowe\u0027s place seems to be falling in the restricted line, the referee awarded a penalty a bit far-fetched. If the first ball is controversial, then Luneng second goal is entirely benefit from the referee\u0027s misjudgment: The first 67 minutes, Alois Theo Lowe assists befo\u003c/p\u003e\u003cp\u003ere scoring handball earlier, but this one Yellow obvious even escaped the referee\u0027s action stuff, can not but cast doubt on the value of the operational capacity of the referee when doubts. Indeed, as a \u0026quot;newly promoted\u0026quot; team, Jianye defeat at the foot of the powerhouse Luneng not surprising, but if this failure is based on the referee\u0027s misjudgment, then presumably Jianye players are not convinced .Another game, Guangzhou R \u0026amp; F sits at home 3-0 Lectra Dalian Albin, when the race to 32 minutes, unpleasant scene occurred in the field, and once led to skirmishes. Had to be played while teammate deadlift, red card Albin bench Tao shot hit the referee would almost rather the cause of all this, it comes from a controversial penalty fine. The first 32 minutes, decimating the players Zhangshuo when the ball inside the penalty area and the other in charge of the defense of physical contact\u003ca href\u003d\"http://www.freeasicscheap.co.uk/nike-free-40-v2-c-10.html\"\u003enike free 4.0 v2 mens\u003c/a\u003e  occurred, Zhang Shuo ground. At this point the main referee Jinpeng Xiang defensive foul, awarded the R \u0026amp; F a penalty kick by David hit, decimating broke the deadlock. For this time the referee\u0027s penalty, Albin players generally believe that the penalty is more far-fetched, led all players unhappy. In particular bench Tao, specially rushed to the fourth official at \u0026quot;discussing\u0026quot; the rest of the players will have to come Albin referee side expressed their dissatisfaction and opinions. And at this time, the referee suddenly rushes to the sidelines to Albin bench Tao produced a red card so as to be sent off, which further led to Albin player dissatisfaction. Digital Albin players and coaches surrounded the referee to make the field into a quasi-control situation.Then referee group quell the dispute this time, but after the game Albin players \u003c/p\u003e\u003c/div\u003e","tags":[]}}