{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1427652104,"rating":171,"authorHandle":"Michael","modificationTimeSeconds":1427754354,"id":17195,"title":"\u003cp\u003eПервый год факультета компьютерных наук ВШЭ\u003c/p\u003e","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ прошлом году я \u003ca href\u003d\"http://codeforces.ru/blog/entry/11918\"\u003eписал\u003c/a\u003e про создание нового факультета компьютерных наук в ВШЭ силами команды Школы анализа данных, \u003ca href\u003d\"http://codeforces.ru/blog/entry/12859\"\u003eотвечал\u003c/a\u003e на частые вопросы абитуриентов. Кстати, можете \u003ca href\u003d\"https://docs.google.com/forms/d/1szjkJKmB34jldx92vIdD21aOAqBardvMw8Z6zWFVgik/viewform?c\u003d0\u0026amp;w\u003d1\"\u003eрегистрироваться\u003c/a\u003e и приходить на \u003ca href\u003d\"http://cs.hse.ru/day_for_schools\"\u003eдень для школьников\u003c/a\u003e 5-го апреля с 12:00, если вам интересно \u003ca href\u003d\"http://www.hse.ru/news/admission/146267030.html\"\u003eчто-то из этого\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eЛетом я лично общался со многими призерами и победителями олимпиад через ВКонтакте и выяснял их настроение по поводу выбора факультета, причины того или иного выбора. Субъективно, наиболее частыми ответами, который я получал, или просто запомнившимися, были такие (не обязательно в порядке частотности):\u003c/p\u003e \u003col\u003e   \u003cli\u003eА я и так уже выбрал ваш факультет.\u003c/li\u003e   \u003cli\u003eЯ бы к вам пошел, но боюсь, что на первом году у вас будет бардак, поэтому все-таки пойду на ВМК/ФИВТ.\u003c/li\u003e   \u003cli\u003eЯ решил остаться в родном городе.\u003c/li\u003e   \u003cli\u003eЯ пойду на ФИВТ.\u003c/li\u003e   \u003cli\u003eЯ пойду на матфак ВШЭ.\u003c/li\u003e   \u003cli\u003eМне нравятся физика и математика, поэтому я пойду на ФУПМ.\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eЛюди, выбравшие матфак ВШЭ, заведомо делают лучший выбор, если уж решили заниматься математикой. Дада, при том, что я сам заканчивал мехмат, у меня сейчас уже нет в этом сомнений. Люди, решившие остаться в родном городе, заслуживают уважения, потому что именно на них потом держится образование в регионах. Хотелось бы в первую очередь побороться с вариантом 2, т.к. эти опасения, с моей точки зрения, и так были необоснованны, учитывая опыт команды организаторов, но сейчас это можно доказать уже фактами.\u003c/p\u003e\u003cp\u003eИтак, что же интересного произошло на ПМИ ФКН за первые три модуля обучения [вместо бардака]:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eНа факультет поступило \u003ca href\u003d\"http://cs.hse.ru/news/129955663.html\"\u003eнеожиданно много студентов\u003c/a\u003e. На ПМИ было предусмотрено 100 бюджетных мест. К середине июля к нам подали заявления более 200 человек, которых мы были обязаны взять исходя из критериев приема по олимпиадам. Кроме того, ректор ВШЭ лично гарантирует, что 25% от общего количества бюджетных мест (то есть 25) будут предложены людям с наилучшими баллами по ЕГЭ. Также мы набираем студентов на платное отделение — до 40 человек (кстати, информация про скидки \u003ca href\u003d\"http://www.hse.ru/news/admission/144493448.html\"\u003eздесь\u003c/a\u003e). В итоге мы набрали около 200 человек — почти в 2 раза больше, чем предполагалось.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eКак вы понимаете, подавляющее большинство поступивших \u003ca href\u003d\"http://biz.cnews.ru/news/line/index.shtml?2014/08/01/581406\"\u003eоказались олимпиадниками\u003c/a\u003e. Из них было 14 всероссов — 8 по информатике, 4 по математике, 2 по физике. По ЕГЭ поступило только примерно 10 человек самых-самых. Кстати, впоследствии они себя проявили лучше, чем некоторые люди, поступившие с олимпиад низкого уровня, см. об этом ниже.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВ связи с повышенным набором мы сформировали два лекционных потока по каждому предмету вместо предполагавшегося одного. Удалось найти достаточное количество лекторов и семинаристов. Всего образовалось 8 групп по 25 человек, разделенных на два потока по 100 человек.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eНа входе мы провели, как и собирались, тестирование по математике и \u003ca href\u003d\"http://codeforces.ru/blog/entry/13922\"\u003eпрограммированию\u003c/a\u003e. Желающие смогут по ссылке попробовать свои силы и сравнить свои результаты с результатами наших первокурсников. По результатам тестирования из топа (и с учетом пожеланий студентов получить дополнительную нагрузку) мы выделили \u003ca href\u003d\"http://www.hse.ru/news/edu/142074960.html\"\u003eпилотную группу\u003c/a\u003e. Пилотная группа на семинарах по обязательным предметам уходит вперед или рассматривает темы более глубоко; кроме того, все студенты пилотной группы сдают продвинутые факультативы по математике и по алгоритмам. На факультативы по математике, в принципе, допускаются все желающие, а на факультативе по алгоритмам места на семинарах ограничены (на лекции допускаются все желающие).\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВ 1-2 модулях студенты изучали программирование на Python и на C++, в 3-м модуле начался базовый курс алгоритмов, и он же продолжится и в 4-м модуле. Почти все семинаристы на обоих курсах — разработчики Яндекса. Лекторами по курсу также были сотрудники Яндекса, одним из лектором по Python и C++ был Алексей Зобнин; в прошлом он преподавал C++ в ШАДе. Мы знали, что студентам очень нравится стиль преподавания Леши, и смогли убедиться в этом еще раз. В ВШЭ каждые полгода проводятся опросы студентов о качестве преподавания, по результатам которых можно производить улучшения в учебном процессе. Насколько я знаю, это уникальная черта именно ВШЭ. Леша получил очень высокие оценки: проголосовавшие 63 студента (из 100 на его потоке) оценили происходившее на лекциях по нескольким критериям на оценки 4.5-4.7. Семинаристов также оценивали, и большинство семинаристов получили по всем 4-м критериям оценки не ниже 4.3.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eТакже студенты изучали математический анализ, дискретную математику, линейную алгебру и геометрию. См. общую программу бакалавриата \u003ca href\u003d\"http://www.hse.ru/ba/ami/about\"\u003eздесь\u003c/a\u003e. С выбором лекторов мы тоже постарались, в том числе пригласили хороших лекторов из НМУ, с мехмата. В результате все лекторы по всем математическим предметам получили оценки выше 4 по всем критериям, а большинство оценок были выше 4.5.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eМы также организовали факультатив по базовым математическим структурам для тех студентов, которые не успели получить нужную математическую культуру в школе или за счет участия в олимпиадах. Факультатив оказался успешным, мы собираемся продолжать проводить его и в следующем году. Также мы планируем добавить дополнительные консультации от преподавателей программирования для тех студентов, которым они необходимы. Также у нас в этом году самообразовались учебные группы, в которых студенты занимались программированием совместно и поясняли друг другу непонятные моменты. Мы помогли им организовать эту деятельность: для них были выделены аудитории и время в расписании.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eКак я писал ранее, студенты ПМИ ФКН начинают проектную работу прямо с 1-го курса. В 3-м модуле стартовал проектный семинар, в котором более 25 \u003ca href\u003d\"http://wiki.cs.hse.ru/Категория:Менторы\"\u003eменторов\u003c/a\u003e из индустрии и науки руководят индивидуальными проектами студентов. Темы проектов простираются от приближенных решений задачи коммивояжера, архиватора, написания ботов, хорошо играющих в 2048 до веб-схемы метро с поиском маршрута до распознавателя капчи до кластеризации раковых транскриптов и до сервиса статистического анализа истории рыночных цен финансовых активов, \u003ca href\u003d\"http://wiki.cs.hse.ru/%D0%9A%D0%B0%D1%82%D0%B5%D0%B3%D0%BE%D1%80%D0%B8%D1%8F:%D0%9F%D1%80%D0%BE%D0%B5%D0%BA%D1%82%D0%BD%D0%B0%D1%8F_%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0\"\u003eпосмотрите сами\u003c/a\u003e. \u003ca href\u003d\"http://wiki.cs.hse.ru/Участник:Gusakov\"\u003eЛеша Гусаков\u003c/a\u003e даже \u003ca href\u003d\"http://www.youtube.com/watch?v\u003daRCaopHgmp8\u0026amp;feature\u003dyoutu.be\"\u003eушел из Гугла\u003c/a\u003e, чтобы вести проекты у наших студентов :) В конце 3-го модуля студенты должны были сдать менторам промежуточный отчет в свободной форме, и сейчас у большинства уже есть некий работающий проект с частично реализованным функционалом. Мы планируем рассказать о наиболее ярких результатах проектного семинара в конце учебного года.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eС первых учебных дней начал работу центр студенческих олимпиад ВШЭ под руководством \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/gustokashin\" title\u003d\"Candidate Master gustokashin\"\u003egustokashin\u003c/a\u003e. По субботам ребята приезжали в Яндекс на совместные Яндекс.Тренировки с командами МГУ и других московских ВУЗов. По четвергам тренировки проходили прямо на факультете. Результаты не заставили себя ждать: две команды факультета прошли на полуфинал ACM, одна из них \u003ca href\u003d\"http://cs.hse.ru/news/138998975.html\"\u003eпрошла в финал\u003c/a\u003e ACM, который пройдет в мае в Марокко. Если учесть, что эта команда целиком состояла из первокурсников ПМИ ВШЭ, это очень сильный результат: ребята выступили лучше любой другой команды первокурсников в России. Также наши студенты успели отличиться и в математике: Вадим Калашников занял \u003ca href\u003d\"http://putnam.ho.ua/2014/winners.pdf\"\u003e5-е абсолютное место\u003c/a\u003e на Mirror of Putnam Competition — международной студенческой олимпиаде по математике. А если говорить о совсем прикладных вещах, то наша студентка Александра Фенстер \u003ca href\u003d\"http://cs.hse.ru/news/139577002.html\"\u003eвыиграла\u003c/a\u003e конкурс Avito.ru по распознаванию контактных данных на изображениях, а Станислав Семенов \u003ca href\u003d\"http://cs.hse.ru/news/133728391.html\"\u003eзанял\u003c/a\u003e 7-е абсолютное место на крупном международном Kaggle-соревновании \u003ca href\u003d\"https://www.kaggle.com/c/higgs-boson\"\u003eHiggs Boson Machine Learning Challenge\u003c/a\u003e.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eМы проанализировали результаты поступления и их корреляцию с нашим собственным тестированием по математике и программированию, с результатами сессии. Поняли, что и должны, и можем себе позволить повысить критерии приема на факультет по результатам олимпиад. Официальные критерии будут озвучены в конце мая, но в целом видно, что победители и призеры олимпиад 3-го уровня существенно проигрывают людям с очень высокими баллами по ЕГЭ, но без дипломов олимпиад, пригодных для поступления, а также некоторым из студентов платного отделения.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eКонечно, жизнь факультета не была ограничена только первокурсниками. У нас продолжает работать магистратура, в которой в том числе есть отделение ШАДа. Была создана новая магистерская программа \u003ca href\u003d\"http://www.hse.ru/ma/mmos/students\"\u003eматематические методы оптимизации и стохастики\u003c/a\u003e под руководством \u003ca href\u003d\"http://www.wias-berlin.de/people/spokoiny/\"\u003eВладимира Спокойного\u003c/a\u003e. Также была организована \u003ca href\u003d\"http://aspirantura.hse.ru/cs/\"\u003eаспирантская школа\u003c/a\u003e по компьютерным наукам со своим научным семинаром.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВ этом году были организованы \u003ca href\u003d\"http://cs.hse.ru/colloquium\"\u003eКоллоквиум ФКН\u003c/a\u003e и \u003ca href\u003d\"http://www.cs.hse.ru/tech\"\u003eИТ-лекторий ФКН\u003c/a\u003e. Коллоквиум — научное мероприятие, на нем выступали с лекциями различные российские и зарубежные ученые, такие как Александр Шень, Stefan Haar, Дмитрий Ветров, Илья Разенштейн, Глеб Гусев, Max Kanovich, Владимир Спокойный и другие. ИТ-лекторий — место, где представители компаний могут рассказать об интересных проектах в индустрии. Нас посетили представители Яндекса, Facebook, ВКонтакте, Одноклассников, Крока, SAP и других компаний.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eВ начале 2015-го года \u003ca href\u003d\"http://cs.hse.ru/news/142369995.html\"\u003eоткрылась\u003c/a\u003e лаборатория \u003ca href\u003d\"http://cs.hse.ru/lambda/\"\u003eLAMBDA\u003c/a\u003e (ЛАборатория Методов анализа Больших ДАнных), которую возглавил Андрей Устюжанин. Андрей руководит в Яндексе исследовательской группой, которая помогает физикам из \u003ca href\u003d\"http://home.web.cern.ch\"\u003eCERN\u003c/a\u003e анализировать эксперименты с Большого Адронного Коллайдера и применять для этого машинное обучение, в том числе на основе алгоритма MatrixNet, разработанного в Яндексе. В этом году благодаря команде Андрея Школу анализа данных \u003ca href\u003d\"https://company.yandex.com/press_center/blog/entry.xml?pid\u003d67\"\u003eприняли в LHCb\u003c/a\u003e — одну из коллабораций ЦЕРНа. Таким образом, ШАД стал единственной организацией, не специализирующейся на физике, которую официально приняли в CERN.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eЯндекс \u003ca href\u003d\"http://blog.yandex.ru/post/86383/\"\u003eучредил\u003c/a\u003e \u003ca href\u003d\"http://cs.hse.ru/iseg\"\u003eстипендию\u003c/a\u003e имени Ильи Сегаловича. Ее получат трое аспирантов, трое магистров и 10 бакалавров факультета, вручение пройдет \u003ca href\u003d\"http://cs.hse.ru/cs_days/\"\u003eв день рождения факультета\u003c/a\u003e — 1-го апреля.\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003c/div\u003e","tags":["факультеты","поступление","образование","фкн","вшэ","шад","яндекс","выбор вуза","для школьников"]}}