{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1488840702,"rating":207,"authorHandle":"SuprDewd","modificationTimeSeconds":1488850571,"id":50841,"title":"\u003cp\u003eSolve problems for a chance at an interview with Google\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eA couple of years ago Google launched an interesting website: \u003ca href\u003d\"https://www.google.com/foobar/\"\u003eGoogle Foobar\u003c/a\u003e. If you try to log in, you\u0027ll get an error saying:\u003c/p\u003e \u003cpre\u003eTo login, you have to have logged in before. Confused? Search on...\u003c/pre\u003e\u003cp\u003ePretty mysterious, right? Well, from what I read on Hacker News at the time, this is some kind of a puzzle set up by Google to recruit Python and Java developers. To get in, you\u0027d simply have to search for the correct phrase. Someone reported that searching for \u0026quot;arraylist java\u0026quot; got him inside, but that didn\u0027t work for me.\u003c/p\u003e\u003cp\u003eHowever, I recently found that searching for this actually gets you inside, but you have to be a little bit patient. Here\u0027s what you can do:\u003c/p\u003e \u003col\u003e   \u003cli\u003e\u003cp\u003eOpen a browser of your choice (it has to be a sufficiently new version so  you get the newest version of Google). I\u0027ve only tested this successfully  with Chrome and Firefox.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eGo to \u003ca href\u003d\"https://google.com/ncr\"\u003ehttps://google.com/ncr\u003c/a\u003e. (The /ncr at the end  is to make sure you go to the main version of Google. Don\u0027t know if that\u0027s  necessary, but doesn\u0027t hurt)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eSearch for \u0026quot;arraylist java\u0026quot; or \u0026quot;python list comprehension\u0026quot;. Other  programming-related search terms may also work, but these should definitely  work.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eHere comes the \u0026quot;be a little bit patient\u0026quot; part. Copy the URL for the search  results page that you just got (Ctrl+L, Ctrl+C). Now open a lot of tabs with  the same URL (repeat Ctrl+T, Ctrl+V, Enter). I\u0027m not sure how many tabs you  need to open, but from my experience 10 tabs should be sufficient.\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eWait for each of the tabs to load. Then go through them, one by one, and  look for a tab that contains a black banner saying \u0026quot;You\u0027re speaking our  language. Up for a challenge?\u0026quot; at the top of the search results. (If you  don\u0027t get any tab with this banner, try going back to step 1, possibly using  a different browser.)\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eClick \u0026quot;I want to play\u0026quot;. You\u0027re in!\u003c/p\u003e\u003c/li\u003e \u003c/ol\u003e\u003cp\u003eNow you will be presented with a terminal that you can use to solve some competitive programming-style problems using Java or Python. They start easy and become progressively harder, and each problem has a certain time frame you have to solve it within.\u003c/p\u003e\u003cp\u003eWhen you\u0027ve progressed to the third or fourth level (don\u0027t remember which one), you get the opportunity to send your code to Google recruiters. From what I\u0027ve read online, this has lead to some people getting an interview at Google. So if you\u0027re interested in that, this might be your chance! If not, it\u0027s still a bunch of fun problems to solve. :)\u003c/p\u003e\u003c/div\u003e","tags":["google","foobar","interview"]}}