{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1411608204,"rating":511,"authorHandle":"marat.snowbear","modificationTimeSeconds":1411786871,"id":13950,"title":"\u003cp\u003eCodeforces Round #269 (Div. 2)\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHello Codeforces community! I\u0027m happy to invite you to participate in Codeforces Round #269 for Division 2 which will be held \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?day\u003d26\u0026amp;month\u003d9\u0026amp;year\u003d2014\u0026amp;hour\u003d19\u0026amp;min\u003d30\u0026amp;sec\u003d0\u0026amp;p1\u003d166\"\u003ethis Friday, September 26th\u003c/a\u003e. As usual first division coders are invited to participate unofficially, I would appreciate a lot if they will join. \u003c/p\u003e\u003cp\u003eAll problems are mine, so if you won\u0027t like them... well, you know whom to blame for those. I did my best in order not to disappoint you. \u003c/p\u003e\u003cp\u003eSince this is my first round, let me introduce myself. I\u0027m 27, have around 7 years of programming experience and was never into ACM/ICPC and stuff like that before, learned words like \u0026quot;dynamic programming\u0026quot; couple of years ago from the algorithms course on Coursera and a bit later found this site. I\u0027m from Saint Petersburg, Russia, was born and lived here until I became 24. Then I got married and me and my wife decided to go live somewhere else and we moved to Kyiv, Ukraine, and we love that city a lot and we will return there some day, hopefully soon. \u003c/p\u003e\u003cp\u003eI hope you will find my problem set interesting and varied. Meanwhile let me get you prepared for the round and introduce you the guys you will help to. So the heroes of my round are three animals from Saint Petersburg and Kyiv zoos. Those are Menshikov and Uslada (\u0026quot;Uslada\u0026quot; means Delight in Russian) — polar bears, symbols of Saint Petersburg zoo. These are my favourite animals of that zoo, they \u003ca href\u003d\"http://youtu.be/PZAshm_Fdgg?t\u003d22s\"\u003ecan do a moonwalk dance\u003c/a\u003e. Their third friend would be Khoras — an elephant from the Kyiv zoo, not sure what kind of dances he likes but he \u003ca href\u003d\"https://fbcdn-sphotos-e-a.akamaihd.net/hphotos-ak-frc3/v/t1.0-9/733762_10151620577642982_438779350_n.jpg?oh\u003d38ec10412ff99bded794da4c5e957c5c\u0026amp;oe\u003d548CAD90\u0026amp;__gda__\u003d1421766383_ebf1b21135a23ba01c2e35a9d68c2227\"\u003ewas very friendly last time we\u0027ve been there\u003c/a\u003e. I was always fond of polar bears and elephants so now I have a round with them! Hope you will remember their names, in problem statements I call them by name and by animal type interchangeably. They want the friendship to exist between their countries and they have some minor problems you can help them with. \u003c/p\u003e\u003cp\u003eTraditional and untraditional regards for this round go to:\u003c/p\u003e \u003cul\u003e   \u003cli\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-admin\" href\u003d\"/profile/MikeMirzayanov\" title\u003d\"Headquarters, MikeMirzayanov\"\u003eMikeMirzayanov\u003c/a\u003e and the entire team of Codeforces for the site,\u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003e\u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Gerald\" title\u003d\"Master Gerald\"\u003eGerald\u003c/a\u003e for his help with the problems, \u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003eMaria Belova aka \u003ca class\u003d\"rated-user user-black\" href\u003d\"/profile/Delinur\" title\u003d\"Unrated, Delinur\"\u003eDelinur\u003c/a\u003e for the translation of the statements, \u003c/p\u003e\u003c/li\u003e   \u003cli\u003e\u003cp\u003elast but definitely not least, my wife Tanya for her infinite support in everything I do. This round wouldn\u0027t be here without her.\u003c/p\u003e\u003c/li\u003e \u003c/ul\u003e\u003cp\u003eWikipedia asked me to remind you that the day we\u0027ll have the round (at least in Russian tome zone and time zones close to it) is 269th day of the year, matches the round number perfectly thanks to \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/Gerald\" title\u003d\"Master Gerald\"\u003eGerald\u003c/a\u003e\u0027s scheduling skill. \u003c/p\u003e\u003cp\u003eIf you read up (down?) to here and I still have your attention then let me know the secret every non-red coder wants to know — in order to become red you need to solve at least 1513 problems on this site. That\u0027s a personal experience, trust me. \u003c/p\u003e\u003cp\u003eAnother thing I\u0027d like to mention here: \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/gojira\" title\u003d\"International master gojira\"\u003egojira\u003c/a\u003e was cheating! In his \u003ca href\u003d\"/blog/entry/8615\"\u003eround announcement\u003c/a\u003e he mentioned that he\u0027s taking the \u0027eldest problem setter\u0027 title from \u003ca class\u003d\"rated-user user-violet\" href\u003d\"/profile/Sammarize\" title\u003d\"Candidate Master Sammarize\"\u003eSammarize\u003c/a\u003e but he didn\u0027t mention his age, so I can\u0027t tell whether this title should be mine or not. \u003ca class\u003d\"rated-user user-orange\" href\u003d\"/profile/gojira\" title\u003d\"International master gojira\"\u003egojira\u003c/a\u003e, please let us know ASAP! \u003c/p\u003e\u003cp\u003eWill see you on the round and I will appreciate a feedback (both positive and negative) a lot! \u003c/p\u003e\u003cp\u003eP.S.: as usual the scoring will be announced closer to the start time, hopefully my memory won\u0027t fail and I will update this blog post then. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eupd 0\u003c/strong\u003e: small update for the English version. In English statements the names of the characters will be Menshykov, Uslada and Horace, don\u0027t get surprised :-)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eupd 1\u003c/strong\u003e: scoring will be a bit different from normal today: \u003cstrong\u003e500, 1000, 2000, 2000, 2500\u003c/strong\u003e\u003c/p\u003e \u003chr /\u003e\u003cp\u003eThanks to everybody who was with us today, hope you enjoyed it! My congratulations to the winners. \u003ca class\u003d\"rated-user user-gray\" href\u003d\"/profile/worse\" title\u003d\"Newbie worse\"\u003eworse\u003c/a\u003e didn\u0027t take part in today\u0027s contest so the fight was tough on both sides of the table. While Menshykov and Uslada are updating the ratings, Horace is finishing the editorial, he\u0027s promising it will be ready a bit later today. \u003c/p\u003e\u003cp\u003eI understood and noted some mistakes of mine in this contest, but please let me know if you have anything to tell about it. I like how it\u0027s started, thanks for beating the 5K record, that\u0027s awesome.\u003c/p\u003e\u003cp\u003eUnfortunately nobody solved E, though \u003ca class\u003d\"rated-user user-red\" href\u003d\"/profile/hos.lyric\" title\u003d\"Grandmaster hos.lyric\"\u003ehos.lyric\u003c/a\u003e was very close to it. His solution failed on the second to last test, which I didn\u0027t consider to be a max test. I consider this to be my mistake that I underestimated the problem, otherwise I would leave it for some next contest.\u003c/p\u003e\u003cp\u003eBest regards,\u003cbr /\u003eWill see you at some next round,\u003cbr /\u003eMarat.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"/blog/entry/13999\"\u003eRound stats\u003c/a\u003e from \u003ca class\u003d\"rated-user user-blue\" href\u003d\"/profile/DmitriyH\" title\u003d\"Expert DmitriyH\"\u003eDmitriyH\u003c/a\u003e\u003cbr /\u003e\u003ca href\u003d\"/blog/entry/13986\"\u003eEditorial\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["round","cf-269","eldest problemsetter"]}}