{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":true,"creationTimeSeconds":1474118880,"rating":90,"authorHandle":"RussianCodeCup","modificationTimeSeconds":1474119278,"id":47168,"title":"\u003cp\u003eRussian Code Cup 2016 — Final Round and Online Contest\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eHi, everyone!\u003c/p\u003e\u003cp\u003eTomorrow, on \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dRCC+2016+Finals\u0026amp;iso\u003d20160918T12\u0026amp;p1\u003d166\u0026amp;ah\u003d2\"\u003eSeptember 18, 2016, at 12-00\u003c/a\u003e the Final Round of Russian Code Cup 2016 will take place. Top 50 participants of the Elimination Round will take part in the contest and have a chance to win great prizes. The length of the Final Round this year is 2 hours, the Final Round participants will compete online. You can watch the Final Round at \u003ca href\u003d\"http://russiancodecup.ru\"\u003ehttp://russiancodecup.ru\u003c/a\u003e\u003c/p\u003e\u003cp\u003eMeanwile we are pleased to announce that the Russian Code Cup team together with Codeforces project have prepared a small surprise to all those who didn\u0027t manage to get to the Final Round of RCC-2016. After the Final Round ends, at \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?msg\u003dRCC+2016+Finals+Online+Contest\u0026amp;iso\u003d20160918T1405\u0026amp;p1\u003d166\u0026amp;ah\u003d2\"\u003e14-05\u003c/a\u003e Codeforces will host online-contest with RCC-2016 Final Round problems.\u003c/p\u003e\u003cp\u003eThe contest will use ACM ICPC rules and will not be rated. Problems will be in English and in Russian. Problems were prepared for Russian Code Cup Final Round, so they are quite difficult, the contest is mostly suitable for Div1 participants. Of course, we would like to ask the Final Round participants do not use the contest for testing their upsolved solutions, please wait until the end of the online contest and use the problem archive.\u003c/p\u003e\u003cp\u003eSo, everyone is welcome to watch the Final Round and then to take part in the online-contest! Good luck to everybody!\u003c/p\u003e\u003c/div\u003e","tags":[]}}