{"status":"OK","result":{"originalLocale":"en","allowViewHistory":true,"creationTimeSeconds":1491880065,"rating":133,"authorHandle":"koil","modificationTimeSeconds":1491880065,"id":51529,"title":"\u003cp\u003eThe big idea of cheating\u003c/p\u003e","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch2\u003eThe story of cheating.\u003c/h2\u003e\u003cp\u003eIn the last div 2 contest, you guys have noticed that there were nearly 30 fake accounts who took 3rd to 30th places before system testing. The first and second leaderboard page were filled mostly with unrated black guys. Here\u0027s a \u003ca href\u003d\"//codeforces.com/blog/entry/51503?#comment-353667\"\u003escreenshot\u003c/a\u003e from another users. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eI created them.\u003c/strong\u003e I know and acknowledge that this can be called as an act of massive cheating. \u003c/p\u003e\u003cp\u003eI didn\u0027t intended doing it to steal people\u0027s rating and win some div 2 contest. I didn\u0027t mind about winning div 2 contest anymore. I did won a few times, kid stuff. \u003c/p\u003e\u003cp\u003eI didn\u0027t do it just only for fun. Honestly, this small joke is extremely boring itself only. \u003c/p\u003e\u003cp\u003eSo why did I do that ?\u003c/p\u003e\u003cp\u003eThe neccessary reason is that I\u0027m currently in my break, so I have a lot of free time.\u003cbr /\u003eThe sufficient reason is to test my \u003cstrong\u003ebig idea\u003c/strong\u003e (not the one you saw). \u003c/p\u003e\u003ch2\u003eThe biggest idea of cheating\u003c/h2\u003e\u003cp\u003eIn most of div 1 contests, the number of room is lesser than or equal to \u003cstrong\u003e20\u003c/strong\u003e. If we have more than 20 purple accounts, there would be two of them in the same room (\u003ca href\u003d\"https://en.wikipedia.org/wiki/Dirichlet%27s_principle\"\u003eDirichlet\u0027s principle\u003c/a\u003e). Let\u0027s call them \u003cstrong\u003emeepo00\u003c/strong\u003e and \u003cstrong\u003emeepo01\u003c/strong\u003e. The idea is about exploiting the hacking system to boost their points. \u003c/p\u003e\u003cp\u003eAccount \u003cstrong\u003emeepo00\u003c/strong\u003e would solve an arbitary problem, for example the easiest problem. In \u003cstrong\u003emeepo00\u003c/strong\u003e\u0027s solution, there would be a secret input case that his solution would absolutely failed. For example : \u003c/p\u003e \u003cpre\u003e\u003ccode\u003eint main() {\n    cin \u0026gt;\u0026gt; N;\n    if (N \u003d\u003d 69696969) {\n        cout\u0026lt;\u0026lt;\u0026quot;I\u0027m hacked\u0026quot;;\n        return 0;\n    } else {\n        solve(N);\n    }\n    return 0;\n}\n\u003c/code\u003e\u003c/pre\u003e\u003cp\u003eAccount \u003cstrong\u003emeepo01\u003c/strong\u003e would hack account \u003cstrong\u003emeepo00\u003c/strong\u003e by that test case. And obviously he will receive 100 points. We keep repeating the process by changing the secret key number from \u003cstrong\u003e69696969\u003c/strong\u003e to something else and get more points. \u003c/p\u003e\u003cp\u003eLet\u0027s say we have 1 hour 30 minutes to hack, that\u0027s 5400 seconds. Let\u0027s say each iteration takes 30 seconds, so we can do it total of 180 times and gain \u003cstrong\u003e18000 points\u003c/strong\u003e. Even half of those points can give \u003cstrong\u003emeepo01\u003c/strong\u003e the \u003cstrong\u003efirst place\u003c/strong\u003e in any \u003cstrong\u003ediv 1\u003c/strong\u003e contest. \u003c/p\u003e\u003cp\u003eImagine someone took the first place in a div 1 contest, beat Legendary grandmasters \u003cstrong\u003ewithout solving a second problem\u003c/strong\u003e. That\u0027s the most ridiculous joke ever.\u003c/p\u003e\u003cp\u003eUntil the administrator stop us, as they did to me :D \u003c/p\u003e\u003ch2\u003eThe problem\u003c/h2\u003e\u003cp\u003eThe problem turned out to be having more than 20 purple accounts. So I wrote some simple JavaScript that help me to automatically create bunch of email then new accounts, log in into each of them, submit a modified solution, log out and repeat... \u003c/p\u003e\u003cp\u003eWith more subtle execution than it was (for example, adding bigger time gap between each account\u0027s submission, less obfuscated code, taking small steps...), I could silently take these bots into div 1 and tell the big joke. \u003c/p\u003e\u003cp\u003eBut I was so hurry, so naive and get caught as you guys know. The administrator banned all of my bots, except this one. \u003c/p\u003e\u003cp\u003eAnyway I have shown you the proof of concept and you may think that achieving it is possible.\u003c/p\u003e\u003ch2\u003eConclusion\u003c/h2\u003e\u003cp\u003eAs things didn\u0027t go as I expected (thanks to my poor execution) and my vacation is also nearly over, I might abandon it. I write this post to share the insight with anyone who find it interesting, even though I predict the post will receive tons of downvotes since this is not really a contribution. But who cares ? \u003c/p\u003e\u003cp\u003eIt\u0027s not about the rating or beating legendary grandmasters at all. These things are just illusory. \u003c/p\u003e\u003cp\u003eIt\u0027s about the idea behind. \u003c/p\u003e\u003cp\u003eEven if the idea may leads to those illusions, it\u0027s still \u003cstrong\u003ean original and creative idea that no one ever did\u003c/strong\u003e. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eI believe that encoutering and executing original and unique ideas everyday helps a lot in being motivated and creative, even if they are unusual and weird. So I wrote this post and hoped that somewhere in the Codeforces community, some people, who love this kind of creativity just like me, would enjoy it.\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e","tags":[]}}