{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1290111240,"rating":4,"authorHandle":"yaro","modificationTimeSeconds":1290197155,"id":884,"title":"Solutions for Сodeforces Beta Round #41","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cb\u003eА. Guilty — to the kitchen!\u003cbr /\u003e\u003c/b\u003eLet us reformulate the statement: we need to find the maximum possible value of x (mentioned in the statement) so that the amount of each ingredient will be enough. Clearly, such x equals min(b_i / a_i). Now it suffices to take minimum of the two values: soup volume we gained and the volume of the pan.\u003cbr /\u003e\u003cb\u003e\u003cbr /\u003eВ. Game of chess unfinished.\u003c/b\u003e\u003cbr /\u003eIn this problem you are to check exactly what the statement says: if the king\u0027s position and all the positions reachable by him in one turn are \u0026quot;beaten\u0026quot;, — that\u0027s a mate. Thus, we have to determine \u0026quot;beaten\u0026quot; positions correctly. Let us remove the black king from the chessboard, leave the positions of  the rooks \u0026quot;unbeaten\u0026quot; (not to forget about possible taking of the rook by the black king), mark positions reachable by rooks \u0026quot;beaten\u0026quot; and then mark positions reachable by white king as \u0026quot;beaten\u0026quot;.\u003cbr /\u003e\u003cbr /\u003e\u003cb\u003eС. Safe cracking.\u003c/b\u003e\u003cbr /\u003eThe answer in this problem is always affirmative, which means it is always possible to make all the numbers equal to one. Greedy approach (here we somehow make two adjacent numbers even and then divide them by two) leads the sum of numbers to become less or equal to six in logarithmic (and certainly less than 1000) number of operations. There are several ways do deal with extremal cases: for instance, many of the participants coped with this by the analysis of all of the cases left. The greedy approach only is not sufficient: the crucial test for hacks was (1 1 1 2).\u003cbr /\u003e\u003cbr /\u003e\u003cb\u003eD. Strange town.\u003cbr /\u003e\u003c/b\u003eLet us associate some numbers a_i with the vertices of the graph. If, for each edge, we assign it the sum of its endpoints\u0027 numbers, then the sum of prices along arbitrary hamiltonian cycle will be equal to the doubled sum of a_i. Therefore, it suffices us to devise such numbers a_i so that their pairwise sums will be distinct (as the edge prices should be distinct). As all of the edge prices are bounded above by 1000, we have to think of an efficient strategy to obtain such a_i. Let\u0027s choose them in greedy way, so that newly added a_i should not be equal to (a_p + a_q - a_k) for each triple of already chosen a_p, a_q, a_k. It is clear that a_n \u003d O(n^3) as there are O(n^3) \u0026quot;blocking\u0026quot; triples (p, q, k).\u003cbr /\u003eAnother idea lies in that equality AB+CD\u003dAC+BD should hold for every quadruple of distinct vertices A, B, C, D (summands stay for edge prices), because a hamiltonial cycle with edges AB and CD can be easily rearranged in the cycle with edges AC and BD and the sums of these cycles should be equal.\u003cbr /\u003eYou may think of how this idea was used by jury to check your solutions in exact and fast way.\u003cbr /\u003e\u003cbr /\u003eThe solution of the problem E will appear soon.\u003c/div\u003e","tags":["codeforces-beta-41","solutions"]}}