{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1268000201,"rating":9,"authorHandle":"brainail","modificationTimeSeconds":1268215994,"id":143,"title":"Поздравляем всех женщин-программистов (и не только ;-)) со всемирным женским днём! с 8 марта! Кампай! \u0026gt;_\u0026lt;","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cb\u003eВот интересные статейки про женщин, которые стали программистами,через что они прошли,и чего они хотят на 8 марта ;-) не зевай! \u003d)\u003c/b\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cdiv\u003e    \u003ch2\u003e\u003cu\u003eИнтервью с женщинами-программистами  \u003c/u\u003e\u003c/h2\u003e   \u003c/div\u003e                                       \u003cp align\u003d\"center\"\u003e\u003cimg src\u003d\"/predownloaded/96/6c/966c176e3975451cfd383986c51725f8532921c1.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e \u003cp\u003eПредставляю вашему вниманию праздничное 8-ми мартовское интервью с женщинами-программистами. Основная идея интервью - разбить стереотипы, показать, что женщины-программисты есть и что они ничем не хуже мужчин-программистов.\u003cbr /\u003e Оказалось, что найти женщин-программистов в интернете не так просто. Они не любят публичности и не ведут профессиональных блогов. У них другие увлечения и не так уж и сильно желание выделиться и стать известными. Наверное, поэтому иногда кажется, что их совсем нет.\u003cbr /\u003e Но они есть! Мне удалось получить ответы от 7-ми представительниц прекрасного пола и отказы еще от десятка \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003e\u003cb\u003eИтак, праздничное интервью с женщинами-программистами:\u003c/b\u003e\u003c/p\u003e \u003cp\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e \u003cp\u003e\u003cbr /\u003e\u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003e \u003ca href\u003d\"http://escapio.livejournal.com/\" rel\u003d\"nofollow\"\u003eМарина aka escapio\u003c/a\u003e:\u003cbr /\u003e Мы с Мариной учились вместе в Университете. А на 4-ом курсе она поехала по обмену учиться в Финляндию, получила 2 диплома и теперь живет и работает программистом в Финляндии. Она имеет мужа и 2-х очаровательных детей, любит путешествовать и фотографировать, но про это вы можете прочитать в ее \u003ca href\u003d\"http://escapio.livejournal.com/\" rel\u003d\"nofollow\"\u003eжурнале\u003c/a\u003e.\u003c/p\u003e \u003cp\u003e\u003cb\u003e1. Как случилось, что вы выбрали профессию программиста?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eУ меня абсолютно математический склад ума. В школе я несколько раз выигрывала городские олимпиады по математике, физике и… географии (люблю путешествовать) \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e Так что вопроса какую профессию выбрать как-то не возникло, уже в 11 классе заочно училась на подготовительных курсах в выбранном вузе.\u003c/p\u003e \u003cp\u003e\u003cb\u003e2. Что было самым интересным и самым сложным для вас во время обучения программированию?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eПолучать второе высшее в Финляндии и одновременно писАть диплом для российского универа. Спали часа по 4, досыпали на лекциях. Было дико сложно, но интересно.\u003c/p\u003e \u003cp\u003e\u003cb\u003e3. Как вы думаете, почему сейчас так мало женщин - профессиональных программистов? Изменится ли ситуация в ближайшем будущем?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eУ женщин традиционно гуманитарный склад ума, поэтому и преобладание гуманитарных профессий. Нет, не изменится.\u003c/p\u003e \u003cp\u003e\u003cb\u003e4. Как к вам относятся мужчины-программисты на работе? Хотели бы вы что-то изменить в их отношении в вам?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eОтлично относятся. У нас вообще очень теплые отношения в коллективе \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e Я сейчас в декрете (ну ты знаешь), так меня со всеми праздниками поздравляют, подарки присылают, встречаемся-пьем кофе. И заказчики хорошо относятся, были случаи, когда заказчик просил мэнеджера отдать их новый проект мне, понравилось им со мной работать.\u003c/p\u003e \u003cp\u003e\u003cb\u003e\u003cbr /\u003e 5. Как женщина-программист, посоветуйте мужчинам-программистам, что подарить жене на 8-ое марта? \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e 6. А какой подарок вы сами мечтаете получить на 8-ое марта дома и на работе?\u003cbr /\u003e \u003c/b\u003e\u003c/p\u003e \u003cp\u003eЯ всегда рада путешествиям-сюрпризам, пусть даже коротким на выходные \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e У тебя жена любит путешествовать? вот паром Хельсинки-Стокгольм-Хельсинки - дешево и сердито \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e или в Таллинн паром.\u003c/p\u003e \u003cp\u003e\u003cbr /\u003e\u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003e \u003ca href\u003d\"http://omega-it.blogspot.com/\" rel\u003d\"nofollow\"\u003eСветлана aka Omega\u003c/a\u003e:\u003cbr /\u003e Светлана сейчас - руководитель отдела в крупной компании. Начинала она там обычным программистом и росла профессионально вместе с ростом компании.\u003cbr /\u003e Также она ведет блог о программировании \u003ca href\u003d\"http://omega-it.blogspot.com/\" rel\u003d\"nofollow\"\u003eOmega-it\u003c/a\u003e.\u003c/p\u003e \u003cp\u003e\u003cb\u003e1. Как случилось, что вы выбрали профессию программиста?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eМои мама и папа - инженеры, так что, видимо, их пример способствовал появлению технических интересов.\u003cbr /\u003e Были и радиокружок, и кружок фотографии и авиамодельный.\u003cbr /\u003e А потом, в 8-м классе в школе появились Корветы, а чуть позже папа собрал - Спектрум 48. Вот из этого увлечения и произошел выбор профессии.\u003c/p\u003e \u003cp\u003e\u003cb\u003e2. Что было самым интересным и самым сложным для вас во время обучения программированию?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eСамым интересным для меня был сам процесс обучения - изучение существующих, новых и новейших технологий и применение их на практике. В этом смысле процесс обучения не закончился и продолжается каждый день \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003eСамым сложным было как раз отвлекаться от этого процесса. Например, помыть посуду или выучить историю. Сейчас у меня есть посудомоечная машина, а историю я изучаю потому, что интересно.\u003c/p\u003e \u003cp\u003e\u003cb\u003e3. Как вы думаете, почему сейчас так мало женщин - профессиональных программистов? Изменится ли ситуация в ближайшем будущем?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eС женщинами-программистами ситуация такая же как с женщинами-профессионалами других технических специальностей. Девушки чаще поступают в не технические ВУЗы, а мужчины - в технические.\u003c/p\u003e \u003cp\u003eДля изменения ситуации в ближайшем будущем не вижу причин. А в отдаленном - возможно это вопрос менталитета общества. Девушки зачастую просто не рассматривают для себя технику как возможный объект для творчества.\u003c/p\u003e \u003cp\u003e\u003cb\u003e4. Как к вам относятся мужчины-программисты на работе? Хотели бы вы что-то изменить в их отношении в вам?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eНе думаю, что при обсуждении профессиональных тем пол может иметь значение (разве что, невозможность, объяснить какую-либо техническую сложность в крепких выражениях \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e .\u003c/p\u003e \u003cp\u003eВ остальном, работа программистом не обязывает ходить “в свитере и джинсах” и женщина остается женщиной.\u003cbr /\u003e Отношение  к себе как-либо менять я бы не хотела.\u003c/p\u003e \u003cp\u003e\u003cb\u003e5. Как женщина-программист, посоветуйте мужчинам-программистам, что подарить жене на 8-ое марта? \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/b\u003e\u003c/p\u003e \u003cp\u003eЕсли вы собираетесь подарить подарок женщине - конечно будет здорово, если не забудете про ее интересы.\u003c/p\u003e \u003cp\u003eЕсли она вышивает - будет приятно получить,например, пяльца, а если она программист - это может быть хорошая книга по программированию из разряда “классики жанра”. Помочь в выборе могут те, кто разделяет ее интересы.\u003c/p\u003e \u003cp\u003eЕсть ряд подарков с которыми трудно ошибиться - начиная от гаджетов и заканчивая духами и цветами. Классические направления - красота, техника, интерьер, путешествия..\u003c/p\u003e \u003cp\u003eВообще, я замечала, что самые классные подарки придумаваются внезапно, а вот натолкнуть на них может блуждание в интернете или по магазину хэнд-мейд, главное - провести некторое время в поисках вдохновения и оно придет.\u003c/p\u003e \u003cp\u003e\u003cb\u003e6. А какой подарок вы сами мечтаете получить на 8-ое марта дома и на работе?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eАленький цветочек  \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003e\u003cbr /\u003e\u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003e \u003ca href\u003d\"http://alenacpp.blogspot.com/\" rel\u003d\"nofollow\"\u003eЕлена aka AlenaCpp\u003c/a\u003e:\u003cbr /\u003e Елена работает старшим программистом в компании Vogster Entertainment, где занимается разработкой компьютерных игр. Еще она ведет очень популярный блог \u003ca href\u003d\"http://alenacpp.blogspot.com/\" rel\u003d\"nofollow\"\u003eAlenaCpp\u003c/a\u003e, который читает несколько тысяч человек (я так понимаю, что в основном - программисты).\u003c/p\u003e \u003cp\u003e\u003cb\u003e1. Как случилось, что вы выбрали профессию программиста?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eМне всегда нравилась математика, я планировала стать математиком и заниматься научной работой. Хотела поступать на МехМат МГУ. Потом я начала программировать, когда училась в школе, мне понравилось и решила слегка переориентироваться. Поступила я в итоге на ВМиК МГУ, где было достаточно и математики, и программирования. Решила, что программировать мне нравится больше.\u003cbr /\u003e Понимаешь, это решение не казалось мне каким-то странным. У меня мама программист. В школе, как я уже сказала, у нас было программирование, параллельным классам его преподавала женщина. По странному стечению обстоятельств в Университете практически все практикумы по программированю у меня вели женщины, так совпало.\u003cbr /\u003e Странные люди, которые считают, что меня не бывает, мне стали встречаться уже после того, как я Универ закончила.\u003c/p\u003e \u003cp\u003e\u003cb\u003e2. Что было самым интересным и самым сложным для вас во время обучения программированию?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eВсе курсы, что касались программирования, мне давались довольно легко. Больше всего мне понравилась курсовая работа по генетическим алгоритмам, на Scheme мы ее делали. На Прологе еще помнится, мы программили, забавный язык.\u003cbr /\u003e Самое сложное - теория функции комплексного переменного. Как-то туго она у меня пошла.\u003c/p\u003e \u003cp\u003e\u003cb\u003e3. Как вы думаете, почему сейчас так мало женщин - профессиональных программистов? Изменится ли ситуация в ближайшем будущем?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eНе нравится потому что. Скучно, неинтересно. Я не знаю почему, я не понимаю как это может быть неинтересно. Мои подруги вежливо меня выслушивают, когда я им что-то околопрограммерское рассказываю, но всё это их явно не захватывает.\u003cbr /\u003e Можно долго рассуждать на эту тему - отчего да почему, но ответа на самом деле не знает никто.\u003c/p\u003e \u003cp\u003e\u003cb\u003eИзменится ли ситуация в ближайшем будущем?\u003c/b\u003e\u003cbr /\u003e Не думаю. Более того, меня очень напрягают попытки ее изменить искусственно. Пытаются девушек как-то заманить. Они потом учатся и мучаются, потому что им не нравится. Или по отношению к девушкам в вузах начинают проявлять нездоровый гуманизм. Получаются недоученные никому не нужные программисты.\u003cbr /\u003e Нужно не мешать тем девушкам, кто сам проявляет интерес, это да.\u003c/p\u003e \u003cp\u003e\u003cb\u003e4. Как к вам относятся мужчины-программисты на работе? Хотели бы вы что-то изменить в их отношении в вам?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eСейчас я в основном работаю с ребятами, которых сама же и нанимала. И они находятся в моем подчинении. Поэтому говорить об их отношении неправильно. Может, они там тихо сидят и злобу копят, я же не знаю \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e Что касается тех мест, где я работала до этого… Я же не вдруг на работу выхожу. Если на собеседовании со мной беседуют как с девочкой-дебилкой или пригласили посмотреть что это за зверюшка такая любопытная, то я там работать не буду. Есть Интернет, можно проискать компании, посмотреть блоги людей, которые там работают, можно выяснить отношение к женщинам-программистам. То есть, если вы на всех форумах орете, что все бабы дуры и женщин-программистов не бывает, то их у вас в компании и не будет.\u003cbr /\u003e Компаний, в которых отношение к женщинам-программистам вежливо-нейтральное, полно на самом деле.\u003c/p\u003e \u003cp\u003e\u003cb\u003e5. Как женщина-программист, посоветуйте мужчинам-программистам, что подарить жене на 8-ое марта? \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/b\u003e\u003c/p\u003e \u003cp\u003eМне мой муж подарил на день рождения EeePC гламурного розового цвета. Мне понравилось \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003e\u003cb\u003e6. А какой подарок вы сами мечтаете получить на 8-ое марта дома и на работе?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eСо мной всё просто, у меня wishlist’ы есть. \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e Я их обновлю к 8 марта.\u003c/p\u003e \u003cp\u003e\u003cbr /\u003e\u003cbr /\u003e \u003cbr /\u003e\u003c/p\u003e \u003cp\u003e\u003cb\u003eНаталия Байгарова, руководитель разработки в области компьютерного зрения, компания SeeStorm\u003c/b\u003e:\u003c/p\u003e \u003cp\u003e\u003cb\u003e1. Как случилось, что вы выбрали профессию программиста?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eХотелось чего-то абстрактного… Но и конкретного. Точного. Ну, и динамично развивающегося… - Специальность прикладного математика, которую давали на ВМиК в МГУ, показалась подходящей.\u003c/p\u003e \u003cp\u003e\u003cb\u003e2. Что было самым интересным и самым сложным для вас во время обучения программированию?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eСамое интересное – постижение состояния погружения в мир логики, выражаемой на формализованном языке и материализующейся в чудеса.\u003cbr /\u003e Самое сложное, как я понимаю теперь, было связано с отсутствием у нас, студентов того времени, персональных компьютеров в процессе обучения программированию (давно я училась, однако).\u003c/p\u003e \u003cp\u003e\u003cb\u003e3. Как вы думаете, почему сейчас так мало женщин - профессиональных программистов? Изменится ли ситуация в ближайшем будущем?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eДумаю, проблема социальная: пока в нашем обществе ребенок интересен только родителям, а в большинстве семей за ребенка ответственна исключительно мама, женщине тяжело оставаться на плаву в стремительно развивающейся профессии.\u003cbr /\u003e Отмечу при этом, что женщины-программисты, с которыми мне приходилось работать, демонстрировали высокий профессионализм. \u003c/p\u003e \u003cp\u003e\u003cb\u003e4. Как к вам относятся мужчины-программисты на работе? Хотели бы вы что-то изменить в их отношении в вам?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eОтносятся как к женщине-программисту: по работе – на равных, в остальном - трогательно внимательно и по-мужски галантно. Ничего не менять!\u003c/p\u003e \u003cp\u003e\u003cb\u003e5. Как женщина-программист, посоветуйте мужчинам-программистам, что подарить жене на 8-ое марта? \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/b\u003e\u003c/p\u003e \u003cp\u003eМое женское окружение относится иронично к этому празднику и вообще-то не ждет ничего в подарок. Мне кажется, мужчинам-программистам можно сэкономить и воспользоваться ситуацией, чтобы впечатлить подругу исключительно своим интеллектом, создав для нее программу-подарок, например игру-головоломку. Креативная открытка - тоже отличная идея: \u003ca href\u003d\"http://www.boltoonz.ru/new_boltoonz/index.php\" rel\u003d\"nofollow\"\u003ehttp://www.boltoonz.ru/new_boltoonz/\u003c/a\u003e\u003c/p\u003e \u003cp\u003e\u003cb\u003e6. А какой подарок вы сами мечтаете получить на 8-ое марта дома и на работе?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eИронично относясь к Женскому дню как к празднику и не ожидая ничего в подарок, конечно, буду рада получить:\u003cbr /\u003e 1) как женщина – цветы, духи и всякие милые вещицы,\u003cbr /\u003e 2) как программист – специальную профессиональную литературу,\u003cbr /\u003e 3) как женщина-программист – что-нибудь экстраординарное вроде шаманского бубна, предназначенного для колдовства над программами. \u003c/p\u003e \u003cp\u003e\u003cbr /\u003e\u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003e \u003ca href\u003d\"http://catty_ua.livejournal.com/\" rel\u003d\"nofollow\"\u003ecatty_ua\u003c/a\u003e:\u003cbr /\u003e Вот что она сама пишет про свой профессиональный путь:\u003c/p\u003e \u003cp\u003e2004 - 2006 - C++/MFC/Win32 Developer at Dinaris (Днепропетровск) - пожалуй, самая низкооплачиваемая, но самая интересная работа. “Пишу на С++ за еду” - это сюда \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e Взяли, потому что обещала себя хорошо вести и не путаться под ногами \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e Разработка игр для игровых автоматов и разного рода программно-аппаратных комплексов для индустрии развлечений. Полная свобода творчества. Самый колоссальный опыт - именно за эти 2 года.\u003c/p\u003e \u003cp\u003e2006-2007 - ASP.net/C# developer at StarSoft Development Labs (Днепропетровкс) - очень понравилась эта оффшорная компания, в которую случайно попала на собеседование (познакомилась в кафе :)). Настолько, что пришлось бросить любимый С++/Win32 и пересесть на совершенно чужой С#/Web. Бесценный опыт, идеальный код, идеальный методологии \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003e2007 - ASP.net/C# developer at Luxoft (Dell) (Киев) - случайно и недолго, поскольку работы для вновь прибывших разработчиков за 2 месяца так и не нашлось, проект по сути расформировали, но было интересно.\u003c/p\u003e \u003cp\u003e2007-now - Senior C# developer/Development Team Lead at EPAM Systems (Киев) - случайно (:)) - первый опыт тим/тех лидерства. Нравится. Пути назад нет \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003e\u003cb\u003e1. Как случилось, что вы выбрали профессию программиста?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eСлучайно. Закончила 3й курс филфака, начались летние каникулы - взяла старенький ноут и решила освоить MS Office, чтобы потом найти какую-нибудь офисную подработку. Ну, и увлеклась…\u003c/p\u003e \u003cp\u003e\u003cb\u003e2. Что было самым интересным и самым сложным для вас во время обучения программированию?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eСложное - переформатировать мозг из процедурного программирования на С в ООП на С++, позже - из десктопного под Win32 - на Web. А интересно…оно всегда интересно. Поэтому я ещё здесь \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003e\u003cb\u003e3. Как вы думаете, почему сейчас так мало женщин - профессиональных программистов? Изменится ли ситуация в ближайшем будущем?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eПотому что это огромная куча времени, помимо рабочего, не все готовы к такой самоотдаче.\u003c/p\u003e \u003cp\u003e\u003cb\u003e4. Как к вам относятся мужчины-программисты на работе? Хотели бы вы что-то изменить в их отношении в вам?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eХорошо относятся. Меня устраивает всё.\u003c/p\u003e \u003cp\u003e\u003cb\u003e5. Как женщина-программист, посоветуйте мужчинам-программистам, что подарить жене на 8-ое марта? \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/b\u003e\u003c/p\u003e \u003cp\u003eГлавное - внимание. И вовремя \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003e\u003cb\u003e6. А какой подарок вы сами мечтаете получить на 8-ое марта дома и на работе?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eЧто-нибудь прикольное, в идеале хэнд-мейд, но знаю, что это сложно \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003e\u003cbr /\u003e\u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003e \u003ca href\u003d\"http://vilochka_myr.livejournal.com/\" rel\u003d\"nofollow\"\u003evilochka_myr\u003c/a\u003e:\u003cbr /\u003e \u003cb\u003eВот, что она сама пишет, что свой профессиональный путь:\u003c/b\u003e\u003c/p\u003e \u003cp\u003eПрофессиональный путь получился не совсем правильно начавшимся из-за все тех же стереотипов:(\u003cbr /\u003e Помнится, внушилось в универе, что девушка программистом быть не может, будет всячески гнобиться мужчинами-программерами, а также начальством в виде недооценивания и урезания зп.\u003cbr /\u003e Сейчас уже понятно, что глупости это все, но все же. И решила попробовать себя в тестинге (потом оказалось, что не мое совершенно:(). Правда не совсем тестинге, есть у нас такая должность типа девелопмент тестер. Это человек, который занимается юнит-тестингом, немного девелопментом ( таски плана программисту сделать элементарно, но времени занимают много), всякий там программинг ассистенс делает для тестеров. Ну типа такие себе помошники программеров и тестеров:)\u003cbr /\u003e Проработала так 3 месяца и перевели в джуниоры, потому как откровенно скучала.\u003cbr /\u003e Из полезного вынесла - полюбила скриптовые языки (Perl, awk и иже с ними), досконально изучила sql etc. Сейчас я С++ программер.\u003c/p\u003e \u003cp\u003e\u003cb\u003e1. Как случилось, что вы выбрали профессию программиста?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eПрограммирование почти такая же интересная штука, как математика. Я не знаю, в какой отрасли еще можно так любить красивые решения:)\u003c/p\u003e \u003cp\u003e\u003cb\u003e2. Что было самым интересным и самым сложным для вас во время обучения программированию?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eБыло и есть то, что область постоянно развивается, приходится что-то читать, узнавать, следить… Мозги то и дело в движении, всегда есть, чему учиться. Берешь задачу, раскручиваешь ее (это ведь довольно тяжело?:)), а по ходу прослеживается прогресс:)\u003c/p\u003e \u003cp\u003e\u003cb\u003e3. Как вы думаете, почему сейчас так мало женщин - профессиональных программистов? Изменится ли ситуация в ближайшем будущем?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eНу почему мало, у нас в проекте 8 из 15ти:) На самом деле, мне кажется, что у нас немного “мужские” мозги. Поэтому и мало:)\u003c/p\u003e \u003cp\u003e\u003cb\u003e4. Как к вам относятся мужчины-программисты на работе? Хотели бы вы что-то изменить в их отношении в вам?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eЧестно говоря, я не вижу разницы. Относятся так же, как и к другим коллегам.\u003c/p\u003e \u003cp\u003e\u003cb\u003e5. Как женщина-программист, посоветуйте мужчинам-программистам, что подарить жене на 8-ое марта? \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/b\u003e\u003c/p\u003e \u003cp\u003eКрасненький ноут ламборджини чего-то там:) Хочу (и пофиг, что это будет 3й:))\u003c/p\u003e \u003cp\u003e\u003cb\u003e6. А какой подарок вы сами мечтаете получить на 8-ое марта дома и на работе?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eэээ, ну букетика тюльпанов, пожалуй, хватит:)\u003c/p\u003e \u003cp\u003e\u003cbr /\u003e\u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003e \u003ca href\u003d\"http://cheesyaska.livejournal.com/\" rel\u003d\"nofollow\"\u003echeesyaska\u003c/a\u003e:\u003cbr /\u003e Работала только в тестинге.\u003cbr /\u003e Софт-Украина - команда QA, какое-то время была тимом у QA, затем надоело все это ушла в Стар-Софт, занималась автоматизацией тестирования, писали скрипты на Silk test.\u003cbr /\u003e Сейчас продолжаю это делать из дома, так как сижу с грудным ребенком \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003e\u003cb\u003e1. Как случилось, что вы выбрали профессию программиста?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eВсе время мечтала стать юристом или психологом. Но в 10м классе на уроках информатики очень увлеклась программированием на q-basic. Требовала все новые и новые задачки, которые нужно было программировать. Участвовала в олимпиадах. Затем поступила на факультет прикладной математики.\u003c/p\u003e \u003cp\u003e\u003cb\u003e2. Что было самым интересным и самым сложным для вас во время обучения программированию?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eВсе было интересно. Очень нравилось получать результат, видеть, что программа работает как и ожидалось \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e Как-то особых сложностей не припомню\u003c/p\u003e \u003cp\u003e\u003cb\u003e3. Как вы думаете, почему сейчас так мало женщин - профессиональных программистов? Изменится ли ситуация в ближайшем будущем?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eДумаю, их так мало, потому что мало кто верит в свои силы. Поэтому даже если они и учились на программистов, выбирают какую-то другую профессию. Ну и женщины по своей природе, в большинстве случаев, любят живое общение, поэтому работа программистом для них утомительна и неинтересна. Не думаю, что ситуация кардинально изменится\u003c/p\u003e \u003cp\u003e\u003cb\u003e4. Как к вам относятся мужчины-программисты на работе? Хотели бы вы что-то изменить в их отношении в вам?\u003c/b\u003e\u003c/p\u003e \u003cp\u003eХорошо относятся, ценят, так как девушек мало \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003e\u003cb\u003e5. Как женщина-программист, посоветуйте мужчинам-программистам, что подарить жене на 8-ое марта? \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/b\u003e\u003c/p\u003e \u003cp\u003eЦветы и свою любовь \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003e\u003cb\u003e6. А какой подарок вы сами мечтаете получить на 8-ое марта дома и на работе?\u003c/b\u003e\u003c/p\u003e \u003cp\u003e10 часов сна ночью без пробуждений на покормить ребенка! \u003cimg src\u003d\"http://bishop-it.ru/wp-includes/images/smilies/icon_smile.gif\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp align\u003d\"center\"\u003e\u003cimg src\u003d\"/predownloaded/7f/c2/7fc227d51cfabb03d8d8d87be17bbd4485ea3891.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp align\u003d\"center\"\u003e\u003cimg src\u003d\"/predownloaded/7f/c2/7fc227d51cfabb03d8d8d87be17bbd4485ea3891.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cimg src\u003d\"/predownloaded/0a/8b/0a8becfd991fed409ff764a51dde33cff387f6d5.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"center\"\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003c/div\u003e","tags":["programming","women"]}}