{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1270710837,"rating":3,"authorHandle":"Alex_KPR","modificationTimeSeconds":1270710837,"id":256,"title":"X ICL","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp align\u003d\"justify\"\u003eНедавно закончился десятый открытый президенсткий командный турнир ICL по программированию.\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЕго отличие от турниров прошлых лет в том, что в этом году проводился заочный Code Game Challenge, о котором я напишу позднее.\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eА сейчас - краткий экскурс по контесту X ICL и, совсем немного, по организационным моментам. На контесте было предложено 12 задач. Скажу сразу и честно: задачи были разнообразные и интересные.\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЛично мы, Orel STU Patapons, несмотря на плохой старт, сдали 4-ую задачу на 152-й минуте и оказались на 4-м месте. После этого должна решаться задача H про то, что есть кенгуру в точке (x,y).\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eК моменту написания этой задачи жюри сообщило: \u0026quot;второй сэмпл кривой, там координаты кенгуру поменять нужно\u0026quot;. Замечательно. Вбили исправленный тест 2 - ответ верный. Вбили тест 1 - вместо \u0026quot;NO\u0026quot; получили \u0026quot;YES 4\u0026quot;. Начался долгий процесс дебага, насилие кода и тому подобные неприятные вещи. Жуткими извращениями получив верные ответы на сэмплы, мы отправили решение и получили WA#1. По опыту задачи A мы знали, что первый тест - совсем не обязательно сэмпл, поэтому дебаг продолжился...\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e \u003c/p\u003e\u003cp align\u003d\"justify\"\u003eВ конце контеста, получив на листочке в десятый раз ответ \u0026quot;YES 4\u0026quot;, я не выдержал и пошёл в жюри. Дойти туда я не успел: по дороге встретились два его представителя. Не успел я открыть рот, а мне уже ответают: \u0026quot;правильный ответ на 1-ый сэмпл задачи H - это YES 4\u0026quot;.\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЯ задал вполне логичный вопрос: \u0026quot;а почему не было никаких сообщений по этому поводу?\u0026quot;. Один из двух ответов был таков: \u0026quot;ну вот так получилось, но если Вы всё сделали так, как написано в условии, то Ваше решение будет засчитано\u0026quot;. Очень смешно. С 0 или с 1 нумеруются строки и столбцы матрицы? Нумерация происходит сверху вниз или снизу вверх? Конечно же, будет засчитано! Дважды переписанное изнасилованное решение получило WA#5. (Ответ про нумерацию был в вопросах по задаче, но не в условии, и пришёл совсем не сразу). Второй ответ мне понравился больше: \u0026quot;выскажешь все свои претензии автору на разборе\u0026quot;. Я представил, как сидят ~100 человек, обкидывают автора гнилыми помидорами и выплёскивают свои негодования в словесной форме. Что ж, выскажем-выскажем...\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eНо высказать, к сожалению, не удалось. Автор задачи поступил поистине гениально, он просто не пришёл на разбор! И, наверное, правильно сделал, ведь нервные клетки не восстанавливаются. \u003d)\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eВместо разбора этой задачи вышел представитель жюри и сказал примерно следующее: \u0026quot;В связи с уникальной ситуацией, возникшей с задачей H, жюри приняло \u003cem\u003eисторическое решение\u003c/em\u003e: считать верными решения, которые считывают координаты кенгуру в порядке (x,y) и в порядке (y,x). Будет произведён режадж, всем спасибо за понимание\u0026quot;.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eВот как можно вести себя столь некомпетентно? Во-первых, в условии русским по-белому сказано, что координаты кенгуру даны в порядке (строка матрицы, столбец матрицы). Во-вторых, вне зависимости от порядка чтения координат кенгуру, ни одно из двух \u0026quot;правильных\u0026quot; решений не получит \u0026quot;правильные\u0026quot; ответы на сэмплы! В результате этого нелепого действия в число сдавших эту задачу добавились ещё те, кто не прочитал формат входных данных.\u003cbr /\u003e\u003c/p\u003e\u003cdiv align\u003d\"justify\"\u003eАркадий Вязников (Вятка СУ 1) пытался высказать своё недовольство по поводу несвоевременных ответов на вопросы и многочисленных no comments, но не учёл, что жюри уже приняло \u003cem\u003eисторическое решение\u003c/em\u003e, а, значит, никого слушать не собиралось. :D\u003cbr /\u003e\u003c/div\u003e\u003cp align\u003d\"justify\"\u003eИз-за режаджов очень сильно затянули закрытие, оно началось на час позже, чем планировалось. В это свободное время удалось узнать, что команде Ижевска пришло сообщение по задаче H с текстом \u0026quot;у нас кривые сэмплы\u0026quot;, причём, на полчаса раньше, чем всем остальным сообщили о некорректности ТОЛЬКО второго теста. Конечно, так и должно быть на любых уважающих себя соревнованиях: одним командам нужно сообщать важную для решения задачи информацию, а другим это нафиг не надо делать.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eКраем уха услышал минимум от двух команд, что задачу на поток они сдали жадно. Точно не уверен, Казань тесты не раскрывает. Но если посмотреть \u003ca href\u003d\"http://www.icl.ru/turnir/files/monitor2010.pdf\"\u003eтаблицу результатов\u003c/a\u003e, то видно, что задача на сортировку массива (это задача L) оказалась сложнее, чем задача на поток (задача B).\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eБлаго, что мы не вляпались в приколы по задачам G и K: до G дойти мы просто не успели, убив два с половиной часа на H, а в K вместо \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e ≤ 10\u003csup class\u003d\"upper-index\"\u003e6\u003c/sup\u003e\u003c/span\u003e оказалось, что \u003cspan class\u003d\"tex-span\"\u003e\u003ci\u003en\u003c/i\u003e ≤ 5· 10\u003csup class\u003d\"upper-index\"\u003e7\u003c/sup\u003e\u003c/span\u003e. Решето Эратосфена до миллиона сдалось; как хорошо, что автор задачи не знал, что есть простые числа, большие \u003cspan class\u003d\"tex-span\"\u003e10\u003csup class\u003d\"upper-index\"\u003e6\u003c/sup\u003e\u003c/span\u003e, но меньшие \u003cspan class\u003d\"tex-span\"\u003e5· 10\u003csup class\u003d\"upper-index\"\u003e7\u003c/sup\u003e\u003c/span\u003e!\u003c/p\u003e\u003cdiv align\u003d\"justify\"\u003eИтог контеста: H - кривые сэмплы и неточное условие; G, K - кривые тесты; B - скорее всего, недостаток тестов. Забавно, что до поездки я был уверен, что в этом году с задачами точно всё будет хорошо: во-первых, это приятные тенденции прошлых лет, когда на каждом следующем контесте кривых задач становится все меньше, а, во-вторых, это же юбилейный десятый турнир, получивший статус президентского. Как я был наивен. :)\u003cbr /\u003e\u003c/div\u003e\u003cp align\u003d\"justify\"\u003eПосле заморозки мы оказались на 7-м месте, после всех режаджей - на 17-м. Удивляюсь, что нам ещё дали диплом и даже неплохой подарок (беспроводные майкрософтские клавы+мыши).\u003c/p\u003e\u003c/div\u003e","tags":["icl","казань","турнир"]}}