{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1285572683,"rating":66,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1285598522,"id":700,"title":"VK sponsorship announcement","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ca href\u003d\"http://vkontakte.ru\" style\u003d\"float: left;margin: 1.0em;\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/files/vk/vk-logo.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e  \u003cp\u003e What can be better than good news? Right you are - excellent news. The news I\u0027m going to share with you is such.\u003c/p\u003e  \u003cp\u003e We\u0027re glad to tell you, that \u003ca href\u003d\"http://vk.com\"\u003eVK\u003c/a\u003e company is now the primary sponsor of Codeforces project! It\u0027s a great honor for us - because \u003ca href\u003d\"http://vk.com\"\u003eVK\u003c/a\u003e is not only the largest social network in Russia and one of the largest in the world, it\u0027s also an example of a high-tech, innovative approach and dynamic development. \u003c/p\u003e  \u003cp\u003e \u003ca href\u003d\"http://vk.com\"\u003eVK\u003c/a\u003e\u0027s help will allow us to continue the development of the platform, to run interesting contests for you on a regular basis. We have ambitious plans to fill Codeforces with useful educational content. \u003c/p\u003e  \u003cp\u003e It\u0027s also important for us, that Codeforces programming contests community attracts not only its makers and participants. \u003c/p\u003e  \u003cp\u003e \u0026quot;\u003ci\u003eCodeforces contributes a lot into the development of collegiate programming in Russia. I\u0027m glad that we have a chance to support this project. I hope it becomes even more interesting to participate in and win Codeforces contests\u003c/i\u003e\u0026quot;, - says Pavel Durov. \u003c/p\u003e  \u003cp\u003e \u0026quot;\u003ci\u003eA powerful developers team is the main driving force of our company. It\u0027s at contests, like Codeforces, where we find young and talented programmers, who can solve difficult technical tasks\u003c/i\u003e\u0026quot;, - added Andrey Rogozov, the head of \u003ca href\u003d\"http://vk.com\"\u003eVK\u003c/a\u003e development department. \u003c/p\u003e  \u003cp\u003e Wish you high rating,\u003cbr /\u003e Mike Mirzayanov \u003c/p\u003e\u003c/div\u003e","tags":["vk","good news","sponsor"]}}