{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1277131019,"rating":2,"authorHandle":"MciprianM","modificationTimeSeconds":1277628765,"id":476,"title":"A median problem","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003eA couple of weeks ago one of my colleagues at college asked me if I could find the solution to this problem that was in a Microsoft interview. I thought about it and later that night I had a couple of solutions including the \u003cstrike\u003eO(NlgN)\u003c/strike\u003e  O(lgN) one (reading the sequences is counted out ) that was required for it. Next morning I also had an implementation in C++ of the solution which worked fine. Now if you want to take a shot at it, the problem statement goes like this:\u003cbr /\u003e\u003cbr /\u003e\u003cblockquote\u003eYou are given two sorted sequences of 32-bit integer numbers. Find the median of the sequence obtained by concatening the two sequences.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003c/blockquote\u003eI will later post the solutions I found, because I like the sort of trade-off that appears whilst you improve your solution\u0027s execution time. But I don\u0027t want to spoil all the fun. So, for now, I will leave you the time to solve it. If you want to step up, you can e-mail me the solutions at cip.cip3ggg@gmail.com and I will post the names of the best 10 solvers in the solution post.\u003cbr /\u003e\u003cbr /\u003eP.S.: Regarding round #17 and #18, I was very busy with the exams and I didn\u0027t have the time to participate at them. But I took my shot at round #20 and came out 9th and hopefully I will be free to take my shot at round #19.\u003cbr /\u003e\u003cbr /\u003e\u003cb\u003eUPD1. Thanks to \u003ca href\u003d\"//codeforces.com/profile/Fcdkbear\"\u003efcdkbear\u003c/a\u003e for pointing out that I requested an O(NlgN) algorithm.\u003cbr /\u003eUPD2. The two sequences are stored in arrays, so you have random acces to the elements.\u003cbr /\u003e\u003cbr /\u003e\u003c/b\u003e\u003c/div\u003e","tags":["c++","interview","median","microsoft","sequence","sort"]}}