{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1265087555,"rating":0,"authorHandle":"Alex_KPR","modificationTimeSeconds":1265140299,"id":42,"title":"Что такое хорошо и что такое ACM+","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eНазвание, как Вы все уже поняли, навеяно постом гражданки \u003ca href\u003d\"http://codeforces.ru/blog/entry/18\"\u003eMedic\u003c/a\u003e. Продолжаю Вас   радовать своими записями в своём самом бесполезном блоге. \u003d)\u003c/p\u003e \u003cp\u003eИтак, что же такое АСМ+? \u003c/p\u003e \u003cp\u003eЭто набор правил, знать которые желательно,   если Вы хотите   участвовать в соревнованиях вида \u003c/p\u003e \u003cp align\u003d\"left\"\u003e   \u003ca href\u003d\"http://pcworld.snarknews.info/index.cgi?data\u003dnewstape\u0026amp;head\u003dindex\u0026amp;menu\u003dindex\u0026amp;class\u003dsnws10\u0026amp;mod\u003dsnws10\"\u003eSN?S     (SnarkNews Winter/Summer Series)\u003c/a\u003e.\u003c/p\u003e \u003cp align\u003d\"left\"\u003e   \u003cbr /\u003e\u003c/p\u003e \u003cp\u003eЧем же они отличаются от обычных? ;)\u003c/p\u003e \u003cp\u003e \u003c/p\u003e \u003cp\u003e   \u003cstrong\u003eПервое\u003c/strong\u003e, что бросается в глаза при просмотре   результатов - это   количество участниками решённых задач. Это число   зачастую оказывается   дробным. Нет-нет, это не школьные правила, где   за каждый пройденный   тест дают один или несколько баллов. Здесь   нужно решить задачу   целиком. Но, в отличие от обычных правил   ACM-ICPC, количество решённых   задач считается как      1-(N-1)*5,   где N -   количество посылок. В свою   очередь, за   \u0026quot;шпалы\u0026quot;   20-минутные   штрафы не назначаются.\u003c/p\u003e \u003cp\u003eТаким образом, решая задачу на +5 на 78-й минуте, Вы имеете все шансы   опуститься на 7-8 мест ниже, получив +0.0 решённых задач и кучу   штрафного времени; например, см. строчку 79 \u003ca href\u003d\"http://pcworld.snarknews.info/index.cgi?data\u003dsnws10/standing4\u0026amp;menu\u003dindex\u0026amp;head\u003dindex\u0026amp;mod\u003dsnws10\u0026amp;class\u003dsnws10\"\u003eтут\u003c/a\u003e.   Это ещё хорошо, если +0.0, а то можно же и минус схлопопать!\u003c/p\u003e \u003cp\u003eКак сказал когда-то сам Снарк, \u0026quot;у меня защита от дурака не   предусмотрена\u0026quot;. Дык, позвольте. Это значит, что я должен НЕ   РЕШАТЬ задачу, если у меня по ней уже -5? Выходит, что так. Кстати, я   не могу припомнить ни один вид соревнований, на котором можно сделать   себе же хуже, решив (добив, пропихнув) задачу...\u003c/p\u003e \u003cp\u003e   \u003cstrong\u003eВторое\u003c/strong\u003e. Язык соревнований... Какой он? Оказывается,   их два: русский и   английский. Задачи тоже предлагаются на нечётных   раундах на английском   языке, а чётных - на русском, согласно \u003ca href\u003d\"http://pcworld.snarknews.info/index.cgi?data\u003dsnws10/schedule\u0026amp;menu\u003dindex\u0026amp;head\u003dindex\u0026amp;mod\u003dsnws10\u0026amp;class\u003dsnws10\"\u003eрасписанию\u003c/a\u003e...   Но не спешите ему верить! Как показывает плачевный опыт прошлого года,   языки 4-го и 5-го раундов SNSS оказались немножко другими. Так что   будьте готовы к неожиданностям. Также, частенько бывают контесты, в   которых основная проблема - это перевод американского английского и,   соответственно, понимание условия.\u003c/p\u003e \u003cp\u003e   \u003cstrong\u003eТретье\u003c/strong\u003e. Сами задачи. Кривые тесты и условия - это   нормально, мы уже   все к этому привыкли. :) Намного более любопытный   момент кроется в   том, что частенько даются мультитесты, а верхняя   граница количества   тестов в одном инпуте не указана. Вот и угадывай,   какое решение уложится   в time-limit, а какое нет. Даже видел, что   кто-то аппеляцию подавал:   \u0026quot;задачу С невозможно решить на языке   Java, ибо TL\u0026quot;. Респект   неизвестному участнику.\u003c/p\u003e \u003cp\u003e   \u003cstrong\u003eЧетвёртое\u003c/strong\u003e. Ещё о правилах. Каждый раунд SN?S длится   около недели. В   течение этого времени каждый может видеть общие   текущие результаты   выступлений в формате ФИО/кол-во задач/время. Но   когда участник   начинает виртуальный контест, то он может наблюдать   ещё за статистикой   по каждой задаче. Т.е., если Вы участвуете в   последний день раунда, то   можете читать задачи именно в том порядке,   в каком появляются плюсики   напротив других участников. Вы потратите   минимум времени на чтение и,   скорее всего, перевод ужасных   нечитаемых американских условий. А если в 1-ый день участвовать, то   придётся переводить всё-превсё. ;)\u003c/p\u003e \u003cp\u003eНу и в \u003cstrong\u003eзаключение\u003c/strong\u003e. Несмотря на все минусы, SN?S -   это намного лучше,   чем ничего. Так что участвуйте на здоровье и   получайте виртуальные   дипломы! \u003d)\u003c/p\u003e \u003cp\u003eP.S. Уж лучше бы было три графы: кол-во задач/кол-во сабмитов/время.   По крайней мере, это ближе к АСМ и не вызывает неприятных ситуаций   вида \u0026quot;сдал... но лучше бы не сдавал\u0026quot;.\u003c/p\u003e \u003cp\u003eP.P.S. Ответ создателя ACM+: \u003ca href\u003d\"http://pcworld.snarknews.info/index.cgi?data\u003dsnws10/reports/ans\u0026amp;menu\u003dindex\u0026amp;head\u003dindex\u0026amp;mod\u003dsnws10\u0026amp;class\u003dsnws10\"\u003ehttp://pcworld.snarknews.info/index.cgi?data\u003dsnws10/reports/ans\u0026amp;menu\u003dindex\u0026amp;head\u003dindex\u0026amp;mod\u003dsnws10\u0026amp;class\u003dsnws10\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["acm","acm+","acm-icpc","snark","контесты","снарк","соревнования","участие"]}}