{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1277504379,"rating":14,"authorHandle":"OSt","modificationTimeSeconds":1277539397,"id":493,"title":"Игромания","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВо спасение темы \u0026quot;\u003ca href\u003d\"http://codeforces.ru/blog/entry/492\"\u003eПроект над которым я работаю: Massive Assault Network\u003c/a\u003e\u0026quot; от оффтопа.\u003c/p\u003e\u003cp\u003eДля меня было неожиданным открытием, что многие участники CF(кроме безнадёжных больных, типа меня ) всё ещё продолжают играть в игры. Вроде как олимпиадное программирование должно забирать всё свободное время, которое есть у человека, решившим им заниматься. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eВстаёт несколько вопросов :\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003cp\u003e1. Что для Вас значит компьютерная игра - способ просто убить время или отдохнуть после работы, получить удовольствие от качественной продукции( хорошая атмосфера, качественный движок, интересный сюжет, красивая картинка) ,посоревноваться с друзьями в навыках, которые развивает игра или Вам нравится игры, как просто хорошие программы  или что то ещё?\u003c/p\u003e\u003cp\u003e2.Какие игры Вы предпочитаете - спокойный казуал, динамичный шутер, игры-головоломки, реалистичные симуляторы, серьезные стратегии , ролевые игры( список можно продолжать) ?\u003c/p\u003e\u003cp\u003e3.Как часто Вы играете в игры?\u003c/p\u003e\u003cp\u003e4. В какие конкретно игры Вы играете, или какие Вам больше всего запомнились?\u003c/p\u003e\u003cp\u003e5.Считаете ли Вы, что игры влияют больше негативно, чем позитивно на Вас или вообще на людей?\u003c/p\u003e\u003cp\u003e6.Хотели бы Вы разрабатывать какие-нибудь игры. Если у Вас уже есть опыт - поделитесь им. На сколько сложно это создавать. Стоит ли работа результата ?\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eНапишу про себя:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e1. Так уж сложилось, что у меня машинка всегда не поспевала за требованиями топовых игр. Ещё со школы зародилась традиция играть во что то не требовательное к ресурсам, но и интересное. Выбор пал на Counter-Strike (1.6). В ней нет  ни нормального движка, про картинку вообще молчу, но она зацепила своим мультиплеером. Часто собирались с друзьями после уроков посоревноваться в стрельбе ещё на шариковых мышках :) Потом начал смотреть разное видео игры топовых геймеров, почитал немного сайтов и появилось желание стать одним из топов. Меня поражала отточенность движений игроков, \u0026quot;красивые\u0026quot; убийства ну и количество трупов на один квадратный метр :). \u0026quot;Это ж сколько адреналина получаешь от такой игры\u0026quot; - думал я. И вот, когда сам прошёл путь от Нуба, до почти профи - понимаю, что усилия были потрачены не зря. Ни раз встречаются такие моменты, когда ты начинаешь творить просто чудеса. Адреналина получаешь - выше крыши. Собственно это и всё, что мне нужно было от CS.\u003c/p\u003e\u003cp\u003e2. Если выпадает возможность - играю в шутеры, стратегии и казуал. Первые 2 жанра люблю за качество исполнения и сложность игры, казуал - за отдых без напряга мозгов, оригинальные идеи.\u003c/p\u003e\u003cp\u003e3. Играю в игры по остаточному принципу - если уже по всякому отдохнул и поработал - тогда и играю. В неделю около 10 часов.\u003c/p\u003e\u003cp\u003e4. Я стараюсь следить за играми через журнал \u0026quot;Игромания\u0026quot;. Большинство игр к сожалению попробовать не могу. А так любимые - CS, Star Craft, Demigod, Diablo, Plants vs Zombies.\u003c/p\u003e\u003cp\u003e5. Считаю, что игры всё таки больше положительно влияют, чем отрицательно. По мимо банальных: улучшение пространственного мышления, реакции, умение быстро делать выбор и соображать, игры нам зачастую приносят нам те ощущения, которые мы очень редко испытываем в своей повседневной жизни. Играя в игры мы можем побыть в разных ролях, побывать в такой атмосфере, из которой не хотелось бы уходить. В общем оттолкнуться от каких то своих проблем и отдохнуть от всего хотя бы в виртуальной реальности.\u003c/p\u003e\u003cp\u003e6. Единственная моя игра - это задание в рамках ВУЗовской программмы - игра \u0026quot;Жизнь\u0026quot; на Java. На себе почувствовал, что одному разрабатывать игры весьма сложно. Проблема многих игр - это низкий FPS при качественной картинке. Как не хорошим программистам и математикам заниматься подобными вещами. Поэтому не исключаю возможность работы над играми, чтобы применить свои навыки написания оптимальных реализаций для игровых движков.\u003c/p\u003e\u003cp\u003eЖду Ваши ответы на эти и смежные вопросы.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["games","игры"]}}