{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1287387703,"rating":15,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1287417320,"id":763,"title":"ACM-ICPC Southern Subregional Programming Contest 2010","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/sgu.jpg\" style\u003d\"margin: 0.5em 1.0em;float: left;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cp\u003e Saratov State University in announcing Southern Subregional Programming Contest 2010. It will be held from the 19th to the 23rd of October. \u003c/p\u003e  \u003cp\u003e For the right to reach the \u003ca href\u003d\"http://neerc.ifmo.ru/\"\u003eRegional Contest\u003c/a\u003e will be competing universities of Astrakhan, Volgograd, Voronezh, Nizhny Novgorod, Penza, Rostov, Samara, Saratov, Tambov, Ulyanovsk, Krasnodar and Stavropol regions and from the republics of Adygea, Mari El, Mordovia, North Ossetia, Tatarstan. Totally 63 teams will participate in the competition. \u003c/p\u003e  \u003cp\u003e In addition, on 19th October will be held IX Regional Team Highschool Olympiad, which is a qualifying stage for the All-Russian Team Olympiad in Informatics for schoolchildren. The top five school teams will win the right to participate in the final stage of the Olympiad. \u003c/p\u003e  \u003cp\u003e On the official website \u003ca href\u003d\"http://contest.sgu.ru/\"\u003ehttp://contest.sgu.ru/\u003c/a\u003e you can view the results during the competition. \u003c/p\u003e  \u003cp\u003e For the fifth consecutive year, except for official competition, teams are invited to an informal entertaining contest Code Game Challenge. Under Code Game Challenge teams will write programs that will be placed in the simulation game world, to directly compete with other participants! Teams will be given specifications for a game object. These specifications will include a set of interfaces to be implemented and a goal for the object to achieve when in competition with other team\u0027s objects. Capabilities include observation of the progress of other team\u0027s objects and measures that can be taken to block that progress. The winning team object will be determined in a game environment while competing with others. \u003c/p\u003e  \u003cp\u003eOn 23rd, October at 07:00 (UTC) on the site \u003ca href\u003d\"http://acm.sgu.ru/\"\u003ehttp://acm.sgu.ru/\u003c/a\u003e will be held an online contest on the subregional contest tasks.  The official onsite standings will be integrated to the online ranklist! \u003c/p\u003e  \u003cp\u003e Good luck! \u003cbr /\u003e MikeMirzayanov \u003c/p\u003e\u003c/div\u003e","tags":["acm-icpc","neerc","saratov"]}}