{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1290184257,"rating":15,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1290232883,"id":888,"title":"ACM-ICPC NEERC 2010, or back to St. Petersburg!","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/train.png\" style\u003d\"margin: 0 1.0em;float: left;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cp\u003e One of the most important all-Russia (it\u0027s even greater! It\u0027s all-region) sport programming contests has approached us. Of course, I mean the ACM-ICPC NEERC 2010/11 World Programming Championship semi-finals. The names of those who will go to the jewel of Egypt, Sharm el-Sheikh will be known in less than a week. Undoubtedly, for some people this contest will become \u0026quot;the flop of 2010\u0026quot;. I hope not to become one of them. \u003c/p\u003e  \u003cp\u003e As you already know, the Saratov university delegation is going to get on the train tomorrow with some special extra luggage - we are taking about 300 T-shirts with us. Today we spent half a day sorting them into boxes, signing and counting them again. I even managed do divide 68 by 2 incorrectly that nearely led to the shortage of T-shirts :) However all the hardships are over, the presents are packed and we are ready to go. Let me remind you that all the official team members will receive Codeforces T-shirts (unfortunately, the reservists, coaches and the team leaders do not count). \u003c/p\u003e  \u003cp\u003e The previous year in St. Petersburg was marked by our hasty visits to all the nearby pharmacies, it was marked by the fact that on the eve of the contest every team had a member with the fever of 38 degrees celsius, it was marked by the fact that one can never have enough paracetamol before the contest. We don\u0027t wish anybody to share this wonderful experience, so dress warm, take care of yourselves and of your teams\u0027 health! \u003c/p\u003e  \u003cp\u003e Have a good journey and see you in St. Petersburg,\u003cbr /\u003e МikeMirzayanov \u003c/p\u003e\u003c/div\u003e","tags":["acm-icpc","neerc"]}}