{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1271512654,"rating":1,"authorHandle":"_ph_","modificationTimeSeconds":1271512654,"id":318,"title":"Ряд предложений по CodeForces","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch3\u003e\u003cb\u003eРяд предложений по CodeForces:\u003c/b\u003e\u003cbr /\u003e\u003c/h3\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e1. Все предложения по CF собирать \u003cu\u003eв одной теме\u003c/u\u003e. Во-первых, чтобы не повторяться, а во-вторых, чтобы быстро эту тему находить. Аналогично, сообщения о найденных багах тоже собрать в одну тему с заголовком типа \u0026quot;Баги на CodeForces (единственная тема)\u0026quot;. Автор тем: администрация сайта.\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e2. При наведении на ник участника на всплывающей подсказке отображать \u003cu\u003eв три строчки\u003c/u\u003e (если указаны): 1) ФИО, 2) город, страну (флаг), 3) звание (рейтинг) и вклад. \u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e3. В регистрационных данных возможность выбрать ВУЗ, в котором участник учился (учится). \u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e4. Хочется, чтобы обсуждения были более структурированы по темам. Мне кажется, классический форум с разделами: \u003cb\u003eБлоги, Соревнования, Алгоритмы и задачи, ЯП и среды разработки, Обсуждение сайта, Объявления\u003c/b\u003e и т.п. более подходит для этого, чем поиск по тегам. В принципе, для реализации этого нужны 2 вещи: 1) при создании новой темы дополнительно указать, к какому разделу она относится и 2) главная страница, на которой будут отображаться разделы форума.\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e5. Предлагаю для обсуждения такой вариант учета результатов соревнования. Наивысший приоритет - кол-во решенных задач, затем - кол-во штрафных попыток, на последнем месте - время. То есть в отличие от обычных правил ACM, здесь более важным становится не скорость набора, а \u003cu\u003eточность (безошибочность) решения\u003c/u\u003e. Для разнообразия можно было бы попробовать\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e6. При регистрации на сайте надо предлагать пользователю свод правил поведения, с которыми он должен согласиться. Сайт набирает популярность, и недалек тот день, когда здесь будут регистрироваться разные коробейники, предлагающие penis enlargement, спаммеры и интернет-тролли. :)\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003c/div\u003e","tags":["codeforces","предложения"]}}