{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1277185418,"rating":6,"authorHandle":"ItsNear","modificationTimeSeconds":1277186061,"id":477,"title":"ICFPC - как это было :о)","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e\u003cb style\u003d\"\"\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eВступление\u003c/span\u003e\u003c/b\u003e\u003c/p\u003e  \u003cp\u003eICFPC\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003e– это контест, на котором команды в течение трех суток пытаются решить какую-то одну забавную задачу по программированию. Язык программирования, который использует победившая команда, признается лучшим языком программирования года до следующего контеста. Я о соревновании узнал впервые в начале этого года, случайно увидев ссылку на него на википедии со статьи про \u003c/span\u003e\u003c/span\u003eTopCoder\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e, и очень захотел попытаться в нем принять участие. В тот момент информации о контесте 2010 еще не было, а потом я че-то зафтыкал и забыл. Так бы я его в общем-то и пропустил, если бы мой бывший одногруппник Кирилл не написал мне на Вконтакте, что он собирает команду для участия в нем, и приглашает меня принять участие.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e\u003cspan style\u003d\"\"\u003e \u003c/span\u003eЯ относился к этому скептически, потому что собственно я хотел писать на \u003c/span\u003eC\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e#, а ребята собравшиеся в той команде – линуксоины.\u003cspan style\u003d\"\"\u003e  \u003c/span\u003eМоно все еще нормально .\u003c/span\u003eNET\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e 4.0 не поддерживает. Или, по крайней мере, найти такое Моно, не очень легко. Но вариант писать с командой победил просто потому что это казалось более интересным. Про язык пока думать не хотелось. В команде два человека писало на \u003c/span\u003eRuby\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e, и один на С++.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eГотовясь к контесту мы завели, как видимо и почти все команды, хранилище кода н \u003c/span\u003egithub\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e, завели дашборд на \u003c/span\u003eEtherPad\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e, настроили \u003c/span\u003eJabber\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e-конференцию (Все-таки в конце концов мне пришлось его завести. Оказалось безболезненно – в миранде он как выяснилось есть по дефолту, без необходимости ставить плагины :о))\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eКонтест по моему времени начинался в пять утра в пятницу. Я встал где-то около семи...\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cb style\u003d\"\"\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eДень первый, Пятница\u003c/span\u003e\u003c/b\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eСогласно описаниям прошлогодних контестов в блогах, обычо условие задачи занимает 20 страниц. В этот раз, когда я открыл его, и увидел, что скроллбар сравнительно большой (\u003d документ маленький), я был приятно удивлен. Ну это было преждевременно.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eИтак, чтоже от нас хотят. Ссылка: (\u003ca href\u003d\"http://icfpcontest.org/2010/task/\"\u003ehttp://icfpcontest.org/2010/task/\u003c/a\u003e) У нас есть машины и топливо. Машина состоит из чемберов, чемберы состоят из двух пайплайнов – верхнего и нижнего. Пайплайн по существу – лист чисел от 0 до 5. Так же каждый чембер является либо основным, либо нет.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eТопливо – это от одной до шести квадратных матриц произвольного размера.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eГрубо говоря, числа в пайплайне – это номер матрицы. Топливо подходит машине, если для любого чембера умножение любого вектора А на произведение матриц в верхней пайпе всегда вернет вектор, где каждый элемент не меньше, чем в векторе, полученном при умножении вектора А на произведение матриц в нижней пайпе. При этом, если чембер является основным, то первый элемент результирующего вектора для верхней пайпы должен быть строго больше, чем первый элемент для нижней не зависимо от входного вектора. Подразумевается, что все элементы А не отрицательны, а первый элемент положителен. Более того, требуется, чтобы в процессе умножения входного вектора на каждую матрицу слева на право первый элемент никогда не становился нулем.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eПосле прочтения этого это можно сразу забыть на пару дней :о) Потому что дальше начинается самая жопа. И машины и топливо задаются в тернарном формате. Про него известно то, что он тернарный, описывает числа, листы и туплы, и что он может описывать бесконечно большие числа и бесконечно длинные листы. И все :о Ну и еще у вас есть пример машинки, описанной в тернарном формате, но не более того. В этом и есть весь шарм \u003c/span\u003eICFPC\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eи его отличие от соревнований типа \u003c/span\u003e\u003c/span\u003eSRM\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eили \u003c/span\u003e\u003c/span\u003eMarathon\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003e– вы даже не знаете, ЧТО вам надо решать :о)\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eДалее, на этом организаторы тоже решили не останавливаться. Чтобы делать топливо, нужно строить фабрики. Фабрика – это граф, где у каждой вершины (гейта) есть два входящих ребра, и два исходящих (порядок ребер важен – то есть если поменять два входящих ребра местами, получится другая фабрика). Порядок вершин тоже важен: если ребро идет из вершины с меньшим номером в вершину с большим, то результат передастся моментально, иначе только на следующий такт.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eНу и фабрику надо выводить в специальном формате, который тоже не описан, но дан пример фабрики, описанной в нем. Также дана последовательность. Скармливание этой последовательности на данную фабрику даст нам некоторую ключевую последовательность. Любое топливо должно начинаться с ключевой последовательности.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eВажно также, что на сервере фабрики запускаются поверх другой входной последовательности.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eМногое не понятно? Не беда, мы чуствовали тоже самое :о)\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eЗадача контеста – засылать топливо для существующих машин. Точнее, засылать фабрики, которые его производят. Чем меньше команд кроме вас поставляют топливо для заданной машины, тем больше профита вы будете получать за нее каждые 15 минут. Чем короче фабрика (чем меньше у нее вершин), тем больше вы будете получать профита с нее.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eОкей. Задачу прочитали, надо думать :о) Все что у нас есть в начале – это возможность засылать фабрики на сервер и смотреть, какой тернарный аутпут она дает, если на вход ей подана секретная входная последовательность, лежащая на сервере.\u003cb style\u003d\"\"\u003e\u003c/b\u003e\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eСобрав несколько фабрик руками, мы поняли, что без визуального редактора нам не жить. Как написать визуальный редактор, чтобы он запускался и у меня на винде, и у ребят на линухе? \u003c/span\u003eQt\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eмы допустим не знаем. Ок, на ум пришло \u003c/span\u003e\u003c/span\u003eJavaScript\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e + \u003c/span\u003eHTML\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e5 \u003c/span\u003eCanvas\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003e– \u003c/span\u003e\u003c/span\u003eFirefox\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e-то есть у всех.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eНачинаю писать. Время где-то 9:15 утра. В 10:00 утра на работе митинг. Пытаюсь успеть, но необходимость позавтракать, умыться, и, собственно, дойти до работы, сыграли свою роль.\u003cspan style\u003d\"\"\u003e  \u003c/span\u003eЯ успел буквально только набрать в \u003c/span\u003eBing\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003e“\u003c/span\u003e\u003c/span\u003ehtml\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e5 \u003c/span\u003ecanvas\u003cspan style\u003d\"\"\u003e \u003c/span\u003etutorial\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e” и по уроку сделать, что клики по канве рисуют гейты, складывая их в массив.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eДальше я бегу на работу, митинг проходит не очень продуктивно, так как я, под видом записей заметок, обсуждаю с ребятами фабрики в джаббере :о)\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eПосле митинга я за час заканчиваю редактор фабрик (да, это оказалось не так просто :о)), и мы начинаем тестировать. Не очень быстро, но становится понятно, что гейт – это функция тернарная функция \u003c/span\u003ef\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e(\u003c/span\u003ex\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e,\u003c/span\u003ey\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e)\u003d\u0026gt;(\u003c/span\u003ex\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e,\u003c/span\u003ey\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e), и мы постепенно начинаем восстанавливать \u003cspan style\u003d\"\"\u003e \u003c/span\u003eэту функцию засылая разные фабрики. Когда функция восстановлена, я прикручиваю к нашему редактору на \u003c/span\u003eJavaScript\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e эвалуейтор фабрик, который по последовательности на входе и фабрике генерит ее выход. Получаем “\u003c/span\u003ekey\u003cspan style\u003d\"\"\u003e \u003c/span\u003esequence\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e” – тернарку, которая должна идти в начале любого топлива. Вот это уже было тупо. Редактор на \u003c/span\u003eJavaScript\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eбыло премлемо, но любой код, который может пригодиться потом – это было тупо. В это же время примерно один из участников команды – Бегемот, расшифровывает входную последовательность на сервере, но у него отпадает интернет, и он не успевает ее послать. Я расшифровываю ее тоже мелкой кодякой на С++, и успеваю как раз к моменту, когда он входит в интернет, и мы одновременно почти отправляем ее в \u003c/span\u003e\u003c/span\u003eJabber\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003e:о)\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eТеперь задача найти фабрику, которая будет генерить эту последовательность. Вот тут настал тупняк. Ребята ушли уже спать, а я начал думать. Брутфорс писать было лень (и слава богу, потому что в этот момент я не знал, что потом надо будет делать фабрики для производства топлива длиной под тысячу символов, которые бы не брутились). Начал выводить фабрики, которые не зависимо от входа будут делать нужный выход. Научился делать два блока – один возвращает ноль, а затем поданную на вход последовательность, другой – получает на вход последовательность и возвращает ее, увеличенную на один. Первый из шести гейтов, второй – из десяти. Их комбинации, очевидно, могут создать фабрику для любой последовательности. Тока фабрика будет иметь длину, в 20 раз большую длины входной последовательности :о)\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eПишу на \u003c/span\u003eJavaScript\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eконвертер выходной последовательности в фабрику (ну опять, почему \u003c/span\u003e\u003c/span\u003eJavaScript\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e???), и засылаю ее на первую машинку. Команда получает 0.014 баллов :о) Я писаюсь кипятком – у нас не ноль :о)\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eНа другие машинки не засылается. Теперь надо думать над тернаркой. Сразу бросается в глаза, что часто встречаются две подряд идущие двойки. Кроме того, почти все машинки начинаются с двух двоек и заканчиваются 10. Казалось бы, 22 – начало листа, 10 – конец. Но не работает. Да и есть машинка, заканчивающася не на 10, а самые простые машинки начинаются не на 22, а на 1.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eПроблема еще в том, что префикс, который должен быть в начале каждого топлива, вообще не похож на описание машинок, а ведь по логике он должен быть в том же формате.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eДо ночи ничего не придумываю, ухожу спать с надеждой, что ребята расшифруют. \u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cb style\u003d\"\"\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eДень второй, Суббота\u003c/span\u003e\u003c/b\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eУтром тернарный формат еще не был разгадан. И никаких зацепок не было.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eВ девять утра был первый отборочный на топкодер, и я решил поискать подсказок в чате. Один чувак отозвался на фразу \u003c/span\u003eIFCPC\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e, и в диалоге с ним я прозрел. Префикс у топлива не является вообще валидной тернарной строкой, и описание топлива идет после префикса, а не начиная с него! Это даже прямым текстом указано в условии, но че-то я затупил. С этой информацией Бегемот засылает наконец-то топливо на хоть какую-то машину, кроме пустой, просто перебирая текст после конца префикса. Кирилл пишет на \u003c/span\u003eRuby\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e бота, который рассылает это топливо на все тачки, и он подходит на неслабое их количество. Баллы начинают течь рекой! Конечно, не сравнимо с другими командами, которые так долго не тупили.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eСледующее прозрение происходит, когда мы понимаем, что если подать валидное топливо (а у нас теперь есть хотя бы одно такое), то можно изучать ошибки парсера машинки. Ошибки были четырех типов: «ожидается 0, 1 или 2, а обнаружен конец», «ожидается 2, а обнаружен конец» и «ожидается 0, 1 или 2, или число здесь должно быть 0 или 1, а обнаружен конец». Третья ошибка выносит мозг. Ожидается 0, 1, 2, 0 или 1? Что это значит? Иногда пишет, что машинка валидна, но что-то с ней не так: нет ни одного мейн чамбера, или топливные баки не соединины (там есть определенное правило по соединению топливных баков). Долго, очень долго, мы втупляем, каждый сам по себе, иногда кидая мысли в джаббер. Копим разные последоавтельности с ошибками, составляем полный список. Спустя пол дня, где-то после обеда уже, я нахожу машинку, которая пишет «не соединен 0 бак сам с собой». Замена на конце нуля на 10 меняет ошибку на «не соединет нулевой с первым». Начинаю перебирать и умудряюсь восстановить формат представления чисел. \u003c/span\u003eAwesome\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e. Перебираю еще пол часика и понимаю весь формат. Я не мог поверить своему счастью. Конечно, когда он уже расшифрован, он кажется очень простым :о) И он реально крут. Мы готовы приступить к непосредственно задаче. Прошло всего полтора суток из трех :о) \u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eСразу пишется на \u003c/span\u003eJavaScript\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e (ну твою ж за ногу) парсер машинок из тернарки в \u003c/span\u003eJSON\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eи парсер топлива из \u003c/span\u003e\u003c/span\u003eJSON\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eв тернарку и сразу в фабрику.\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eКирилл улучшает скрипт, чтобы тот рассылал больше типов топлива, и уходит спать. Скрипт убивается через 10 минут после этого, когда сервер вернул 503. Не очень \u003c/span\u003eRobust\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003e:о)\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eСначала я решаю руками некоторые простые машинки, где матрица имеет размер 1 на 1 (открыть машинку, подать ее на парсер, подумать, написать \u003c/span\u003eJSON\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eтоплива, закодить в фабрику, заслать – автоматизацией не пахнет :о)), пока не нахожу машинку 13252. Смотря на нее я понимаю, что некоторые числа в описании топлива в решении могут быть очень большими, знаков по 100. И мое решение на яваскрипте явно не способно их обрабатывать. Приходится переписывать половину кода на \u003c/span\u003e\u003c/span\u003eJava\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003e– потеря времени - \u003cspan style\u003d\"\"\u003e \u003c/span\u003eс \u003c/span\u003e\u003c/span\u003eBigInteger\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e, с осознанием того, насколько изначально было тупо писать все на \u003c/span\u003eJavaScript\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e. Теперь весь код, уже готовый, невозможно использовать, потому что \u003c/span\u003eJavaScript\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eдаже не научишь писать в файл/читать из файла. При этом конвертор в фабрики я не переношу, и автоматизация все еще хромает, так как надо сконвертить машинку в \u003c/span\u003e\u003c/span\u003eJSON\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eна стринчке, запустить ява-приложение, и опять на страничке сконверить аутпут в фабрику.\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eПосле этого я решаю все машинки вида 13252, и на этом получаю сильный старт – такие машинки к тому времени решены 6-7 командами, а значит баллов за них дают неплохо. Обгоняю постепенно в таблице результатов соседние команды, спустя какое-то время мне уже не надо проматывать странцу чтобы найти нас :о)\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eДалее вырисовывается несколько путей развития:\u003c/span\u003e\u003c/p\u003e  \u003cp style\u003d\"text-indent: -0.25in;\"\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e\u003cspan style\u003d\"\"\u003e1.\u003cspan style\u003d\"font: 7.0pt \u0026quot;Times New Roman\u0026quot;;\"\u003e      \u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eУлучшить наши фабрики – сделать их покороче, чтобы баллов за них капало побольше\u003c/span\u003e\u003c/p\u003e  \u003cp style\u003d\"text-indent: -0.25in;\"\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e\u003cspan style\u003d\"\"\u003e2.\u003cspan style\u003d\"font: 7.0pt \u0026quot;Times New Roman\u0026quot;;\"\u003e      \u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eНаписать решалки каких-то базовых машинок\u003c/span\u003e\u003c/p\u003e  \u003cp style\u003d\"text-indent: -0.25in;\"\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e\u003cspan style\u003d\"\"\u003e3.\u003cspan style\u003d\"font: 7.0pt \u0026quot;Times New Roman\u0026quot;;\"\u003e      \u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eИли сделать свои машинки\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eЯ выбрал третий путь, и начал делать машинки, выбирая несколько больших степеней двойки, и рисуя семь чемберов, которые, видимо, можно будет решить только подобрав эти степени двойки. Засылаю одну такую машинку, и ее почти сразу решает пять команд...\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eЭто не беда, увеличиваю ограничение, засылаю снова. В этот раз почти успех, только через пару минут решила одна команда, и еще попозже вторая. Затем много минут новых решений не поступает, и я убеждаю уже проснувшихся ребят заслать такие машинки под лимит, и сосредоточиться на решении чужих до конца соренования. Сам засылаю машинок 30, и ухожу спать, время уже за полночь. Перед сном успеваю пронаблюдать, как наша команда начинает взлетать в таблице результатов, обходя тонну соперников. Кирилл в этом время добавляет в бота две новых фабрики, которые решают еще больше нубских машинок.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eОсновной мой страх был, что мы все равно не придумаем машинки лучше, и если не зашлем сейчас, то потеряем много баллов. Лучше, как мне тогда казалось, сосредоточиться на решении чужих машин.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cb style\u003d\"\"\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eДень третий, Воскресенье\u003c/span\u003e\u003c/b\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eС утра мы уже на 14-ом месте с 300К очков, наши машинки уже решило по 5-6 команд не считая нас, и к списку решенных нами машинок добавилось порядка 60 нубских. Мы все еще растем неплохими темпами (не смотря на то, что наши машинки научились решать).\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eЯ ухожу смотреть матч Бразилия – Ивори Коаст, а ребята продолжают улучшать бота и думать. Просмотр матча в баре без выпивки не удался, и вернулся я в состоянии, не пригодном для решения задачки. Однако новости хорошие – Бегемот придумал новый способ генерить фабрики, который позволит делать фабрики в 10 раз короче!\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eСервер соревнования лежит. Администраторы, видя это, дают несколько вспомогательных ссылок, среди них полный список машинок с длинами всех решений, где мы видим, что наши решения самые длинные (и, как следствие, приносят меньше всего очков).\u003cspan style\u003d\"\"\u003e  \u003c/span\u003e\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eВ это время я начинаю писать брут для топлива на \u003c/span\u003eC\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e# (как хорошо, что в .\u003c/span\u003eNET\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e 4.0 есть \u003c/span\u003eBigInteger\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e), который перебирает одноингридиентные топлива с кажным элементом от 1 до 10. Парсер написался легко, но попытки найти машинку, которую бы он решал, заканчиваются буквально нахождением двух трех.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eПри этом копировать аутпут брута на \u003c/span\u003eJavaScript\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eстраничку, чтобы сконвертировать топливо в фабрику, очень неудобно, и встает необходимость перенести конвертор топливных фабрик на \u003c/span\u003e\u003c/span\u003eC\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e#. Раз уж надо переносить генератор, решаю сразу писать идею Бегемота. Это занимает ужасное количство времени (вероятно не последнюю роль в этом сыграл побочный эффект матча Бразилия – Ивори Коаст), но в конечном итоге новый конвертор топлива в фабрики, готов.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eЗатем запрос “\u003c/span\u003eC\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e# \u003c/span\u003eWebRequest\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e” в \u003c/span\u003eBing\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e и 30 минут учат софтинку грузить список машинок с сервера, грузить машинки, брутить их, конвертить и засылать, и за несколько минут количество решенных нами машинок увеличивается в 1.5 раза! :о)\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eПри этом софтинка перепосылает все уже решенные нами машинки с более короткими фабриками.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eТеперь внимание вопрос. Почему я написал брут форс, а не линейное программирование, если даже ребенку очевидно, что это – задача на линейное программирование? Большинство конкуретнов, которые нас потом обошли не очень сильно, разумеется написали ЛП.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eВечером, когда ребята проснулись, возникает печаль. \u003c/span\u003eMono\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eс .\u003c/span\u003e\u003c/span\u003eNET\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e 4.0 не так-то легко найти. Они оба не могут запустить мою софтинку. Я генерирую у себя на машине все простые топлива, чтобы Кирилл добавил их в свой скрипт. Теперь на новые машины сразу засылается новое топливо. К сожалению, мой \u003c/span\u003eC\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e# кодяк в отличие от бота Кирилла, не запоминает решенные машинки, и каждый раз идет по всему списку. Чтобы он как-то все-таки решал свежие машинки, я запускаю его восемь раз с разным стартовым отступом. Оборачиваю пол кода в \u003c/span\u003etry\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e-\u003c/span\u003ecatch\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e, чтобы не повторить подвиг Кирилла с падением через 10 минут. Ухожу спать в полночь, до конца контеста пять часов.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eНочью происходит забавный момент. Во-первых, уже с вечера многие команда, похоже, написали ЛП-солвер, и начали очень быстро расти. И конкуренция в последние часы просто дикая. Нас рвет \u003c/span\u003eSnakeTeam\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e, которую Бегемоту было принципиально порвать, и дерет нас за счет... своих машинок! Потому что 1000 решенных простых машин дает порядка 10 баллов за прирост, в то время как 72 своих (72 - лимит), которые решит одна команда кроме вас, дает 30 баллов за прирост! Прогадал я, однако, с засылкой машинок под лимит раньше времени.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eТак вот, забавный момент. Была под нами команда \u003c/span\u003eSzM\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003e– стыдно за МГУ. Бегемот открыл ихнюю машинку, прочитал, и понял, что он знает как ее решать, в тоже время, наши боты пока ее не умеют делать. Он решает ее, и решает все машинки \u003c/span\u003e\u003c/span\u003eSzM\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e. В итогде, в конце контеста \u003c/span\u003eSzM\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003eза нами с минимальным отставанием :о) Получается ихние же машинки не дали им нас обойти :о)\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eВ итоге мы на 19-ом месте. Вокруг невероятная концентрация российских команд: над нами \u003c/span\u003eTBD\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e, повыше \u003c/span\u003eSnakeTeam\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e, под нами Стыдно за МГУ, \u003c/span\u003ejabber\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e-\u003c/span\u003eru\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e.\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eВот в общем такая история. Основные уроки, которые были вынесены:\u003c/span\u003e\u003c/p\u003e  \u003cp style\u003d\"text-indent: -0.25in;\"\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e\u003cspan style\u003d\"\"\u003e1.\u003cspan style\u003d\"font: 7.0pt \u0026quot;Times New Roman\u0026quot;;\"\u003e      \u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eПодумай 10 раз на каком языке пишешь.\u003c/span\u003e\u003c/p\u003e  \u003cp style\u003d\"text-indent: -0.25in;\"\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e\u003cspan style\u003d\"\"\u003e2.\u003cspan style\u003d\"font: 7.0pt \u0026quot;Times New Roman\u0026quot;;\"\u003e      \u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eНе пиши на \u003c/span\u003eJavaScript\u003cspan style\u003d\"\"\u003e \u003cspan lang\u003d\"RU\"\u003e:о)\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e  \u003cp style\u003d\"text-indent: -0.25in;\"\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e\u003cspan style\u003d\"\"\u003e3.\u003cspan style\u003d\"font: 7.0pt \u0026quot;Times New Roman\u0026quot;;\"\u003e      \u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003eВнутри команды используйте один язык программирования :о)\u003c/span\u003e\u003c/p\u003e  \u003cp\u003e\u003cspan lang\u003d\"RU\" style\u003d\"\"\u003e\u003cspan style\u003d\"\"\u003e \u003c/span\u003eВ следующем году обязательно буду писать снова :о Никакие из соревнований, где я участвовал прежде (кроме конечно ICPC 2008 - с этим ничто не сравнится :О)) по накалу страстей даже рядом, по-моему, не стояли :о)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e","tags":["icfp","icfpc"]}}