{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1267546476,"rating":0,"authorHandle":"Salat","modificationTimeSeconds":1267554360,"id":121,"title":"Впечатления от TopCoder","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВпечатления от TopCoder’а: Все так быстро происходит, что я успел только понять эти задачи.\u003c/p\u003e  \u003cp\u003e\u003cb\u003e1 ЗАДАЧА\u003c/b\u003e\u003c/p\u003e  \u003cp\u003eМинут тридцать пытался понять чего тут хотят та, таки понял, написал решение, но кто-то очень умный решил меня challenge’нуть, от чего мне не удалось набрать больше нуля баллов.\u003c/p\u003e  \u003cp\u003eУсловие: \u003c/p\u003e  \u003cp\u003eПро кроликов. Надо подсчитать кол-во прыжков которые кролики могут сделать при трех условиях:\u003c/p\u003e  \u003cp\u003e-\u003cspan style\u003d\"\"\u003e              \u003c/span\u003eКролик не может перепрыгнуть сразу через двух кроликов\u003c/p\u003e  \u003cp\u003e-\u003cspan style\u003d\"\"\u003e              \u003c/span\u003eКролик не может прыгнуть на место другого кролика\u003c/p\u003e  \u003cp\u003e-\u003cspan style\u003d\"\"\u003e              \u003c/span\u003eКролик должен прыгать только на место 2*b-a\u003c/p\u003e  \u003cp\u003eКролики стоят в ряд например {5,8} это координаты двух кроликов на прямой.\u003c/p\u003e  \u003cp\u003e \u003c/p\u003e  \u003cp\u003e\u003cb\u003e2 ЗАДАЧА\u003c/b\u003e\u003c/p\u003e  \u003cp\u003eТут я сразу понял чего хотят, но времени на написание решения уже не было.\u003c/p\u003e  \u003cp\u003eУсловие:\u003c/p\u003e  \u003cp\u003eВсе кролики хотят быть пронумерованными, всего их n, i–ый кролик может быть пронумерован от 1 до max[i] включительно. Определить кол-во способов, которыми можно пронумеровать всех кроликов.\u003c/p\u003e  \u003cp\u003eНапример : 4 кролика {4,4,4,4}\u003c/p\u003e  \u003cp\u003eТогда у первого кроля 4 способа выбрать номер, у третьего осталось три способа, и.т.д.\u003c/p\u003e  \u003cp\u003eПолучается 24 \u003d 4*3*2*1 способа всего.\u003c/p\u003e  \u003cp\u003e \u003c/p\u003e  \u003cp\u003e\u003cb\u003e3 ЗАДАЧА\u003c/b\u003e\u003c/p\u003e  \u003cp\u003eНе понятно как решать, такую задачу.\u003c/p\u003e  \u003cp\u003eУсловие:\u003c/p\u003e  \u003cp\u003eЕсть колода карт, на каждой из них записано какое-то число, типа double. Теперь нужно удалить две карты из колоды, их числа либо сложить, либо умножить, результат записать на новую карту и вставить в колоду. Повторить эти действия до тех пор, пока в колоде не останется одна карта.\u003c/p\u003e  \u003cp\u003eВроде не чего сложного? Но\u003cspan style\u003d\"\"\u003e  \u003c/span\u003eнадо сделать это таким образом, чтобы в результате на карте было написано максимально возможное число. \u003c/p\u003e  \u003cp\u003e \u003c/p\u003e  \u003cp\u003eПосле кодинга наступает затишье, вроде три минуты. После чего участники пытаются, валить друг друга.\u003cspan style\u003d\"\"\u003e  \u003c/span\u003eМОЖНО СМОТРЕТЬ ЧУЖИЕ РЕШЕНИЯ, и стрелять по ним.\u003cspan style\u003d\"\"\u003e  \u003c/span\u003eВот и все.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eИтог: рейтинг 806.\u003c/p\u003e\u003cp\u003eВывод: быстрее соображать надо.\u003c/p\u003e\u003cp\u003eВердикт: accepted.\u003c/p\u003e\u003c/div\u003e","tags":["topcoder"]}}