{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1265893510,"rating":1,"authorHandle":"Fefer_Ivan","modificationTimeSeconds":1266233780,"id":72,"title":"Мысли о саморазвитии","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv class\u003d\"from-renderer\"\u003eНесмотря на все полезные навыки, которые дает нам университет и олимпиадное программирование, некоторые вещи, необходимые в промышленном программировании, для меня покрыты туманом. Так что я решил заняться собой.\u003cbr /\u003e \u003cbr /\u003e    Для начала, я скачал книгу \u0026quot;Эффективное использование С++\u0026quot; автора С. Мейерса, упомянутую в статье \u003ca href\u003d\"http://codeforces.ru/blog/entry/43\"\u003eJava vs C++\u003c/a\u003e    .\u003cbr /\u003e \u003cbr /\u003e    Книга интересная и полезная, однако, чтобы практически закрепить полученные навыки, я решил придумать относительно простой проект и реализовать его.\u003cbr /\u003e \u003cbr /\u003e    Сделаю небольшое лирическое отступление. Когда я был помладше, я много времени проводил за компьютерными играми. И моё увлечение программированием косвенно вызванно так же играми. Я много игр перепробывал. Так же в некоторые было особенно приятно играть с друзьями. В свое время очень интересной была игра \u003ca href\u003d\"http://dagobah.biz/flash/tanks.swf\"\u003eTanks\u003c/a\u003e    . Механика простая. По очереди от 2 до 5 танков ездят, стреляют и уничтожают. Однако была куча фишек. Щиты а-ля Star Trek, возможноть телепортации и куча разного вооружения.\u003cbr /\u003e \u003cbr /\u003e    Самое досадное, что она была багнутая. Стоило один раз улучшить броню и уничтожение становилось невозможным, так как количество здоровья становилось дробным и автор, наверное, не знал, что вместо a \u003d\u003d 0 надо писать fabs(a) \u0026lt; EPS\u003cbr /\u003e \u003cbr /\u003e    Вот и решил я создать собственный аналог. Конечно, потребуется время и силы, но я думаю, что такое занятие поможет мне развить свои навыки.\u003cbr /\u003e \u003cp\u003eХотелось бы услышать ваши мнения по поводу способов развития навыков программирования.\u003cbr /\u003e\u003c/p\u003e    P.S.\u003cbr /\u003e \u003cbr /\u003e    Планирую использовать OpenGL. Подскажите пожалуйста хороший ресурс или книгу по данной библиотеке.\u003cbr /\u003e\u003c/div\u003e\u003c/div\u003e","tags":["innovations","learning","с++"]}}