{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1291398096,"rating":0,"authorHandle":"Andronnix","modificationTimeSeconds":1291398096,"id":911,"title":"Google AI Challenge","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eНе так давно (1 декабря) закончился Google AI Challenge - соревнование ботов. Боты участников играли между собой в игру, представляющую собой следующее: Дана карта на которой расположены планеты. У каждой планеты известны координаты, количество кораблей на ней и количество прироста кораблей. Игрок может отправлять заданное количество кораблей на планету. Игра походовая. Победа засчитывалась в двух ситуациях: если у противника не осталось планет и флотов или если к 200 ходу суммарное количество кораблей одного участника превышало суммарное количество кораблей другого(масло масляное \u003d) ).\u003cdiv\u003e\u003cbr /\u003e\u003cdiv\u003eКаждый участник после регистрации качал так называемый стартер кит - стартовый набор. В него входил набор карт, несколько простых ботов, визуализатор для тестирования своего бота у себя на компьютере. Затем участник производил изменения в коде стандартного бота и загружал его на сайт, где происходили соревнования ботов. Участники были аж из 100 стран, и их количество было около 4600. Ну, собственно это был мой первый опыт участия в соревнованиях такого рода, и моё 2615 место я считаю довольно неплохим результатом, учитывая то что мне пришлось кодить на Java, который мне почти незнаком. \u003c/div\u003e\u003c/div\u003e\u003cdiv\u003eВот ссылка на сайт, если кому то интересно: \u003ca href\u003d\"http://ai-contest.com\"\u003ehttp://ai-contest.com\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003eЕсли игра заинтересовала, есть флеш версия игры с несколькими игроками, от 2 и до 12, называется Galcon, собственно она и была основой для игры в челлендже: \u003ca href\u003d\"http://www.galcon.com/flash/\"\u003ehttp://www.galcon.com/flash/\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003c/div\u003e","tags":["google","google ai challenge"]}}