{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1287902711,"rating":10,"authorHandle":"dalex","modificationTimeSeconds":1287915289,"id":784,"title":"Samara SAU на четвертьфинале","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eСобственно, здравствуйте, уважаемые читатели. Это мой первый пост на этом сайте, и связан он, разумеется, с четвертьфиналом 18-23 октября в Саратове, который на самом деле называется первенством Южного подрегиона NEERC.\u003cbr /\u003e\u003cbr /\u003eВероятно, все уже видели монитор соревнований - там команда Samara SAU #2 заметно опередила мою команду Samara SAU #1. Это не случайность, просто при регистрации человек, ответственный за нее, решил пошутить и поменять нас местами, потому что он хотел отсортировать команды по возрасту. Так что реально сильнейшей была вторая команда, а наши шансы на проход я оценивал примерно 50 на 50.\u003cbr /\u003e\u003cbr /\u003eВ качестве вступления хочу отметить чистоту и красоту территории университета. Это не наш раздолбанный Самарский аэрокосмический университет с убогими зданиями, свалкой самолетов, домиками каких-то мужиков, вроде бы связанных с запчастями для машин и прочим мусором.\u003cbr /\u003e\u003cbr /\u003eРассказ, пожалуй, надо начать с 20 октября, когда прошел пробный тур и раздали условия Code Game Challenge. О пробном туре у меня одно замечание: меня и мою команду очень порадовала тестирующая система. При написании java-класса, реализующего Runnable и дальнейшем создании нового потока тестирующая система давала верный вердикт RE при выбрасывании исключения. А вот на Тимусе, например, дают WA вместо RE.\u003cbr /\u003e\u003cbr /\u003eПосмотрев задания Code Game Challenge, мы очень обрадовались: это снова танки, а не унылые гонки. Точнее, это были танки двухлетней давности без баз и трения.\u003cbr /\u003eНа самом Code Game Challenge мы сначала написали стрельбу, на это ушло примерно час. Мы просто сделали все то же самое, что и 2 года назад, когда наш танк занял 7 место. Этот алгоритм себя оправдал: стрелял наш IDDQD идеально. А вот хорошее движение написать не получилось: наверняка все видели, как наш танк тупил.\u003cbr /\u003eБыло обидно, что нам не везло с случайными бонусами. За 10 минут до конца соревнования мы тестили свой ховеркрафт на рандомах в Global Test, и он примерно в 80% случаев набирал более 100 очков и занимал 1 место. За 6 раундов настоящего Code Game это удалось лишь в самой первой игре. Возможно, при большем везении мы попали бы в призы.\u003cbr /\u003eЗато отлично выступила наша вторая и сильнейшая команда. Их ховеркрафт рвал нашего IDDQD один на один примерно в 70% случаев. Мы предполагали, что это серьезная заявка на победу - так и вышло. Ховеркрафт с загадочным названием Natasha Fan Club, названный в честь местной богини программирования, не только идеально стрелял, но и превосходно ездил и собирал бонусы, и в итоге победил, выиграв 8 поединков из 9 и уступив еще в одном лишь одно очко.\u003cbr /\u003eА наша третья команда с креативным названием 123456789 заняла шестое место, обогнав наш невезучий ховеркрафт, который закончил турнир на 16 месте.\u003cbr /\u003eЯ снимал на сотовый второй и третий раунды (т.е. когда осталось 32 ховеркрафта и финал соответственно), и они уже доступны для просмотра (пока на Rutube). Хотя было бы круто, если бы организаторы выложили оригинальное видео, я не вижу причин, почему этого не делать.\u003cbr /\u003e\u003cbr /\u003eСам контест для нашей команды прошел в режиме злостного отупения. Вначале мы написали задачу F (про лифт), но получили TLE. Конечно, это было зацикливание. Мой просчет... Потом набрали задачу B (про кубики), сдали таки F и J (про буйки, где один из моих партнеров вовремя сообразил, что надо оставлять на месте ровно два буйка). Затем я целый час решал E (про мужика, которого везут с закрытыми глазами), вовремя не заметив нормальное решение в 3 цикла for. Первый неверный сабмит по E получил TLE, хотя работать должен был вроде бы недолго. А второй неверный сабмит произошел из-за глупейшего бага, недописанной строчки. Потом мы зачем-то написали эвристику для C, cловившую WA #19, и сдали D (про Николая и Владимира) с второй попытки (ага, естественно, ребро надо добавлять только в одну сторону).\u003cbr /\u003eИтак, за 3 часа мы сдали 5 задач, а наша первая (на мониторе - вторая) команда сдала шесть. В дальнейшем мы так ничего и не сдали, а за час до конца соревнований были на 13 месте, если исключить стоящие выше нас лишние саратовские команды. Непосредственно после контеста мы узнали, что сидевшие напротив нас волгоградцы решили две задачи за последний час и обогнали нас - мы стали четырнадцатыми, последним выходящим местом.\u003cbr /\u003eНа выходе нас немножко успокоили, сказав, что мы были последними из тех, кто решил пять задач, и что команды, решившие четыре задачи, отставали от нас по времени - им надо было делать две. Этого не произошло, и мы проскочили в Питер, не решив ни одной трудной задачи. А вообще непонятно, почему мы не начали писать G и K.\u003cbr /\u003e\u003cbr /\u003eРезультат был отпразднован, разбор задач прослушан, и пора было уезжать. Мы решили посидеть на лавочках на территории университета и уйти, как только до отправления поезда останется час. Там было весело: на нас целый час набигали две пьяные девочки, Алиса и Оля. Они никак не могли поверить, что мы ждем поезда, и все время пытались унести с собой рули, выигранные в Code Game Challenge. В итоге они порвали ручку у коробки руля и зохавали два бейджика. Впрочем, это нас не огорчило, и мы уехали домой, в Самару. А я еще и написал этот пост.\u003cbr /\u003e\u003cbr /\u003e\u003cb\u003eUPD\u003c/b\u003e: Видео Code Game Challenge залито на Rutube: \u003ca href\u003d\"http://rutube.ru/tracks/3703952.html?v\u003d74c4d34409fa2e52a8c439a3039b7f03\"\u003ehttp://rutube.ru/tracks/3703952.html?v\u003d74c4d34409fa2e52a8c439a3039b7f03\u003c/a\u003e и Вконтакте: \u003ca href\u003d\"http://vkontakte.ru/video7104349_154275450\"\u003ehttp://vkontakte.ru/video7104349_154275450\u003c/a\u003e, не ругайте меня за возможные неадекватные комментарии...\u003c/div\u003e","tags":["code game challenge","четвертьфинал"]}}