{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1292162709,"rating":9,"authorHandle":"OSt","modificationTimeSeconds":1292339414,"id":951,"title":"IT Fest \u0026quot;Aрхангельск 2010\u0026quot; - взгляд участника.","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЯ часто слышал весьма позитивные отзывы об этом мероприятии, но только в этом году получилось выбраться на него. Хотелось бы поделиться с сообществом своими заметками об этом мероприятии.\u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eПредыстория:\u003c/strong\u003e\u003c/p\u003eПосле \u0026quot;слива\u0026quot; четверти в Рыбинске было принято решение о замене двух пятикурсников-математиков, на \u0026quot;подрастающее\u0026quot; поколение. \u0026quot;Старички\u0026quot; уже перестали тренироваться, \u0026quot;хватка\u0026quot; потерялась и в результате такой epic fail. \u003cp\u003eТак получилось, что новоиспеченная команда успела провести только 2 тренировки,на которых планировалось прежде всего отработать взаимодействие и распределение ролей. Было решено, что \u0026quot;молодые\u0026quot; займутся простыми задачами, на решение которых им отводилось 1-1.5 часа. Я же должен был за это время оценить остальные задачи, которые писать и решать буду сам в оставшееся время. На тренировках всё проходило гладко и все были довольны результатами.\u003cbr /\u003e\u003c/p\u003e\u003cbr /\u003eСама поездка в Архангельск из Вологды на поезде заняла часть вечера и всю ночь.\u003cbr /\u003eСамым забавным оказалось, что вместе с нами в Архангельск в том же вагоне были отправлены \u0026quot;призывники\u0026quot;. Как сказал один из сокомандников - \u0026quot;Главное завтра не проснуться побритым и в форме\u0026quot; :)\u003cbr /\u003eВ Архангельск поезд прибыл около 7 часов утра. На перроне нас встретили две студентки Поморского ГУ, которые проводили нас до автобуса, на котором нас довезли до гостиницы. \u003cbr /\u003eЯ, правда, мало где бывал, но чтобы команды так встречали да ещё и рано утром - это, конечно, приятно удивило.\u003cbr /\u003e\u003cbr /\u003e\u003cp\u003eЗаселившись в гостиницу \u0026quot;Беломорская\u0026quot;, которая порадовала наличием рестораном и кафе и большими номерами, мы пошли на регистрацию и открытие фестиваля.\u003c/p\u003e\u003cp\u003eВ здании ПГУ нас опять встретили представительницы прекрасного пола, которые выдали нам все материалы. Мимо нас постоянно мелькал фотограф, который судя по всему сделал весьма приличное количество фотографий, которые, наверно, будут доступны после мероприятия.\u003c/p\u003eОткрытие прошло в приятной и торжественной обстановке. Выступали администрация ПГУ+жюри+спонсоры. После этого все пошли на пробный тур, начался который правда для нас с небольшой задержкой.\u003cbr /\u003e\u003cp\u003eМеста были оборудованы весьма достойно. Всё нужное ПО было установлено. Тестирующая система была доступна :)\u003c/p\u003e\u003cp\u003eБыли даны 3 халявные задачи, которые с гиканием и улюлюканием наша команда успела \u0026quot;закатать\u0026quot; раньше всех. После этого мы принялись писать нормальные шаблоны для решений, тестировать сервер на максимальную нагрузку, в общем заниматься всем тем, что и нужно делать сегодня, чтобы не было неожиданностей завтра.\u003cbr /\u003e\u003c/p\u003eОсновной тур начался в 10 часов. Все команды ринулись быстро укладывать простые задачи. Сразу выделилось около 5( в том числе и наша) команд, которые почти всё время занимали вершину списка. Наша команда работала по обкатанной на тренировках схеме. Пока мои сокомандники решали 4 задачи за 1.5 часа, я пробовал свои силы на остальных. Но ,видимо весьма увлекшись решением, я пропустил тот момент, когда надо было заметить, что ребята \u0026quot;зависли\u0026quot; над 5-ой задачей. \u003cp\u003eХотя меня и призывали к решению, я, полностью погруженный в свои задачи, соображал над их задачами весьма слабо. Тем более мои друзья так упорно \u0026quot;запинывали\u0026quot; эту задачу, что я был более чем уверен, что им надо просто ещё чуть чуть времени. Прождав ещё около часа, я сел писать решение к своей задаче. Попыток сдачи по той задаче я не видел и были сомнения, что и мне её решать не стоит. В результате решение получило TL и было принято решение мне срочно присоединяться к решению \u0026quot;зависшей\u0026quot; задаче.\u003cbr /\u003e\u003c/p\u003eВ конце концов я переписал решение на свой лад и мы всё таки его сдали за 17 секунд до конца соревнования. Это было просто нечто. Пусть и решили мало задач, но позитивная концовка всё таки подняла настроение.\u003cbr /\u003e\u003cbr /\u003eРазбор задач проводил \u003ca href\u003d\"http://codeforces.ru/profile/KirillB\"\u003eКирилл Бутин\u003c/a\u003e, тренер команд ПГУ. \u003cbr /\u003e\u003cp\u003eНа нем, кстати, он сообщил, что моё решение, которое получило TL, могло бы зайти, если бы я добавил всего одно, правда не совсем очевидное, отсечение (один Else-If). Обидно было упустить такую возможность, но что поделать.\u003c/p\u003e\u003cp\u003eНа мой взгляд проблемсет был весьма сбалансированным. Из 10 задач \u0026quot;решабельными\u0026quot; даже для меня были 7. Был один откровенный \u0026quot;гроб\u0026quot;, предоставленный \u003ca href\u003d\"http://codeforces.ru/profile/it4.kp\"\u003eit4.kp\u003c/a\u003e :)В общем, от контеста остались смешанные чувства, но в общем всё понравилось.\u003cbr /\u003e\u003c/p\u003eЗакрытие было весьма впечатляюще. Всем были продемонстрированы демки мультимедия-проектов, которые участвовали во втором мероприятии IT Fest. Весьма впечатлили выступления студентов МатФака ПГУ, которые пели, играли и шутили\u003cbr /\u003eна сцене. В общем, всё было очень интересно, но голова после 5-и часового контеста всё-таки просила покоя :)\u003cbr /\u003eСпонсоры были щедры на подарки, которые весьма быстро расходились в основном участникам конкурса проектов.\u003cbr /\u003e\u003cp\u003eПосле мероприятия был фуршет, на который пошли в основном \u0026quot;взрослая\u0026quot; часть участников IT Fest.\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eВ итоге моя команда заняла 5 место, что мы посчитали не плохим началом для нового коллектива. \u003c/p\u003e\u003cp\u003eУезжая из Архангельска, мы были точно уверены, что в следующем году обязательно постараемся сюда вернуться.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eРезультаты олимпиады по программированию: \u003ca href\u003d\"http://itfest.pomorsu.ru/olimp2010\"\u003ehttp://itfest.pomorsu.ru/olimp2010\u003c/a\u003e\u003c/p\u003e\u003cp\u003eРезультаты конкурса мультимедиа работ: \u003ca href\u003d\"http://itfest.pomorsu.ru/rez2010\"\u003ehttp://itfest.pomorsu.ru/rez2010\u003c/a\u003e\u003c/p\u003e\u003cp\u003eРаботы призеров Фестиваля:  \u003ca href\u003d\"http://itfest.pomorsu.ru/gallery2010\"\u003ehttp://itfest.pomorsu.ru/gallery2010\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUPD:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eФото отчет: \u003ca href\u003d\"http://itfest.pomorsu.ru/photo2010\"\u003ehttp://itfest.pomorsu.ru/photo2010\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["2010","itfest","архангельск"]}}