{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1267222655,"rating":4,"authorHandle":"ItsNear","modificationTimeSeconds":1267222655,"id":105,"title":"А что после ICPC? И в чем вообще смысл?","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv class\u003d\"from-renderer\"\u003eЯ уверен, что многим, кто сейчас занимается АСМ, интересно, с каким классом задач им предстоит столкнуться в будущем, когда официальные старты закончатся и настанет пора думать, где бы заработать на красную икру с кока-колой. И что полезного они вынесут из того, чем сейчас занимаются.\u003cbr /\u003e\u003cbr /\u003eИнтересно:\u003cbr /\u003e1. Какой вы видели свою работу во времена ваших поездок на ICPC?\u003cbr /\u003e2. И какой класс задач реально встал после\u003cbr /\u003e3. Насколько вы круче своих коллег (чисто по ощущениям - кажется ли вам, что вы справляетесь с работой лучше их)\u003cbr /\u003e4. Какова роль полученных регалий в вашей жизни.\u003cbr /\u003e\u003cbr /\u003eЭто, разумеется, если вы уже закончили свою ICPC-карьеру. Иначе вопросы следующие:\u003cbr /\u003e\u003cbr /\u003e1. Какой вы видите свою работу после ICPC?\u003cbr /\u003e2. И какой класс задач вы ожидаете решать?\u003cbr /\u003e3. Чего вы ожидаете от регалии, которую получите?\u003cbr /\u003e4. Как вы оцениваее свой шанс рано или поздно получить эту самую регалию, и какая регалия является вашей целью (попадание на финал, медаль финала, золотая медаль финала, чемпионство на финале)? Является ли вашей целью любая регалия или цель вообще иная?\u003cbr /\u003e\u003cbr /\u003eВ Ижевске за всю историю было четверо программистов-олимпиадников, которые достигали мирового уровня, и вместе смогли в сумме пройти на четыре финала и завоевать три медали. Это меньше, чем во многих городах. Но историю можно проследить: первое поколение ребят остались после олимпиад в Ижевске, и работают в местных компаниях. Лучше ли они чем их коллеги? Один - заведомо да. Но не за счет олимпиад, а за счет упорства, которое сначала принесло медаль, а потом позволило быстро расти по карьерной лестнице. Про второго ничего хорошего не скажу :о)\u003cbr /\u003e\u003cbr /\u003eЕще один молодой человек из того поколения, который не был так крут, как они, но получил медаль, будучи \u0026quot;участником-зрителем\u0026quot;, качественно поюзал свою регалию и попал в огромную московскую фирму. \u003cbr /\u003e\u003cbr /\u003eЯ уже видел их опыт и как только вернулся с второго финала, почти в тот же день подсуетился и написал в нужные места, и почти пустое резюме с медалью ICPC принесло мне отличную работу за рубежом, и класс задач очень приятный - модные нынче Data Mining и Machine Learning. Мораль из этого - медаль чемпионата мира имеет ОГРОМНЫЙ вес в глазах зарубежных гигантов. А с высоты вашего опыта интервью вы потом пройдете за нефиг делать. То есть, если нацеленность на результат есть, вы получите потом отличную работу.\u003cbr /\u003eА вот что, если нацеленность была, а разультата не получилось - я не знаю. Интересно было бы узнать судьбу ребят, которые пять лет занимались олимпиадками, а потом ничего не заняли по неудачному стечению обстоятельств.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eПотому что, забыв о регалии, что мы имеем?\u003cbr /\u003eЯ знаю один плюс, который реально помогает - это умение решать задачи, которые раньше не встречал. Я часто замечаю, что когда мы сталкиваемся с какой-то сложной задачей, я могу сразу предложить качественное решение, в то время как даже очень умные ребята могут потратить какое-то время на его поиск. Потому что это то, в чем я крут и на что я потратил пять лет. Но что кроме этого?\u003cbr /\u003eМного алгоритмов? Почти не пригождаются. Я не знаю задач на поток в реальной жизни, которые бы еще не были решены и требовали чьего-то вмешательства.\u003cbr /\u003eКомандная работа? В чем заключается командная работа? На самом деле, есть ли кто-то, кто считает, что то, как работала их команда на ICPC, может действительно дать полезные навыки? Какие именно? Командная работа - это видимо то, в чем отличаются все команды. Я знаю, что то, как работала наша команда, было очень оптимизировано для ICPC, и не дало реального навыка для работы в команде над каким-то проектом. Если у кого-то это не так, мне было бы интересно узнать, а как тогда? Как должна работать команда, чтобы это приносило полезный опыт?\u003cbr /\u003eЗнание языков и технологий - это вообще смешно, чаще всего на олимпиаде используются только базовые конструкции и несколько стандартных классов. Вспомнить хотя бы задачу J на ГП Удмуртии. Что, серьезно никто не знает, что в Java есть встроенный интерпретатор JavaScript? :о) И недавние примеры с задачами на определение, является ли число простым. Сколько человек знало про BigInteger.isProbablyPrime?\u003cbr /\u003e\u003cbr /\u003eЭто то, как это у меня. Я научился решать нестандартные задачи быстро,  и это все, что я получил из практических навыков, на первый взгляд. Глубже я не копал :о)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eЕще интересный момент, которого бы хотелось избежать сейчас. Часто пишут, например, \u0026quot;если ты не встречал задач на поток, это не значит что их нет\u0026quot;. Но никто же не спорит - но где они? Интересно же реальные примеры, а не общие слова. Предположений и я строил много, на деле все повернулось как-то не так, как предполагалось :о)\u003cbr /\u003e\u003cbr /\u003eБолее обобщенно, хотелось бы построить коллективное мнение о\u003cbr /\u003eа) том, что ждет олимпиадников в будущем - опыт уже прошедших и ожидания тех, кто пока вертится в этом всем\u003cbr /\u003eб) том, что полезного мы вынесем и как это реально потом пригодится\u003cbr /\u003e\u003c/div\u003e\u003c/div\u003e","tags":["icpc"]}}