{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1289680862,"rating":-5,"authorHandle":"OSt","modificationTimeSeconds":1289680862,"id":866,"title":"SRM 487 Problem Two Division 2","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЭто был мой 3-ий SRM.\u003c/p\u003e\u003cp\u003eПрерыдущие 2 были слиты и я находился на 521 месте в своём дивизионе.\u003c/p\u003e\u003cp\u003eВ этот раз участников было более 2000, и мне казалось, что сейчас я продолжу своё падение.\u003c/p\u003e\u003cp\u003eНо взяв себя в руки сел его писать.\u003c/p\u003e\u003cp\u003eПервая задача сдалась быстро.\u003c/p\u003e\u003cp\u003eВторая же показалась весьма интересной.\u003c/p\u003e\u003cp\u003eНаписав первое придуманное решение и проверив его на демо тестах, я его отослал.\u003c/p\u003e\u003cp\u003eНо уже тогда во мне закралось ощущение, что решение уж больно короткое получилось и в принципе могло чудом пройти демо тесты, но просто обязано свалиться на System Test.\u003c/p\u003e\u003cp\u003eНе придумав ничего путного по 3 задаче до конца соревнования пытался понять своё решение, но так и не понял.\u003c/p\u003e\u003cp\u003eКаково же было моё удивление, когда обе задачи прошли System Test и я с 521 места переместился на 38, получив +221 рейтинга.\u003c/p\u003e\u003cp\u003eПросмотрев решения всех, кто выше меня по рейтингу я был удивлён, что ни у кого не было линейного как по памяти так и по количеству действий, однопроходного решения.\u003c/p\u003e\u003cp\u003eЯ уже перестал верить в чудеса и то, что ко мне приходит озарение и \u0026quot;заходит\u0026quot; вообще непонятно каким образом моё решение. \u003c/p\u003e\u003cp\u003eВ общем у меня вопрос - может ли кто нить объяснить - почему моё решение зашло. Это weak tests или на несколько минут в меня вселился дух какого то профи и при этом свалил тут же после отправки этого решения, не объяснив его корректность.\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://pastebin.com/eG342EyQ\"\u003eИсходый код\u003c/a\u003e \u003c/p\u003e\u003c/div\u003e","tags":["srm 487","topcoder"]}}