{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1290528073,"rating":15,"authorHandle":"yak_ex","modificationTimeSeconds":1290528073,"id":893,"title":"Regarding rating: Part 2","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eFirst, I am not good at statistics. Therefore, the following article may include incorrect description. OK?\u003c/p\u003e\u003cp\u003eIn the comments for the previous article, rating system was mentioned:\u003c/p\u003e\u003cblockquote\u003eEnhancements of Elo rating system is used by TopCoder and Codeforces. TopCoder uses normal distribution. On the other hand, Codeforces uses logistic distribution.\u003c/blockquote\u003e\u003cp\u003eIn Elo rating system, expected score, that is probability of winning plus half probability of drawing, is assumed. The expected score is described by ratings and this is (one of) the formula using different distribution between TopCoder and Codeforces. So, I am interested in the actual result.\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/3a/01/3a0147133aa6d3e1c6137172072501ccb06cc810.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003eThis scatter chart shows rating difference of two participants and probability that the participant having higher rating gets higher score. It is calculated as follows:\u003c/p\u003e\u003col\u003e\u003cli\u003eFor all not-team contests, any pair of participants is chosen.\u003c/li\u003e\u003cli\u003eFor all pairs, difference of ratings \u003cstrong\u003ebefore\u003c/strong\u003e the contest is calculated, ranks in the contest is compared and the result of comparison is classified to win, draw or lose.\u003c/li\u003e\u003c/ol\u003e\u003cp\u003e\u0026quot;Logistic\u0026quot; is calculated by the formula (R\u003csub\u003eB\u003c/sub\u003e-R\u003csub\u003eA\u003c/sub\u003e means negative of rating difference and E\u003csub\u003eA\u003c/sub\u003e means expected score):\u003c/p\u003e\u003cblockquote\u003e \u003cimg src\u003d\"/predownloaded/15/3c/153c82785b799bbaf5dde38d38e092aa312302fb.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/blockquote\u003e\u003cp\u003e\u0026quot;Normal\u0026quot; is calculated by the formula:\u003cbr /\u003e\u003c/p\u003e\u003cblockquote\u003e\u003cimg src\u003d\"/predownloaded/17/59/17597648d31cbad44a78e68e251ee1e3b645d548.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/blockquote\u003eμ is 0 and σ is adjusted to pass through the point (x, E\u003csub\u003eA\u003c/sub\u003e) \u003d (400, 10/11).\u003cp\u003eAccording to the chart, it seems that both of distribution does not fully capture the characteristics of the actual curve and that normal distribution is near form the actual curve though it is little difference..\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","rating"]}}