{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1277697235,"rating":0,"authorHandle":"Anurag","modificationTimeSeconds":1277697292,"id":502,"title":"UVA Contest Problem","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003eYesterday i participated in this contest On UVA OJ from Bangladesh\u003cbr /\u003e\u003cbr /\u003ehttp://uva.onlinejudge.org/index.php?option\u003dcom_onlinejudge\u0026amp;Itemid\u003d13\u0026amp;page\u003dshow_contest\u0026amp;contest\u003d253\u003cbr /\u003e\u003cbr /\u003eI am here to discuss about \u003cb\u003eproblem C(Cheerleaders)\u003c/b\u003e which i couldnot submit. The first two problems A and B were easier for me.\u003cbr /\u003e\u003cu\u003eProblem C link \u003c/u\u003e\u003cbr /\u003ehttp://uva.onlinejudge.org/contests/253-dead8a0b/11806.html\u003cbr /\u003e\u003cbr /\u003eAm i right? The problem can be solved considering the following cases\u003cbr /\u003eCase1 : There is non-zero solution only when \u003cb\u003eK\u0026gt;\u003d2\u003c/b\u003e. otherwise zero solution\u003cbr /\u003e\u003cb\u003eif Case1 is true, then\u003c/b\u003e\u003cbr /\u003eCase2 :  The arrangment can be done in following way:\u003cbr /\u003e\u003cb\u003eI\u003c/b\u003e. place 2 Cheerleaders on the one of the opposite corners and the rest          leaders can be  put in the rest of N*M-2 cells .\u003cbr /\u003e\u003cb\u003eII\u003c/b\u003e place 2 Cheerleaders on other opposite corners and the rest leaders can be put in the rest of N*M-2 cells\u003cbr /\u003e\u003cb\u003eIII\u003c/b\u003e place 2 cheerleaders in adjacent corner and 1 leader on one side and the rest in the remaining N*M-3 cells\u003cbr /\u003e\u003cb\u003eIV\u003c/b\u003e III way can  be repeated 3 more times\u003cbr /\u003e\u003cb\u003eV\u003c/b\u003e place 3 cheerleaders in 3 corners and the rest in N*M-3 cells\u003cbr /\u003e\u003cb\u003eVI\u003c/b\u003e V way can be repeated 2 more times\u003cbr /\u003e\u003cb\u003eVII\u003c/b\u003e place 1 cheerleader(it will cover 2 sides) on one of the corner and 2 leaders on the other 2 sides and the rest leaders on N*M-3 cells\u003cbr /\u003e\u003cb\u003eVIII\u003c/b\u003e \u003cb\u003eVII way \u003c/b\u003ecan be repeated 3 more times as we have 4 corners in total\u003cb\u003e\u003cbr /\u003eIX\u003c/b\u003e place 4 cheerleaders on all the 4 sides aand the remaining cheerleaders on the N*M-4 cellls\u003cbr /\u003e\u003cbr /\u003eThats\u0027all\u003cb\u003e\u003cbr /\u003eK\u003c/b\u003e  should be appropriately dealt as sometimes (k has to be)\u003cbr /\u003e \u003cb\u003eI\u003c/b\u003e K\u0026gt;\u003d2\u003cbr /\u003e \u003cb\u003eII\u003c/b\u003e K\u0026gt;\u003d3\u003cbr /\u003e \u003cb\u003eIII\u003c/b\u003e K\u0026gt;\u003d4\u003cbr /\u003e\u003cbr /\u003ePlease comment whether this can provide a solution or not\u003cbr /\u003eOne thing more at the UVA site can\u0027t i submit the solution to this problem any more?\u003cbr /\u003e\u003cbr /\u003eThanks for ur response\u003c/div\u003e","tags":["bubt, bangladesh","c.cheerleaders","uva contest"]}}