{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1273070364,"rating":22,"authorHandle":"dened","modificationTimeSeconds":1273071583,"id":354,"title":"Мысли о пользе спортивного программирования","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eКраткая предыстория. В одном из \u003ca href\u003d\"/blog/entry/282\"\u003eблогов\u003c/a\u003e завязалось серьезное обсуждение о мотивации в спортивном программировании. \u003ca class\u003d\"rated-user\" href\u003d\"../../../profile/SkidanovAlex\" title\u003d\"Майор \nSkidanovAlex\"\u003eSkidanovAlex\u003c/a\u003e высказал свое мнение (не знаю, насколько искреннее и серьезное), что: \u0026quot;От олимпиадного программирования нет пользы кроме медали :о)\u0026quot;. Я ему кратко ответил, что я не получал медалей, но получил от СП огромную пользу в саморазвитии, и что считаю это намного важнее любых медалей. Он в свою очередь закономерно спросил, какую конкретно пользу я получил. Хотел ответить там же, но ответ получился немного великоватым, и в комментарий бы, скорее всего, не влез, так что решил выделить его в отдельный блог-пост. А вот сам ответ:\u003cbr /\u003e\u003cbr /\u003eЕсли в общем, то спортивное программирование помогло мне в заметной степени дисциплинировать свой ум, что я считаю очень полезным достижением.\u003cbr /\u003e\u003cbr /\u003eА если подробнее, то вот какие явные плюсы занятия СП мне пришли в голову (наверняка многое упустил из виду, может кто-то что-то добавит):\u003cbr /\u003e\u003cul\u003e\u003cli\u003eразвивает умение понимать суть проблемы;\u003c/li\u003e\u003cli\u003eразвивает умение сводить сложную проблему к нескольким более простым проблемам;\u003c/li\u003e\u003cli\u003eвырабатывает способность и привычку находить более простое/эффективное/красивое решение проблемы;\u003c/li\u003e\u003cli\u003eвырабатывает привычку доказывать эффективность решения перед его реализацией, ибо методика \u0026quot;авось сработает\u0026quot; обычно приводит к плачевным результатам;\u003c/li\u003e\u003cli\u003eразвивает способность решать проблему быстро, но не спеша;\u003c/li\u003e\u003cli\u003eразвивает способность удерживать в уме сложные схемы объектов и связей;\u003c/li\u003e\u003cli\u003eразвивает способность длительной концентрации внимания на проблеме, требующей решения;\u003c/li\u003e\u003cli\u003eразвивает способность быстрого переключения внимания с одной проблемы на другую;\u003c/li\u003e\u003cli\u003eразвивает память, ведь требуется помнить не мало алгоритмов, теорем, приемов;\u003c/li\u003e\u003cli\u003eпомогает через системы рейтингов более-менее объективно оценивать свой уровень подготовки и эффективность тренировок;\u003c/li\u003e\u003cli\u003eпомогает отказаться от привычки доверяться обманчивым ощущениям (некоторые ошибочно называют это \u0026quot;интуицией\u0026quot;), а доверять исключительно разуму и здравому смыслу (я убежден, что только через него и может проявляться настоящая интуиция).\u003c/li\u003e\u003c/ul\u003eБольшинство этих навыкав неоценимо полезны не только в программировании. Если подытожить, то можно сказать, что СП помогает в решении многих жизненных проблем, обогащает внутренний мир и способствует более реалистичному восприятию мира. Во как загнул! :) но думаю, что нисколько не преувеличил. Конечно, наверно, есть и другие способы достичь похожих результатов, но для меня СП оказалось одним из самых эффективных.\u003c/div\u003e","tags":["мотивация","польза","саморазвитие"]}}