{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1268527592,"rating":13,"authorHandle":"goo.gl_SsAhv","modificationTimeSeconds":1268534291,"id":173,"title":"XI открытое личное первенство УрГУ","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch3\u003eОткрытое личное первенство Уральского Государственного Университета, г. Екатеринбург.\u003c/h3\u003e\u003cp\u003eНачну рассказ задачей, в духе некоторых авторов:\u003cbr /\u003e\u003c/p\u003e\u003ch2\u003eProblem I\u003c/h2\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/dd/a8/dda889bf1afa8483e04635814c89471efb8404f0.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/b9/9c/b99c0412537bcb9f83a26a42d3fafc1b170af288.jpeg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003ch2\u003eInput\u003c/h2\u003e2\u003cbr /\u003eE\u003cbr /\u003eC\u003ch2\u003eOutput\u003c/h2\u003eCase #1: О\u003cbr /\u003eCase #2: З\u003cp\u003eНу чтож, \u003ca href\u003d\"http://contest.ur.ru/usu/febr_10/monitor/monitor.html\"\u003eконтест\u003c/a\u003e \u003cstrike\u003eслит\u003c/strike\u003e завершён, его можно и нужно проанализировать, в первую очередь свои ошибки, ну и упущения организаторов...\u003c/p\u003e\u003cp\u003eДля начала о задачах\u003c/p\u003e\u003cp\u003eA. \u0026quot;Книжная полка\u0026quot; - Геометрия, тернарный поиск.\u003cbr /\u003eB. \u0026quot;Взрыв в пирамиде\u0026quot; - Геометрия, расстояние от точки о плоскости.\u003cbr /\u003eC. \u0026quot;Торт\u0026quot; - Решение системы линейных уравнений, по сути геометрия, провести прямую пересекающую прямоугольник и максимизировать функцию F(x, y) в вершинах одной из половинок. Можно было сдать тернарным поиском, что избавляет от рассмотрения кучи граничных случаев, у меня их было 6, и потому сдал с +7.\u003cbr /\u003eD. \u0026quot;Полтора землекопа\u0026quot; - Не сложный ребус на / и %, к моему удивлению множество людей искали остаток от деления одного числа на другое с помощью перебора в цикле.\u003cbr /\u003eE. \u0026quot;Золотые слитки\u0026quot; - Ничего так задача, интересная, можно свести к простой геометрической задаче на бинпоиск. (не сдал)\u003cbr /\u003eF. \u0026quot;К вопросу о лысине 2\u0026quot; - Перебор с извратом\u003cbr /\u003eG. \u0026quot;Долгожители\u0026quot; - Посчитать число дней между двумя датами, кто писал на яве и шарпе сразу акцептили, а я набажил в 6 строчках 3 раза. (+4)\u003cbr /\u003eH. \u0026quot;Адская работа\u0026quot; 1000 решений сводящихся к циклу со всякими движениями\u003cbr /\u003eI. \u0026quot;Двоичный палиндром\u0026quot; - А ну-ка догадайся, что есть закономерность (не сдал)\u003cbr /\u003eJ. \u0026quot;Поиски тайника Геометрия\u0026quot; - Даже не знаю как описать, можно комбинаторно подходить, можно хитро проэмулировать с использованием несложной геометрии, но решение не очень то простое как мне показалось (не сдал)\u003c/p\u003e\u003cp\u003eИтогом 5 задач на геометрию, одна на тернарный поиск (или 2, если C включить сюда),  бинарный поиск, перебор с извратом, закономерность, и ещё что-то. В общем-то есть некая не сбалансированность. Одну задачу в общем-то можно назвать задачей на графы - F про перебор. Но из графов там только граф на 50 вершин a[i][j] \u003d i % j \u003d\u003d 0 || j % i \u003d\u003d 0\u003c/p\u003e\u003cp\u003eЗадачи в общем-то не сложные, можно решить их все часа за 3 даже мне. Но я увяз в багах, в тупеже, и не поверил что задача у которой в инпуте число порядка 2^1000000 является задачей на формулу.\u003cbr /\u003eКонтест вышел очень динамичным на мой взгляд, рассмешил Павел, не сделавший ни одного сабмита до заморозки, и сдавший в итоге 5. Алексей выбрал неверную тактику - он не сабмитил халяву до заморозки, в итоге  сдав все задачи проиграл 250 минут штрафу.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["екатеринбург","контесты"]}}