{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1272629759,"rating":21,"authorHandle":"dened","modificationTimeSeconds":1272629759,"id":345,"title":"Необычные задачи, с которыми я столкнулся во время Codeforces Beta Round 12","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eДля меня этот контест оказался намного интереснее всех предыдущих из-за того, что помимо обычных задач контеста пришлось решать ещё кучу необычных :), например:\u003cbr /\u003e- выяснить почему у меня прямо перед турниром пропал доступ в Интернет (правильный ответ: моя телефонная компания решила заменить АТС, соответственно ADSL на это время не функционировал)\u003cbr /\u003e- настроить GPRS-подключение к Интернету на КПК (чужом, находился у меня на временном хранении) через свою SIM-карту (настроить Интернет через свой телефон варианта не было, т.к. не было дров). Подзадачи:\u003cbr /\u003e- вспомнить адрес точки доступа сети МТС, имя пользователя и пароль (правильный ответ internet.mts.ru, mts, mts, соответственно)\u003cbr /\u003e- найти причину, по которой ActiveSync не мог подключиться к КПК по USB (самая трудная, правильный ответ: система не могла определить сетевой адрес устройства, причина отключенные мною недавно обычно неиспользуемые системные службы, в частности \u0026quot;DHCP-клиент\u0026quot;)\u003cbr /\u003e- настроить общий доступ в Интернет на КПК.\u003cbr /\u003e\u003cbr /\u003eЧерез пол часа после начала турнира, все эти задачи были решены, и заветная страница http://codeforces.ru/ открылась браузером, и наконец настало время обычных задач. A, B, C были решены довольно быстро, правда отправить было суждено только A и B, а ко времени посылки C Интернет снова пропал. Это значит, что появились новые задачи:\u003cbr /\u003e- выяснить куда в этот раз пропал Интернет (правильный ответ: кончились деньги на счете телефона; нахождение правильного ответа усложнялась тем, что инет рывками подавал признаки жизни).\u003cbr /\u003e- включить услугу \u0026quot;кредит\u0026quot; на своем сотовом (с этой задачей я так и не справился, т.к. не смог быстро найти номер телефона, по которому можно было бы подключить услугу).\u003cbr /\u003e- дождаться прихода жены домой, заменить симку в КПК на сим-карту жены.\u003cbr /\u003e\u003cbr /\u003eСпустя 20 минут и с этими задачами удалось справиться. Задачу C удалось таки отправить, а вот на D и E времени уже не осталось. В итоге минус к рейтингу и я по-настоящему позеленел. :)\u003cbr /\u003e\u003cbr /\u003eСпрашивается, на что я надеялся, присоединяясь к турниру через 30 минут после его начала? Я пошел ва-банк. Зная свои силы, рассчитывал, что удастся решить больше задач, чем большинству участников даже с потерей в 30 минут. И действительно, если бы не возникли проблемы с нетом во второй раз, и я бы не потерял ещё 20 минут, то вполне вероятно, что успел бы решить D или E, и остался бы с плюсом к рейтингу. Но удача распорядилась иначе, и я проиграл. Тем не менее, я ничуть не расстроен и ни о чем не жалею.\u003cbr /\u003eВсе, выговорился, всем спасибо за внимание! :)\u003cbr /\u003e\u003cbr /\u003eИ напоследок пожелание по существу: \u003cb\u003egood luck and have fun!\u003c/b\u003e :)\u003c/div\u003e","tags":["удача"]}}