{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1265211960,"rating":0,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1265252945,"id":47,"title":"The second day in the Celestial Empire","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv style\u003d\"float: left;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e   \u003cimg alt\u003d\"Перед рейсом\" src\u003d\"//assets.codeforces.com/day4/01-su1.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/div\u003e \u003cp\u003e The second day we spent sightseeing -  we went to the excursions   organized by the host country, some places we visited on our own. \u003c/p\u003e \u003cp\u003e In the morning we had some free time, and we went to the local Arbat   (or Kirov Avenue, as you wish). Actually, when we walked not far away   from the hotel, we found out that we vaguely knew how to get back. But   still we didn\u0027t want to go back, that\u0027s why we went on moving away,   guided by little information we had. It was really cold - but we were   well-prepared. I put on a down-filled coat, that we\u0027d got on the first   day, over my proper one, foe example. Vova put on the  presented   trousers over his own jeans, and seemed happy. The parts that got cold   were our faces. \u003c/p\u003e \u003cp\u003e On our way to that avenue we asked for the directions many times.   The problem was that we didn\u0027t remember  its name. 80% of passers-by   said they didn\u0027t speak English, 20% said they did, but it was the only   thing  they could say in English. Finally, using the international   language of gestures, we got the direction and found the avenue.   Personally I was disappointed, there was nothing to look at there. Of   course, it was interesting to  walk past old buildings, but we had no   desire to \u0026quot;Russian goods\u0026quot; shops. They sold home-made vodka,   chocolate called \u0026quot;Russian fir (pets)\u0026quot; (they meant   \u0026quot;pelts\u0026quot;),  and other goods of doubtful quality. \u003c/p\u003e \u003cp\u003e \u003c/p\u003e \u003cdiv style\u003d\"float: right;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e   \u003cimg src\u003d\"//assets.codeforces.com/day4/02-vova.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/div\u003e \u003cp\u003eAfter that we had dinner at the hotel. We should give the cooks their   due - the meals are always good. The dinner didn\u0027t disappointed us,   moreover we\u0027d worked up appetite.\u003c/p\u003e \u003cp\u003e After that we had dinner at the hotel. We should give the cooks   their due - the meals are always good. The dinner didn\u0027t  disappointed   us, moreover we\u0027d worked up appetite. Then we had an excursion to Sun   Island Park. Quite a big park is \u0026quot;densely populated\u0026quot; by snow   statues. There were  scenes from life of a common Chinese man,   impressive models of famous architectural buildings (St. Basil\u0027s   Cathedral is  said to have been noticed there). Entertainments were   not numerous: the guys slid down the ice hill. Antonina Fedorova and I   tried to keep up: went down the ice hill on something resembling   tyres. All this lasted quite long, and we got  back to the hotel   pretty tired.  \u003c/p\u003e \u003cp\u003e I\u0027d like to add that before going to bed Dima, Vova and I went to   the hotel sauna. It was ok, but Jacuzzi wasn\u0027t that good. There were   two of them: the temperature in the first one was +14, the second one   was too hot to bare. So, at last, we swam in the swimming poll. They   wanted to sell us swim caps, but we aren\u0027t that sort of people, and   finally we got them for thank you, or \u0026quot;Xie-xie\u0026quot;.\u003c/p\u003e\u003c/div\u003e","tags":["2010","acm","harbin","icpc","saratov"]}}