{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1268076041,"rating":23,"authorHandle":"Alex_KPR","modificationTimeSeconds":1268076041,"id":150,"title":"О виртуальных наградах","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp align\u003d\"justify\"\u003e\u003cimg src\u003d\"http://s003.radikal.ru/i204/1003/3c/3085231cc941.jpg\" style\u003d\"float: left;margin: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003eХочу предложить \u0026quot;свой взгляд\u0026quot; на возможную организацию виртуальных наград на страницах codeforces.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eИдея введения таких наград не нова, но их применения я, почему-то, на сайтах спортивного программирования ранее не встречал. \u003c/p\u003e\u003cp align\u003d\"justify\"\u003eИтак...\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eНа странице каждого пользователя появляется полоска для трофеев, примерно так, как показано на рисунке слева. При получении новой награды соответствующая картинка добавляется в конец списка. Если навести на неё, выплывет маленькое окошко с информацией, за что дали награду. Если нажать на неё - то попадём на страницу наград.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e \u003c/p\u003e\u003cp align\u003d\"justify\"\u003eСтраница наград.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eОна будет выглядеть в виде таблицы из двух колонок: большое изображение награды (хотя бы 64х64) и полное её описание. При нажатии на награду попадаем на страницу рейтинга, но отсортированную по данной награде. Звучит поистине бредово. :) Поэтому приведу маленький пример. Абсолютно все совпадения прошу считать чистой случайностью. \u003d)\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eПример. Награда \u0026quot;Снайпер\u0026quot;. Описание: участник, который решил на чистый \u0026quot;+\u0026quot; на контестах не менее 10 задач подряд, достоен зваться снайпером, ибо \u0026quot;стреляет\u0026quot; по задачам без промаха. Жмём на картинку с гранатомётом (шутка) и попадаем на страницу рейтинга. Там будут только те, у кого есть такая награда.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e1. Petr, рейтинг такой-то, успехи такие-то, 13 задач подряд сдано чисто\u003cbr /\u003e2. Rizvanov, ..., 12 задач подряд сдано чисто\u003cbr /\u003e3. Petr, ..., 12 задач подряд сдано чисто\u003cbr /\u003e4. Petr, ..., 10 задач подряд сдано чисто\u003cbr /\u003e5. ivan.popelyshev, ..., 10 задач подряд сдано чисто\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eТеперь о самих наградах.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eИх удобно разделить на две большие группы: программистские и социальные. Исходя из названий понятно, какие награды могут в принципе существовать. :)\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eРазумная мысль - ввести такие награды, чтобы их могли получать не только \u0026quot;топовые\u0026quot; участники. Это, например, трофей \u0026quot;Хамелеон\u0026quot; - не менее N раз поменял свой цвет. Конечно, могут встретиться такие кадры, которые будут специально делать всё возможное, чтобы получить эту и другие \u0026quot;легкодоступные\u0026quot; награды, но, надеюсь, их будет немного и они не ухудшат очень сильно общее отношение к такого типа наградам.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eНаграды делятся также на единичные и повторяемые. Единичные награды - это награды, получить которые можно всего один раз (например, \u0026quot;Хамелеон\u0026quot;), но их суть можно улучшать постоянно: чем больше меняешь цвет, тем выше в рейтинге \u0026quot;хамелеонов\u0026quot; и тем ценнее трофей. Награды типа \u0026quot;Снайпер\u0026quot; можно получать много раз, но улучшаться может только последняя (в примере выше так и получилось: некто Petr сделал 10 чистых сдач, сбился, потом 12 чистых, сбился, потом 13 чистых и, возможно, не собирается на этом останавливаться). Возможно существование уникальных наград, которые можно получить всего один раз за определённое достижение, например, \u0026quot;участник онсайт финала codeforces 2012: за два часа до конца света\u0026quot;. \u003d)\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eСписок наград v. 0.01.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eПрограммистские:\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e\u0026quot;Снайпер\u0026quot;. Не менее N чистых сдач подряд\u003cbr /\u003e\u0026quot;Первопроходец\u0026quot;. Не менее N раз решил задачу, не решённую никем до этого (даётся 1 раз)\u003cbr /\u003e\u0026quot;Писатель\u0026quot;. Не менее N раз давал свой контест на codeforces (даётся 1 раз)\u003cbr /\u003e\u0026quot;Чемпион\u0026quot;. Выиграл не менее N контестов (даётся 1 раз)\u003cbr /\u003e\u0026quot;Везунчик\u0026quot;. Не менее N удачных контестов подряд, т.е. контестов, давших плюс к рейтингу\u003cbr /\u003e\u0026quot;?\u0026quot;. В течение N контестов находился в топ-10 (даётся 1 раз)\u003cbr /\u003e\u0026quot;Хамелеон\u0026quot;. Не менее N раз изменил цвет (даётся 1 раз)\u003cbr /\u003e\u0026quot;?\u0026quot;. Не менее N непропущенных соревнований CF подряд\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eСоциальные:\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e\u0026quot;?\u0026quot;. Написал в блог сообщение, собравшее +N голосов (на самом деле бредовая награда, потому что потом могут и минус поставить сообщению,  но в v. 0.01 пусть остаётся)\u003cbr /\u003e\u0026quot;Скандалист\u0026quot;. Написал в блог сообщение, которое комментировалось N раз\u003cbr /\u003e\u0026quot;Звезда\u0026quot;. Не менее N раз попал на главную страницу CF (даётся 1 раз)\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eВ данной статье слово \u0026quot;награда\u0026quot; использовалось не менее 20 раз. :)\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","hexadecimal","достижения","награды"]}}