{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1264885293,"rating":12,"authorHandle":"Medic","modificationTimeSeconds":1264885293,"id":18,"title":"Что такое ACM и что такое плохо","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ первом посте напишу, о своем небольшом опыте соревнований по олимпиадному программированию.\u003c/p\u003e\u003cp\u003e\u003cspan style\u003d\"border-collapse: collapse;color: rgb(170,170,170);font-family: verdana , arial , sans-serif;font-size: 13.0px;\"\u003e \u003c/span\u003e\u003cbr /\u003e\u003c/p\u003e  \u003cp\u003eПервый город, куда мы, собравшись с мужеством, поехали был Таганрог. Впечатление о самом городе приятное, это небольшой уютный тихий город, где живет товарищ Беляков из Нашей Раши и разговаривает с телевизором. В которм еще остались такие маленькие улочки между домами, где ходит только трамвай и можно дотянутся из окна трамвая до цветочного горшка на подоконнике. В котором \u003cspan style\u003d\"\"\u003e \u003c/span\u003eочень приветливые люди, а в столовой университета можно наестся на 50 рублей.\u003c/p\u003e  \u003cp\u003eВторой город, где мы побывали, был Саратов. Не буду рассказывать, как мне нравится этот город, так как я провела в нем все детство.\u003c/p\u003e  \u003cp\u003eОфициальная часть турнира в Таганроге была очень напыщенной. Она проходила в круто оборудованном конференц зале. Хотя он у них уже год, производственная пленка на переключателях наушников до сих пор оставалась. В конце турнира мы все таки ее содрали на своих местах, чтоб вернутся и победить) \u003c/p\u003e  \u003cp\u003eОфициальная часть турнира в Саратова\u003cspan style\u003d\"\"\u003e  \u003c/span\u003eпроходила в актовом зале, выглядела как то по родному немного, хотя и были уважаемые тети, дяди, которые выступали с напутствующим словом, сохранялась приятная обстановка. А еще в Саратове дали футболки!!!!\u003c/p\u003e  \u003cp\u003eПробный тур в Таганроге прошел просто ужасно. Не работали дженериксы(\u0026lt;\u0026gt;). На мой вопрос к организатору, как быть с такой проблемой, мне ответили что эту задачу можно решить и без выпендрежных коллекций.\u003cspan style\u003d\"\"\u003e  \u003c/span\u003eПопросили позвать организатора на инстанцию выше. \u003cspan style\u003d\"\"\u003e \u003c/span\u003eПока его звали, провели эксперимент: послали решение с неопознанными дженериксами на сервер и решение как и полагается, прошло. \u003cspan style\u003d\"\"\u003e \u003c/span\u003eВ конце концов, узнали, что у нас на локальной машине очень старая версия NetBeans. В завершении пробного тура проблема была решена дополнительной установкой \u003cspan style\u003d\"\"\u003eeclipse\u003c/span\u003e.\u003c/p\u003e  \u003cp\u003eПробный тур в Саратове. Прошел хорошо. Теперь мы были с тренером и чувствовали себя немного уверенней. На пробном поймали только Ru\u003cspan style\u003d\"\"\u003en\u003c/span\u003eTimError вместо Tim\u003cspan style\u003d\"\"\u003ee\u003c/span\u003eLimit, но это пустяки. Однажды, на он-лайн контесте на сайте \u003cspan style\u003d\"\"\u003eacm\u003c/span\u003e.\u003cspan style\u003d\"\"\u003esgu\u003c/span\u003e.\u003cspan style\u003d\"\"\u003eru\u003c/span\u003e, поймали \u003cspan style\u003d\"\"\u003eGlobalError\u003c/span\u003e, чтобы это значило?\u003c/p\u003e  \u003cp\u003eВ основе Code Game Challenge в Таганроге были Танчики, которые крушили Бактерии и Вирусы, и опасались повредить Эритроциты. И как всегда проблемы с \u003cspan style\u003d\"\"\u003eJava\u003c/span\u003e, но теперь на сервере игры. По огромным уверениям организаторов, что они все починят через минуточку, мы продолжали писать на \u003cspan style\u003d\"\"\u003eJava\u003c/span\u003e, код, который не могли подгрузить и запустить\u003cspan style\u003d\"\"\u003e  \u003c/span\u003eпод игрой. После 2-х часов заверений и часа объяснений что к чему, мы по совету тех же организаторов перешли на \u003cspan style\u003d\"\"\u003eJ\u003c/span\u003e# и нам и другим несчастным, избравшим \u003cspan style\u003d\"\"\u003eJava\u003c/span\u003e (по воле судьбы мы оказались в одной комнате) был добавлен 1 час. В финальном соревновании наш Танчик таки валил систему на 5-й секунде. И если при смерти на танчике высвечивалась иконка черепа с костями, то на нашем была бомбочка, хоть выделились)\u003c/p\u003e  \u003cp\u003eВ основе Code Game Challenge в Саратове были машинки, которые стреляли шинами (мы почему то перевели их как Простокваши) и как полагается машинкам, ездили по трассе. Запомнился без глюков и багов. За что огромное спасибо организаторам.вопрос в зале: «А это танчики умеют…» на что, г-н Мирзаянов ответил: «У нас Танков нет». Цитата очень \u003cspan style\u003d\"\"\u003e \u003c/span\u003eприжилась и добротная часть машинок называлась \u003cspan style\u003d\"\"\u003eHETAHK\u003c/span\u003e. Яркая и хорошо прорисованная картинка поля сразу бросилась в глаза, все познается в сравнении… Все прошло \u003c/p\u003e  \u003cp\u003eОсновные туры в обоих университетах прошли хорошо, за что еще раз спасибо организаторам.\u003c/p\u003e  \u003cp\u003eНу и конечно\u003cspan style\u003d\"\"\u003e  \u003c/span\u003e\u003cspan style\u003d\"\"\u003eHappy\u003c/span\u003e\u003cspan\u003e \u003c/span\u003e\u003cspan style\u003d\"\"\u003eEND\u003c/span\u003e!\u003c/p\u003e\u003c/div\u003e","tags":["cаратов","acm","contest","таганрог"]}}