{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1267736855,"rating":0,"authorHandle":"freopen","modificationTimeSeconds":1267804433,"id":132,"title":"Впечатления от сайта","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eЯ подумал, и решил, что неплохо было бы создать список вещей, которые можно добавить в этот сайт. Сразу оговорюсь. Во первых, все это мое \u003ci\u003eличное\u003c/i\u003e мнение. Во вторых, данный пост \u003ci\u003eне\u003c/i\u003e является претензией к сайту. Все таки проект совсем новый и работы очень много. Этот пост - попытка структурировать пожелания и предложения по сайту. Итак:\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ch3\u003e\u003cspan style\u003d\"font-weight: normal;font-size: 13.0px;border-collapse: collapse;color: rgb(170,170,170);font-family: verdana , arial , sans-serif;\"\u003e \u003c/span\u003e\u003c/h3\u003e\u003ch3\u003e\u003cspan style\u003d\"font-weight: normal;font-size: 13.0px;border-collapse: collapse;color: rgb(170,170,170);font-family: verdana , arial , sans-serif;\"\u003e\u003c/span\u003eПо сайту\u003c/h3\u003e\u003cdiv\u003e\u003cdiv\u003e\u003col\u003e\u003cli style\u003d\"text-align: left;\"\u003e\u003cb\u003eRSS лента.\u003c/b\u003e Неплохо было бы, чтобы она выглядела примерно, как на хабре.\u003ca href\u003d\"http://www.imagepost.ru/?v\u003d68/RSS.png\"\u003e\u003cimg align\u003d\"right\" hspace\u003d\"5\" src\u003d\"http://www.imagepost.ru/thumbs/68/RSS.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" vspace\u003d\"5\" /\u003e\u003c/a\u003e\u003cbr /\u003e\u003c/li\u003e\u003cli style\u003d\"text-align: left;\"\u003e\u003cb\u003eОблако тегов.\u003c/b\u003e Если есть теги, надо место, где они все собраны.\u003c/li\u003e\u003cli style\u003d\"text-align: left;\"\u003e\u003cb\u003eВход.\u003c/b\u003e Не знаю, как у других, но мне приходится заново входить в систему довольно часто. Насколько я понял, сессия умирает при выходе из браузера. Можно ли сделать хотя бы галочку вида \u0026quot;Запомнить меня\u0026quot;.\u003c/li\u003e\u003cli style\u003d\"text-align: left;\"\u003e\u003cb\u003eОтослать vs отменить.\u003c/b\u003e Мелочь. Когда у двух соседних кнопок первые буквы совпадают, начинаешь путаться. Можно их как нибудь переименовать?\u003c/li\u003e\u003cli style\u003d\"text-align: left;\"\u003e\u003cb\u003eСкачать файл.\u003c/b\u003e Сегодня половина ссылок открывается методом \u0026quot;Скачать файл\u0026quot; (Chromium).\u003cbr /\u003e\u003c/li\u003e\u003cli style\u003d\"text-align: left;\"\u003e\u003cb\u003eОтправка комментариев.\u003c/b\u003e Когда я отправляю комментарии, половина уходит пустыми. Думаю, это как-то связано с предыдущим пунктом\u003c/li\u003e\u003c/ol\u003e\u003ch3\u003eПо редактору\u003c/h3\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003col\u003e\u003cli\u003e\u003cb\u003e\u003c/b\u003e\u003cs\u003e\u003cb\u003eОбтекание картинки.\u003c/b\u003e\u003c/s\u003e\u003cs\u003e Я так и не смог сделать. Выглядит как-то странно.\u003c/s\u003e\u003c/li\u003e\u003cli\u003e\u003cb\u003e\u003c/b\u003e\u003cs\u003e\u003cb\u003eСсылка на картинку. \u003c/b\u003e\u003c/s\u003e\u003cs\u003eТо же самое. Он требует выделить \u003c/s\u003e\u003ci\u003e\u003c/i\u003e\u003cs\u003e\u003ci\u003eтекст\u003c/i\u003e\u003c/s\u003e\u003cs\u003e. Картинку он за текст не признал.\u003c/s\u003e\u003c/li\u003e\u003cli\u003e\u003cb\u003eПотеря фокуса \u003c/b\u003eпри нажатии любой кнопки редактора. Может это во всех редакторах так, но со временем это начинает немножко надоедать.\u003c/li\u003e\u003cli\u003e\u003cb\u003eСтранная реакция кнопок.\u003c/b\u003e Опять же, может и во всех онлайн WYSIWYG редакторах это так. Если нажать на кнопку, когда ничего не выделено, то ничего и не произойдет. Значит, работает только с тем, что выделено. Но если начать печатать дальше, он сохранит форматирование последнего символа. Это удобно только по отдельности. Так приходится сначала написать чуть чуть вперед, потом вернуться и задать форматирование.\u003c/li\u003e\u003cli\u003e\u003cb\u003eПодсветка кнопок.\u003c/b\u003e Ее нет. Если добавить, будет чуть чуть удобнее. Впрочем, я уже придираюсь.\u003c/li\u003e\u003cli\u003e\u003cb\u003eCut.\u003c/b\u003e Особый секрет создания ката я так и не понял. Вроде все сделал, как написано, а кат не появился.\u003c/li\u003e\u003c/ol\u003e\u003chr /\u003e\u003cdiv\u003eПока что, это все, что я смог вспомнить. Вообще, это мой первый пост на подобном ресурсе, поэтому, если я что-то не понимаю в \u003ci\u003eСистеме\u003c/i\u003e, сообщите мне об этом.\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eUPD 1:\u003c/b\u003e 1 и 2 по редактору удалось сделать с помощью редактирования исходного кода. Странно, что у меня с первого раза не получилось. Но все равно странно прибегать к html разметке ради такой ерунды.\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eUPD 2:\u003c/b\u003e Сегодня половина ссылок открывается методом \u0026quot;Скачать файл\u0026quot; (Chromium)\u003c/div\u003e\u003cdiv\u003e\u003cb\u003eUPD 3:\u003c/b\u003e Особый секрет установки ката освоен. Оказывается, его надо было скопировать и вставить. Но это все-равно как-то странно.\u003c/div\u003e\u003c/div\u003e","tags":["codeforces","предложения","система тестирования"]}}