{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1288187439,"rating":-38,"authorHandle":"goo.gl_SsAhv","modificationTimeSeconds":1288187478,"id":797,"title":"NEERC и нетерпимость курильщиков. блэк энд вайт.","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВ прошлом году организаторы NEERC, отвечая на вопрос из зала о местах для курения заявили во время открытия соревнования, что курение запрещено. Совсем. Если вы будете курить на территории  Аничкого дворца, вы будете дисквалифицированы. Если вы покидаете территорию дворца, вы снова будете дисквалифицированы. Если взлетите и будете курить над территорией дворца вас догонят, поймают и дисквалифицируют в третий раз.\u003c/p\u003e\u003cp\u003eЯ категорически не согласен с такой позицией организаторов, и не только потому, что я курильщик. Я бы например был против ущемления прав женщин на данном соревновании или любых других групп лиц объединенных по какому-то принципу, пусть и неприемлимому для других. Я например негативно отношусь к сесуальным меньшинствам, но не считаю что по этой причине их нельзя допускать к соревнованиям или ущемлять другие их права.\u003c/p\u003e\u003cp\u003eВ стрессовой обстановке соревнования, помимо того что курильщик волнуется вместе со всеми, он ещё переживает что ему не дают покурить, а выкуренная сигарета на многих действует успокаивающе в данной ситуации. Это ставит участника в неравное положение. Если соперники никогда не курили, а во время контеста скажем ели шоколад - им никто не запрещает есть шоколад и сейчас. У человека стаж курения 10+ лет, а тут ему вдруг говорят что нельзя и нам неважно что ты при этом чувствуешь.\u003c/p\u003e\u003cp\u003eНе вижу никаких видимых причин для введения этого запрета. Кто-то мне сказал, что запрет введён из-за школы на территории дворца. Но школьники толпами курили во время переменок и уроков во дворе. Причем максимум что сделают школьнику это погрозят пальцем, а тебя дисквалифицируют с такого важного соревнования.\u003c/p\u003e\u003cp\u003eВ связи с предстоящим полуфиналом, хочу спросить у людей которые непосредственно будут участвовать в соревновании их мнение на этот счёт.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["acm","neerc","организация соревнований"]}}