{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1269803753,"rating":15,"authorHandle":"Nerevar","modificationTimeSeconds":1269803753,"id":226,"title":"Открытый кубок. Гран-При Приазовья.","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eСегодня состоялся очередной этап Открытого Кубка России по программированию. Проводился он на задачах олимпиады ЮФУ в Таганроге. Я уверен, что кто-нибудь напишет на codeforces подробный \u0026quot;отчет\u0026quot; о мероприятии в ЮФУ. Я же здесь изложу свои впечатления и предлагаю обсудить этап кубка.\u003cbr /\u003e\u003cbr /\u003e \u003cbr /\u003e\u003cbr /\u003eМы в очередной раз собрались нашим ветеранским составом порешать контест. Надо сказать, что у нас имеются возможности для варьирования состава, поскольку в команде Saratov SU #1 у нас четыре человека. Почему это так, смотрите \u003ca href\u003d\"http://codeforces.ru/blog/entry/33\"\u003eздесь\u003c/a\u003e:). На этот этап поначалу вообще планировался состав, в котором команда ни разу не писала: Вова, Стас и Наташа, потому что у моего отца сегодня 50-летний юбилей. Однако Стас совсем не смог, и дебют не состоялся:)) Очень жалко, было бы забавно. У нас же в команде практикуется разделение ролей, и я в нем кодер. Закончилось тем, что я пришел только на первые три часа контеста, а потом отправился отмечать. Удивительно, но и этого хватило, чтобы расположиться в 14 штрафных минутах от первого места (кстати, это тоже саратовская команда!) в итоговой таблице. И вообще, судя по нашим результатам на последних этапах кубка, отсутствие тренировок идет нам ... на пользу! Мы никогда так хорошо не решали этапы кубка, когда у нас были регулярные тренировки. И вообще, скажу так: контест решается хорошо, когда он тебе в радость и ты соскучился по задачам, по духу соревнования! Может, некоторым тренерам и участникам стоит взять такое наблюдение на заметку?:))\u003cbr /\u003e\u003cbr /\u003eЗадачи в целом порадовали. Было огромное количество халявы, за час командами было сдано 6-7 разных задач. Кто-то это не любит, но по-моему, ничто не настраивает на оставшийся контест лучше, как несколько быстрых  AC в начале. Задачи не показались идейно сложными, однако на реализацию идей надо было потратить достаточное время. Поэтому для меня, как для человека за клавиатурой, контест прошел весело.\u003c/div\u003e","tags":["opencup","открытый кубок","таганрог"]}}