{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1273403519,"rating":2,"authorHandle":"daftcoder","modificationTimeSeconds":1319570739,"id":371,"title":"Что есть TopCoder Algorithm","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПривет, я dAFTc0d3r. Я хочу немного рассказать про то, как участвовать в  соревнованиях TopCoder Algorithm.\u003cbr /\u003e\u003cimg src\u003d\"/predownloaded/d0/70/d070daf11330641860b960b9d040d039c0bd996b.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e \u003cbr /\u003eЧто же такое TopCoder в принципе?\u003cbr /\u003e\u003ci\u003eTopCoder is a company which administers contests in computer programming\u003c/i\u003e (\u003ca href\u003d\"http://en.wikipedia.org/wiki/TopCoder\"\u003eWiki\u003c/a\u003e).\u003cbr /\u003eДа, TopCoder проводит соревнования, причём совершенно различных видов: Algorithms, Design, Development, Marathon Matches, Studio, Architecture, Assembly, Testing, Bug Races.\u003cbr /\u003e\u003cbr /\u003eПервое, с чем мы сталкиваемся, когда заходим на сайт топкодера (\u003ca href\u003d\"http://www.topcoder.com/\"\u003etopcoder.com\u003c/a\u003e)  - что делать? Куда дальше идти? Когда я регистрировался (что было в 2007 году) такой проблемы вроде не было. Если честно, я до сих пор не знаю, как сейчас самому дойти до правильного ответа - \u003ca href\u003d\"http://www.topcoder.com/tc\"\u003etopcoder.com/tc\u003c/a\u003e.\u003cbr /\u003e\u003cbr /\u003eВторая проблема – регистрация. Хотя, в принципе, она вполне решаемая с помощью хорошего переводчика.\u003cbr /\u003e\u003cbr /\u003eТретья проблема – запуск арены, через которую производится участие в соревнованиях Algorithm.\u003cbr /\u003eНасколько я помню, решение – установка \u003ca href\u003d\"http://www.google.ru/search?q\u003dJava+Web+Start\"\u003eJava Web Start\u003c/a\u003e.\u003cbr /\u003eСама же ссылка на арену скрывается под текстом O(n) в левом верхнем углу сайта.\u003cbr /\u003e\u003cbr /\u003eКогда мы решили первые три проблемы, запустили арену, вошли под своим пользователем, мы можем потренироваться. Это будет очень полезным.\u003cbr /\u003eПусть наш язык – C++. Откроем одну из тренировочных комнат: Practice Rooms --\u0026gt; SRMs --\u0026gt; 609-624 --\u0026gt; 614 - SRM 448 DIV 2.\u003cbr /\u003e\u003ca href\u003d\"http://img22.imageshack.us/img22/5421/59265711.jpg\"\u003e\u003cimg border\u003d\"0\" src\u003d\"/predownloaded/01/55/01554273e50d244d16f13582b3bd323de8d6ff98.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003cbr /\u003e\u003cbr /\u003eДалее мы попадаем в окно комнаты соревнований.\u003cbr /\u003eВыбираем задачу, пусть это будет 250я задача\u003cbr /\u003e\u003ca href\u003d\"http://img52.imageshack.us/img52/4369/76237523.jpg\"\u003e\u003cimg border\u003d\"0\" src\u003d\"/predownloaded/6e/10/6e10654ccfc577560887d4cacaf820e0c069a603.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003cbr /\u003e\u003cbr /\u003eОткрывается окно Coding Phase (аа! сколько окон!). Сверху справа выбираем плагин и язык. В поле Problem Statement находится условие задачи. Понимаем условие задачи, читаем Defenition (в каком виде требуется отправить решение), обязательно читаем Constraints – ограничения, и смотрим Examples.\u003cbr /\u003e\u003ca href\u003d\"http://img534.imageshack.us/img534/309/45275094.jpg\"\u003e\u003cimg border\u003d\"0\" src\u003d\"/predownloaded/ca/ef/caef737d2ad7ad1fe658175abd4d7b03ed8027bf.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/a\u003e \u003cbr /\u003e\u003cbr /\u003eМы должны посчитать сумму карт для игры Блэк Джек. Карта задаётся двумя символами – рангом и мастью. От нас требуют написать класс TheBlackJackDivTwo, содержащий public метод int score(vector \u0026lt;string\u0026gt; cards).\u003cbr /\u003e\u003cbr /\u003eПишем решение задачи:\u003cbr /\u003e\u003ca href\u003d\"http://codepad.org/EMkgXA2X\"\u003ehttp://codepad.org/EMkgXA2X\u003c/a\u003e\u003cbr /\u003e\u003cbr /\u003eПытаемся его скомпилировать. Успешно. \u003cbr /\u003eДалее проверяем свой код на тестах из условия (Test). Так же можно ввести свой тест, который будет соответствовать ограничениям, и увидеть, какой результат выдала программа.\u003cbr /\u003eЗавершаем работу с задачей нажатием на кнопку Submit и закрытием окна Coding Phase.\u003cbr /\u003e\u003cbr /\u003eТак как это комната для тренировок – решение можно сразу протестировать, выбрав Practice Options --\u0026gt; Run System Test.\u003cbr /\u003eПри верном решении цифры 250 загорятся зелёным, при неверном можно будет увидеть тест, на котором программа отработала некорректно.\u003cbr /\u003e\u003cbr /\u003eТеперь поговорим о \u003cb\u003eформате соревнований TopCoder Algorithm\u003c/b\u003e.\u003cbr /\u003eСоревнование называется SRM - Single Round Match. Расписание SRMов можно увидеть \u003ca href\u003d\"http://www.topcoder.com/tc?module\u003dStatic\u0026amp;d1\u003dcalendar\u0026amp;d2\u003dthisMonth\"\u003eздесь\u003c/a\u003e, или, например, используя различные готовые календари (\u003ca href\u003d\"http://codeforces.ru/blog/entry/349\"\u003eпример\u003c/a\u003e). Матч длится 1 час 35 минут. На решение задач (Coding Phase) даётся 1 час и 15 минут, 5 минут (Intermission) даётся на передышку и подготовку тестов для третей части - Challenging Phase. \u003cbr /\u003e\u003cbr /\u003eПеред началом соревнований участники распределяются на комнаты, в каждой комнате присутствует не более 20 человек. Во время Фазы Челленджа вам разрешается смотреть код других участников твоей комнаты, который они отправили по каждой из задач. Если вы видите, что решение какого-либо участника не является полным, вы можете попробовать обломать его программу, подобрав такой тест, на котором решение либо выдаст неверный результат, либо не завершит свою работу корректно или не уложится по времени.\u003cbr /\u003e\u003cbr /\u003eЗа успешную попытку челленджа вам начисляется 50 дополнительных очков, за неуспешную – снимается 25. Челленджить с отрицательным количеством очков нельзя!\u003cbr /\u003e\u003cbr /\u003eНа контесте предлагается три задачи, которые обычно стоят 250, 500 и 1000 очков. Очки, которые вы получите за задачу, определяются разностью времени открытия задачи и посылки её (Submit). Существует возможность повторной отправки задачи – в этом случае время пересчитывается, относительно времени последней посылки, и снимается 10% очков за каждую повторную посылку, но вы получите как минимум 30% очков задачи.\u003cbr /\u003e\u003cbr /\u003eПосле Challenging Phase происходит System Testing Phase, где все выдержавшие челлендж решения тестируются на заранее приготовленных тестах + тестах, которые успешно уронили чужие решения в предыдущей фазе. Если задача была решена верно – вы сохраняете свои очки по ней, в противном случае вы получаете 0 очков за неё.\u003cbr /\u003e\u003cbr /\u003eЗатем все участники сортируются по количеству очков, набранных за контест, и идёт пересчёт общего рейтинга участников. Все участники разбиты на 2 дивизиона: 1200 и больше очков рейтинга – I Дивизион, меньше 1200 – второй. \u003cbr /\u003e\u003cbr /\u003eНадеюсь эта статья поможет кому-либо испытать новые ощущения от решения задач.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eИскренне ваш, пока ещё жоолтый,\u003cbr /\u003e\u003cbr /\u003e\u003ca class\u003d\"rated-user\" href\u003d\"../../../profile/dAFTc0d3r\" title\u003d\"Капитан \ndAFTc0d3r\"\u003edAFTc0d3r\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eUPD. Часть #2: \u003ca href\u003d\"http://codeforces.ru/blog/entry/1265\"\u003eПлагины для C++ и внешней среды разработки (MS Visual Studio)\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e","tags":["srm","topcoder"]}}