{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1292917856,"rating":40,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1292917856,"id":967,"title":"Problems\u0027 Materials Publishing","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003e Hi everybody,  \u003c/p\u003e\u003cp\u003e I am happy to tell you that Codeforces will soon free you from reading those endless \u0026quot;Please, give me test #??\u0026quot; in the comments. Now you can click on a link with the submission-id on the status page and it will show not only the original solution texts, but also the tests on which testing was performed (the judging system report). It will not contain the full inputs/outputs/answers if they are too large – you will have to wait for now and enjoy their prefixes. As soon as we understand that there\u0027re no bugs in the implementation, we will open all the previous contests to view the tests.  \u003c/p\u003e\u003cp\u003e However, that is only the first step; later you will be able to download contest problem archives that will contain full texts (or their generators) as well as the authors\u0027 solutions and other materials.  \u003c/p\u003e\u003cp\u003e Of course we do not want Codeforces problems to be copied from one \u0026quot;online judge\u0026quot; to another one. You’ve got to understand that Codeforces puts huge effort into preparing tasks and organizing contests. That\u0027s why we limit the material usage to make using our problems on websites or in other automatic testing systems impossible. On the other hand, we will be glad if the contest materials will be useful for individual training or for some assemblies, training sessions etc. with the onsite participants. Read the license text carefully as we want some Codeforces data to be published near (or inside) the problem tasks.  \u003c/p\u003e\u003cp\u003e At the moment it is version 0.1 of the license, we will perhaps change a lot in it, but I guess the idea will undergo no changes.  \u003c/p\u003e\u003cp\u003e \u003cb\u003eCodeforces materials usage license (v. 0.1)\u003c/b\u003e \u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003col\u003e \u003cli\u003e You may publish the texts of Codeforces problems in any open sources, but you must preserve a direct link to the site http://codeforces.ru (http://codeforces.com for English statements) and indicate Codeforces as the problem source. These data should be located in the close proximity to the statement, be easily noticeable and readable. It is forbidden to publish Codeforces problems in open sources supporting automatic testing (such as online judges or similar resources). \u003c/li\u003e \u003cli\u003e You must not use tests and other materials of the problems (generators, checkers, validators) to publish tasks in open sources supporting automatic testing (such as online judges or similar resources) even provided the original problem conditions has been changed. \u003c/li\u003e \u003cli\u003e You may use the provided material: tests, generators, checkers, validators and others for individual training or to organize short-term teaching and training activities with the participants present on-site. Task conditions should contain the data from paragraph 1 of this license. The secondary (subsequent) distribution of the tasks should contain this license and comply fully with the license’s rules. \u003c/li\u003e \u003c/ol\u003e\u003c/div\u003e","tags":["codeforces","license","metarials","publishing","tests"]}}