{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1270187256,"rating":5,"authorHandle":"hadi","modificationTimeSeconds":1270189198,"id":246,"title":"Codeforces Beta Round #7","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003eI participated in the beta round #7, and my performance wasn\u0027t good and I dropped some rating points.\u003cbr /\u003e\u003cbr /\u003eMy first mistake was in problem B, in which I wasn\u0027t careful that \u0026quot;erase\u0026quot; parameter can be any integer. I think my solution failed for \u0026quot;erase -1\u0026quot;. Well, this didn\u0027t cost me too much, as I figured it out in about 10 minutes and got it Accepted.\u003cbr /\u003e\u003cbr /\u003eMy second mistake, and biggest mistake was in problem C. I\u0027m very weak in number theoretical problems (currently), and I didn\u0027t realize that this is a standard Diophantine equation, which had a very standard algorithm to solve. After some struggling, I searched the internet for some help. At last, I ended up in \u003ca href\u003d\"http://www.shygypsy.com/tools/number.cpp\"\u003eShygypsy\u0027s tools\u003c/a\u003e, which had the code for problem. But it didn\u0027t work for negative numbers, and I wasn\u0027t good enough to figure out how to do the % operator for negative numbers. After much time spending on this problem, and writing too much unnecessary code, I could get it Accepted in 1:43.\u003cbr /\u003e\u003cbr /\u003eThen I tried to solve problem D, but probably 17 minutes wasn\u0027t enough for me. It wasn\u0027t a hard problem. Palindrome prefixes can be detected in O(n) using KMP (or probably using hashing), and the rest can be done using a simple DP. Well, the solution wasn\u0027t difficult, but probably I didn\u0027t have enough self-confidence to solve it.\u003cbr /\u003e\u003cbr /\u003eI have lack of self-confidence, maybe because I have lack of practice :-) I will most probably participate in next match, and I hope to gain some rating points.\u003c/div\u003e","tags":["analysis","codeforces beta round #7","postmortem"]}}