{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1267205949,"rating":3,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1315158152,"id":102,"title":"Codeforces Rating System","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv class\u003d\"from-renderer\"\u003e\u003cp\u003e As some users have already noticed - contest rating has been added   to Codeforces. For now it is in beta too, but it looks very adequate.   Here\u0027s how it is calculated. \u003c/p\u003e \u003cp\u003e Each person is characterized by their rating, the number \u003ci\u003eR\u003c/i\u003e. If person \u003ci\u003eA\u003c/i\u003e\u0027s rating is \u003ci\u003eR\u003c/i\u003e\u003csub\u003e\u003ci\u003eA\u003c/i\u003e\u003c/sub\u003e, and person \u003ci\u003eB\u003c/i\u003e\u0027s is equal to \u003ci\u003eR\u003c/i\u003e\u003csub\u003e\u003ci\u003eB\u003c/i\u003e\u003c/sub\u003e, then the   formula                 \u003c/p\u003e \u003cdiv style\u003d\"text-align: center;\"\u003e   \u003cimg src\u003d\"/predownloaded/15/3c/153c82785b799bbaf5dde38d38e092aa312302fb.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e   \u003cbr /\u003e\u003c/div\u003e   gives the probability that \u003ci\u003eA\u003c/i\u003e will get a higher position than \u003ci\u003eB\u003c/i\u003e in the round final standings. By the way, here everything is very close to the \u003ca href\u003d\"http://en.wikipedia.org/wiki/Elo_rating\"\u003eElo rating\u003c/a\u003e.  \u003cp\u003e Before updating your rating after the end of the round,   for each participant his seed  is calculated, that is the place that   the participant is expected to take in this competition. Thus, two   things are known for each participant - his seed (the expected place)   and rank (the actual place). Depending on the difference between these   two values, your rating increases or decreases. If the difference is   higher, your rating changes more.   \u003c/p\u003e \u003cp\u003e There are a few technical points: \u003c/p\u003e \u003cul\u003e   \u003cli\u003eif it is the first contest for a participant, his seed is     calculated as 1 + \u003ci\u003en\u003c/i\u003e / 2, where \u003ci\u003en\u003c/i\u003e is the total number of participants     in the round; \u003c/li\u003e   \u003cli\u003echanges in the ranking of contestants are multiplied by a     correction factor such that allows the sum of ratings of the     participants to remain unchanged (before and after the round). \u003c/li\u003e\u003c/ul\u003e \u003cp\u003e  As at TopCoder all users are divided into two divisions: the first   (rating over \u003cstrike\u003e1500\u003c/strike\u003e 1650) and the second (rating_ not more than \u003cstrike\u003e1500\u003c/strike\u003e 1650). Not   rated users fall into the second division automatically.  \u003c/p\u003e \u003cp\u003e  Wish you high rating,  \u003c/p\u003e\u003cp\u003eMikeMirzayanov\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e","tags":["codeforces","rating"]}}