{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1271058163,"rating":16,"authorHandle":"ItsNear","modificationTimeSeconds":1271058713,"id":284,"title":"Это Вегас, детка :о)","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eПост содержит explicit content. Если вам нет 18, возможно его не стоит читать :о)\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eДля тех кто не в курсе, 6-ого апреля у меня был День Рождения. К сожалению, шестое апреля выпало на середину рабочей недели, и куда-то вырваться в этот день было невозможно - так что празднование перенеслось на пару дней, чтобы зацепить оба выходных. Я взял отпуск на работе на пятницу, и уже в четверг вечером мы отправились в Вегас.\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/ac/cf/accf990591acd5d1579d9555c05c389a77af0bc9.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003eПрилетели мы около 10 вечера (да, фотография выше сделана явно не в тот же день :о)), зачекинились в экскалибур и пошли гулять. Машина мечта была увидеть фонтаны перед Беладжио, и от экскалибура до туда на первый взгляд должно было быть близко. Это было только на первый взгляд, реально там было фигачить пешком пол часа, и этот путь за три дня мы прошли наверное раз 10 :о(\u003cbr /\u003eПока мы дошли до фонтана уже была полночь, и он не работал. Мы зашли в планету Голливуд, просрали кучу бабла в блэкджек и расстроенные пошли в экскалибур. На утро первым делом запечатлели меня с нашим отелем :о)\u003cbr /\u003e  \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/44/cb/44cbbb173990fd539e14873ac81c5f9228eb8d4c.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003eВот вид на отель покучавее:\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/3e/43/3e43af38d68035056e093186056ebdddd1e3a3f6.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003eОт экскалибура открывается отличный вид на стрип\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/6c/08/6c088e1abe40c7ba4bc8b2b341984530d6e1acba.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003e\u003cbr /\u003eВообще, в Вегасе много всего удивительного и красивого. Отели пытаются как-то удивить посетителей. Я больше всего тащусь от оформления отлелей Нью-Йорк Нью-Йорк и Париж (после экскалибура, конечно :о))\u003cbr /\u003eНью-Йорк Йью-Йорк находится через дорогу от экскалибура и изображает Манхэттен. Одна из фишек этого отеля - это неслабые американские горки с полным комплектом - долгий медленный подъем с резким спуском, мертвые петли, езда вверх головой. Когда я послдений раз был в Вегасе два года назад, это было одно из самых запомнившихся событий. В этот раз мы на них так и не прокатились, потому что Маша не решилась, а я один че-то не очень захотел.\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e  \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/6f/fd/6ffdc8b0865e6d77a94e7b1fcfe706258d642a75.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003e\u003cbr /\u003eПариж находится в самом центре Стрипа, и основная его фенька - это в два раза уменьшенная копия Эйфелевой Башни.\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/53/0b/530b022295f483492d10e60d7b69e8906f30a146.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003e\u003cbr /\u003eНа самом деле это было бы не так круто, если бы напротив Парижа не было отеля Беладжио, а перед Беладжио не было невероятно крутого фонтанного шоу. Опять же возвращаясь к моей поездке в Вегас два года назад - однажды Маша пересматривала видео с того раза и смотря на видео с фонтаном думала о том, что ей никогда в жизни не увидеть его вживую. Поэтому с утра первым делом пошли смотреть на фонтаны опять. И они опять не работали, в этот раз потому что слишком рано. Даже с земли фонтаны смотрятся просто невероятно, а с Эйфелевой Башли это вообще не передаваемо.\u003cbr /\u003eВ общем после второй неудачной попытки посмотреть на фонтан мы пошли дальше по стрипу в направлении к Миражу, посмотреть на вулкан. Вулкан был больной темой - на ТЦО я был в мираже три дня и даже не знал, что там вообще есть вулкан. После этого все, кому я не говорил, что мы останавливались в Мираже, спрашивали меня про то, как мне понравился вулкан, и я не мог ответить ничего вразумительного.\u003cbr /\u003eВулкан тоже накрылся. Опять же потому, что было слишком рано.\u003cbr /\u003eДалее, надо отметить, что до Лас-Вегаса я не пил вообще ничего алкогольного, даже пиво, в течение полутора лет. Но в Вегасе продолжить это не удалось. Так что в Мираже мы взяли по коктельчику и двинулись в направлении Стратосферы. Надо отметить, что коктейли в Вегасе продаются в таре, которой хватает на пол дня\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/37/3e/373e571352cd0321fcb1806fab5f8da051823037.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003eКак многие наверное знают (а кто не знает, узнает сейчас :о)) на стратосфере есть три аттракциона. X-scream - паровоз, который мчится с вершины стратосферы вниз в бездну по конечным рельсам и останавливается в последний момент останавливается, Insanity - каруселька, которая вылазит за пределы башни, наколняет всех на 45 градусов и начинает крутиться, и Big Shot. Вот Big Shot - это то, на что пошли мы. Я всегда его считал самым страшным аттракционом из трех, что оказалось не совсем так. Немного о нем. Сама стратосфера - это 350 метровая башня. Над ней возвышается шпиль. Точную высоту шпиля я не знаю, но на вид снизу высота шпиля равна где-то трети от высоты башни, то есть грубо говоря 100 метров.\u003cbr /\u003e  \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/42/df/42df51eb4b92d7ebc3e22ff64158f0fabf9616f3.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003eЛюди садятся на удобные места вокруг шпиля, после чего их с огромной скоростью поднимают где-то на половину от его высоты, и отпускают вниз с такой же огромной скоростью. То есть, люди, уже находящиеся на высоте 110 этажного дома, за несколько секунд поднимаются еще примерно на высоту 15-20 этажей и летят вниз, при этом просто сидя на седушке со свешенными ногами\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/c2/c7/c2c74810b69baab24019b6a77098e36b634ec711.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  С аттракциона остались отличные фотки, сделанные специально установленной там камерой. Забавные радостные лица до старта, и полные ужаса после :о) Маша не нравится себе с застывшим ужасом на лице и не хочет видеть этот кадр в интернете :о)\u003cbr /\u003e\u003cbr /\u003eНа обратном пути мы пошли к Беладжио, где Маша наконец-то увидела первый раз в своей жизни танцующие фонтаны\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/6f/73/6f73758d8472f4087e32cdd0365f643a54508bef.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003eДень продолжался, коктейли из Миража кончились, начались новые, из Парижа. \u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e  \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/ff/df/ffdf208030ed237a5749b33d8ad8504e938b1a13.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003eДалее вечер был все ближе, и надо было уже думать на какое шоу идти. Не смотря на то, что реально мы были в вегасе три дня, вечер пятницы был единственным, когда мы могли пойти на шоу, потому что суббота была запланирована на другие дела, а воскресенье вечер мы уже должны были застать в самолете. Вариантов шоу у нас было три. Концерт группы AC/DC, выступление Дэвида Коперфильда и стрип шоу с участием Холли Мэдисон. На концерт AC/DC можно было пойти разве что чтобы посмотреть на прыгающего на одной ноге с гитарой Ангуса Янга, но это явно не стоило целого вечера. На Коперфильда было два варианта. За 200 баков с рыла можно было после выступления сфоткаться с ним, а за 60 баков только посмотреть концерт. Первый вариант был бы клевый, но 400 баков было как-то жалко. А просто идти смотреть на фокусы - я могу Акопяна посмотреть на ютубе :о) В общем я двумя руками был за Peepshow с Холли. В буквальном смысле слова\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/de/49/de49c8ccc4b10e7d1752f0e8e421d64e265053bb.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003eШоу было awesome. Даже если забыть о том, что это было стрип шоу, танцы были поставлены очень клево, были всякие смешные интермиссии, выступление я не знаю как это называется, короче когда мужик выступает на свисающем в потолка канате, прикольно вплели публику на первых рядах (один из ребят оказался подсадным, и потом неплохо укатывал тоже со сцены). Все это было заплетено в не очень умный сюжет, и кульминацией было то, на что видимо пришло половина зала - обнаженный бюст Холли. Силикона там анрил... :о)\u003cbr /\u003e\u003cbr /\u003eТак кончился первый день. Второй день был целиком посвящен полету на Гранд Каньён.\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/1b/33/1b330558dad93619b1bb23ac0975be29337dace0.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003e\u003cbr /\u003eЕсли вы когда-то мечтали полетать на маленьком самолетике, лучше размечтать обратно. При определенном стечении пилота, самолета и погоды\u003dтурбулентности через пол часа полета желудок очень просится наружу :о) Мы вроде пережили полет туда.\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/02/34/0234d2a1d23307370c62750e0ac408e10f5fcab4.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e   \u003cbr /\u003e\u003cbr /\u003eПервым делом мы поехали к стеклянному мосту - известному достаточно аттракциону над каньёном. В сущности он именно то, что отражено в его названии - стеклянный мост :о)\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/64/76/64760f244675b568e2fa7b702800e3053826a63a.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003eХодить по нему нереально страшно, чтобы сделать эту фотку я вообще не знаю как пересилил себя. Потому что высота под мостом порядка 500 метров - полторы стратосферы, а стекло не выглядит очень толстым. В общем всякие американские горки отдыхают :о)\u003cbr /\u003eДальше на каньоне уже было не так интересно, хоть и очень красиво.\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/00/9b/009bf62695325a5b71a3528ffcb40025c9701ea3.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003eКстати, кто видит на следующей фотке орла?\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/a9/e4/a9e48391c5cc28a4f6382ec2dafcb264c0f1668c.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e   \u003cbr /\u003eВечером того дня, после Каньена (кстати на обратном пути или погода была лучше, или пилот опытнее, или самолет круче, но летели мы гладко и без особых неприятных ощущений), мы вернулись к Эйфелевой Башне, чтобы уже посмотреть на фонтаны вечером. Очередь на башню была такой, что ожидаемое время (там оно оценивается) было один час. Пришлось доплатить и уже через пять мин мы были наверху. Фонтан сверху смотрится awesome, настолько awesome, что отвлекаться на то, чтобы снимать его не хочется. Вид на вегас с башни тоже awesome\u003cbr /\u003e \u003cbr style\u003d\"line-height: 1.0px;\" /\u003e \u003cimg alt\u003d\"\" border\u003d\"0\" src\u003d\"/predownloaded/ac/38/ac384b068a5b2b5e2b7d0b2d95cf60bf88ece7d0.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e  \u003cbr /\u003eСпустившись с башни мы вернулись к фонтану, чтобы все-таки сделать его видео\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e  \u003ci\u003e(значит вставка ролика накрылась, потому что тут знак доллара работает отлично. ссылка на видео: http://video.mail.ru/bk/shd/las_vegas/241.html)  \u003c/i\u003e \u003c/p\u003e\u003cp\u003e\u003cbr /\u003eПервые две минуты используется только небольшая часть всего арсенала. Самое интересое в конце :о)\u003cbr /\u003eВ общем так все и прошло. Третий день зашел уже плохо. После двух дней непрерывного потребления алкогольных коктелей с полутора годами без капли алкоголя немного мучало похмелье и не давало наслаждаться днем. Только во второй половине стало получше, и вдарив еще по яблочному мартини мы пошли рубать на игровых автоматах. 40 долларов превратились в 50, и мы радостные, что хоть раз нам удалось выиграть (не важно что порядок выигрыша не сопоставим с тем, что мы успели проиграть до этого), отправились домой.\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["вегас"]}}