{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1268447789,"rating":0,"authorHandle":"Alex_KPR","modificationTimeSeconds":1268448262,"id":170,"title":"CF beta 4: ?!?!?!?!","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp align\u003d\"justify\"\u003e\u003cimg src\u003d\"/predownloaded/ec/8d/ec8dbb3aeb1e57d2d5bda32aaad3a094b2b11d1f.jpg\" style\u003d\"float: left;margin: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003eВо-первых, где моя аватарка? Я её не видел со вчерашнего дня. Вместо неё остался только порваный листок. И, кажется, такая проблема не только у меня.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eВо-вторых, в общем рейтинге я опустился на ~20 мест. Казалось бы: так и должно быть, люди участвуют, растут... Выше меня на одно место стал некто \u003ca class\u003d\"rated-user\" href\u003d\"/profile/VC15\" title\u003d\"Капитан VC15\"\u003eVC15\u003c/a\u003e. \u003c/p\u003e\u003cp align\u003d\"justify\"\u003eМне стало любопытно, кто это, и каковы его успехи. ;-) Оказалось, что он занял 24-е место, решив все 4 задачи второго дивизиона. Дык, позвольте. У меня было 26-е место в \u003cem\u003eпервом\u003c/em\u003e дивизионе, где, помимо всего прочего, участвовало в полтора раза больше человек! По-моему, формула подсчёта рейтинга нуждается в очень и очень серьёзной доработке (для сведения: у нас по одному участию).\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eТеперь о самом контесте.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e \u003c/p\u003e\u003cp align\u003d\"justify\"\u003eВспоминая задачу C прошлого контеста, очень надеюсь, что в задаче A было менее ста тестов. \u003d) В задаче C ограничение по времени стоит 5 секунд и, я думаю, корректное решение на C++ с использованием map требует не менее, чем полсекунды на тест. А если учесть, что часть участников пишут на паскале, то следовало ожидать много \u0026quot;таймлимитной фигни\u0026quot;. В то же время в задаче D все писали решение за квадрат, которое тоже хорошо подвешивает тестирующую систему.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eКак результат: во время тренировки вокруг меня постоянно ходили какие-то люди и жаловались о том, что \u0026quot;\u003cem\u003eя шестнадцать минут ждал результата и получил ошибку компиляции! а всё потому, что у них гнутая ся четвёртой версии!\u003c/em\u003e\u0026quot;; некоторые после сорокаминутного ожидания своих трёх сабмитов психовали и шли домой, в полной уверенности, что \u0026quot;всё правильно\u0026quot;, а потом получали минусы.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eКстати, некрасиво получилось к приверженцам паскаля. Я разделяю точку зрения о том, что \u0026quot;паскалистов\u0026quot; надо приучать к java или C++, но в этом контесте они оказались совсем за бортом: уж слишком сильное преимущество даёт STL в задачах C и D.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЖаль, что тестирующая система не \u0026quot;летает\u0026quot;; но если не получается бороться с причиной проблем, то можно попытаться бороться со следствиями: по-другому организовывать задачи для второго дивизиона или менять правила соревнований, например, делать их близкими к TopCoder.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЧто ж, будем надеяться, что всё будет хорошо. :)\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eКстати, с задачами для второго дивизиона могу помочь; главная проблема - перевод. \u003d)\u003c/p\u003e\u003c/div\u003e","tags":["codeforces","stl","задачи","контест","рейтинг","формула"]}}