{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1267297249,"rating":0,"authorHandle":"removed1","modificationTimeSeconds":1267551387,"id":110,"title":"Размышления: формат контеста","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv class\u003d\"from-renderer\"\u003e\u003cdiv class\u003d\"from-renderer\"\u003e   \u003cp\u003eВозможно, идея не нова, но...\u003c/p\u003e   \u003cp\u003e\u0026quot;Производный челлендж-контест\u0026quot;\u003c/p\u003e   \u003cp\u003eДаются обычные ACM-задачи (если на codeforces round предлагалось 3     задачи на два часа, то тут можно 20-30 минут на три задачи), которые     уже использовались на каком-нибудь из контестов, для которого     доступны   решения участников (\u0026quot;контест-прообраз\u0026quot;).     Участники за время   контеста присылают не решения, а тесты -- набор     из N тестов на задачу   (как в топкодере, можно делать повторный     сабмит). После истечения   времени система проводит тестирование     \u003cstrong\u003eнеправильных решений\u003c/strong\u003e с контеста-прообраза. Число     очков, набранных   участником, равно количеству решений с     контеста-прообраза,   неправильность которых удалось обнаружить на     наборе тестов, присланных   участником. Это, в некотором роде,     непомерно раздутая челлендж-фаза с Topcoder.\u003c/p\u003e   \u003cp\u003eРазумеется, такой контест, т.к. проводится на уже использованных     задачах, может быть only for fun. А последнее в значительной степени     зависит от разнообразия разных форматов контестов...\u003c/p\u003e\u003cp\u003eP.S.: недостатки челленджа на топкодере:\u003c/p\u003e\u003cp\u003eТо, что ошибочные челленджи отнимают очки, приводит к тому, что многие новички вообще не челленджат. А раз они этого не делают, научиться этому сложно. Как результат, средний участник топкодера имеет челленджей меньше, чем SRM в которых он принимал участие. Я челленджил чаще среднего и мне понадобилось больше года, чтобы общее количество баллов от челленджей стало положительным. Также, бывают нечелленджабельные проблемсеты.\u003c/p\u003e   \u003cp\u003e     Вообще, то, о чем я написал выше, стоило бы скорее характеризовать как форму тренировки, а не контеста. Аналогично состязаниям на самое быстрое решение задачи, или использующее наименьшее количество памяти.\u003cbr /\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e","tags":["topcoder"]}}