{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1268382977,"rating":1,"authorHandle":"SPIRiT_1984","modificationTimeSeconds":1268851445,"id":157,"title":"Some improvements could be useful","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eRight now the site is functioning stable, but some improvements could be useful, since some things are wery annoying.\u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003cp\u003eI think this site is really great. I really enjoyed posting here and taking part in CF Beta 3 round (nice problems, BTW). But some things seem a little bit annoying to me, and they could be modified a little bit.\u003c/p\u003e\u003cp\u003e1. It would be nice, if there would be a link to post history on the user profile page, since right now this is a little bit weird - you cannot see even your own post history, if you want to. For example, I wanted to find the entry with discussion about CF Beta 3 problems, but it took some time, since I could not get to this discussion through my posts there, and this discussion was not in \u003cstrong\u003eRecent Actions \u003c/strong\u003elist. Found it through the tag links.\u003c/p\u003e\u003cp\u003e2. And that brings us to another problem, it would be nice to have some categorys for blog entries (the most important ones, I guess). I would suggest at least categories \u0026quot;FAQ\u0026quot;, \u0026quot;Editorials\u0026quot; (after the contest is over, it is supposed to have a editorial, I guess), \u0026quot;Tutorials\u0026quot; (may include entries with links to useful books).\u003c/p\u003e\u003cp\u003e3. As for the contests itself. Since the problem statements say that program should work with standard input/output streams, it may become hard to test the sample statement (each time to type it). And, if contestants will redirect streams in his solution code, he may forget to comment these lines before sumbitting. It would be nice, if there would be some sort of environment variable or constant defined, like on ACM servers. After that it turns out much easier. For example, on ACM servers  (with \u003cstrong\u003eONLINE_JUDGE \u003c/strong\u003epseudoconstant defined) I use something like this in my code:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e#ifndef\u003c/strong\u003e ONLINE_JUDGE\u003cbr /\u003efreopen(\u0026quot;input.txt\u0026quot;,\u0026quot;rt\u0026quot;,stdin);\u003cbr /\u003efreopen(\u0026quot;output.txt\u0026quot;,\u0026quot;wt\u0026quot;,stdout);\u003cbr /\u003e\u003cstrong\u003e#endif\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThere - no problems, works fine at contestant computer and both the online contester.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eUpd:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe problem 3 (with streams) is solved, since right now I am using Emacs for writing and standard \u003cstrong\u003emake \u003c/strong\u003eutility for compiling and executing, therefore it\u0027s quite simple to redirect the streams in the make file.\u003c/p\u003e\u003c/div\u003e","tags":["contester","sitedesign"]}}