{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1267890230,"rating":0,"authorHandle":"xiaotian","modificationTimeSeconds":1272556828,"id":139,"title":"找回刚刚丢失的东西","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003e每天穿梭在天马与校区之间，上课、刷题、吃饭、睡觉貌似就是生活的全 部。每天脑子里想着相同或不同的事，普通或奇怪的事。有事触景生情觉得生活索然无味、有时心情激动感慨生活如此美好。或许某一个下午走在去机房的路上，看 着湖大的莘莘学子们孜孜不倦的身影，突然感觉自己像一块行尸走肉；抑或某个晚上走过图书馆旁，回味自己的一天，憧憬着自己的将来……这就是生活，我的生 活……似乎索然无味，却似乎有色彩斑斓……\u003c/em\u003e\u003c/p\u003e \u003cp\u003e\u003cem\u003e从7月27号但现在，我似乎一直都呆在学校，活动范围仅限与校区、天马、中南，期间似乎过过三次江，一次去火车站接同学，另外两次陪同学去 长沙理工。真是单调的可以啊……我感觉生活中缺少一种元素，重要的元素。慢慢的理解、思索，我似乎看见它了——我缺少的是沟通。\u003c/em\u003e\u003c/p\u003e \u003cp\u003e\u003cem\u003e很直观的去说，手机就是一个很好的例子。我的手机现在似乎是专门用来接收通知的，我在20天里用它发送了22条信息，打过几个电话。这只是 表象……多少次我从机房里出来的时候我都希望有一个人能够听我说“我用双向BFS比单向BFS快了30ms”、“我那道题打表预处理0ms过了”等等的感 受和心得，可是没有那样一个人，就因为我是化工院的，我就要承受这样的孤独。一个人走在黑暗的、冰冷的那条校园小道上心里真得很不好受……我羡慕旁听计通 院《操作系统》的课的时候他们在一起讨论算法。我的生活中就是却好像这样的交流和沟通……\u003c/em\u003e\u003c/p\u003e \u003cp\u003e\u003cem\u003e好几次和欢欢姐在一起说些生活、学习上的琐事的时候我感觉生活中就想射进一缕阳光，好温暖、好舒服。无论是作为倾诉者或者聆听者我都有种清 新的感觉……而慢慢的我发现我对她的感觉或许不是当初承诺的那种傻傻的“姐弟”的感觉。那一次从长理回来的路上，她凝视着车窗外我看着她，有一个瞬间我居 然在想：她太美了，如果可以的话我愿意用一生去守护她，还有生日那次她送我礼物的那一刻我有种想抱着她的冲动。有时我尝试着喜欢一个女孩子的时候，我总喜 欢与欢欢姐比较，然后那个女孩子又在我的生活中慢慢淡去。我想我是喜欢她了——我这个上了大学才认识的高中校友、我这个和我做了两年姐弟的大我8个月的朋 友。或许就是这种感觉的萌动，让我生活中缺少了某些东西。\u003c/em\u003e\u003c/p\u003e \u003cp\u003e\u003cem\u003e我想努力去改变我的生活，但是不知道怎么突破这一个切入点……纠结了吧？……该怎么办呢？\u003c/em\u003e\u003c/p\u003e \u003cp\u003e这是我去年月赛前写的一篇日志，但是只是存了草稿。今年月赛前我又将他翻了出来。认认真真的读了两遍，忍不住心里一阵苦涩。那些日子这样过去了，我 成长了好多，然而在今年——2010这一年里，同样的日子似乎还在继续，我也在继续成长……\u003c/p\u003e \u003cp\u003e这些天，因为某事，将学习以及ACM似乎太过于忽略了，生活也受到了或多或少的影响。我在问自己一个问题：什么是成长？试问什么是成熟？\u003c/p\u003e \u003cp\u003e答曰：面对失败的勇气不失为最重要的标志之一。\u003c/p\u003e \u003cp\u003e这么多事情落在我身上，我经常缺少一种面对失败的勇气。因为这种畏惧心理，很多事情我甚至不敢尝试着去做，我要求自己做每一件事情都要完美，可是这 是不现实的啊……于是我似乎一事无成。这么说似乎不是很好理解，那么用一个成语说吧：优柔寡断。呃，这不是一个褒义词吧？这不应该是男人的缺点，我希望自 己雷厉风行，我希望自己大刀阔斧。可是好多次我让自己失望了。\u003c/p\u003e \u003cp\u003e又见月赛，我似乎不太了解这一次月赛的意义在哪里？校队内部的PK？抑或新人的选拔？再问我算什么？校队内部，还是新人？今天和计通院08级某数据 结构老师又说起我的这点事，他认为我考研和acm是冲突的。我语塞了……真的很冲突的……我说：“可是我大三了，过了今年这个赛季，我这辈子都没有机会参 加ACM……”。他说：“可是你大三了，你今年不准备考研，你要等到什么时候？”我再次语塞了……\u003c/p\u003e \u003cp\u003e我又害怕了，我开始怕月赛，也开始怕acm，更怕考研。我怕失败……月赛失败了，我怕失去继续前进的信心；acm失败了，我怕失去生活的动力；考研 失败了，我怕失去活着的勇气……写下这些文字的时候，我怕我自己了……我怎么突然变得如此懦弱，这好像不是我。我是坚强的才对，我怕丢失了自己……\u003c/p\u003e \u003cp\u003e再次翻开以前的日志，好温馨，好幸福。自己曾经走过一条不同寻常的路，一条精彩的路。这条路上有很多知心的朋友陪伴。而这一周我是怎么了，把自己迷 失的这么深沉……月赛似乎要报销掉了……\u003c/p\u003e \u003cp\u003e不，不，不是的。这不是我，我相信这不是我。我是坚强的，我是爱自己的，我是不会把自己迷失的。我要坚强的站起来继续走下去。许巍的歌说：“每一刻 难过的时候，就独自看一看大海，总想起身边走在路上的朋友，有多少正在醒来，让我们干了这杯酒，好男儿胸怀像大海，经历了人生百态世间的冷暖，这笑容温暖 纯真。”好男儿胸怀像大海，加油，加油……翻过今天这一页，我一定还会是以前的我。自信、乐观、积极、向上。笑一笑，我亲爱的晓天……（呃，我逗自己笑 了……）\u003c/p\u003e \u003cp\u003e对嘛！！多笑笑，这才是我们曾经的晓天么……多少事情都过去了，还会因为生活中的一个过客而变得如此低迷。还记得么，晓天？新生杯上那一粒进球，笑 一笑吧；学生会例会上的那一次拍案而起，再笑一笑吧。还记得么，晓天？南宁时和项教授讨论中国余数定理，笑一笑吧；凌晨两点钟蜷缩在火车站售票大厅等待放 票，再笑一笑吧。还记得么，晓天？进入校队时的激动与兴奋，笑一笑吧；第一次再湘大领奖的那个瞬间，再笑一笑吧……没有什么理由可以让你这么消沉了吧？笑 一笑，再笑一笑，大笑一声吧，哈哈……\u003c/p\u003e \u003cp\u003e呵呵，还是以那一句话结尾，做最好的自己……晓天，你真的很棒的……\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e","tags":["none"]}}