{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1274638721,"rating":14,"authorHandle":"ItsNear","modificationTimeSeconds":1274638721,"id":394,"title":"Система TCM? O.O","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cb\u003eАнонс:\u003c/b\u003e \u003cb\u003e24.05.2010 (пн), 20:00\u003c/b\u003e на сервере личных  соревнований SnarkNews пройдёт экспериментальный индивидуальный турнир.  Турнир будет проведён по системе \u003ca href\u003d\"http://158.250.33.215/%7Eejudge/tcm.html\"\u003eTCM\u003c/a\u003e, которая будет использоваться на \u0026quot;Яндекс Open 2010\u0026quot;. Продолжительность турнира - 1  час 20 минут.\u003cbr /\u003e\u003cbr /\u003e(с) SnarkNews\u003cbr /\u003e\u003cbr /\u003eВ кратце описание системы - когда вы посылаете задачу, вы можете ее послать по нормальному, по ACM-овски, либо вы можете послать ее в темную. Во втором случае она останется в монике до конца как знак вопроса, и перепослать или что-то еще сделать по ней нельзя.\u003cbr /\u003eВ конце соревнования все темные проверяются, и за успешные дают 1.5 балла.\u003cbr /\u003e\u003cbr /\u003eМне одному кажется, что в этом соревновании будет просто невероятно заруливать удача? По-моему совершенно любой человек может накосячить на любой задаче с каким-то шансом. Очевидно, что по простой задаче никто никогда в такой системе не отправит в светлую - это тупо. Значит все почти участники поощрительные задачи будут сабмитить в темную.\u003cbr /\u003eУ трети из них она не пройдет, и это сразу совершенно случайным образом даст кому-то фору в 1.5 поинта :о Если простых задач парочка, то это еще круче раскидает людей.\u003cbr /\u003eБыло бы еще разумно, если бы у задач были какие-то назначенные им поинты, и падение простой задачи не равнялось бы по поинтам падению гроба, а в таком виде это будет полюбому лотерея.\u003cbr /\u003e\u003cbr /\u003eВообще возникает устойчивое ощущение, что снарк не любит штрафы. Те, кто писал в его системе АСМ+ думаю помнят, что там штраф полностью лишает вас возможности бороться за призовые места с теми, кто штраф не сделал :о\u003cbr /\u003e\u003cbr /\u003eА еще интересно, что же вообще значит TCM. Это типа TC и ACM вместе? От TC получается взяли только проверку в конце? Или это как-то по умному еще расшифровывается?\u003cbr /\u003e\u003c/div\u003e","tags":["snarknews","tcm"]}}