{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1265290678,"rating":0,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1265648116,"id":50,"title":"Night before the contest","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003eI think I won\u0027t find any strength to describe the finishing day. I will only tell you that it was quite tiring - before the trial contest the guys had to  wait for about an hour. Then there was a contest almost as long as the real one. \u003cdiv\u003e   \u003cbr /\u003e\u003c/div\u003e \u003cdiv\u003eAnd now about the most important. The official site of the contest     is \u003ca href\u003d\"http://icpc.baylor.edu/\"\u003ehttp://icpc.baylor.edu/\u003c/a\u003e,  and as   for the traditional textual broadcast, you\u0027ll find it at \u003ca href\u003d\"http://acm.math.spbu.ru/~snark/finals/index.cgi?data\u003dnewstape\u0026amp;class\u003dfinal2010\u0026amp;year\u003d2010\"\u003eSnarknews\u003c/a\u003e   (In Russian)\u003c/div\u003e \u003cdiv\u003e   \u003cbr /\u003e\u003c/div\u003e \u003cdiv\u003eYou start rooting for us on February 5 at 5 o\u0027clock (Moscow time)\u003c/div\u003e \u003cdiv\u003e   \u003cbr /\u003e\u003c/div\u003e \u003cdiv\u003eLet\u0027s express our thoughts and emotions about the contest in the   commentaries under this post. I\u0027m not sure, if I\u0027m going  to have the   Internet during the contest, but if I have such a chance,  I\u0027ll write something.\u003c/div\u003e \u003cdiv\u003e   \u003cbr /\u003e\u003c/div\u003e \u003cdiv\u003eUPD: I\u0027ve nearly forgotten the most important. Today Bill Poucher   announced sad news - the finals in Malaysia are postponed, and where   they are  next year is still kept secret. Rumors say in Cairo (Egypt). \u003c/div\u003e \u003cdiv\u003e   \u003cbr /\u003e\u003c/div\u003e \u003cdiv\u003eUPD 2: At the informal tournament ICPC Challenge our team advanced   to the finals and took the 4th prize. The  Final competition is going   to take place tomorrow at the closing ceremony.\u003c/div\u003e \u003cdiv\u003e   \u003cbr /\u003e\u003c/div\u003e \u003cdiv\u003eUPD 3: I think you\u0027ll be able to see the results \u003ca href\u003d\"http://icpc2010.csc.kth.se/\"\u003ehere\u003c/a\u003e. Thank you \u003ca href\u003d\"http://codeforces.ru/profile/vici\"\u003evici\u003c/a\u003e, plus for you!\u003c/div\u003e\u003c/div\u003e","tags":["2010","acm","acm-icpc","contest"]}}