{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1265358082,"rating":24,"authorHandle":"ivanromanov","modificationTimeSeconds":1265663775,"id":56,"title":"The results","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003eAccording to \u003ca href\u003d\"http://acm.math.spbu.ru/%7Esnark/finals/index.cgi?data\u003dnewstape\u0026amp;class\u003dfinal2010\u0026amp;year\u003d2010\"\u003eSnarknews\u003c/a\u003e        (in Russian only), Shanghai JTU has become the  World Champion for the third time (2002, 2005, 2010), this means it has  the same number of victories as the Stanford University and the SPbSU  ITMO.\u003cbr /\u003e \u003cbr /\u003e \u003cdiv\u003eThen goes the Moscow State University (Gusakov, Kornakov,   Razenshtein) - the European Champions! Congratulations to the team and   to their coach  Anton Pankratiev!\u003c/div\u003e \u003cdiv\u003e   \u003cbr /\u003eThe next one is the biggest surprise of this contest (IMHO) -   Taiwan National University. Personally for me it was a pleasant   surprise, because in November \u003ca href\u003d\"http://picasaweb.google.com/ivanromanov/Taiwan\"\u003eI visited   Taiwan\u003c/a\u003e - a nice island! I  recommend it to everyone. It was my   first trip to Asia, a good start .\u003cbr /\u003e   \u003cbr /\u003eThe following two teams - Kiev State University (Grinenko,   Neiter,  Simonenko) and Petrozavodsk State University (Denisov,   Nikolaevskyi). In person I know only the guys from Petrozavodsk, I\u0027m   glad for Alexei, Denis, Ilya, and Denis Petrovich, Vladimir   Alekseevich,  Victor Nicolaevich - congratulations to all of them!\u003cbr /\u003e\u003c/div\u003e \u003cbr /\u003e        An interesting fact: the three leaders of the \u003ca href\u003d\"http://karelia.snarknews.info/index.cgi?data\u003dmacros/final\u0026amp;menu\u003dindex\u0026amp;head\u003dindex\u0026amp;round\u003d08\u0026amp;sbname\u003d2010w\u0026amp;class\u003d2010w\"\u003elast   Petrozavodsk training  session\u003c/a\u003e         took the positions among the five best teams, and in the same  order!\u003cbr /\u003e \u003cbr /\u003e        The sixth place - Tsinghua. The seventh - alma mater, Saratov SU (Bondarenko, Matov, Yakunin)! Congratulations to Natasha, Dima, Vova, Misha, Antonina Gavrilovna on their silver medals! \u003cbr /\u003e \u003cbr /\u003e        The eighth position - Warsaw, a nice city. The ninth - St. Petersburg SU (Antipov, Levin, Smirnov), the forth medal to our North-Eastern European  region. 10th and 11th were Zhongshan and Fudan. The 12th  was the University that hosted the previous World Championship in  Stockholm - KTH, Sweden.\u003cbr /\u003e \u003cbr /\u003e        Congratulations to the medalists once again!\u003cbr /\u003e \u003cbr /\u003e                UPD. It \u003ca href\u003d\"http://uaimages.com/images/383434bord%201-21%20v2.png\"\u003eoccurred\u003c/a\u003e         that SPbSU has the same penalty time as the eighth position. Moreover, there is a chance that Russia will have one more medalist - Ural SU (Burmistrov, Dublennih, Kurpilianskyi) occupies the 13th position and is the last team which solved 6+ problems.\u003cbr /\u003e \u003cbr /\u003e        UPD2. 4  gold medals, 5 silver medals (including SPbSU), 4 bronze medals (including UralSU). Totally, NEERC is the Vice-World champion, the European champion,  got a gold medal, three silver medals and a bronze one.\u003c/div\u003e","tags":["acm","acm-icpc","world finals"]}}