{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1287525380,"rating":5,"authorHandle":"ir5","modificationTimeSeconds":1287525960,"id":771,"title":"Codeforces Beta Round #36","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch3\u003eGeneral\u003c/h3\u003e\u003cbr /\u003eIt was normal codeforces contest except the IO: input.txt/output.txt. I didn\u0027t know the IO change before contest began and I got upset. I used an unaccustomed fstream library in the contest, but I should use freopen as below code. (if C++)\u003cbr /\u003e\u003cbr /\u003e    freopen(\u0026quot;input.txt\u0026quot;, \u0026quot;r\u0026quot;, stdin);\u003cbr /\u003e    freopen(\u0026quot;output.txt\u0026quot;, \u0026quot;w\u0026quot;, stdout);\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003ch3\u003eA Extra-terrestrial Intelligence \u003c/h3\u003eSimple problem, calculate the interval length between first two \u00271\u0027s, then check if all interval lenghs are equal.\u003cbr /\u003eI failed to read the statement \u003ci\u003e\u0026quot;It’s guaranteed that the given record sequence contains at least three 1s\u0026quot;\u003c/i\u003e at the beginning, then I stopped for a little.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003ch3\u003eB Fractal \u003c/h3\u003eThis is also a simple problem, simple iteration is good because the input size is very small.\u003cbr /\u003eBut I stuck at compilation error of vector\u0026lt;string\u0026gt; substitution, then I lost about 10 mins. This upset me. My C++ compiler MinGW outputs compilation error at below code. I don\u0027t know what is wrong yet..\u003cbr /\u003e\u003cbr /\u003e        vector\u0026lt;string\u0026gt; vs1(N,string(N,\u0027^\u0027));\u003cbr /\u003e        vector\u0026lt;string\u0026gt; vs2(2*N,string(2*N,\u0027^\u0027));\u003cbr /\u003e        vs1\u003dvs2;\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003ch3\u003eC Bowls \u003c/h3\u003eDifficult geometry. Many branching are required and my submission failed in the contest.\u003cbr /\u003eWhen a bowl A is put on a bowl B, the contact point with A,B will be one of below situations.\u003cbr /\u003e\u003cimg src\u003d\"/predownloaded/50/5c/505cb379542c7052fc92e211f2b5d46d8267560b.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003eSo when we simulate putting a bowl A, calculate the height of putting on bowl B foreach 0\u0026lt;\u003dB\u0026lt;\u003dA-1, then take maximum height as a bowl A position.\u003cbr /\u003eTo find the contact point, I first wrote binary search method instead because branching was laborious. But it was hacked quickly. (perhaps TLE or WA.)\u003cbr /\u003e\u003cbr /\u003eBe aware that input size N is a bit large to run O(N^2) in 2000 msec limit, heavy calculation must be reduced.\u003cbr /\u003eLine struct class as below was bad thing because method push_back will consume much time.\u003cbr /\u003e\u003cbr /\u003e    struct Line : public vector\u0026lt;P\u0026gt; {\u003cbr /\u003e        Line(const P \u0026amp;a, const P \u0026amp;b) { push_back(a); push_back(b); }\u003cbr /\u003e    };\u003cbr /\u003e\u003cbr /\u003e(I think the input size 3000 was a bad thing because the code which is only a little heavy may got TLE.\u003cbr /\u003eIn Codeforces, TLE may not detect at pretest that contains only easy tests, and we cannot test the worst case in judge server environment, so we can\u0027t check if the code will get TLE or not.\u003cbr /\u003eIf O(N^2) algorithm is simply required, N\u0026lt;\u003d1000 would be good.. wouldn\u0027t it?)\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003ch3\u003eD New Game with a Chess Piece \u003c/h3\u003eI didn\u0027t read in the contest.\u003cbr /\u003eThis problem looks like Nim, though the rule removing stones is different from Nim. Actually, this problem is not so hard if we experiment with small input size like 1\u0026lt;\u003dN,M\u0026lt;\u003d50.\u003cbr /\u003eThe answer has a relatively comprehensible rule with N,M,K, so we can construct O(1) algorithm. The solution will be simply an enumeration of mathematical expression.\u003cbr /\u003eI thought D is easier than C, though two problems are in different category.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003ch3\u003eE Two paths \u003c/h3\u003eI don\u0027t read yet.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003e\u003ch3\u003eResult\u003c/h3\u003eooxxx 1332pts 97th\u003cbr /\u003e1885-\u0026gt;1814\u003cbr /\u003e\u003cbr /\u003eBad result. I\u0027m shocked at C because I solved many geometry problems before and had a little self-confidence with geometry.\u003cbr /\u003eIf a geometry problem is given next time again, I need to solve it.\u003c/div\u003e","tags":["#36","codeforces"]}}