{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1264869111,"rating":12,"authorHandle":"OSt","modificationTimeSeconds":1265929677,"id":14,"title":"Создаём команду по программированию.","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eРешился написать о том, что наболело.\u003c/p\u003e \u003cp\u003eХорошо, когда ВУЗ уже давно участвует в соревнованиях и проблем с   кадрами нет. Но бывает, что сильные команды уходят и тренерам   приходится с нуля создавать коллектив. Предположим, что мы имеем   группу людей, которые умеют программировать на уровне учебной   программы своего курса и разбираются в математике. Они друг друга знают.\u003c/p\u003e \u003cp\u003eКаким образом можно заинтересовать их в олимпиадном программировании?\u003c/p\u003e \u003cp\u003e \u003c/p\u003e \u003cp\u003eНаличие весьма авторитетного тренера или просто уважаемого ими   старшекурсника, глядя на которого, они смогли бы   \u0026quot;заразиться\u0026quot; любовью к этому делу весьма важно (на мой   взгляд). То есть они могут воочию увидеть - как можно   \u0026quot;покачаться\u0026quot; и чего можно достичь. Тогда они могут начать   работать просто \u0026quot;за идею\u0026quot; (как начал заниматься я сам). Это   самый лучший вариант, на мой взгляд, ибо человек сам понимает чего он   может достичь своим трудом и отдаётся делу полностью. Но как часто   бывает - таких людей почти нет. С этим я и столкнулся в рамках своего   ВУЗа. Когда этот вариант не проходит, мы и начинаем искать сложные   \u0026quot;обходные\u0026quot; пути, дабы привлечь народ.\u003c/p\u003e \u003cp\u003eНачинаем \u0026quot;мозговой штурм \u0026quot; :\u003c/p\u003e \u003cp\u003e1.Можно попробовать заинтересовать студентов некими   \u0026quot;скидками\u0026quot; при обучении : менее требовательность к ним в   рамках основной программы и т.п. Но тут многое зависит от самих   преподавателей. Кафедра сможет не одобрить такой подход.\u003c/p\u003e \u003cp\u003e2.Можно попробовать заинтересовать студентов некими   \u0026quot;материальными ценностями\u0026quot; в разумных масштабах. То есть   устраивать небольшие факультетские соревнования  и лучших   награждать дипломами или как модно сейчас стало - футболками с   надписями \u0026quot;в тему\u0026quot; :) . Мне лично кажется этот вариант   вполне заманчивым. Каждый наверняка не отказался бы походить в   какой-то \u0026quot;особой\u0026quot; футболке. Заодно и поднимет свой авторитет   и общий интерес с соревнованиям. \u003c/p\u003e \u003cp\u003ePS: Буду весьма благодарен, если кто-нибудь подскажет ещё парочку   действенных способов как увеличить интерес к олимпиадному движению   внутри вуза.\u003c/p\u003e \u003ch3\u003e   \u003cstrong\u003eUPD :\u003c/strong\u003e\u003cstrong\u003eЗабавно, но \u0026quot;раздача слонов\u0026quot;     оказалась   весьма удачным ходом. Народ ринулся решать только в     путь. Жаль, что   большинство задач они смогли сдать только после разборов.\u003c/strong\u003e\u003c/h3\u003e \u003cp\u003eЯ же взял 1 место, решим все задачи. И получил своего   \u0026quot;слона-магнитика\u0026quot; :)\u003c/p\u003e \u003cp\u003e   \u003cimg src\u003d\"/predownloaded/bf/c1/bfc1f354dc0177960bef9accf6e671d59290328f.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e \u003cp\u003eНа этой неделе тоже проводится контест. Но задачи в этот   раз не по   тем темам, где я сильнее остальных. Так что соревнование   будет куда интересней.\u003c/p\u003e\u003c/div\u003e","tags":["команда","мозговой штурм","советы"]}}