{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1272651712,"rating":-2,"authorHandle":"removed1","modificationTimeSeconds":1272653260,"id":346,"title":"Пост про Яву N 2","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eВсе про неё, любимую.\u003c/p\u003e\u003cp\u003eИтак. Я скачал раздельно датафиды по всем годам и обработал их - отдельно - тем же сумматором, что и в предыдущем случае, убавилось только количество столбиков (теперь 10). Отсечка прежняя: не менее 3 матчей, в которых участник появлялся и не менее 3 задач.\u003c/p\u003e\u003cp\u003eГрафик отвечает на вопрос \u0026quot;берем наугад участника топкодера со средним рейтингом между N-1 и N децилями (если не знаете что это такое \u003ca href\u003d\"http://ru.wikipedia.org/wiki/Дециль#.D0.94.D0.B5.D1.86.D0.B8.D0.BB.D1.8C\"\u003ehttp://ru.wikipedia.org/wiki/Дециль#.D0.94.D0.B5.D1.86.D0.B8.D0.BB.D1.8C\u003c/a\u003e), берем наугад его задачу по которой было Submit или Compiled, какова вероятность, что использовалась Java?\u0026quot; Справа подписано количество учтенных участников.\u003c/p\u003e\u003cp\u003eВ 2001 году статистика вероятно, была с ошибками, в более поздней я ошибок не нашел, поэтому начинаю с 2002 года. Что же такое произошло между 2003 и 2004 годом? По вот этой \u003ca href\u003d\"http://www.tiobe.com/index.php/content/paperinfo/tpci/index.html\"\u003ehttp://www.tiobe.com/index.php/content/paperinfo/tpci/index.html\u003c/a\u003e штуке 2003 год был годом языка, который я называть не буду (и вообще это оффтопик). Правда, какое отношение это имеет к Topcoder, данных не имеется.\u003c/p\u003e\u003cp\u003eПо поводу новичков. Казалось бы, если на каком-то языке пишет много новичков, то со временем, новичок должен превратиться в опытного и вообще частота использования языка должна от этого расти, а не убывать. А распределение уже много лет как не меняет форму!\u003c/p\u003e\u003cp\u003e\u003cimg src\u003d\"http://img168.imageshack.us/img168/9150/graph2.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["java","statistics","topcoder"]}}