{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1273158008,"rating":18,"authorHandle":"ivanromanov","modificationTimeSeconds":1273159104,"id":360,"title":"24-часовой контест","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cspan style\u003d\"font-family: arial;font-size: small;\"\u003e\u003cp\u003e\u003cimg src\u003d\"/predownloaded/33/f1/33f1f03dd006afc496c62452479ee7ed6240b2f4.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cspan lang\u003d\"RU\"\u003eДень труда в этом году начался для меня 1-го мая \u003cspan lang\u003d\"RU\"\u003eв 9 часов утра, а закончился спустя сутки. В Будапеште десятый раз проходил 24-часовой контест \u003c/span\u003e\u003ca href\u003d\"http://www.challenge24thelegend.com/\"\u003eChallenge\u003c/a\u003e\u003cspan lang\u003d\"RU\"\u003e\u003ca href\u003d\"http://www.challenge24thelegend.com/\"\u003e 24\u003c/a\u003e\u003c/span\u003e\u003cspan lang\u003d\"RU\"\u003e.\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan lang\u003d\"RU\"\u003eВ марте я получил предложение, от которого невозможно было отказаться. Петрозаводская команда, успешно пройдя через онлайн-тур в финальную часть соревнований, искала замену Денису Денисову, который не мог поехать в Венгрию. [Власов Денис] Петрович предложил мне присоединиться к нему и Илье Николаевскому, за что им огромное спасибо.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eФормат финальных соревнований таков: команда из трёх человек, без ограничений по возрасту, приносить можно компьютеры, литературу, спальные мешки :-). Большинство участников принесли по лэптопу, но некоторые местные команды приволокли мощные десктопы и целые дата-центры. Средство связи используется ровно одно - локальная сеть, каждой команде выдаётся до четырёх статических ip-адресов. Мобильники и другая связь с внешним миром, как водится, запрещены. Общение с жюри по IRC. Сдача решений исключительно напрямую по TCP/IP: для каждой задачи объявлен хост и порт, протокол общения зависит от задачи.\u003c/p\u003e\u003cp\u003eПроблемсет в этом году включал восемь задач, оценённых от одной до семи тысяч баллов. Половина задач - вполне традиционные алгоритмические, в духе ACM. Остальная половина - разнообразные, от игровых а-ля Java Challenge / Code Game Challenge до развлекательной задачи \u0026quot;Объём\u0026quot;. На каждую ACM-подобную задачу было сразу опубликовано по 10 тестов стоимостью 100 баллов каждый (штрафа за неудачные подходы нет). Требовалось отсылать жюри только ответы на тесты, прямо присоединяясь к указанному хосту/порту, например телнетом.\u003c/p\u003e\u003cp\u003eЧуть подробнее о четырёх нетрадиционных задачах. Задача, оптимальное полиномиальное решение которой неизвестно, оценивалась исходя из максимума в 1000+1500. Тысячу можно было набрать, предъявив в каждом из десяти тестов решение лучше чем у других участников. (Точнее: отдельно по каждому тесту корректные ответы команд сортировались по оптимальности; лучшее решение получало 100 баллов, остальные меньше, по приведённой в условии формуле.) Ещё до полутора тысяч можно заработать, отправив жюри свой пример входных данных со своим ответом. Подробности начисления баллов в этом случае не были описаны подробно.\u003c/p\u003e\u003cp\u003eИгровая задача на 2500 баллов - танки. Танки умеют торговать оружием и стрелять. Условие задачи странным образом опускало всяческие подробности правил, предлагая участникам написать решение и запуская его, выяснить как там всё устроено. В общем это единственная задача, на которую мы ничего не написали. (Хотя какие-то баллы заработать следовало.)\u003c/p\u003e\u003cp\u003eПоследняя, главная, задача - вертолёты (7000 балов максимум). Требовалось написать управление вертолётом, с учётом физики, случайного ветра. Лететь к заданной точке, управляя несущим и рулевым винтами, оказалось непросто. Перевозить коммерческие грузы из пункта А в пункт Б, не задевая за препятствия - ещё сложнее. Разрешалось губить вражеские вертолёты, задевая корпусом за их несущий винт; наша команде первой удалось это сделать, за что мы получили специальный диплом :-)\u003c/p\u003e\u003cp\u003eАх да, и ещё одна прекрасная задача на тысячу. Как и на алгоритмические задачи, было дано десять наборов входных данных. Каждый набор - это три-пять рендеров (в формате .png) некой трёхмерной сцены. На сцене всегда присутствует белый кубик единичного объёма  и предмет, объём которого необходимо определить. В десятом тесте, например, была симпатичная корова. По каждому тесту ответы команд ранжировались по удалённости от истинного объёма, далее начислялись баллы за первое-третье места: 100, 80, 66; за четвёртое и последующие места: 60-2*место. Каждая команда знала, сколько получила баллов за каждый тест, и имела право раз в час ресубмитить свой вариант.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eНесколько слов о моих впечатлениях. Соревнования оказались очень увлекательны: по духу напоминают участие в тренировочных сборах. Сутки пролетели незаметно, разве что около трёх часов ночи и около шести очень хотелось спать. Полседьмого была зарядка на улице - весьма ободрила! \u003ca href\u003d\"http://picasaweb.google.com/ivanromanov/Budapest\"\u003eБудапешт\u003c/a\u003e оказался очень красивым городом. Всем рекомендую участвовать в следующем году.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003ca href\u003d\"http://picasaweb.google.com/ivanromanov/Budapest\"\u003e \u003cimg src\u003d\"/predownloaded/e8/ec/e8ec4d3e351a8043203e1ea77530e1e4a411760b.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eP.S. \u003ca href\u003d\"http://www.challenge24thelegend.com/2010/result?func\u003dfinal\"\u003eРезультаты\u003c/a\u003e: победили поляки, на втором Венгрия, третьи (с существенным отрывом) словаки, четвёртые шведы (в составе \u003cspan style\u003d\"font-family: Tahoma , Arial , sans-serif;font-size: 13.0px;\"\u003eFredrik Niemelä, организатор финала в Стокгольме в 2009), пятые ЮАР+ЮАР+UK (включая Bruce Merry aka bmerry), шестые - Сербия, седьмые - Венгрия+Венгрия+Сербия, восьмые - словаки, девятые - немцы, десятые - мы, одиннадцатые - Львовчане, всего приехало 28 команд.\u003c/span\u003e\u003c/p\u003e\u003c/span\u003e\u003c/div\u003e","tags":["budapest","challenge24","contest"]}}