{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1271319336,"rating":4,"authorHandle":"valergrad","modificationTimeSeconds":1271503680,"id":302,"title":"Code Game Challenge - Добро пожаловать!","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eВ этом году в рамках открытого кубка ВолГУ по программированию пройдет Code Game Challenge.\u003cbr /\u003eОн создан студентами Волгоградского Политеха, у них уже есть опыт создания CGC, можете убедиться здесь http://habrahabr.ru/blogs/sport_programming/71355/, тут есть два ролика про их прошлые проекты, здесь же можно почитать что такое CGC, для тех кто не знает.\u003cbr /\u003eВ этом году мы решили пригласить всех желающих принять участие в нем онлайн. Таким образом, любой желающий поучаствовать в нашем CGC, должен будет прислать мне до воскресенья в личку сообщение, с именем команды, списком участников ( от 1 до inf), желаемым логином и паролем.\u003cbr /\u003eСам CGC состоится 18-го апреля, воскресенье, с 11.00 до 16.00.\u003cbr /\u003eСсылка на документацию по CGC будет доступна здесь в субботу с 15.00, для ознакомления.\u003cbr /\u003e\u003cbr /\u003eИтак, что за CGC будет в этом году?\u003cbr /\u003eЭто будет реал-тайм стратегия, немного похожая на игру в старкрафт за терранов. У каждого компьютерного противника будет база и возможность построить большое количество различных по своим возможностям юнитов на собранные специальными юнитами кристаллы. Т.е. в отличие от всех  CGC, которые я видел,  где вы управляете в основном одним юнитом, здесь количество юнитов у каждой стороны может быть довольно внушительным, причем разного типа. Массовые кровопролитные бои неизбежны :) Дальнейшие подробности пока раскрывать не будем.\u003cbr /\u003e\u003cbr /\u003eК сожалению,  наш CGC поддерживает только С++, так что приносим извинения тем, кто на нем не пишет, но у них поучаствовать не получится. Также, тем кто не пользуется Windows, тоже не получится поучаствовать, т.к. используется механизм Dll-ок.\u003cbr /\u003e\u003cbr /\u003eШоу будет проведено дважды. Один раз - только для Волгоградских команд 30-го апреля, на закрытии открытого кубка. Второй раз - для всех команд, если, конечно, будут иногородние участники.\u003cbr /\u003eДля второго шоу сделаем ролик, и выложим его на youtube. Это, конечно, не самый лучший способ, если кто-то расскажет, как нам настроить трансляцию изображения на какой-либо сервер, который \u003cbr /\u003eвозьмется параллельно ретранслировать его для всех желающих посмотреть шоу он-лайн - тогда попробуем. Сами мы ретранслировать при большом количестве участников не сможем, у нас не такой широкий канал.\u003cbr /\u003e\u003cbr /\u003eДальнейшие подробности будут появляться здесь походу. Задавайте вопросы, регистрируйтесь, welcome!\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eДокументацию по CGC с описанием юнитов и интерфейсов можно скачать здесь\u003cbr /\u003ehttp://sp.vgg.ru/files/CGC.doc\u003c/div\u003e","tags":["cgc","tags","соревнования"]}}