{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1292507485,"rating":34,"authorHandle":"Nerevar","modificationTimeSeconds":1292843241,"id":960,"title":"WCS Online Olympiad Results","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/baloons.png\" style\u003d\"float: left;margin: 0.0pt 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e  \u003cp\u003e Let me say the customary phrase \u0026quot;The series of school online Olympiads have ended!\u0026quot; \u003c/p\u003e   \u003cp\u003e The organization of all the Olympiads was supported by \u003ca href\u003d\"http://yandex.ru\"\u003eYandex\u003c/a\u003e and \u003ca href\u003d\"http://abbyy.ru\"\u003eABBYY\u003c/a\u003e companies. Overall 6 competitions took place, three team Olympiads and three individual ones. It is now high time we looked at the results and found the Olympiad winners. The two nominations (team contests and individual contests) were ratified individually – in each of them the results of the participants’ best two of three performances. Here are the links to the total results in each nomination: \u003c/p\u003e  \u003cul\u003e \u003cli\u003e\u003ca href\u003d\"//codeforces.com/summary/zksh-2011-teams\"\u003eteam contests’ results\u003c/a\u003e\u003c/li\u003e \u003cli\u003e\u003ca href\u003d\"//codeforces.com/summary/zksh-2011-individuals\"\u003eindividual contests’ results\u003c/a\u003e\u003c/li\u003e \u003c/ul\u003e  \u003cp\u003e  Overall about 750 participants from all over the world had been registered during the series. Of course, the majority of them were Russian participants. As we can see, about 180 teams took part in the team contests and more than 400 school students took part in the individual contests. \u003c/p\u003e\u003cdiv\u003eAfter discussion with the WCS organizers the results were decided to be calculated in the following manner. In the team contests 34 best teams (that scored more than 175 points) are rewarded. Among them\u003cbr /\u003e  \u003cul\u003e     \u003cli\u003e8 best teams receive first degree certificates:         \u003col\u003e             \u003cli\u003eGennady Korotkevich team (Gomel, Belarus)\u003c/li\u003e             \u003cli\u003ePhTL №1 #1 (Saratov, Russia)\u003c/li\u003e             \u003cli\u003edespise_oimaster team (China)\u003c/li\u003e             \u003cli\u003eMinsk-1 team (Minsk, Belarus)\u003c/li\u003e             \u003cli\u003eLIT: LIT_1 team (Alexandria, Ukraine)\u003c/li\u003e             \u003cli\u003eFisher is a ball! team (Perm, Russia)\u003c/li\u003e             \u003cli\u003eGomel-2 team (Gomel, Belarus)\u003c/li\u003e             \u003cli\u003eMozyr-1 team (Mozyr, Belarus)\u003c/li\u003e         \u003c/ol\u003e     \u003c/li\u003e     \u003cli\u003eThe teams that win places form 9th to 19th receive second degree certificates.\u003c/li\u003e     \u003cli\u003eAnd the teams that win places from 19th to 33rd receive third degree certificates (note that the 33rd place is divided between two teams).\u003c/li\u003e \u003c/ul\u003e  \u003cp\u003e \u003c/p\u003e \u003cbr /\u003e\u003cdiv\u003eAlso the individual contests’ results have been calculated. We have to single out Gena Korotkevitch, who swept to victory and won a well- earned Cornel Medal of \u0026quot;the best school contest participant of 2010\u0026quot;!\u003c/div\u003e\u003cp\u003e 71 individual contest participants will receive certificates. The certificates are divided as follows: \u003c/p\u003e  \u003cul\u003e     \u003cli\u003eeleven best participants receive the first degree certificates:         \u003col\u003e             \u003cli\u003eGennady Korotkevich (Gomel, Belarus)\u003c/li\u003e             \u003cli\u003eTaras Klaskovsky (Minsk, Belarus)\u003c/li\u003e             \u003cli\u003ePavel Kunyavsky (Saratov, Russia)\u003c/li\u003e             \u003cli\u003eSue Shen (Changsha, China)\u003c/li\u003e             \u003cli\u003eAli-Amir Aldan (Almaty, Kazakhstan)\u003c/li\u003e             \u003cli\u003eYuQing Ai (Changsha, China)\u003c/li\u003e             \u003cli\u003eSerj Nagin (Alexandria, Ukraine)\u003c/li\u003e             \u003cli\u003eSergey Kulik (Mozyr, Belarus)\u003c/li\u003e             \u003cli\u003eAnton Kovsharov (Gubakha, Russia)\u003c/li\u003e             \u003cli\u003eAlaxey Gordeev (Perm, Russia)\u003c/li\u003e             \u003cli\u003eTom Chen (China, Hangzhou)\u003c/li\u003e         \u003c/ol\u003e    \u003c/li\u003e    \u003cli\u003ethe participants that win places form 12th to 36th receive second degree certificates,\u003c/li\u003e    \u003cli\u003eand the participants that win places form 37th to 70th receive second degree certificates (and yet again the last place for which the third degree certificate is received is divided between two participants!).\u003c/li\u003e \u003c/ul\u003e  \u003cp\u003e The Olympiad jury committee did a lot of work preparing fascinating tasks and answering the participants’ questions patiently. The jury consisted of a united group of students, postgraduates and employees of Saratov State University. The list of those who helped to prepare and conduct the Olympics is as follows: Natalia Bondarenko, Artem Rakhov, Nickolay Kuznetsov, Mikhail Mirzyanov, Gerald Agapov, Edward Davtyan, Polina Bondarenko, Ivan Fefer, Maxim Ivanov, me and our interpreter Maria Belova who makes our problems understandable not only for the Russian-speaking participants.\u003c/p\u003e  I thank everybody for taking part in the competitions and for their interest in the Olympiads!\u003c/div\u003e\u003c/div\u003e","tags":["school olympiad","wcs","yandex"]}}