{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1271098495,"rating":18,"authorHandle":"L.I.S.","modificationTimeSeconds":1271298788,"id":287,"title":"ЧУ 2010","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003e11 апреля завершился 14 Открытый чемпионат Урала по спортивному программированию, который проводится в Ургу. В этом году участников стало еще больше (приехало 54 команды), в частности, вдохновленные прошлогодней победой ИТМО (которые в этот раз приехали в составе сразу двух команд), приехали СПбГУ, а также добавились МГУ и Алтайский госуниверситет.\u003cbr /\u003e\u003cdiv\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eТакже как и в прошлый раз, чемпионат проходил три дня. Первый день - пробный тур, затем игровой, ну и на третий день - основной тур. Организаторы как всегда старались придумать что то необычное.\u003c/div\u003e\u003cdiv\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eПеред пробным туром, на регистрации выдали буклетики и футболки, которые на этот раз были в пределах размеров программистов, и мне наконец то досталась М-ка - на прошлом ЧУ мне досталась XL, в которую может поместится 2.5 таких программиста как я. Потом в комплект добавились ручка, блокнотик, и кубик-рубика 2х2 от яндекса. Еще выдали бумажки на которых были отмечены места с Екатеренбуржской игры Бегущий человек (лично в нашем городе это называется дозор, где люди бегают по городу, и ищут нужные места, которые не всегда просто найти), и нам сказали что эти бумажки нам завтра понадобятся. Ну мы недолго думая поняли что это вполне может быть как то связано с игровым туром, ну и решили пройтись по паре мест. На листочке было написано что особо стоит найти два места: 1 - номер подъезда в котором находится заданная квартира, в заданном доме (туда мы пойти не решились), и 2 - год изготовления люка телефонного общества, который находится на перекрестке ул Малышева и Горького. Интересно, пешеходы очень удивлялись, когда видели нас, счищающими пыль с люка на дороге, чтобы посмотреть дату его изготовления?\u003c/div\u003e\u003cdiv\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eПотом было открытие, на котором как всегда Леонид Волков толкал свою пламенную речь. Оно прошло немного скучновато, скорее всего потому что проходило оно не в актовом зале, и поэтому было очень душно. В это время в актовом зале проходила какая то встреча оксфордских студентов, на которую я посередине встречи как ни в чем не бывало ввалился, и даже успел посидеть пару секунд, пока до меня не дошло, что я оказался не в том месте, и под возмущенные взгляды покинул зал. Правда на открытии очень порадовали слова Магаза Оразкимовича Асанова про студентов ИТМО: \u0026quot;В этом зале сидят чемпионы Урала и мира, и каждый из вас может их побить.\u0026quot;\u003c/div\u003e\u003cdiv\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eНа пробном туре первой задачей шла стандартно a + b. Второй задачей была викторина, которая в этот раз была посвящена спорту. Если кто-то не знает что это такое - просто даются вопросы с четырмя вариантами ответа, и нужно просто на запрос в виде номера вопроса вывести правильный вариант ответа. Вопросы в тестах идут по порядку, так что вопросы на которые не знаешь ответа можно решать перебором. На этот раз было около 20 вопросов. Интересно было посмотреть насколько программисты дружат со спортом. Таблица результатов к сожалению не сохранилось, но видеть как некоторые команды сдают викторину с +20 было весело. На самом деле по настоящему сложным оказался только один вопрос, из-за которого мы сдали задачу с +3, \u0026quot;в каком виде спорта Россией была завоевана первая золотая олимпийская медаль\u0026quot;, среди ответов было фехтование, борьба, стрельба и фигурное катание. Как потом сказал Александр Ипатов на разборе пробного тура, вопрос можно было решать так: \u0026quot;так как зимние олимпийские игры проходят только с 24 года, а искусственного льда раньше не было, то вариант с фигурным катанием можно было отбросить и перебрать все остальные, и получить +3.\u0026quot; Оказывается раньше летние олимпийские игры проводились около полгода поэтому успевал появляться лед. В общем правильным в оказался вариант с фигурным катанием. Третья задача была немного нестандартной. Вася написал программу которая сортировала массив, ниже приводилась программа на Java, реализующая qsort (Вася наверно настолько суров, что пишет qsort руками), на вход подавался массив, ну и необходимо было выдать вердикт, который бы выдала тестирующая система в ответ на работу Васиной программы. Хотя эту задачу сдали 3 команды я так и не понял что же там нужно было выводить. Оказывается при переполнении стека ML случается раньше чем Stack Overflow. На разборе сказали, что вроде как вердиктов TL и ML быть вообще не должно было, но прежде чем они успели исправить тесты, задачу уже сдала команда СПбГУ Drink Less. В общем java runtime не настолько предсказуема, как я раньше думал.\u003c/div\u003e\u003cdiv\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eНа второй день проходил игровой тур, параллельно с ним проходил турнир тренеров, который представлял из себя \u0026quot;физическую версию\u0026quot; игрового тура участников. В этот раз он длился 4 с половиной часа,  и каждая команда вполне могла успеть написать хоть как то работающего бота. Правда на этот раз, видимо прислушавшись к критике, правила не стали выдавать заранее. Игра оказалась очень простой, называется она прорыв, и представляет из себя разновидность игр на шахматной доске. Игра мало известная, но не так давно она заняла первое место на контесте игр для шахматной доски 8х8. Играть нужно пешками которые изначально расставлены в два ряда, и могут рубить соперника, как обычные пешки, либо ходить на одну клетку вверх, вверх-влево или вверх-вправо. Цель игры - дойти до противоположного края доски, либо убить всех пешек соперника. Лично мы немного модернизировав бота для тестирования, принялись писать что то сложное, и когда до конца осталось около получаса, и наш бот падал делая неверные ходы, мы поняли что отдебажить его будет очень сложно, поэтому бросили все и начали писать бота попроще, которого дописать так и не успели. В результате наш бот даже не вышел в плейофф.\u003c/div\u003e\u003cdiv\u003e\u003cimg src\u003d\"/predownloaded/da/0a/da0a853726a148a4edb85cf23d702173c34068e1.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv style\u003d\"text-align: center;\"\u003eКоманда СПбГУ ИТМО пишет бота Eat more который займет второе место.\u003c/div\u003e\u003cdiv style\u003d\"text-align: center;\"\u003eНаверное мало кто, увидев данную фотографию скажет \u0026quot;О да там же вторая команда \u003c/div\u003e\u003cdiv style\u003d\"text-align: center;\"\u003eМагнитогорского ГТУ\u0026quot;\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eСобственно, как я уже сказал, параллельно проходил турнир тренеров, результы:\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003col\u003e\u003cli\u003eАндрей Лопатин\u003c/li\u003e\u003cli\u003eЮрий Айдаров\u003c/li\u003e\u003cli\u003eАндрей Станкевич\u003cbr /\u003e\u003c/li\u003e\u003c/ol\u003e\u003cimg src\u003d\"/predownloaded/8d/0a/8d0af97cf3fbf245912107e30657e995e06ff84e.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003cbr /\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eПока подводились итоги игрового тура, прошел турнир что? где? когда?. Победителей я не помню. Помню только что наша команда оказалась на последнем месте. На самом деле очень сложные вопросы после прочтения ответа становились очень простыми, что очень мне напомнило аналогичную ситуацию с олимпиадными задачками.\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eДальше прошло собственно подведение итогов игрового тура. Оно получилось довольно забавным. Очень весело было смотреть как пешка доходя до предпоследней клетки вдруг останавливалась и начинали совершатся намного менее логичные ходы. Так же очень понравилось как Алексей Самсонов а-ля Дмитрий Губерниев, коментировал каждый шаг соперников. На самом деле сразу было видно финалистов. Бот СПбГУ ИТМО как танк шел строго горизонтально постепенно продвигая свои пешки к границам соперника. А бот команды СПбГУ Drink Less (как выяснилось потом использующий рекурсию на 6 ходов вперед) легко находил брешь в защите соперника. В итоге в финале, как сказал Алексей Самсонов, мы узнали, \u0026quot;что нужно Больше Есть или Меньше Пить\u0026quot;. После победы Drink Less, состоялась битва лучшего игрока среди тренеров, с лучшим ботом. По случайности им оказался Андрей Лопатин, который является тренером команды Drink Less. Правда на этот раз Андрей был поставлен в равные условия с ботом и у него так же был TL 3 секунды. В итоге после двух партий, с небольшим счетом, искусственный интеллект все же превзошел человеческий.\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003e\u003cimg src\u003d\"/predownloaded/95/0a/950a151579cf42e9c37d1cbce21fd9eb6edd5621.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/div\u003e\u003cdiv style\u003d\"text-align: center;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eБитва учителя с учениками, человеческого интеллекта с машинным.\u003c/div\u003e\u003cdiv style\u003d\"text-align: center;\"\u003eСудя по результатам, сценаристы терминатора и матрицы не далеки от правды.\u003c/div\u003e\u003cdiv style\u003d\"text-align: center;\"\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e\u003c/span\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eНа третий день был назначен основной тур. Задачи на ЧУ всегда отличаются своей \u0026quot;необычностью\u0026quot;, но в этот раз они по моему были более необычны чем когда либо, собственно их можно посмотреть на тимусе. Как сказал на подведении итогов Алексей Самсонов: \u0026quot;Стандартные задачи мы обычно стараемся давать на отборочных четвертьфиналах и чемпионатах Ургу, а на ЧУ постепенно накапливаются своеобразные гробики. В этот раз не было наверное ни одной халявной задачи, т.к. столько нулей не было очень давно.\u0026quot; На самом деле некоторые задачи мне очень понравились, хоть они и не были сложными. Вот \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d79\u0026amp;num\u003d7\"\u003eэта\u003c/a\u003e, которую сдало большинство команд, понравилась больше всех. Так же понравилась, задача \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d79\u0026amp;num\u003d11\"\u003eметро\u003c/a\u003e, которая изначально задумывалась как шредер. Алексей Самсонов сказал что они хотели разрезать ее и положить в конверт частями, чтобы участник прежде чем решить задачу программно, должен был решить ее физически, но все таки авторы решили не издеваться над участниками, но лично мне идея показалась очень забавной. Была и задача, \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d79\u0026amp;num\u003d1\"\u003eкоторую\u003c/a\u003e, как и задумывалось, никто не сдал. \u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eНа самом деле для нас этот контест оказался не очень удачным. Первой я начал решать \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d79\u0026amp;num\u003d6\"\u003eзадачу\u003c/a\u003e F, которая оказалась не настолько простой для меня, как кажется на первый взгляд. На самом деле, я до сих пор не могу ее сдать. WA по простой задаче в начале контеста получать очень обидно, особенно когда никакой мелкий тест не помогает выявить ошибку, а для генерации больших тестов нужно писать программу, либо возится с калькулятором, теряя драгоценное время. В итоге после нескольких неудачных посылок и изрядно упавшего настроения, на втором часе мы перешли к другим задачам. Но наверное зря я поддался упадкам настроения, потому как мозг уже на втором часе отказывался подключатся к кодингу, и пришлось писать \u0026quot;чисто руками\u0026quot;, если кто понимает такое состояние. Как результат только 33 место.\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eНа самом деле видя замороженную таблицу ни у кого не оставалось сомнений в том, что победит Питер. Стоял лишь вопрос, либо ИТМО 1 либо Drink Less. Собственно говоря финалисты игрового тура, замерли в верхних строчках таблицы. Но ИТМО 1 все таки сдали на одну задачу больше и , прошлогодние чемпионы ЧУ 2009, стали \u003ca href\u003d\"http://acm.usu.ru/chu/2010/monitor/monitor.html\"\u003eпобедителями\u003c/a\u003e ЧУ 2010. \u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cimg src\u003d\"/predownloaded/2b/be/2bbea80f729110747845f9f2763c1c3ec83ceaf3.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003e2 Место - СПбГУ Drink Less\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003e3 Место - СПбГУ ИТМО 2\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eВ общем Питер увез все призовые места.\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003eДальше прошло награждение. Награждали традиционно книгами футболками и, на этот раз музыкальными инструментами. Очень забавно было видеть Капуна с бубном, который он так долго выбирал. Ну а дальше также традиционно был фуршет, правда на этот раз было очень приятно что он проходил не в тесной аудитории а в столовой, ну и на этом ЧУ 2010 завершился.\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eЕдинственное что не понравилось, это обеды за 110 рублей. Не знаю почему цены на столовую постоянно растут (видимо на этот раз это связано с оксфордскими студентами), но стандартный суп, картошка и гуляш, салат, компот, в соседнем буфете дополняется еще одним компотом и вкусной булочкой за те же деньги, но это все мелочи.\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eИтог: если кто еще не был на ЧУ обязательно приезжайте на следующий год, не пожалеете, правда если хотите к нему хорошенько подготовится, нужно забивать на стандартные комплекты задач, и решать побольше задач с Тимуса, так сказать Уральской направленности.\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cspan style\u003d\"white-space: pre;\"\u003e \u003c/span\u003eФоторепортаж и другие материалы можно посмотреть на \u003ca href\u003d\"http://acm.usu.ru/chu/2010/index.html\"\u003eофициальном сайте соревнования\u003c/a\u003e.\u003c/div\u003e\u003cdiv style\u003d\"text-align: justify;\"\u003e\u003cbr /\u003e\u003c/div\u003e\u003c/div\u003e","tags":["чемпионат урала 2010","чу 2010"]}}