{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1264999198,"rating":12,"authorHandle":"OSt","modificationTimeSeconds":1265098762,"id":28,"title":"Не спалось.","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЕсли уж писать в блог - то всё, о чем думаю и чем живу :)\u003c/p\u003e \u003cp\u003e \u003c/p\u003e \u003cp\u003eВчера тренер прислал список задач для решения в течении недели.7   задач на неделю. \u003c/p\u003e \u003cp\u003eСтранно, но спать ночью явно не хотелось, возможно потому, что сосед   по комнате расположился на моей кровати, вместо своей :) Будить его не стал.\u003c/p\u003e \u003cp\u003eРешил попробовать порешать. \u003c/p\u003e \u003cp\u003eСперва взялся за математическую задачу про \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1698\"\u003eавтоморфные   числа\u003c/a\u003e. Сперва идей не было вообще, даже которые можно было бы   реализовать преподсчетом. После курения литературы была найдена   теорема, которая и помогла написать прекалк, работающий около 2 минут   и в результате задача была сдана с 1 раза.\u003c/p\u003e \u003cp\u003eСледом за ней отправилась задача про \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1008\"\u003eКодирование   изображений\u003c/a\u003e. Где то около получаса моск пытался понять - чего от   него хочет автор задачи и я в 5 утра. Потом он соизволил включиться и   я быстро написал решение через BFS и сдал его тоже  с 1 попытки.   Даже не отлаживал.\u003c/p\u003e \u003cp\u003eСтал уже поглядывать на часы - скоро надо было бы   \u0026quot;вставать\u0026quot; в ВУЗ.\u003c/p\u003e \u003cp\u003eПоследним аккордом ночной деятельности стала задача про \u003ca href\u003d\"http://acm.timus.ru/problem.aspx?space\u003d1\u0026amp;num\u003d1291\"\u003eШестерёнки\u003c/a\u003e.   Сразу было видно, что там примитивный обход графа, НО там надо было   опять грамотно построить работу с дробным видом скоростей. Я уже имел   печальный опыт работы с ними, так что особого желания вспоминать его   не было. Немного подумав, решился всё-таки написать. Оказалось, что я   помню все грабли и смог их обойти. Первая попытка отправки - и WA 11.   Посмотрев на код понял, что есть случай, когда та самая дробь может   вообще не быть создана и следовательно выводило null. Пара ударов по   клавиатуре и задача тут же получает AC. \u003c/p\u003e \u003cp\u003eУставший и не выспавшийся, но довольный сейчас пойду в ВУЗ.\u003c/p\u003e \u003ch1\u003e   \u003cstrong\u003ePS:\u003c/strong\u003e\u003c/h1\u003e \u003cp\u003eВстретил в ВУЗе тренера, обсудили решенные задачи. Сказал что не   плохой результат и по времени и по штрафу, особенно если учитывать ,   что всё сдавалось с 5 до 7 утра.  :) И я вполне не плохо выглядел   для человека, не спавшего более 30 часов. Хе. Видел бы он меня на паре   ДО этого ;)\u003c/p\u003e \u003cp\u003eКак пришёл - вырубился почти на 17 часов. Зато полностью восстановил   свои силы и готов дальше работать. На очереди написание программы на   Java на тему \u0026quot;Рисование текстурированного куба    вращающегося  мышкой с учётом интенсивности освещения\u0026quot;.   Продолжаю писать свою графическую библиотеку для сего задания.\u003c/p\u003e\u003c/div\u003e","tags":["acm-icpc","bfs","java","комьютерная графика","сон","тимус"]}}