{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1268402584,"rating":13,"authorHandle":"hadi","modificationTimeSeconds":1268403143,"id":161,"title":"Codeforces Beta Round #4","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003eToday I participated in my first codeforces contest. The problem-set was quite easy. \u003cbr /\u003e\u003cbr /\u003eHere are how I solved the problems:\u003cbr /\u003e\u003cbr /\u003e\u003cb\u003eProblem A: \u003c/b\u003eThe answer is \u0026quot;NO\u0026quot; if and only if n is either odd or equal to 2, otherwise you can decompose it as (2, n-2).\u003cbr /\u003e\u003cbr /\u003e\u003cb\u003eProblem B:\u003c/b\u003e The answer is \u0026quot;Yes\u0026quot; if and only if sum(minTime) \u0026lt;\u003d sumTime \u0026lt;\u003d sum(maxTime). You can construct a list in this case easily using a greedy method.\u003cbr /\u003e\u003cbr /\u003e\u003cb\u003eProblem C: \u003c/b\u003eStraightforward implementation. I used C++\u0027s std::map to implement this problem.\u003cbr /\u003e\u003cbr /\u003e\u003cb\u003eProblem D: \u003c/b\u003eO(N^2) dynamic programming. DP state is index of last chosen envelope, and loop over for the next envelope.\u003cbr /\u003e\u003cbr /\u003eI didn\u0027t do bad (I became 15th), but I expected better. In fact I could be 3rd if I was a bit careful and read the problem-statement of the last problem more carefully and got it in my first submission at 0:26. I missed that envelope size must be \u003ci\u003estrictly\u003c/i\u003e larger than the card, and thought equal is also okay. I got the submission result about 25 minutes later, and lost lots of penalty time.\u003cbr /\u003e\u003cbr /\u003eThe lessons to learn are:\u003cbr /\u003e1. Read problem statement more carefully,\u003cbr /\u003e2. It\u0027s okay to waste another minute to check everything once more before submission,\u003cbr /\u003e3. Don\u0027t just wait for submission result, re-read the problem statement and your code once more.\u003cbr /\u003e\u003cbr /\u003eI hope to do better in next contests, which I expect to have more difficult problem-sets.\u003cbr /\u003e\u003cbr /\u003eBy the way, congratulations to the winner of the contest, \u003ca href\u003d\"//codeforces.com/profile/Xazker\"\u003eXazker\u003c/a\u003e, who is also \u003ca href\u003d\"http://www.topcoder.com/tc?module\u003dMemberProfile\u0026amp;cr\u003d22705871\"\u003ered at topcoder\u003c/a\u003e.\u003c/div\u003e","tags":["analysis","codeforces beta round #4","postmortem"]}}