{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1265071515,"rating":0,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1265107568,"id":40,"title":"The first day in the Celestial Empire","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv style\u003d\"float: left;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e   \u003cimg alt\u003d\"Перед рейсом\" src\u003d\"//assets.codeforces.com/day3/01-po-doroge.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" title\u003d\"Перед рейсом\" /\u003e\u003c/div\u003e     The flight went well, without any problems. I always regret that I can\u0027t sleep on the plane,  and I envy my fellow passengers the ability to sleep their fill during the flight.  I managed to fall asleep at the beginning of the first flight only, don\u0027t remember how we took off, but didn\u0027t  miss the meal. After that I didn\u0027t sleep at all. The guys seemed to have rested a bit, though, of course, the  rest was far from normal. I tried to derive the meaning of some hieroglyphs by comparing the city names in  English and in Chinese, but even this didn\u0027t help me fall asleep.  \u003cp\u003eWe flew 7 hours to Beijing, and 2 more hours from Beijing to   Harbin. At Sheremetyevo Airport we met several other Russian  teams.   The teams from Samara, Izhevsk, and, it seems, Ural were on the same   plane. And some other teams. Moreover,  we flew with Andrey Styskin,   who works for Yandex, and will take part in the conference in the   context of the contest.  Separate teams could be clearly distinguished   on the plane: 3 young people, each with a laptop, or a netbook.   However there were exceptions.\u003c/p\u003e \u003cp\u003e \u003c/p\u003e \u003cdiv style\u003d\"float: right;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e   \u003cimg src\u003d\"//assets.codeforces.com/day3/04-natasha-na-granice.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/div\u003e \u003cp\u003eIn Beijing we met a team from Moscow, which had already spent 4 days   there. Anton Pankratiev (their trainer) demonstrated  a piece of paper   with the phrase on it:\u0026quot;no pepper, please\u0026quot;, which had been   kindly translated into Chinese for  them by a hotel staff member. They   showed it in restaurants to be on the safe side.  \u003c/p\u003e \u003cdiv style\u003d\"float: left;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e   \u003cimg src\u003d\"//assets.codeforces.com/day3/05-no-pepper.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/div\u003e \u003cp\u003e At the airport we were met by amiable volunteers from the local   University, who asked us friendly to wait for a bus that will take us   to the hotel. On the bus we had to wait again, I think, for the next   flight. The airport turned to be rather far from the city, the journey   took us about an hour. There were no traffic jams on the roads,  or at   least the driver avoided them skillfully. The roads are mature: with   road interchanges, multilane, even and fine. \u003c/p\u003e \u003cdiv style\u003d\"float: right;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e   \u003cimg src\u003d\"//assets.codeforces.com/day3/07-meeting.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/div\u003e \u003cp\u003e The hotel check-in didn\u0027t go quickly, we got a set of warm clothes   each, and went out in search of food. There was a pedestrian street   nearby, but we didn\u0027t have time to go there, and the weather wasn\u0027t   nice. It was about 30 degrees below zero, but in spite of this you   could see smiling Chinese people without hats.  \u003c/p\u003e \u003cdiv style\u003d\"float: left;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e   \u003cimg src\u003d\"//assets.codeforces.com/day3/09-menu.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/div\u003e \u003cp\u003e Having walked around the neighbourhood, we found a genuine Chinese   eatery. A friendly waiter uttered in broken  English \u0026quot;Sit down,   please\u0026quot;, but shortly after it occurred it was the only phrase he   knew. To tell you the  truth, it\u0027s not that easy (but very amusing!)   to order a meal, when no one understands you.  We got a wonderful   menu! All the staff gathered around us, the process amused too. \u003c/p\u003e \u003cp\u003e When we came back to the hotel, we registered for the competition.   Everything went quickly - it wasn\u0027t the first time we  had done that.   For sure, we met other Russian teams. Plenty of familiar faces.  \u003c/p\u003e \u003cbr style\u003d\"clear: both;\" /\u003e\u003c/div\u003e","tags":["2010","acm","acm-icpc","harbin","saratov"]}}