{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1265627936,"rating":0,"authorHandle":"anmalygin","modificationTimeSeconds":1265635316,"id":68,"title":"Часть первая. Патетическая. любовь к dojo","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eНаконец-то добрался до того, чтоб написать обещанное. Прощу прощения за задержку - сплошные траблы с сессией наших студентов (которых у нас кстати обучается 936 человек).\u003cbr /\u003e         Я хотел в этом посте рассказать о плавном переходе нашего приложения с компонент js-фреймворка dojo, на мега-клевую библиотеку пользовательских компонент jsf - richfaces. Но пораскинув умом, понял, что рассказ получится слишком длинный и малочитабельный). Потому сначала расскажу о dojo, который мы использовали целый год и приросли ему все душой.\u003cbr /\u003e \u003ch3\u003eЧасть первая. Патетическая.\u003c/h3\u003e         Каждому из вас, кому приходилось стругать веб-проекты, особенно используя скриптовые языки, рано или поздно приходило в голову вместо собственного java-script, который частенько бывал написан через \u0026quot;пень колоду\u0026quot; использовать готовый  js - фреймворк, который бы и кроссбраузерности позаботился бы и механизм для аджакса и всяких модных эффектов. Вариантов  таких решений достаточно много, от уже заслуженных до амбициозных новичков\u003cbr /\u003e \u003cbr /\u003e \u003cb\u003e1. \u003ca href\u003d\"http://jquery.com/\"\u003ejQuery\u003c/a\u003e.\u003c/b\u003e \u003cbr /\u003e \u003cimg src\u003d\"http://miklb.com/user/files/jquery-logo.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e         Отличная библиотека, простая, активно развивающаяся и весьма популярная в рунете, все мои знакомые фрилансеры для небольших проектов используют ее. Есть куча плагинов и очень симпатичных виджетов. Смотреть   \u003ca href\u003d\"http://jqueryui.com/\"\u003eздесь\u003c/a\u003e        .\u003cbr /\u003e         jQuery мы использовали часто и даже многострадальный \u003ca href\u003d\"http://cc.sgu.ru/\"\u003eсайт ВЦ\u003c/a\u003e         (год назад бывший плацдармом для многочисленных экспериментов)\u003cbr /\u003e \u003cbr /\u003e         2. \u003ca href\u003d\"http://www.extjs.com/\"\u003eExtJS\u003c/a\u003e \u003cbr /\u003e \u003cimg src\u003d\"http://www.keliglia.com/img/avatar/extjs.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e         Очень мощная библиотека. Отличные отлаженны виджеты. Актуальная версия аж 3.1, что внушает. Ну и вообще сделана очень хорошо. В отличие от того же jQuery в стандартной комплектации идет не только ядро, но и всякие рюшки типа виджетов, что делает его весьма тяжеловесным. Используется много где, вроде даже есть webOS, сделанная с использованием его. и еще одна очень навороченная система документооборота, которую я одно время думал использовать. \u003cbr /\u003e \u003cbr /\u003e         3. \u003ca href\u003d\"http://dojotoolkit.org/\"\u003edojo\u003c/a\u003e        . \u003cbr /\u003e \u003cimg src\u003d\"http://dojotoolkit.org/resources/images/dojo.logo.small.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cbr /\u003e         Наша любимая библиотека, прочесанная вдоль и поперек, а потому остановлюсь поподробнее.\u003cbr /\u003e         dojo представляет собой нечто среднее меж двух описанных выше. Он не так громоздок как extJS (даже есть возможность собрать собственную библиотеку только из нужных компонент). В отличие от jQuery в нем по умолчанию уже много чего есть.\u003cbr /\u003e         Вот \u003ca href\u003d\"http://anton.shevchuk.name/javascript/dojo-for-beginners/\"\u003eздесь \u003c/a\u003e        есть хорошая статья для тех, кто хочет познакомится с dojo поближе. Повторять ее не буду, расскажу о субъективных впечатлениях.\u003cbr /\u003e \u003cbr /\u003e \u003cb\u003eДостоинства \u003c/b\u003e \u003cbr /\u003e \u003col\u003e   \u003cli\u003e     \u003cb\u003eХорошее ядро\u003c/b\u003e, вменяемое и достаточно несложно в освоении. 27     Кб в     сжатом виде). правда там мало что есть\u003cbr /\u003e\u003c/li\u003e   \u003cli\u003e     \u003cb\u003eМодульная архитектура\u003c/b\u003e. Модули для разных нужд очень чётко     разграничены (по крайне мере, что мы использовали). И опять таки     повторюсь несложно собрать свою библиотеку, зная что собственно вам нужно.\u003c/li\u003e   \u003cli\u003e     \u003cb\u003eОчень много всего \u003c/b\u003eесть даже компонента для работы с Jabber сервером\u003c/li\u003e   \u003cli\u003eАрхитектура всего dojo состоит из \u003cb\u003e3 основных компонент\u003c/b\u003e\u003c/li\u003e\u003c/ol\u003e \u003cbr /\u003e \u003cbr /\u003e           Об этом поподробнее\u003cbr /\u003e \u003cbr /\u003e \u003cbr /\u003e \u003cb\u003edojo \u003c/b\u003e        - набор базовых классов, работы с DOM, CSS, клевые селекторы и базовые визуальные эффекты\u003cbr /\u003e \u003cb\u003edijit\u003c/b\u003e         - компоненты для построения пользовательских интерфейсов. Панели, деревья, табы, списки, чекбоксы, прогрессбары.. Вообще о этой части надо отдельно говорить, много интересных нюансов и в использовании также. \u003cbr /\u003e \u003cb\u003edojox \u003c/b\u003e        - мой любимый пакет для экспериментальных расширений. Вообще \u003ca href\u003d\"http://dojofoundation.org/\"\u003eDojo Foundation\u003c/a\u003e        , которая занимается развитием проекта судя по всему в самом начале пытались объять вообще все, что можно сделать вебом. Времени на доработку разрозненных компонент не было и многие из них попали в этот пакет, да там и мирно почивают до сих пор. Некоторые (наиболее востребованные) дорабатываются и перекочевывают в другие пакеты. Вообще посмотрев доки этого пакета можно оценить как видит dojo Foundation  будущее веба, и видело его в недавнем прошлом. \u003cbr /\u003e         Из этого пакета мы использовали мультизагрузку для файлов к сообщениями. Сколько было геморроя, трудно описать словами, но смотрелось в конечном итоге довольно эффектно).\u003cbr /\u003e \u003cbr /\u003e         Кстати вспомнился случай. Мы решили сделать небольшой чат на главной странице для моментальной техподдержки студентов. Делать его  c ajax  показалось неинтересно. Решили попробовать технологию \u003ca href\u003d\"http://en.wikipedia.org/wiki/Comet_%28programming%29\"\u003ecomet \u003c/a\u003e        (она позволяет клиенту держать постоянный коннект с сервером и сервак к примеру может добавлять сообщение на страничку как только оно пришло в его очередь). И чтобы вы думали! В dojox была библиотека для поддержки комета. Пришлось основательно перелопатить все, но в конечном итоге месяц назад мы запустили его в тестовом режиме и пока сбоев не было. О мытарствах с запуском comet обязательно расскажу потом еше (или заставлю одного из наших бойцов), ибо было  невероятно забавно преодолевать все препятствия почти при полном отсутствии документации. \u003cbr /\u003e         И вот так мы плавно перешли к недостаткам dojo\u003cbr /\u003e \u003cbr /\u003e \u003cb\u003eНедостатки\u003cbr /\u003e\u003c/b\u003e \u003col\u003e   \u003cli\u003e     \u003cb\u003eдокументация \u003c/b\u003e- это важно, черт возьми, к сожалению dojo     Foundation     не всегда согласен с этим. Когда мы начинали с     документацией было     все вообще грустно. Сейчас ситуация получше,     но, увы, до идеала еще     далеко. Вот \u003ca href\u003d\"http://docs.dojocampus.org/\"\u003eздесь     \u003c/a\u003eофициальная документация \u003c/li\u003e   \u003cli\u003e     \u003cb\u003eКомпонеты из dojox\u003c/b\u003e очень часто нужны, но почти всегда     невероятно глючат. \u003c/li\u003e\u003c/ol\u003e \u003cbr /\u003e         Так пора закругляться. Я к сожалению не о всех джс- библиотеках рассказал, что мы пробовали, но как нибудь в другой раз.\u003cbr /\u003e \u003cbr /\u003e \u003cb\u003eАнонс - Часть Вторая. Сентиментальная. Jsf 2.0\u003c/b\u003e \u003cbr /\u003e\u003c/div\u003e","tags":["dojo","ipsilon"]}}