{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1265029498,"rating":0,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1265107949,"id":33,"title":"Introduction","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv style\u003d\"float: left;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e\u003cbr /\u003e\u003cimg alt\u003d\"The team captain Natalia Bondarenko\" src\u003d\"/predownloaded/d3/cd/d3cdebf317ae735ba1c328edba386e0f9f405955.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" title\u003d\"The team captain Natalia Bondarenko\" /\u003e   \u003cbr /\u003e     The team captain Natalia Bondarenko \u003c/div\u003e   January 30, 2010 the delegation of the Saratov State University is leaving for the World Finals of the International Collegiate Programming Contest. This year it\u0027s held in Harbin (hi, China), and that means that apart from an interesting contest, we have cold weather, ice statues, fried rice with prawns, and as I hope, Beijing Duck.      \u003cp\u003e Our   University will take part in the Contest for the 7th time, and for the   team Saratov SU#1 this will be the 2nd Finals. It seems to be high   time to introduce myself. I\u0027m Mike Mirzayanov, and I\u0027m this team\u0027s   coach (and also all other teams from my university). In reality I\u0027m   the director of Programming Competitions Training Center, but in this   case it doesn\u0027t matter. I became a part of this so-called olympic   movement quite long ago, but since that time I\u0027ve managed to take part   in the finals of the ICPC, and in the finals of Google Code Jam, and   onsite competitions by TopCoder (TCO and TCCC both). In brief, I do   know what computer programming competitions are, but we won\u0027t speak   about me. \u003c/p\u003e \u003cp\u003e We will speak about our team Saratov SU#1 and their participation in   the coming World Finals. I plan to write a series of articles about   our trip to China. No one knows, on whom Lady Luck will smile, and   whether we\u0027ll return triumphant or defeated, but I hope my account   will seem interesting to someone. Any questions? Ask them in your   commentaries, and I\u0027ll answer them with pleasure.  \u003c/p\u003e \u003ch3\u003eWhere does Saratov SU#1 come from?\u003c/h3\u003e \u003cp\u003e Of course, the main characters of my narration are the team. Some   Universities\u0027 teams have high-sounding and complicated names (SPb SU   Drink Less, or vice versa Ural SU Wine, or one more example: Izhevsk   STU Imba КТО НАСОС (WHO IS THE PUMP)), we have simpler names. Each   team is given a number, and it is the same while the team consists of   almost the same members. \u003c/p\u003e \u003cdiv style\u003d\"float: right;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e   \u003cimg alt\u003d\"Stan Pak\" src\u003d\"/predownloaded/63/a8/63a8d7b5058cd582a55ae834ceae092f1aa7aa8f.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" title\u003d\"Stan Pak\" /\u003e   \u003cbr /\u003e     Stan Pak \u003c/div\u003e \u003cp\u003e Saratov SU#1 was born the distant year of 2005, and consisted of   Natalia Bondarenko, Stanislav Pak, and Alexander Zabrodin. None of   them, apart from Natasha, had had any considerable experience of   winning programming competitions in school years. Natasha, being in   the 11th form, took the11th prize at the All-Russia Olympiad in   Informatics (in Novosibirsk), and took part in zone tours of   all-Russia Olympiad in Mathematics. Stas showed good results at   regional Math contests, but nothing more. By 2005 he was already the   second-year student, but had not demonstrated any extraordinary   achievements. I hadn\u0027t known the surname Zabrodin until 2005. \u003c/p\u003e \u003cp\u003e In 2005 they were \u003ca href\u003d\"http://neerc.ifmo.ru/past/2005/standings-with-time.html\"\u003ethe     46th in the NEERC\u003c/a\u003e. That year Saratov SU#2 advanced to the World   Finals, that was the team that became World Champions at the 30th ICPC   in Texas. But it\u0027s a different story. \u003c/p\u003e \u003cp\u003e By that time Dima Matov had improved his programming skills and   started to train assiduously. The results came quickly, and by summer   2006 he was one of our best students. At that time Sasha Zabrodin left   the Programming Centrer, as well as trace in our memories thanks to   the song on the tune of \u0026quot;Hunter\u0026quot; by Korol i Shut (famous   Russian punk band): \u003c/p\u003e \u003cdiv style\u003d\"padding-left: 8.0em;\"\u003e Но вдруг из темноты раздался   рев,\u003cbr /\u003e Затем с петель слетела в доме дверь.\u003cbr /\u003e За шумною   толпой\u003cbr /\u003e Бежал огромный страшный зверь.\u003cbr /\u003e  Zabrodin,\u003cbr /\u003e   Zabrodin,\u003cbr /\u003e Zabrodin,\u003cbr /\u003e Zabrodin Alexander!\u003cbr /\u003e\u003c/div\u003e \u003cp\u003e In season 2006-2007 the team got a new member, Dima Matov was taken   to the team instead of Sasha Zabrodin. The results were immediate, at   summer 2006 training session in Petrozavodsk regularly they showed   better results than Saratov SU#3, the strongest team at that moment:   Goldstein, Klimov, Nazarov. Instructors of other teams say:\u0026quot;At   first from Saratov the strongest was Saratov SU#3 (Elterman, Lazarev,   Mirzayanov), then Saratov SU#2 (Alekseenkov, Kulkin, Romanov) became   the champions, and now it\u0027s Saratov SU#1\u0026quot;. I intend to name our   next team Saratov SU#0. \u003c/p\u003e \u003cdiv style\u003d\"float: left;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e   \u003cimg alt\u003d\"The coach and Dmitry Matov\" src\u003d\"/predownloaded/4d/e1/4de1ccea9e70942ba7941538b49ef4b3b51ce86e.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" title\u003d\"The coach and Dmitry Matov\" /\u003e   \u003cbr /\u003e     The coach and Dmitry Matov \u003c/div\u003e \u003cp\u003e But not everything went smoothly. I\u0027ll list the positions Saratov   SU#1 took at semi-finals: 2006 - 26th, 2007 - 22nd. Of course, in 2007   everyone expected the team to advance to the finals. That year they   were competing with Saratov SU#4 (Klenov, Denisov, Mescheryakov).   Sergei Nazarov at those semi-finals told to the team\u0027s head Antonina   Gavrilovna Fedorova: \u0026quot;Don\u0027t worry. One of the teams will advance   to the World Finals for sure\u0026quot;. But none of them went to the   finals.   \u003c/p\u003e \u003cp\u003e In summer 2008 the team changed its work strategies, and benefited   from this. Before that all the team members had had the same roles,   looking for the solution together, and according to the new strategies   Dima Matov became the main coder , Natasha focused on the algorithms,   and Stas validated her ideas, focused on complicated statements,   tricky things, and helped Dima with implementation (a typical pair   programming, but without the role changes). The team sticks to this   scheme nowadays. \u003c/p\u003e \u003cp\u003e Autumn 2008 was a very tense period. Dmitry Klenov didn\u0027t want to   miss the chance to go to the World Finals, so, Saratov SU#2: Klenov,   Ivanov, Rakhov trained hard, improving their results. We all went to   the semi-finals and knew that it was impossible to say for sure which   of Saratov teams would show the best results. The competition was   really interesting and tough, the outcome pleased everyone. Saratov   SU#1 won the semi-finals and became the champions of Russia and the   North-East European region. Saratov SU#2 took the 4th prize. Here are   the top five teams of the 2008 semi-finals: \u003c/p\u003e \u003ccenter\u003e   \u003ctable style\u003d\"border-collapse: collapse;\"\u003e     \u003ctbody\u003e       \u003ctr\u003e         \u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003e1           \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003eSaratov           SU #1: Bondarenko, Matov, Pak \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003e9           \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003eproblems \u003c/td\u003e\u003c/tr\u003e       \u003ctr\u003e         \u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003e2           \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003eMoscow           SU ST: Angelyuk, Astakhov, Maksimenko \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003e9           \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003eproblems \u003c/td\u003e\u003c/tr\u003e       \u003ctr\u003e         \u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003e3           \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003eMoscow           SU Unpredictable: Gusakov, Kornakov, Razenshteyn \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003e9           \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003eproblems \u003c/td\u003e\u003c/tr\u003e       \u003ctr\u003e         \u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003e4           \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003eSaratov           SU #2: Ivanov, Klenov, Rakhov \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003e9           \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003eproblems \u003c/td\u003e\u003c/tr\u003e       \u003ctr\u003e         \u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003e5           \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003eSPb           SU Burunduchki: Davydov, Kopeliovich, Petrov \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003e8           \u003c/td\u003e\u003ctd style\u003d\"border-collapse: collapse;border: 1.0px solid black;padding: 0.25em;\"\u003eproblems \u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/center\u003e \u003cp\u003e The team prepared assiduously for the long-expected finals,   demonstrating various results. \u003ca href\u003d\"http://codeforces.ru/blog/entry/2\"\u003eI\u0027ve already written\u003c/a\u003e   how the World Finals in Stockholm went. Well done! The results of 2008   were marvelous. \u003c/p\u003e \u003cdiv style\u003d\"float: right;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e   \u003cimg alt\u003d\"Vladimir Yakunin\" src\u003d\"/predownloaded/c3/04/c3043d1b11e88da80387c82c950a704814f0d103.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" title\u003d\"Vladimir Yakunin\" /\u003e   \u003cbr /\u003e     Vladimir Yakunin \u003c/div\u003e \u003cp\u003e Meanwhile the season 2009-2010 was coming, the last in the team\u0027s   history. The contest has strict age limitations, limitations on the   number of participations, etc. for each member of a team, according to   them our team was heading for its last season. \u003c/p\u003e \u003cp\u003e At summer training session in Petrozavodsk the team showed the 4th   result in Russia, the results of the 2nd, 3rd and 4th positions being   very close. They won the experimental Finals of Open Cup, and the   whole Open Cup in season 2008-2009 (right you are, Oleg, they\u0027re still   waiting for their prizes). On the whole, nothing boded ill. \u003c/p\u003e \u003cp\u003e Troubles came unexpected, several days before the 2009   Quarter-Finals. After careful calculations it occurred that Stas Pak   had already participated in the quarter-finals 5 times, and he   couldn\u0027t compete any more. Finita la comedia. Changes in the team   membership. \u003c/p\u003e \u003cdiv style\u003d\"float: left;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e   \u003cimg src\u003d\"/predownloaded/ea/e9/eae970351820b2568062ecdee9e7f3a2c71caf03.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e   \u003cbr /\u003e     Team advisor and CS\u0026amp;IT department dean \u003cbr /\u003e   Antonina Fedorova \u003c/div\u003e \u003cp\u003e It should be mentioned that all the three faced the news heroically.   The team\u0027s head Antonina Fedorova and me feared that such a turn would   break the  competitive spirit, but this didn\u0027t happen. There were   several days left before the quarter-finals, thus the decision about a   new member had to be taken immediately. We thought over different   variants. The problem was that admittedly it was no good splitting the   team Saratov SU#2:Ivanov, Kreis, Rakhov, because they formed a   powerful team together. Moreover at that time Natasha came down with   the flu, and couldn\u0027t take part in the trainings for some time. \u003c/p\u003e \u003cp\u003e Finally, we agreed on my candidate. The fact was that Saratov SU#3:   Goldshtein, Nazarov, Yakunin (participants of the 2005 World Finals)   had stopped participating in the contests by that time, but one of its   members, Vova Yakunin, had left the team earlier, in 2005. In 2005 he   stepped away from the olympic movement, participating in TopCoder   contests from time to time. But as you know, talent can\u0027t be lost or   sold, and Vova accepted our offer to return to the limelight with   great enthusiasm, and other team members spoke highly of their only   training with him. Meet he new members of Saratov SU#1: Bondarenko,   Matov, Yakunin. One of the trainers from the Ural State University   expressed his opinion: \u0026quot;Saratov works wonders. They can take a   dusty stool from the shelf, blow off the dust, put nearby, and it will   solve programming problems!\u0026quot; \u003c/p\u003e \u003cp\u003e I won\u0027t tell you that everything worked perfect at the   quarter-finals, it was hard for them, but they didn\u0027t lose heart. And   then there were persistent trainings for the semi-finals, which they   lost to Saratov SU#2 with frightening regularity. Though: at the last   training before the semi-finals they won the whole world by one   problem solved, including the last champions. \u003c/p\u003e \u003cp\u003e I am not going to exhaust you with the story about the semi-finals,   the only thing I will say: the team took the 5th prize and advanced to   the 2010 World Finals. And now I have to switch from past to present   tense and tell you that at this very moment the guys are having one of   their last trainings. Let\u0027s wish them good luck. Especially for   February 5. \u003c/p\u003e\u003c/div\u003e","tags":["history","saratov","saratov su1"]}}