{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1281029964,"rating":7,"authorHandle":"brainail","modificationTimeSeconds":1281030047,"id":579,"title":"Помогите !! Wi-Fi это тяжко !!! xD","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eЗнаю что уже была похожее тут, но не смог извлечь урока из той темы :) Буду очень рад что мне вежливо всё разъяснят и покажут! Так сказать вдолбят навеки в мою головешку :))\u003cbr /\u003e\u003cbr /\u003eВ общем купил себе долгожданный ноутбук недавно :)\u003cbr /\u003eВспомнил что ещё примерно дней 20 дома будет находится модем от ByFly (белорусский провайдер интернета), модем семейства ZTE, а точнее \u0026quot;Промсвязь ADSL модем M-200 A\u0026quot; :) На нём есть точка доступа Wi-Fi, или как то так :)\u003cbr /\u003eСам Wi-Fi никогда не пользовался, хоть и знаю что это такое :)\u003cbr /\u003eНа домашнем компьютере интернет от этого модема настроен и отлично работает.\u003cbr /\u003eНа ноутбуке стоит \u0026quot;Windows 7 Ultimate 32-bit\u0026quot;. Она автоматом сразу после активации на модеме WLAN, нашла мой модем (точку доступа), и я захотел подключится, но ничего не вышло :) Подключается та всё отлично, сигнал имеет отметку сильный, ну и я стал искать много разных настроек в интернете, как и что это сделать. Нашёл сразу \u003ca href\u003d\"http://byhelp.by/post_1263386825.html\"\u003eвот это\u003c/a\u003e, причём находил примерно такое же, но настройки шифрования только другие, но это не помогло, по прежнему идёт всё отлично, всё подключается, и пишет \u0026quot;Неопознанная сеть\u0026quot; -\u0026gt; \u0026quot;Без доступа в интернет\u0026quot;, отсюда можно понять что в интернет я не смогу выйти :)) \u003cbr /\u003eИ вот тогда такой вопрос, у меня ведь есть все мои шлюзы, маски подсети, ip.. Могу ли я без обращения в тех-поддержки с вашей помощью настроить эту болванку, и надо ли делать что-то на самом домашнем аппарате, или достаточно ноутбук помучать !? :))\u003cbr /\u003e\u003cbr /\u003eБуду ждать любой инструкция, буду очень рад если сразу мне дадут понять да или нет :)) А потом дадут хорошие и чёткие указания по исправлению этой ситуации :)) Простота, краткость, скриншоты приветствуются и всё остальное :)\u003cbr /\u003e\u003cbr /\u003eСпасибо! Жду !! xD\u003c/div\u003e","tags":["adsl","internet","wi-fi"]}}