{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1274962050,"rating":6,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1274991210,"id":403,"title":"Saratov Summer School \u0026quot;Sazanka 2010\u0026quot;","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch2\u003e\u003cspan style\u003d\"font-weight: normal;font-size: medium;\"\u003e\u003cimg src\u003d\"http://acm.sgu.ru/sazanka-2010/sazanka-2009-1.jpg\" style\u003d\"width: 250.0px;float: right;margin: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/span\u003e\u003c/h2\u003e\u003ch2\u003eThe first information letter\u003c/h2\u003e\u003cbr /\u003e  \u003ch3\u003eGeneral information\u003c/h3\u003e\u003cbr /\u003e  \u003cp\u003e From 2nd to 12th August 2010 Saratov State University runs an international student summer school in computer programming. Teams of three people and individual participants are invited to take part in it.\u003c/p\u003e  \u003cp\u003e The school will take place in a picturesque place at one of Saratov resort centers on the Volga bank. The participants will be provided comfortable rooms for 2-4 people and meals three times a day. The resort center owns a beach and sport grounds. \u003c/p\u003e  \u003cp\u003e \u003cimg src\u003d\"http://acm.sgu.ru/sazanka-2010/sazanka-2009-2.jpg\" style\u003d\"width: 330.0px;float: left;margin: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e  The school curriculum includes lectures by Saratov state university coaches, joint trainings, problems tutorials and topical workshops. The curriculum is designed for younger university students who aspire to achieve high results at programming competitions. \u003c/p\u003e  \u003cp\u003e The fees are 15000 RUR (~ 500 USD) for a person. Moreover, each team or an individual participant should bring a laptop with the support of WI-FI. \u003c/p\u003e  \u003cp\u003e All interested participants and teams should register at \u003ca href\u003d\"http://acm.sgu.ru/sazanka-2010/\"\u003ehttp://acm.sgu.ru/sazanka-2010/\u003c/a\u003e till 10th June 2010.  Don\u0027t postpone the registration, as the number of participants we can take is limited. \u003c/p\u003e  \u003cp\u003e You can get additional information by e-mail mirzayanovmr[symbol-at]gmail.com. As since the official language of the school is Russian, the registration requires knowledge of Russian. Also it is recommended to view this page in Russian.\u003c/p\u003e\u003c/div\u003e","tags":["saratov","summer school","training camp","volga","volley"]}}