{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1267560654,"rating":13,"authorHandle":"Alex_KPR","modificationTimeSeconds":1267718993,"id":122,"title":"Возвращение блудного попугая","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp align\u003d\"justify\"\u003e\u003cimg src\u003d\"http://s51.radikal.ru/i131/1003/49/65229f2a1332.jpg\" style\u003d\"float: right;margin: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003eВсё никак не дойдут руки написать о зимней школе программирования, проводившейся в городе Харькове на базе национального университета радиоэлектроники. Эти сборы проводились уже третий раз, в них принимала участие 71 команда. Были команды и из Беларуси (BSUIR #1), Грузии (Tbilisi #1 и Tbilisi SANGU), России (SPb SU, Pomor SU, Orel STU #1, Orel STU #2). Формат школы подразумевал существование двух лиг: высшей и юниорской. Уровень сборов в этом году высокий. Итоговых результатов я, к сожалению, не знаю, потому что уехал досрочно до закрытия. Надеюсь, что они скоро появятся на официальном сайте зимней школы \u003ca href\u003d\"http://www.olimp.sc170.kharkov.ua/sum_result_2010\"\u003eздесь\u003c/a\u003e. Думаю, официальной информации достаточно. :) \u003c/p\u003e\u003cp align\u003d\"justify\"\u003e \u003c/p\u003e\u003cp align\u003d\"justify\"\u003eОткрытие. Как же без него! Во время жеребьёвки команду просили выйти на сцену, а в это время показывали их фото и зачитывали невероятно увлекательную информацию о многочисленных успехах. Звучало это примерно так же круто, как \u0026quot;участник поедания шашлыков 2009\u0026quot; и \u0026quot;трёхкратный стиратель носков\u0026quot;. У меня нет цели обидеть каких-либо контестантов, но посудите сами: не каждый может похвастаться длинным списком своих чемпионств и победств. Зачем организаторам захотелось воспроизвести все эти \u0026quot;липовые\u0026quot; успехи, которые требовались в большом количестве от тренеров, непонятно. Лично мне было неприятно слышать, что я \u0026quot;участник школьных олимпиад\u0026quot; и \u0026quot;призёр четвертьфинала 2009\u0026quot;.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eБольше всего нравились высказывания про топкодер. Например, \u0026quot;бла-бла-бла, а ещё принимает активное участие в топкодере\u0026quot;. Или \u0026quot;бла-бла, жёлтый рейтинг на топкодере\u0026quot;. Но самое классное было \u0026quot;бла-бла, ФИОЛЕТОВЫЙ рейтинг на топкодере\u0026quot;. У меня 90 участий на ТС и я точно знаю: никакого фиолетового рейтинга точно там нет. Скорее всего имелся в виду синий, но мы к тому моменту так раздухалирись, что немедленно двумя командами сочинили легенду о том, что после 5k начинается фиолетовый рейтинг, который Пете даже и не снился.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eПосле торжественного вытягивания бумажки с номером компа, команду просили сказать что-то в микрофон (и опять неудачная затея). Большинство отделывалось фразой \u0026quot;всем спасибо\u0026quot;, но в конце какой-то паренёк решил оторваться по полной программе. Он благодарил маму, папу, дедушку с бабушкой, Бога (!), то ли своего имиджмейкера, то ли продюсера, просил выйти его на сцену. Посоветовал не брать дорогие обеды, потому что \u0026quot;на вкус они не очень\u0026quot; и \u0026quot;он дома готовит лучше\u0026quot;. Всё это время его красные от стыда сокомандники закрывали лица руками и прятались в тени. Молодец, парень; далеко не каждый может вести себя столь легко и свободно на публике.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eКстати, о дорогих обедах. Финансовый вопрос не закрывался на протяжении всех сборов. Острее всего он ощущался, когда речь заходила о еде. В отличие от большинства других программистских школ, здесь предлагалось два вида питания: дешёвый (~30 грн) и дорогой (~85 грн). Дешёвый обед включал в себя примерно следующее: салат из капусты, борщ с пампушками, гречка с куриной ногой, рогалик и чай. Очень и очень даже неплохо. Дорогой: салат из кальмаров, солянка, гречка со свиной отбивной, пирожное и кофе. Бутербродов с красной икрой не предлагалось, поэтому понять, почему стоимость \u0026quot;буржуйского\u0026quot; обеда в три раза дороже, мне не удалось. Я был не одинок в своём непонимании, и поэтому дорогие обеды взяли всего 3 или 4 команды. \u003c/p\u003e\u003cp align\u003d\"justify\"\u003eПредлагался вдобавок банкет за 150 грн. \u0026quot;Что будет на банкете?\u0026quot;, спросили мы. \u0026quot;Нарезки\u0026quot;, - прозвучало в ответ. Трезво поразмыслив, мы отказались от банкета. В конце концов его и отменили вовсе.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e\u003cimg src\u003d\"http://s40.radikal.ru/i090/1003/12/5d80cb6c19e4.jpg\" style\u003d\"float: left;margin: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003eНа контестах, к сожалению, ожидаемых шариков не было. Давали флажки за первую сдачу нерешённой до этого никем задачи. Нашу вторую команду отправили во второй дивизион. И что же? Почти каждый контест они утаскивали 1-2 флажка! Мы же заработали всего 2 за весь период сборов. \u003d)\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eПосле \u0026quot;подведения итогов дня\u0026quot; они частенько возвращались в обновках: то шарфики им подарят, то шапочки с перчатками. В конце концов Orel STU #2 выиграла второй дивизион и получила ещё по пакету подарков, медали зимней школы на шею и ещё много-много всего. Всё, в следующем году перебазируюсь в юниорскую лигу. :)\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eО туалете.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eВсе помнят, как на NEERC можно выходить в уборную? Один человек из аудитории с сопровождающим идут к ближайшему (да-да, именно ближайшему) туалету, там делаются дела и happy end.\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eОрганизаторы зимней школы решили предостеречь себя от возможных обменов идеями между участниками в сортире и поступили так: назначили каждой компьютерной аудитории свой, индивидуальный туалет. Отмечу, что харьковский национальный университет радиоэлектроники состоит из нескольких корпусов. ;)\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЕстественно, что не каждый компьютерный класс находится возле уборной. От нашей аудитории до нашего туалета было два пути: \u0026quot;длинный\u0026quot; и \u0026quot;через улицу\u0026quot;. Длинный путь состоял в следующем: нужно подняться на 2-ой этаж, пройти до конца коридора, перейти в другой корпус, подняться 3 пролёта, идти по длинному коридору, мучительно взглянуть на манящую табличку \u0026quot;М\u0026quot;, но, к сожалению, пройти мимо, спуститься 3 пролёта, пройти в следующий корпус и через пару зигзагов добраться до места облегчения. Я предпочитал путь через улицу. \u003d)\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eА теперь самый весёлый день. Всё началось с того, что куртку Антона Лунёва гардеробщица категорически отказалась вешать. У него то ли шапка была в рукаве, то ли перчатки в кармане, но тётя божий одуванчик громко возмущалась: \u0026quot;да вы что, хотите чтобы я надорвалась? Такие тяжести таскать!\u0026quot;. Убеждения, что \u0026quot;мы не местные\u0026quot; и \u0026quot;деть некуда\u0026quot; не помогали. Антон, человек очень культурный и скромный, был растерян и только улыбался вредной бабульке. Я посоветовал ему попробовать другое окошко и это помогло.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eНо на этом приключения не закончились. Придя на контест, мы услышали нежный женский голосок: \u0026quot;таааак! чтобы никто не жевал и не пил за клавиатурами, понятно?\u0026quot;. Я заметил, как чья-то рука тянется за моей пепсей; хорошо, что удалось убедить, что пить за рабочим местом не буду. Тётя вышла и кто-то быстро решил дожевать купленный пирожок. Результат: \u0026quot;и если я не вижу, что кто-то свинячит тут, то это ещё не значит, что я не заставлю убирать!\u0026quot;. Самое главное, что до этого дня проходили такие же контесты и в плане еды за рабочим местом всё было без проблем.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЛадно, тётя, повоюем. :) В течение контеста каждые 15-20 минут я брал пепси, подходил к ней и пил. А к ближе к концу взял стул, перенёс к её столу, с удовольствием развернул шоколадный батончик и, извлекая довольное мычание, громко им чавкал. Больше никаких воплей о том, что нельзя есть и пить на рабочем месте, я не слышал. \u003d)\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eВ общем и целом, всё было организовано очень классно. Еда была вкусной, компьютеры работали, сред разработки хватало. Спасибо большое Александру Вечуру. Мужик очень адекватный, он решал абсолютно любые вопросы.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЛекторами были Антон Лунёв, Виталик Гольдштейн, Миша Левин, Эльдар Богданов, Дима Кордубан, Андрей Лопатин и другие.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЖду следующей зимней школы! \u003d)\u003c/p\u003e\u003c/div\u003e","tags":["сборы","туалет","харьков","хнурэ","школа"]}}