{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1274689139,"rating":5,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1274696369,"id":395,"title":"Открыта регистрация на IPSC 2010","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv\u003e\u003cimg src\u003d\"/predownloaded/8f/aa/8faa14526a209098376d38367aa5bd958916fa3a.gif\" style\u003d\"float: left;margin: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003eДля тех кто еще не знает, сообщу, что IPSC (Internet Problem Solving Contest) это ежегодное соревнование, которое проводиться братским народом - словаками. Интересно оно в первую очередь необычными правилами и задачами. В этом году соревнование будет проходить \u003ca href\u003d\"http://www.timeanddate.com/worldclock/fixedtime.html?month\u003d06\u0026amp;day\u003d06\u0026amp;year\u003d2010\u0026amp;hour\u003d12\u0026amp;min\u003d00\u0026amp;sec\u003d0\u0026amp;p1\u003d735\"\u003e6 июня\u003c/a\u003e, а регистрация \u003ca href\u003d\"http://ipsc.ksp.sk/register.php\"\u003eуже открыта\u003c/a\u003e.\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003eСоревнование длится 5 часов и на нем будет предложено 6-20 задач. Например, в прошлом году \u003ca href\u003d\"http://ipsc.ksp.sk/old.php?arg_contest\u003dipsc2009\"\u003eих было 13\u003c/a\u003e. По каждой задаче вы можете скачать два набора входных данных: упрощенный и усложненный. Отсылать на проверку надо только результаты (примерно как в Google Code Jam), за неправильные попытки начисляется icpc-like penalty (для простого теста 10 минут штраф за попытку, для сложного - 20). Бывает, что они дают не решаемую в общем случае задачу, но тесты содержат входные данные специального вида, то есть, посмотрев на них внимательно можно понять, что для данного вида тестов решение существует. Кроме того на этом соревновании обязательно бывают задачи-угадалки, в которые практически невозможно сдать с первой попытки, но каждая попытка дает новую информацию. Задача состоит в том, чтобы выбрать правильную стратегию, получив ответ за наименьшее число попыток. Отметим, что существует ограничение на число попыток на каждый тест равное 10. Настоятельно рекомендую написать пробный тур, чтобы ознакомиться с их системой сдачи решений.\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003eВ конце отмечу, что этот контест (2000 года) команда Saratov SU 3 (Эльтерман, Лазарев, Мирзаянов) считает своим днем рождения. Дважды мы делали себе подарок, одерживая победу на нем: в \u003ca href\u003d\"http://ipsc.ksp.sk/old.php?arg_contest\u003dipsc2003\"\u003e2003\u003c/a\u003e и \u003ca href\u003d\"http://ipsc.ksp.sk/old.php?arg_contest\u003dipsc2004\"\u003e2004\u003c/a\u003e годах :)\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003cdiv\u003eРезультаты подводятся по двум дивизионам: школьный дивизион (детский) и открытый (взрослый). На настоящий момент чемпионом мира по версии IPSC является команда наших соотечественников \u003ca href\u003d\"http://ipsc.ksp.sk/top10.php?arg_contest\u003dipsc2009\"\u003eUral Fanclub of Ksenia Sobchak\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003cbr /\u003e\u003c/div\u003e\u003c/div\u003e","tags":["ipsc","ipsc-2010","languages"]}}