{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1270752818,"rating":3,"authorHandle":"San_Sany4","modificationTimeSeconds":1270753125,"id":260,"title":"Codeforces. Всегда с тобой.","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv align\u003d\"left\"\u003e\u003cdiv align\u003d\"left\"\u003e    Так уж получилось, что живу я довольно далеко от места учёбы, поэтому вынужден тратить на дорогу почти два часа ежедневно \u003cspan style\u003d\"font-size: 12.0pt;font-family: \u0026quot;Times New Roman\u0026quot;;\"\u003e–\u003c/span\u003e час туда и час назад. Чтобы не скучать в поездке и не терять время даром, я достаю свой мобильник и отправляюсь бороздить просторы интернета. С недавних пор к списку регулярно посещаемых сайтов добавился и Codeforces. Однако при каждом посещении приходится сталкиваться с рядом проблем:\u003cbr /\u003e \u003cbr /\u003e\u003col\u003e\u003cli\u003eНевозможно написать комментарий или запись в блог. Пробовал со всего, что было \u003cspan style\u003d\"font-size: 12.0pt;font-family: \u0026quot;Times New Roman\u0026quot;;\"\u003e– Opera Mini 5 beta 2, Opera Mini 4.2, Bolt, встроенный в мой K530i браузер. Поле для редактирования распознаёт только Bolt, но что туда не напиши \u003c/span\u003e\u003cspan style\u003d\"font-size: 12.0pt;font-family: \u0026quot;Times New Roman\u0026quot;;\"\u003e– ничего не появится. Жаль, но полноценной поддержки Javascript-а пока на телефонах нет.\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan style\u003d\"font-size: 12.0pt;font-family: \u0026quot;Times New Roman\u0026quot;;\"\u003eИз-за небольшого экрана прямоугольник, радостно приветствующий меня или сообщающий о том,  что голос послан на обработку, появляется не внизу страницы, а почти на самом верху, загораживая обзор.\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan style\u003d\"font-size: 12.0pt;font-family: \u0026quot;Times New Roman\u0026quot;;\"\u003eТакже, из-за размера экрана весь вид страницы \u0026quot;плывёт\u0026quot;. Это скорее недостаток, чем проблема, и серьёзно он не мешает, но ответ на ответ на ответ ...(несколько раз)... на комментарий скукоживается до трёх-четырёх букв в строке, и читать его, согласитесь, неудобно.\u003c/span\u003e\u003c/li\u003e\u003c/ol\u003e\u003cspan style\u003d\"font-size: 12.0pt;font-family: \u0026quot;Times New Roman\u0026quot;;\"\u003eЯ хочу спросить разработчиков \u003c/span\u003e\u003cspan style\u003d\"font-size: 12.0pt;font-family: \u0026quot;Times New Roman\u0026quot;;\"\u003e– а можно ли сделать PDA-версию сайта, или хотя бы поставить переключатель \u0026quot;Скриптовый/стандартный редактор\u0026quot;, как при отправке задачи? Я полагаю, что это облегчит жизнь не только мне одному. Ведь так приятно, когда любимый сайт всегда и везде с тобой!\u003c/span\u003e\u003cbr /\u003e\u003c/div\u003e\u003cspan style\u003d\"font-size: 12.0pt;font-family: \u0026quot;Times New Roman\u0026quot;;\"\u003e\u003c/span\u003e\u003c/div\u003e\u003c/div\u003e","tags":["codeforces","mobile","opera mini"]}}