{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1292695841,"rating":6,"authorHandle":"nekto","modificationTimeSeconds":1292696123,"id":978,"title":"Усовершенствования codeforces руками сообщества","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eНаше сообщество уникальное в своем роде – каждый здесь разработчик!!! Пусть кто-то с большими знаниями, кто-то с меньшими, но современные средства разработки и технологии позволяют организовать разработку новых модулей сайта сообществом при этом обеспечивая безопасность системы. Организаторам часто не хватает времени на реализацию предложений сообщества по улучшению сайта, хотя они нужны, а порой необходимы.\u003cbr /\u003e\u003cbr /\u003eБолее конкретно предлагаю:\u003cbr /\u003e\u003cbr /\u003e1)    организаторы предоставляют сообществу совокупность API сайта (при необходимости API дорабатывается или создается новое).\u003cbr /\u003e2)    при поступлении новых предложений они проходят\u003cbr /\u003eэтап обсуждения, где выясняется, нужно ли это усовершенствование воплощать в жизнь, выдвигаются предложения и т.д.\u003cbr /\u003e3)    Разрешение организаторов на данное усовершенствование (возможно можно будет отказаться).\u003cbr /\u003e4)    Создание программного кода силами сообщества и загрузка через систему контроля версий. Возможно конкурирующее программирование - выигрывает реализация с меньшим расходом ресурсов. Также возможны две стратегии разделения исходных фалов\u003cbr /\u003eа) любой участник сообщества может вносить изменения в код\u003cbr /\u003eб) только один участник, или группа друзей создает какой-то компонент.\u003cbr /\u003e5)    Разработка тестов также силами сообщества.\u003cbr /\u003e6)    Организаторы утверждают обновление и подсоединяют к codeforces.\u003cbr /\u003e\u003cbr /\u003eПреимущества: не только наполнение, но и создание функционала портала ведется руками сообщества, что по идее приведет к увеличению скорости доработки и улучшения codeforces.\u003cbr /\u003e\u003cbr /\u003eНедостатки: \u003cbr /\u003e1)    не до конца понятно как можно справиться с проблемой безопасности (предлагается предоставление интерфейсов системы с валидацией в реализации всех аргументов на корректность и проверка на отсутствие «запрещенных» функций, как во время проведения контестов).\u003cbr /\u003e2)    возможно не будет хватать производительности серверов codeforces на все желания сообщества.\u003c/div\u003e","tags":["предложения","усовершенствование"]}}