{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1273334266,"rating":5,"authorHandle":"e-maxx","modificationTimeSeconds":1273334430,"id":369,"title":"Интересное почитать","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003emaths\u003c/h1\u003e\u003ch2\u003e\u003ca href\u003d\"http://dmitri-pavlov.livejournal.com/12428.html\"\u003e\u0026quot;Страх перед нулём и единицей.\u0026quot;\u003c/a\u003e\u003c/h2\u003e\u003cp\u003e[ Dmitry Pavlov\u0027s livejournal ]\u003c/p\u003e\u003cp\u003e\u0026quot;Наша жизнь полна предрассудков и необоснованных страхов. Однако не все знают, что предрассудки и страхи во множестве присутствуют в математике. Сегодня я расскажу всего лишь про один такой предрассудок — страх перед нулём и единицей.\u0026quot; ...\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003ch2\u003e\u003ca href\u003d\"http://dmitri-pavlov.livejournal.com/11276.html\"\u003e\u0026quot;Манифест Dieudonné («Все мы учились в одном гадюшнике…»)\u0026quot;\u003c/a\u003e\u003c/h2\u003e\u003cp\u003e[ Dmitry Pavlov\u0027s livejournal ]\u003c/p\u003e\u003cp\u003e\u0026quot;Время от времени я начинаю разъяснять, почему геометрия, в том виде, как она сейчас преподаётся в школе, малоосмысленна, и почему ситуацию с этим необходимо менять. Вот, например, несколько недавних дискуссий, есть и другие: \u0026lt;links\u0026gt;. \u003cbr /\u003e\u003cbr /\u003eНедавно я прочитал предисловие к книге Dieudonné 1964 года Algèbre linéaire et géométrie élémentaire и обнаружил, что в этом предисловии ясно и понятно изложены все те мысли, которые я уже давно пытаюсь разъяснять в различных дискуссиях. По этой причине я решил воспроизвести русский перевод этого предисловия ниже.\u0026quot;\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003ch1\u003escience\u003cbr /\u003e\u003c/h1\u003e\u003ch2\u003e\u003ca href\u003d\"http://igorivanov.blogspot.com/2008/10/blog-post_23.html\"\u003e\u0026quot;Обыкновенный скотч как источник рентгеновского излучения\u0026quot;\u003c/a\u003e\u003c/h2\u003e\u003cp\u003e[ Igor Ivanov\u0027s livejournal ]\u003c/p\u003e\u003cp\u003e\u0026quot;Удивительное (и красивое!) -- рядом.\u003cbr /\u003e\u003cbr /\u003eСегодня в Nature опубликована статья, в которой рассказывается о простом эксперименте с забавными результатами. Оказывается при медленном разматывании скотча, которое происходит не равномерно, а рывками, наблюдаются короткие вспышки света. А также вспышки рентгеновского излучения с энергией в десятки кэВ!\u0026quot;\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003ch1\u003ecoding\u003c/h1\u003e\u003ch2\u003e\u003ca href\u003d\"http://codebase.livejournal.com/1004.html\"\u003e\u0026quot;Программирование, как средство самовыражения\u003c/a\u003e\u0026quot;\u003c/h2\u003e\u003ch3\u003e[ a-ilyin\u0027s livejournal ]\u003c/h3\u003e\u003cp\u003e\u0026quot;Это довольно большая (18кб) статья, написанная по мотивам одной дискуссии в ЖЖ. Первоначально была опубликована здесь.\u003cbr /\u003e\u003cbr /\u003e Я – как уже писал – разработчик программного обеспечения с более чем 25-летним стажем, а до этого – и параллельно с этим – был разработчиком электронной аппаратуры, как цифровой, так и аналоговой. Скажу очень кратко, что имел в том и другом некоторые успехи. ...\u0026quot;\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003ch1\u003ehumour\u003c/h1\u003e\u003ch2\u003e\u003ca href\u003d\"http://che-telcontar.livejournal.com/67351.html\"\u003e\u0026quot;Санкт-Петербурга не существует!\u0026quot;\u003c/a\u003e\u003c/h2\u003e\u003cp\u003e[ che_telcontar\u0027s livejournal ]\u003c/p\u003e\u003cp\u003e\u0026quot;Прогуливаясь с lashner по Питеру 2 недели назад, мы занимали время словесной игрой. Потом решили выложить это в ЖЖ – в качестве доброго стёба над искателями/критиками Атлантид- Гиперборей, над альтернативными историками и «новыми хронологами». Я возвращался к тексту несколько раз и не пожалел букв. Теперь же не терпится увидеть отклики, критику и гневные опровержения. А может быть, вы найдете новые «доказательства»?\u0026quot;\u003c/p\u003e\u003c/div\u003e","tags":["books","livejournal","ljl"]}}