{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1265262883,"rating":0,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1265321538,"id":49,"title":"The third day in the Celestial Empire","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv style\u003d\"float: left;margin: 1.0em;font-size: 11.0px;text-align: center;\"\u003e   \u003cimg alt\u003d\"Line to open ceremony\" src\u003d\"//assets.codeforces.com/day5/01-tonnel.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/div\u003e \u003cp\u003e      The third day was marked by rises and falls of Harbin in our eyes. Everything started with the opening ceremony -      it was badly organized, protracted and boring. Right before the opening ceremony the audience went to the assembly      hall of the Harbin Engineering University, but the participants  were less privileged and had to suffer. We were all      gathered in a long basement room, we had to form a line according to predetermined numbers, and wait. As you know,      103 teams take part in the finals, so, about 450 people (coaches and volunteers included) packed into that basement.      It was stuffy and crowded there. The Russian teams demonstrated their inherent quick-wittedness, they decided not to      stand in the crowd, and moved closer to the entrance, it was cooler and there was more room there. \u003c/p\u003e \u003cp\u003e  Finally, to solemn music (be careful, phonogram!) the teams one by one climbed the stage, took pictures  and went down to join the audience. As after that according to the program some outdoor activities were planned, many participants had prepared sensibly beforehand, they had put on the presented warm trousers, sweaters, etc. With such a \u0026quot;formal\u0026quot; look they got to the opening ceremony and the shoot. My standing ovation. \u003c/p\u003e \u003cp\u003e \u003c/p\u003e \u003cembed allowfullscreen\u003d\"true\" height\u003d\"338\" scale\u003d\"noscale\" src\u003d\"http://flv.video.yandex.ru/lite/mikemirzayanov/r04o7deshx.2113/\" type\u003d\"application/x-shockwave-flash\" width\u003d\"450\"\u003e   \u003cp\u003e Many officials from the Chinese government, the local University and some other people were invited to the ceremony.  They spoke. In Chinese. The interpreter did her job - but I\u0027m sure I won\u0027t find any  participant who got slightly interested. We saw an interesting band - \u0026quot;12 girls band\u0026quot; - 12 girls pretended they played  musical instruments, while the pre-recorded track was on. Maybe I haven\u0027t understood something? All these  lasted for three hours, I had time to get cold, to take a nap and to think much. \u003c/p\u003e   \u003cp\u003eThen there was a practice contest. There were much fewer problems with it, because it was organized by the jury members, not by the local organizers. This year\u0027s innovation is the usage of the automatic testing system,    though the jury reserved to themselves the right to make changes. I will remind you that until this year the testing    system was with hand power, we can only guess about the reasons.\u003c/p\u003e   \u003ccenter\u003e     \u003cimg alt\u003d\"На пробном туре\" src\u003d\"//assets.codeforces.com/day5/02-practice.JPG\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" title\u003d\"На пробном туре\" /\u003e\u003c/center\u003e   \u003cp\u003eThen we were treated to a \u0026quot;fiery\u0026quot;  dinner, where the most popular dish were bananas. They hadn\u0027t pepper them at least.\u003c/p\u003e   \u003cp\u003eThen there came time for entertainment - the participants were given tools and snow cubes to make statues. The students and other    volunteers seemed to like that activity. The united team of coaches and guests from St.Petersburg and Moscow made a    funny pig. Our team didn\u0027t lag behind.\u003c/p\u003e   \u003cp\u003eAfter that we were taken to the hotel, where the supper was more \u0026quot;humane\u0026quot;, and then without delay we went to the evening excursion Ice and Snow World. It was really beautiful there - ice buildings, lit by colourful lights. Have a look at the pictures.\u003c/p\u003e   \u003cdiv style\u003d\"margin: 0 auto;width: 400.0px;font-size: 11.0px;text-align: center;\"\u003e     \u003cimg src\u003d\"//assets.codeforces.com/day5/04-snow-1.JPG\" style\u003d\"margin-top: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e     \u003cbr /\u003e     Vova slipped      \u003cimg src\u003d\"//assets.codeforces.com/day5/05-snow-2.JPG\" style\u003d\"margin-top: 3.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e     \u003cbr /\u003e     Monument to beer \u0026quot;Harbin\u0026quot;      \u003cimg src\u003d\"//assets.codeforces.com/day5/06-snow-3.JPG\" style\u003d\"margin-top: 3.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e     \u003cbr /\u003e     Guess who it is    \u003cimg src\u003d\"//assets.codeforces.com/day5/07-snow-4.JPG\" style\u003d\"margin-top: 3.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e     \u003cbr /\u003e     Just beautiful \u003c/div\u003e\u003c/embed\u003e\u003c/div\u003e","tags":["acm","acm-icpc","harbin","saratov"]}}