{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1269776005,"rating":6,"authorHandle":"fedor.birjukov","modificationTimeSeconds":1269776005,"id":224,"title":"Что же читать?","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eВ наши дни существует необычайной количество прекрасных книг о программировании, которые стали классикой, традиционными учебниками для программистов. Так что же все-таки стоит прочитать и в какой последовательности?\u003cbr /\u003eСейчас я сам столкнулся с тем, что не знаю за что взяться, потому что количество книг, которые я хочу прочитать плавно перевалило за 20...\u003cbr /\u003eВот, что рекомендует \u003ca href\u003d\"http://spbtc.ru/information/index.html\"\u003eСанкт-Петербургский тренировочный центр:\u003cbr /\u003e\u003c/a\u003e\u003cul\u003e\u003cli\u003e   Кормен, Т., Лейзерсон, Ч., Ривест Р., Штайн К. «Алгоритмы: построение и анализ».  \u003c/li\u003e\u003cli\u003e   Кнут Д. «Искусство программирования».  \u003c/li\u003e\u003cli\u003e   Шень А. А. «Программирование. Теоремы и задачи».  \u003c/li\u003e\u003cli\u003e   Керниган Б., Пайк Р. «Практика программирования».  \u003c/li\u003e\u003cli\u003e   Романовский И. В. «Дискретный анализ».  \u003c/li\u003e\u003cli\u003e   Уоррен Г. «Алгоритмические трюки для программистов».  \u003c/li\u003e\u003cli\u003e   Грехем Р., Кнут Д., Паташник О. «Конкретная математика».  \u003c/li\u003e\u003cli\u003e   Скиена С. С., Ревилла М. А. «Олимпиадные задачи по программированию. Руководство по подготовке к соревнованиям».   \u003c/li\u003e\u003cli\u003e   Меньшиков Ф. В. «Олимпиадные задачи по программированию».  \u003c/li\u003e\u003cli\u003e   Асанов М. О., Баранский В. А., Расин В. В. «Дискретная математика: графы, матроиды, алгоритмы».  \u003c/li\u003e\u003cli\u003e   Гасфилд. Д. «Строки, деревья и последовательности в алгоритмах».   \u003c/li\u003e\u003cli\u003e   Вирт. Н. «Алгоритмы и структуры данных».  \u003c/li\u003e\u003c/ul\u003eНо есть еще много интересных книг, которые стоило бы почитать:\u003cbr /\u003e\u003cul\u003e\u003cli\u003eРоберт Седжвик «Фундаментальные алгоритмы на C++».\u003c/li\u003e\u003cli\u003eSteven Skiena \u0026quot;The algorithm design manual\u0026quot;. Если честно, то именно эта книга и ввела меня в задумчивость. Потому что, немного просмотрев ее, я увидел какое-то сходство с творением Кормена (CLRS, «Алгоритмы: построение и анализ»).\u003c/li\u003e\u003cli\u003eИ великое множество книг по математике. Ведь математика тоже очень полезна. Этот пункт тоже ввел меня в задумчивость.\u003ca href\u003d\"http://www.diary.ru/%7Eeek/p47467303.htm\"\u003e Литература по линейной алгебре\u003c/a\u003e и \u003ca href\u003d\"http://www.diary.ru/%7Eeek/p48574979.htm\"\u003eпо аналитической геометрии.\u003c/a\u003e \u003ca href\u003d\"http://www.diary.ru/%7Eeek/p47754007.htm\"\u003eПо высшей математике.\u003cbr /\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003eЧем больше список, тем больше он дезориентирует.\u003cbr /\u003eПоэтому я рекомендую всем остановиться для начала на списке тренировочного центра. Можно, конечно, добавить к нему Седжвика и еще одну книгу Стивена Скиены, только она полностью на английском.\u003cbr /\u003eЕсли смотреть только на первый список, то я могу определиться, что читать следующим. Но если добавить еще пару книг, то я в замешательстве.\u003cbr /\u003eСложно добавить еще что-то к этому звездному составу. Книги по языкам программирования не в счет. Мне больше интересно, может ли кто-нибудь высказаться по поводу моих добавлений к списку. Потому что они сбивают меня с толку и я не могу взять наконец книгу и читать ее.\u003cbr /\u003eЕсли кто-то хочет, может высказаться о книгах и сказать, в каком порядке он советовал бы их читать.\u003cbr /\u003eДумаю, тем, кто собрался здесь, все эти книги знакомы. Но всегда есть люди, которые только начинают свое знакомство с программированием. В итоге, может получиться неплохое руководство.\u003cbr /\u003eЯ, в свою очередь, рекомендую прочитать Кормена, \u0026quot;Конкретную математику\u0026quot; и Стивена Скиену. Ну и все остальное) Потому что все книги очень интересные. Правда, одни сложнее, а другие проще.\u003c/div\u003e","tags":["литература","подготовка"]}}