{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1265393970,"rating":12,"authorHandle":"Alex_KPR","modificationTimeSeconds":1265411815,"id":60,"title":"Казанские автобусы и многое другое","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp align\u003d\"left\"\u003e   \u003ctable border\u003d\"0\" cellpadding\u003d\"5\" cellspacing\u003d\"5\"\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\u003cimg src\u003d\"http://roselectrod.ru/tst/12.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/td\u003e\u003ctd align\u003d\"justify\"\u003e\u003cp\u003eКазань.             Столица   Татарстана.             Там           делают самую             вкусную шаурму. А             ещё           проводят турнир по             программированию. \u003c/p\u003e           \u003cp\u003eЭтот           турнир   примечателен   тем,           что             на нём всегда           происходит что-то           весёлое             и   необычное.           \u003c/p\u003e           \u003cp\u003eЭто           не           только событие             приехать-поучаствовать-уехать,           но ещё и             возможность             отлично           отдохнуть,             встретить старых             друзей, попытаться             прочитать татарские   названия (\u0026quot;ашымлаклар\u0026quot; -             продуктовый             магазин, вроде бы) и многое другое.\u003c/p\u003e           \u003cp\u003eИменно там я впервые познакомился с Ural SU Fusion и SPb SU             IFMO Mafia, которые сейчас называются SPb SU IFMO 1.\u003c/p\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/p\u003e \u003cp\u003e \u003c/p\u003e \u003cp align\u003d\"justify\"\u003e   Как-то вот так исторически сложилось, что   последние три года   орловские   команды приезжают туда в неполном составе.\u003c/p\u003e \u003cp align\u003d\"justify\"\u003eВ прошлом году нас поселили в   гостиницу   \u0026quot;Кварт\u0026quot;.   Нормальная гостиница, в   принципе.   Конечно,   далековато от место   проведения: мы ехали от неё   около 50 минут на   автобусе до места   проведения - КГТУ им. Туполева.\u003c/p\u003e \u003cp align\u003d\"justify\"\u003eПробный тур был весёлым,   впрочем, как и всегда.   Родного dev-cpp, разумеется, нет. Флешки использовать, разумеется,   нельзя. Из   нас двоих студию   никто не знает. Через 10 минут насилия   над   ней я   сдался и попросил   позвать кого-нибудь из технического   комитета. И   когда спросил   \u0026quot;а как создать новый файл?\u0026quot;,   удивлению   молодого человека   не было предела; я думал, что он   вот-вот   спросит   \u0026quot;а вы вообще   как сюда попали?!\u0026quot;.\u003cbr /\u003e\u003c/p\u003e \u003cdiv align\u003d\"justify\"\u003e                          На открытии   мы ещё   посидели, а с экскурсии благополучно сбежали и отправились в   гостиницу. На следующий день, хорошенько отдохнув, мы,   бодрые и   весёлые,   были готовы рваться в бой. \u003c/div\u003e \u003cdiv align\u003d\"justify\"\u003eЖюри предложило K задач.\u003cbr /\u003e\u003c/div\u003e \u003cp align\u003d\"justify\"\u003e     Начали просто ужасно: незнакомая среда   разработки + \u0026quot;не   та\u0026quot; выбранная задача сделали своё дело.   Первый   сабмит по С на шпалу через   40 минут после начала. Пока я   копался с распечаткой, моя   сокомандница сдала K и мы оказались   где-то на 20 месте. У лидеров было   решено уже 4. Сразу куда-то   высоко убежали ZU StarLab (нынешние IFMO 2) и ЯкЦупЦоп.\u003cbr /\u003e\u003c/p\u003e \u003cdiv align\u003d\"justify\"\u003e                          А дальше   как-то пошло,   пошло... Поток, который я к тому моменту писал всего   пару раз,   сдался быстро; переборные задачки миллиардной сложности   проходили и   без супермегаотсечений. А то, что не получалось у меня,   получалось у Марии.\u003cbr /\u003e\u003c/div\u003e \u003cp align\u003d\"justify\"\u003e    После заморозки сдалась девятая задача. В   мониторе мы оказались четвёртыми.\u003cbr /\u003e\u003c/p\u003e \u003cdiv align\u003d\"justify\"\u003e                          И, наконец,   случилось.\u003cbr /\u003e\u003c/div\u003e \u003cp align\u003d\"justify\"\u003e    Студия сошла с ума. На любые cout\u0027ы и printf\u0027ы   она   писала в файл   всякую ахинею. Минут через 15 я, уверенный, что   всё-таки   где-то   происходит переполнение, вбил:\u003cbr /\u003e\u003c/p\u003e \u003cbr /\u003e \u003cp\u003e          freopen(\u0026quot;output.txt\u0026quot;,\u0026quot;wt\u0026quot;,stdout);\u003c/p\u003e \u003cp\u003e    int   a,b;\u003c/p\u003e \u003cp\u003e    cin\u0026gt;\u0026gt;a\u0026gt;\u0026gt;b;\u003c/p\u003e \u003cp\u003e    cout\u0026lt;\u0026lt;a+b;\u003c/p\u003e \u003cp\u003e    return 0; \u003c/p\u003e \u003cbr /\u003e \u003cp align\u003d\"justify\"\u003eОтвет майкрософтского \u0026quot;чуда\u0026quot; превосходил   все ожидания. В   выходном файле на инпут \u0026quot;2 3\u0026quot; появилось   что-то вроде   \u0026quot;Linking...\u0026#x7f;\u0026#x7f;\u0026#x7f;\u0026#x7f;\u0026#x7f;\u0026#x7f;\u0026quot;. Пнув ногой компьютер,   отправил его в   перезагрузку. Не помогло. Психанув, мы   ушли с тура   за полчаса до   конца контеста.\u003cbr /\u003e\u003c/p\u003e \u003cp align\u003d\"justify\"\u003e                          Шансов попасть в тройку   лидеров было   немного: сильная команда ЯкЦупЦоп   (Сёва Опарин)   решила до   заморозки 8 задач и у них осталась несложная   переборная   задача, сдав   которую, они обгонят нас по времени.\u003c/p\u003e \u003cp align\u003d\"justify\"\u003eУ СтарЛаба и так 9. Были и ещё   команды с 8-ю   задачами и хорошим   штрафным временем.\u003c/p\u003e \u003cp align\u003d\"justify\"\u003eТут нас нашла женщина из оргкомитета, \u0026quot;а, вот вы   где!\u0026quot;.   Оказывается, мы ей не сообщили время нашего отъезда   (странно, я   присылал письмо о времени прибытия/отбытия). Автобусов в   гостиницу   больше не будет, а как забирать свои вещи и быстро-быстро   добираться   до ж/д вокзала, стало вдруг непонятно.\u003c/p\u003e \u003cp align\u003d\"justify\"\u003eМы решили пропустить обед, разбор, награждение и   закрытие, но   попасть   на поезд.\u003c/p\u003e \u003cp align\u003d\"justify\"\u003eВ общем, перед нами   поставилась самая сложная   задача всего   контеста: по незнакомому городу   найти кратчайший путь   до гостиницы,   адрес которой, разумеется, не   знали ни мы, ни та   женщина, ни   люди   на улице (спрашивал не   менее десятка человек).   В конце концов   сели   в рандомный автобус, и   поехали, как и должно   было случиться, в   другую сторону.\u003c/p\u003e \u003cp align\u003d\"justify\"\u003eПроехав   N остановок и понимая, что сейчас   заблудимся окончательно,   я безо   всякой надежды спросил у молодого   человека: \u0026quot;ты не   знаешь, где   гостиница кварт?\u0026quot;. \u0026quot;Да   вот же она!\u0026quot;, -   ответил он мне,   показывая рукой на серое   невзрачное здание. С ума   сойти можно! Как   оказалось в дальнейшем,   это просто университетский   автобус сделал существенный крюк.\u003c/p\u003e \u003cp align\u003d\"justify\"\u003eНазад добрались без особых приключений. Успели даже   на награждение и   порадовались \u003ca href\u003d\"http://www.icl.ru/turnir/files/monitor2009.html\"\u003eрезультатам\u003c/a\u003e.\u003cbr /\u003e\u003c/p\u003e \u003cp align\u003d\"justify\"\u003e                          Но самое удивительное   было то,   что   когда мы приехали на ж/д вокзал, то увидели там тот   же автобус, на   котором ехали в гостиницу!\u003cbr /\u003e\u003c/p\u003e \u003cp align\u003d\"justify\"\u003e                          Поэтому заблудиться в   Казани просто   невозможно: садясь в любой автобус Вы рано или поздно   доберётесь   именно туда, куда нужно. Такие вот они, казанские автобусы.\u003c/p\u003e \u003cp align\u003d\"justify\"\u003eЧто касается самого турнира, то он с каждым годом   становится лучше и   интереснее. Багов в тестах и кривых условий уже   не   было, если мне не изменяет память.\u003c/p\u003e \u003cp align\u003d\"justify\"\u003eА совсем скоро начнётся отборочный тур. Информация о   нём есть на \u003ca href\u003d\"http://www.icl.ru/turnir/index.php\"\u003eофициальном   сайте\u003c/a\u003e.   Приглашаю всех принять участие!\u003c/p\u003e \u003cp align\u003d\"justify\"\u003eТолько хочу сразу предупредить: во-первых, сильным   командам там будет   неинтересно (уровень соревнований, всё-таки, не   настолько высок), а   во-вторых, нужно относиться к турниру как к   развлечению, чтобы не   чувствовать себя как Виталик Гольдштейн на   всероссийской студенческой олимпиаде.\u003c/p\u003e \u003cp align\u003d\"justify\"\u003eМожно сказать так: если Вы в душе искатель   приключений, то Казань ждёт Вас. \u003d)\u003c/p\u003e \u003cp align\u003d\"justify\"\u003e   \u003cimg src\u003d\"http://roselectrod.ru/tst/13.jpg\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e\u003c/p\u003e\u003c/div\u003e","tags":["icl","msvs","автобус","казань","соревнования","турнир"]}}