{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1290637472,"rating":45,"authorHandle":"Alex_KPR","modificationTimeSeconds":1290806263,"id":894,"title":"15-ый NEERC глазами очевидцев (в соавторстве с Р. Ветровым)","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp align\u003d\"justify\"\u003eШампанское выпито, пирожные с бутербродами съедены - окончился 15-ый NEERC. Кто-то радуется призовым местам/выходу в финал, кто-то сожалеет о неудаче и надеется на успех в следующем году. Нам, команде Орловского ГТУ, на этот раз повезло, и мы уже готовимся к финалу, поедая питерскую шаурму и играя во второй старкрафт.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eРезультаты NEERC оказались неожиданными. Статистика предсказывала выход тех двенадцати команд, которые наиболее успешно (с заметным отрывом) выступали последние полгода в открытом кубке, в петрозаводских сборах и других соревнованиях - их названия (команд) можно найти в разделе голосования на сайте Снарка с соответствующим рейтингом популярности. Но, как и в любых других спортивных соревнованиях, в acm-icpc присутствует элемент случайности, вызванный как и составом задач, так и психологической устойчивостью ребят.\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eПопытаюсь восстановить в памяти хронологию событий и описать полуфинал взглядом обычного участника.\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e \u003c/p\u003e\u003cp align\u003d\"justify\"\u003eОткрытие проводилось с привлечением колоритнейшего ведущего, который рождал бурю позитивных эмоций своим необычным голосом. Показывали слайды с панорамами северной столицы, на которые накладывались различные достопримечательности. Очень запомнился слайд, на который наложили чайку, перемещающуюся с константной скоростью из левого верхнего угла в правый нижний. Здорово выступили ребята-циркачи с трюками на скакалках.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eВо время открытия у нас появился лист с рассадкой команд. Удивило, что в первом холле собрались многие очень сильные команды: СПбГУ 1, СПбГУ ИТМО 1, Саратовский ГУ 2, МГУ. Мы оказались во втором холле и нашими соседями стали первая команда Саратова и команда Нижнего Новгорода. Весёлые и добродушные ребята, они очень смеялись над тем, что наш компьютер разместили в углу комнаты, тем самым образуя суммарное рабочее место размером около одного квадратного метра - и это на три человека! К счастью, удалось быстро \u0026quot;восстановить справедливость\u0026quot; переносом монитора, но памятную фотографию с надписью \u0026quot;знай своё место\u0026quot;, к сожалению, вовремя сделать не догадались.\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eПробный тур прошёл в матах на рабочие клавиатуры, поскольку у многих не нажимались в основном кнопки левого шифта и контрола, плохо реагировали остальные клавиши. Тренеры подливали масла в огонь, говоря о том, сколько мучались школьники с этими клавиатурами. В результате, Нижний Новгород убедил жюри в необходимости смены этой богадельни; а вот в клавиатуру первой команды Саратова не заглядывал (хотя помню громкие возмущения Ивана Фефера).\u003cbr /\u003e\u003c/p\u003e\u003cdiv align\u003d\"justify\"\u003e На следующий день случился основной тур. Погода радовала снегом, пахло зимой. Начало тура отложили на 20 минут. Кто-то говорил, что Станкевич зимнюю резину не поставил; кто-то говорил, что команда СПбГУ физически не может добраться из Петергофа в Аничков дворец; кто-то -  что, мол, с синхронизацией с Барнаулом проблемы. Официальная версия была \u0026quot;по техническим причинам\u0026quot;, куда, впрочем, вписываются все вышеперечисленные.\u003cbr /\u003e\u003c/div\u003e\u003cp align\u003d\"justify\"\u003eТретий год подряд на NEERC в проблемсете оказалось 11 задач. Крик Фефера \u0026quot;А - халява!\u0026quot; сперва воспринялся как прикол и дезинформация, но, как оказалось, А действительно была простой задачей. За первой успешной посылкой у нас последовал 45-ти минутный \u0026quot;перерыв\u0026quot;, после чего задачки начали сдаваться одна за другой, иногда с редкими штрафами. Ситуация в мониторе была, как минимум, необычной: долгое время не было привычных столбиков с плюсиками, каждая команда находила \u0026quot;свою\u0026quot; задачу, которая достаточно быстро сдавалась. Только к концу третьего часа стало ясно, что наиболее сложные задачи - это B, C, H и J.\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e Сдав последнюю (восьмую) задачу за 20 минут до конца, мы отправили на печать текущее состояние монитора, чтобы попытаться вычислить занимаемое место в худшем случае. В холле многие, узнав количество решённых задач, спешили поздравить нас с попаданием в финал, хотя радоваться раньше времени не стоило: у Перми 8, у Челябинска 9, и мало ли, какие сюрпризы могут преподнести другие команды.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eНе радовала новость о задержке подведения итогов - томительное ожидание продлилось на час дольше, чем рассчитывали. Впрочем, это время наша команда прекрасно провела в пабе в компании с Сёвой Опариным и Славой Исенбаевым.\u003cbr /\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eИ вот пришла пора подведения итогов. Колоритный ведущий продолжал радовать публику. Фраза: \u0026quot;одну секунду за минутную паузу\u0026quot; (автор не гарантирует стопроцентное совпадение с оригиналом) навсегда останется в наших сердцах.\u003cbr /\u003e\u003c/p\u003e\u003cdiv align\u003d\"justify\"\u003e Во время награждения новая \u0026quot;фишка\u0026quot; полуфинала - знаки вопроса на тех местах, где команды сабмитили задачи в последний час - начала с треском проваливаться, когда ведущие просили выйти на сцену команды раньше, чем участники видели \u0026quot;раскрытие интриги\u0026quot;. Но, вскоре, председатель жюри, Роман Елизаров, взял инициативу в свои руки и процесс награждения стал проходить намного интереснее. Единственный минус, который резко бросался в глаза - это возможность видеть три-четыре команды, распологающиеся выше текущей. Из-за этого в первой двадцатке команд желаемой интриги было намного меньше, чем хотелось бы.\u003cbr /\u003e\u003c/div\u003e\u003cp align\u003d\"justify\"\u003eОстаётся поздравить команду СПбГУ ИТМО 2, ставшей чемпионом России, а также все команды, прошедшие в финал чемпионата мира. Большое спасибо Алексею Самсонову, Алексу Фетисову, Константину Дроздову, Сергею Поромову, Аркадию Вязникову и многим-многим другим за тёплые поздравления и пожелания. Спасибо Яндексу и Codeforces за футболки.\u003c/p\u003e\u003c/div\u003e","tags":["acm","neerc","контест","полуфинал","турнир"]}}