{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1284123583,"rating":21,"authorHandle":"e-maxx","modificationTimeSeconds":1284126146,"id":651,"title":"Число делителей числа N","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp\u003eЧасто в олимпиадных задачах, чтобы оценить асимптотику алгоритма, требуется знать примерное число делителей поступающего на вход числа. Точнее, требуется знать максимальное число делителей среди всех чисел до, скажем, миллиарда.\u003c/p\u003e\u003cp\u003eСамая грубая оценка - O (sqrt(N)), а именно, не более двух квадратных корней из N.\u003c/p\u003e\u003cp\u003eНо часто это оказывается слишком грубой оценкой, неоправданно завышенной.\u003c/p\u003e\u003cp\u003e \u003c/p\u003e\u003cp\u003eОбычная используемая мной оценка - \u003cstrong\u003eO(кубического корня из N)\u003c/strong\u003e. Эту таинственную оценку я услышал когда-то давно от кого-то, и никогда её не понимал, но пользовался ей, и она работала.\u003c/p\u003e\u003cp\u003eСовсем недавно мы делали стресс-тест, и на числах до миллиарда она подтвердилась - число делителей не превосходит двух кубических корней из числа. Этого \u0026quot;доказательства\u0026quot; вполне достаточно, чтобы и дальше применять эту оценку на практике. Но найти ей математическое объяснение ну никак не получалось.\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eСегодня в очередной раз решил поискать на эту тему в интернете. На этот раз нашёл то. что нужно, на удивление быстро:\u003cstrong\u003e \u003ca href\u003d\"http://en.wikipedia.org/wiki/Divisor_function\"\u003een.wikipedia.org/wiki/Divisor_function\u003c/a\u003e\u003c/strong\u003e. Здесь много всякого интересного, но вот главная вещь, поразительная для меня формула:\u003cbr /\u003e\u003c/p\u003e\u003cp\u003e\u0026quot;для любого eps\u0026gt;0 выполняется: d(n) \u003d o(n^eps)\u0026quot;\u003c/p\u003e\u003cp\u003eВыходит, на самом деле число делителей ведёт себя на бесконечности не только лучше квадратного, кубического и прочего корней из числа n; оно вообще является \u003cstrong\u003eсубполиномиальной\u003c/strong\u003e величиной!\u003c/p\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eДругие оценки:\u003c/p\u003e\u003cul\u003e\u003cli\u003eWigert:  \u0026quot;d(n)  ~  n ^ (log2 / log log n)\u0026quot;  (ну я примерно передал порядок, на самом деле там формула посложнее)\u003c/li\u003e\u003cli\u003eДирихле:  \u0026quot;СУММА_{i\u003d1..n} d(i) / n  ~  log n + 2 gamma - 1\u0026quot;\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cbr /\u003e\u003c/p\u003e\u003cp\u003eP.S. Некоторым это может показаться бояном, но я знаю, что многие до сих пор даже не знают, что число делителей меньше квадратного корня, не говоря уже о таких \u0026quot;крутых\u0026quot; оценках :)\u003c/p\u003e\u003cp\u003eP.P.S. Для олимпиад, где обычно в таких задачах мы имеем дело с числами до 10^9 - 10^12, эти оценки малополезны (здесь надо по-прежнему брать корень кубический), но они интересны чисто как математический факт.\u003c/p\u003e\u003c/div\u003e","tags":["алгоритмы","простые числа"]}}