{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1289661305,"rating":51,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1289683171,"id":864,"title":"ACM-ICPC NEERC celebrates its 15th anniversary","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cimg src\u003d\"//assets.codeforces.com/images/neerc-15-en.png\" style\u003d\"margin: 0 1.0em;float: left;width: 170.0px;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003cp\u003e This year the ACM-ICPC regional contest of our region celebrates its 15th anniversary! We heartily congratulate the organizers, members of the jury and the technical committee. We would like to give our special congratulations to the Competition Director Vladimir G. Parfenov. Thank you very much for your work not only in organizing this competition, but also in developing the programming community throughout our region. Much has been done over 15 years. All the achievements of our region teams on the ACM-ICPC finals are also due to you. I have to say that NEERC is organized on the top level and has highly interesting sets of problems which all the participants find very exciting. We wish you new successes and new achievements! \u003c/p\u003e \u003ca href\u003d\"//assets.codeforces.com/images/codeforces-tshirts-on-neerc.png\" rel\u003d\"photobox\" style\u003d\"margin: 0 1.0em;float: right;\"\u003e \u003cimg src\u003d\"//assets.codeforces.com/images/codeforces-tshirts-on-neerc.png\" style\u003d\"width: 120.0px;max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/a\u003e \u003cp\u003eThis year the Saratov university delegation does not arrive in St. Petersburg empty-handed. We\u0027ve decided to give presents to all participants. Each St. Petersburg NEERC participant will receive a Codeforces T-shirt. For us, delivering so many T-shirts will help to clarify who among our team members is the strongest programmer:)\u003cbr /\u003e\u003c/p\u003e \u003cp\u003e The Codeforces team and Saratov University. \u003c/p\u003e\u003c/div\u003e","tags":["acm-icpc","happy birthday","neerc"]}}