{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1271004594,"rating":12,"authorHandle":"daftcoder","modificationTimeSeconds":1271014176,"id":282,"title":"Биография ещё одного спортивного программиста","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch3\u003e  \u003c/h3\u003e\u003ch3\u003e  \u003cp\u003e  \u003c/p\u003e\u003c/h3\u003e\u003ch3\u003eБиография ещё одного спортивного программиста.\u003c/h3\u003e\u003cp\u003e  \u003c/p\u003e\u003cp\u003e \u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eПрактически всё своё детство я провёл в Костроме, учился в костромской школе, общался со сверстниками и людьми постарше, увлекался футболом, математикой и ничем больше.\u003c/p\u003e\u003cp style\u003d\"text-indent: 35.4pt;\"\u003e \u003c/p\u003e  \u003cp\u003e\u003cspan style\u003d\"\"\u003e            \u003c/span\u003eНо так как я учился не в «классе звёзд» нашего потока, мои вторые места на школьных олимпиадах по математике никто не замечал (мне до сих пор интересно почему), и я не ходил ни на город, ни в кружок, никуда ещё. Всего, как обычно, пришлось добиваться самому.\u003c/p\u003e  \u003cp\u003e\u003cspan style\u003d\"\"\u003e            \u003c/span\u003eГде-то в 7 классе меня заметил школьный преподаватель по информатике – Чижов Сергей Васильевич, предложил мне позаниматься паскалем. Но уже во втором уроке я увидел физическую формулу (кто из вас любил физику в школе?) и бежал в ужасе от туда. \u003d)\u003c/p\u003e  \u003cp\u003e\u003cspan style\u003d\"\"\u003e            \u003c/span\u003eЗатем в начале 8 классе он мне дал задачку – посчитать 2^500. К концу 8 класса я придумал длинную арифметику и успешно решил её, параллельно распечатав 2 в степени 5000 на листе А4 6-м шрифтом, впрочем быстро обнаружилось, что степень двойки заканчивается нечётным числом. \u003d) Вот он первый счастливый опыт дебага в поиске ошибок.\u003c/p\u003e  \u003cp\u003e\u003cspan style\u003d\"\"\u003e            \u003c/span\u003eВ 9-м классе мной овладел \u003cspan style\u003d\"\"\u003eVisual\u003c/span\u003e\u003cspan\u003e \u003c/span\u003e\u003cspan style\u003d\"\"\u003eBasic\u003c/span\u003e, я самостоятельно, по весёлой и занимательной книжке, изучил язык, принципы работы языка, объектно-ориентированный подход к программированию (что помогает мне до сих пор). Затем следовала 832-х страничная книжечка «Использование \u003cspan style\u003d\"\"\u003eVisual\u003c/span\u003e\u003cspan\u003e \u003c/span\u003e\u003cspan style\u003d\"\"\u003eBasic\u003c/span\u003e 6», первая программа на 2000 строк, осознание того, что не всякая правильно написанная программа будет работать без ошибок, и закат эпохи \u003cspan style\u003d\"\"\u003eVB\u003c/span\u003e\u003cspan\u003e \u003c/span\u003eу меня в голове.\u003c/p\u003e  \u003cp\u003e\u003cspan style\u003d\"\"\u003e            \u003c/span\u003eТак же в 9 классе я попробовал позаниматься математикой, пришел на вступительную олимпиаду, немного не получил очков для прохода в супергруппу, но теперь ничуть об этом не жалею. Занимался с нами Сидоров Александр Васильевич, он рассказал нам, что есть Матиндукция, дал основы антагонистических игр, в общем дал серьёзный толчок в развитии меня как математика.\u003c/p\u003e  \u003cp\u003e\u003cspan style\u003d\"\"\u003e            \u003c/span\u003eПаскаль. Как много в этом слове. В 10м классе моя мама позвонила в Центр доп. образования одарённых школьников, чтобы узнать, как можно попасть на занятия по программированию. По телефону ей сказали, что это нереально, что дети там занимались по 4 года и уже что-то знают и т.п. В итоге (спасибо её упорству) она добилась время и места проведения вступительной олимпиады.\u003c/p\u003e  \u003cp\u003e\u003cspan style\u003d\"\"\u003e            \u003c/span\u003eЯ пришел посмотреть на занятия младшей группы и увидел, что там всё кисло. Когда пришел на вступительную олимпиаду увидел (по лицам \u003cspan style\u003d\"\"\u003exD\u003c/span\u003e), что грамотных людей здесь немного и решил... писать олимпиаду не в младшую группу, а в старшую. И прошел. С последним местом. Там быстро-быстро я узнал основы школьного олимпиадного программирования. Занятия проводил Козырев Сергей Борисович.\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eТак же в 10 классе началось разделение программисты/экономисты. На занятиях у Моисеева Бориса Михайловича я получше изучил \u003cspan style\u003d\"\"\u003eTP\u003c/span\u003e 7.0, и узнал формулу количества сочетаний (я же не занимался олимпиадной математикой).\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eГородскую олимпиаду я написал, заняв 2е место. Затем было немного времени подготовки к области. На области я уже занял первое место и поехал на заключительный этап (зоналка тогда ещё или уже не проводилась), который проходил в Новосибирске. Всероссийская олимпиада меня тогда очень впечатлила, я посмотрел на Великих в олимпиадном движении РФ. \u003d)\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eЛетом между 10 и 11 классами я в первый раз поехал в Летнюю многопредметную школу, проходившую тогда под Волгореченском (Костромская область) на базе Берендеевых полян (там сейчас проходит ЛКШ?). Узнал много нового, выиграл все возможные турниры (в связи с отсутствием конкуренции)\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003e11й класс был занят олимпиадами, программированием, проблемами личного характера, и поступлением. Поступление. Я хотел поступать в ИТМО, но по семейным причинам поступил в Костромской ГУ им Н.А.Некрасова. Школу и область я выиграл, на России (как мне потом сказали) выступил неплохо, но уж больно сложные задачи были в том году в Кисловодске.\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003e1й курс был посвящен учебе, я съездил на Воронежскую олимпиаду, познакомился там с Никитой Рыбаком, Виталием Гольдштейном и своим будущим тренером, а тогда студентом 5 курса, Виноградовым Виктором. Из Воронежа увёз диплом 6й степени. Так же съездил на четвертьфинал в Рыбинске.\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eМежду 1 и 2 курсом я съездил в ЛМШ (2007год, Красная Горка) лаборантом на информатику, где познакомился с моей будущей женой – 10-классницей-биологиней. 2й курс был посвящен ей, но я ещё съездил в Воронеж во второй раз, забрал там диплом пятой степени, так же съездил на четвертьфинал во второй раз (в качестве студента).\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eВ 2008 году я перевожусь в ЯрГУ на 2й курс (в связи с разницей в учебных планах), и начинаю там тренироваться под руководством Виктора. Выиграв отборы в Рыбинск я собрал себе команду из 2х пятикурсников, и мы без проблем прошли в Питер, где, впрочем, выступили средне.\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eВ этом же учебном\u003cspan style\u003d\"font-size: 12.0pt;font-family: \u0026quot;Times New Roman\u0026quot;;\"\u003e \u003c/span\u003e году съездил в Иваново на открытый личный чемпионат ИГЭУ по программированию, заняв там 5е место.\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eВ сезоне 2009-2010 на отборе на четвертьфинал занимаю 4е место, но один человек отказывается от участия, и я снова попадаю в первую команду, сформированную уже в этот раз из 4курсника Афанасьева Дмитрия (на данный момент самый сильный участник, на мой взгляд), Быковой Надежды – студентки 3 курса математического факультета и меня – студента 3го курса. Впрочем на четвертьфинале вторая команда ЯрГУ в чистую обгоняет нас, и в полуфинал выходят две команды ЯрГУ.\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eДо полуфинала я успел съездить в Воронеж и привезти оттуда диплом четвертой степени. Саратовские студенты были там на высоте. \u003d)\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eНа полуфинале в этот раз задачи были уж больно жесткими, а в начале контеста вся команда усиленно тупила, в итоге мы заняли 122 место. Самое интересное, что после контеста каждый утверждал, что именно он виноват в таком результате, но я то знаю, что больше всех виноват я!\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eНо самое главное – мы сфоткались с Биллом Паучером – директором \u003cspan style\u003d\"\"\u003eACM\u003c/span\u003e\u003cspan\u003e \u003c/span\u003e\u003cspan style\u003d\"\"\u003eICPC\u003c/span\u003e! \u003cspan style\u003d\"\"\u003exD\u003c/span\u003e\u003cspan\u003e \u003c/span\u003eНашли мы его в макдаке и совершенно случайно. \u003d) \u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eЕщё в этом году успел съездить в Вологду и привезти оттуда диплом 3й степени, заняв 4е место.\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003e \u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eЕсли вы смогли всё это осилить – вы псих. о_О\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003e \u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eНа данный момент я немного решаю задачи и изучаю новые алгоритмы.\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eНаш тренер надеется, что когда-нибудь студенты его вуза смогут съездить на финал \u003cspan style\u003d\"\"\u003eICPC\u003c/span\u003e (а заодно и его прихватят \u003d)).\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003e \u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eСпасибо всем, кто это читал.\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003eСпасибо мне, что я смог всё это изложить.\u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003e \u003c/p\u003e  \u003cp style\u003d\"text-indent: 35.4pt;\"\u003e\u003cspan style\u003d\"\"\u003eP\u003c/span\u003e.\u003cspan style\u003d\"\"\u003eS\u003c/span\u003e.: в итоге могу добавить, что для достижения чего-нибудь перед собой надо ставить цели и добиваться их, хотя бы частично, никогда не опускать руки и идти по жизни с улыбкой, даже если на душе грустно.\u003c/p\u003e    \u003cp style\u003d\"text-indent: 35.4pt;\"\u003e  \u003c/p\u003e    \u003ch3\u003e  \u003c/h3\u003e\u003c/div\u003e","tags":["биография","яргу"]}}