{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1287943301,"rating":3,"authorHandle":"Remstam","modificationTimeSeconds":1288001647,"id":788,"title":"Southern Subregion Quarterfinals. Ulyanovsk SU #2","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cp align\u003d\"justify\"\u003eТоже опишу прошедшее с точки зрения команды-новичка, ибо Ulyanovsk SU #2 в этом году полностью обновлена. Вообще, вторая команда поехала, так сказать, набираться опыта и не претендовала на что-либо серьезное.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eИтак,\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e\u003cu\u003eДень1. Пробный тур\u003c/u\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eСначала немножко впечатлений: Саратов достаточно приятный чистый город, но ужасно много пробок. И хотя очень-очень часто ходят автобусы, в час пик они превращаются в бочки с людьми :) Проезд в троллейбусе аж целых 7 рублей(!) - я уж было подумал, что попал в рай. Доплюхавшись до места регистрации в \u0026quot;дом с синенькими стеклышками\u0026quot; (в 12 корпус), мы быстренько отметились и отправились в гостиницу скинуть свои пожитки. Гостиница, правда, была не так уж близко, но к открытию мы успели.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЦеремония открытия, как и полагается всем церемониям, состояла из вступительных речей/раздачей пакетов/ручек/футболок/прочего, кроме того, после всего специально для таких, как мы, М.Мирзаянов вместе с тов. Комковым в буквальном смысле \u0026quot;разжевали\u0026quot; правила проведения соревнований, хотя они и так были интуитивны понятны: телефон выпилить, вести себя тихо, все вопросы через тестирующую систему.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eНа пробный тур жребий кинул нас в здание научной библиотеки - воистину прекрасное, хоть и немного ветхое здание с совковым лифтом и небольшим ремонтом возле закрытого буфета :)\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eСам пробный тур прошел для нас без каких-либо коллизий, вторую задачу пробовали сдать с использованием STL и без; поковыряли некоторые настройки и уехали к себе в номер придумывать стратегию для предстоящего CGC.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e\u003cu\u003eДень 2. Code Game Challenge\u003c/u\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eВечером дня предыдущего в голову особо ничего не приходило, поэтому придумывали все на ходу. Собственно, весь смак заключался в том, чтобы более или менее адекватно написать стрельбу и манипуляции с ускорением и углом поворота, но явно профита нам не хватало, хоть и на ботах наш личный рекорд составил 156 баллов.\u003cu\u003e\u003cbr /\u003e\u003c/u\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eПомотавшись по Саратову, вечером мы пришли смотреть шоу - прекрасное зрелище, море веселья и хорошие впечатления! Как ожидалось, наша \u0026quot;тетя Глаша\u0026quot; слила все 3 раунда, но к удивлению, заняла не последнее, а предпоследнее место ))) \u0026quot;Убивашка\u0026quot; первой команды, расположившись в начале четвертого десятка, занимала в раундах 2-3 места, а \u0026quot;Slowpoke\u0026quot; коллег из технического университета даже один раунд выиграл, расположившись в итоге на 35 месте.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eПоначалу я болел за FrozenKenny, но он в итоге проиграл, а победила лодка второй команды Самарского Аэрокосмического университета, с чем я их искренне и поздравляю :) Руль - вещь хорошая.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e\u003cu\u003eДень 3. Контест\u003c/u\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЕще раз скажу, что нашей задачей-минимум было решить пару-тройку задач \u0026quot;чисто\u0026quot;, т.е. с первой попытки, поэтому с самого начала контеста мы не понеслись вперед сломя голову, а вдумчиво стали искать задачи, которые могли бы быть легкими.\u003cu\u003e\u003cbr /\u003e\u003c/u\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eПервой мне на глаза попалась задача В, и было решено изначально сдать ее. Написав код, придумали с десяток всяких тестов, которые, как мне казалось, могли завалить решение, но нет, программа все выдержала, и наш первый AC был получен.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЗадачу про лифт мы приметили на потом, а следующей нашей задачей стала задача про буйки. Как и у всех, наверное, внезапно всплыла идея о фиксации 2 буйков, но мы почему-то решили фиксировать крайние, (еще задав глупый вопрос о том, можно ли их двигать - конечно можно, никто не запрещал :) ). Задумавшись о том, что можно, вообще говоря, двигать любые буйки, мы затормозили. Короче говоря, смелости чуть-чуть не хватило.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eОтложив буйки, с первой попытки был запилен лифт, и было решено заняться задачей С про взрывы. Решали мы ее в корне неверно, ставив бомбы таким образом, чтобы при каждом взрыве уничтожалось наибольшее количество камней. WA #20 дал нам об этом знать, посему под раздачу пошла задача про телегу, сокровище и, кажется, разноцветных гусей )) К этому моменту времени первая команда все еще была позади нас, вызвав неподдельное удивление.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eК этому времени подошла еда, после небольшого перерыва была предпринята попытка сдать рекурсивное решение, но, как уже понятно, по времени ждать на максимальном тесте пришлось бы очень долго.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eСхлопотали TLE #11 и до конца контеста(оставалось где-то 15 минут) ели печеньки :)\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eВечером поджидала церемония закрытия, первая команда заняла 23 место с 5 задачами, политех заслуженно вышел в полуфинал с 6 задачами (8 место), с чем я их тоже поздравляю - удачи им в Петербурге!\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eНаша же команда среди тех, кто решил 2 задачи, стала второй, а в итоге 45-й, по крайней мере, лучше, чем 53-е место в прошлом году.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eЧестно говоря, даже не стыдно, решили столько, сколько смогли, подготовимся еще годик - в следующий раз выступим лучше.\u003c/p\u003e\u003cp align\u003d\"justify\"\u003e\u003cu\u003eДень 4. Разбор задач\u003c/u\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eПеред ним, собственно, была экскурсия, на которой показали Ленина, Чернышевского, Гагарина и прочих, гораздо интересней было послушать разбор. Понравился Михаил Мирзаянов, который делал хорошие паузы (вот эти вот его вступительные \u0026quot;хорошо\u0026quot;, \u0026quot;ага\u0026quot; и \u0026quot;как бы\u0026quot; :) ), лично я понимал в той или иной степени все до последней задачи, на которой я в конце концов высох и разбирал разве что \u0026quot;Краскал\u0026quot;, \u0026quot;МСТ\u0026quot; и \u0026quot;ребро\u0026quot; :)\u003cu\u003e\u003cbr /\u003e\u003c/u\u003e\u003c/p\u003e\u003cp align\u003d\"justify\"\u003eПожалуй, все.\u003c/p\u003e\u003c/div\u003e","tags":["2010","neerc","саратов","четьвертьфинал"]}}