{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1271535593,"rating":0,"authorHandle":"alex_tolstov","modificationTimeSeconds":1271535593,"id":320,"title":"Безопасность запускаемых решений в проверяющих системах.","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eЙохоу, всем привет.\u003cbr /\u003e\u003cbr /\u003eПишу порт проверяющей системы с Windows на FreeBSD. Все вроде бы даже и работает, но возникает вполне закономерный вопрос - а как сделать так, чтобы пользователь не послал на проверку какую-нибудь чушь, которая убьет сервер, или же, например, не занялся читерством по типу доступа к ресурсам, к которым он не должен иметь этот самый доступ. \u003cbr /\u003e\u003cbr /\u003eПоскольку с такими задачами я ранее не сталкивался, то и решения данной проблемы у меня нет. \u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eВ голову приходят лишь некоторые идеи:\u003cbr /\u003e\u003cbr /\u003e \u003cbr /\u003e \u003cbr /\u003e1) Запуск решений под пользователем, не имеющим доступа к файловой системе, помимо чтения/записи инпута/аутпута.\u003cbr /\u003e2) Некий \u0026quot;анализатор\u0026quot; решений на различных языках, запускаемый после процесса компиляции с целью отстранить от тестирования решения, которые, например, вызывают определенные функции, неугодные нам. Возникает ощущение что это как-то не тру, из-за того что \u0026quot;за всем не углядишь\u0026quot; и \u0026quot;лениво для каждого языка писать свое\u0026quot;. \u003cbr /\u003e3) Каким-то образом отрубить библиотеки, которые, опять же, нам не нужны. В результате у нас не должно скомпилироваться.\u003cbr /\u003e4) По горячим следам найдена тема безопасности на Яве, заключающаяся в применении менеджера безопасности и настроек политики.\u003cbr /\u003e5) Проводить операции, касающиеся безопасности, не над исходником, а над непосредственно бинарником. Сюда может входить подмена адресов вызываемых функций или чего-то похожего.\u003cbr /\u003e\u003cbr /\u003e\u003cbr /\u003eБыло бы интересно узнать о стандартных подходах в такой ситуации среди Гуру. \u003d) Уверен, что многие из сидящих на этом сайте имели/имеют отношение к написанию проверяющих систем :)\u003cbr /\u003e\u003cbr /\u003eЗаранее спасибо!\u003c/div\u003e","tags":["безопасность","проверяющая система"]}}