{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1275983941,"rating":1,"authorHandle":"daftcoder","modificationTimeSeconds":1275989951,"id":441,"title":"ЕГЭ","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003eРаз уж я \u003ca href\u003d\"http://codeforces.ru/blog/entry/436#comment-6097\"\u003eначал\u003c/a\u003e разговор о ЕГЭ, ...\u003cbr /\u003eИтак, поговорим о вопросах Жизни, Вселенной и Всего Такого.\u003cbr /\u003e\u003cbr /\u003eПереписка двух людей в аське.\u003cbr /\u003eНики изменены, цензура применена:\u003cbr /\u003e \u003cbr /\u003e xxx\u003cbr /\u003eесли подумать - то процесс подготовки к ЕГЭ - это как раз придумывание, а уже потом натаскивание и тренировка на задания. В чем прелесть то - если уже один раз решал - потом не придётся изобретать велосипед, ибо ты его уже знаешь.\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eо_О\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eэто как с задачами про программированию. Идя на контест ты помнишь основные методы , а задачи - это просто ходы влево-вправо от основных вещей. Другой вопрос, если организаторы сделали сюрприз и добавили что то новенькое\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eнее, ты не жжошь\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eэто же убивает всю фантазию, весь интеллект\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eзадания наоборот должны быть разнообразными, ХОТЯ БЫ в части С\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eда ладно. Ты на ЕГЭ решишь всего 4 задания С (или скока там их). Вопрос - сколько задач тебе надо будет решить ДО этого, чтобы решить те. Неужели тренировка - это не в счёт? OO\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eИМХО ещё как в счёт.\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eтренировка в счёт, вопрос какая!\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eРешение задач :)\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eесли решение задач разных - да\u003cbr /\u003eесли натаскивание на типы задач - нет!\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eя могу написать прогу, которая сдаст ЕГЭ по математике на 100\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eи по физике\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eда и в проганье тоже самое на самом деле. Это просто дисперсия разная )\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eппц, ну да ладно\u003cbr /\u003eсчитай, что я этого не говорил\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eИМХО, если ты и так сообразительный - тебе ничего не покажется сложным )\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eДа.\u003cbr /\u003eНо если ты тупо натасканный, тебе всё должно показаться ОЧЕНЬ сложно. Должно! Но по факту не так.\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eТы реально вникни. Вся наша жизнь - это решение в большенстве однотипных задач. И в конце концов нас интересует РЕЗУЛЬТАТ, а не процесс. Представь, что было бы, если бы ты не использовал свой опыт каждый раз, когда решаешь задачу\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eТы немного путаешь понятия. ЕГЭ - это твой отчёт о навыках. РЕЗУЛЬТАТ подготовки. Решение задач для тренировки к ЕГЭ - это процесс, который занимает много времени, чтобы сдать ЕГЭ на отлично.\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eВсё как в жизни. Зачем усложнять себе жизнь постоянно.\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eТы и так вкалывал много раз. Должен ведь быть от этого толк\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eМне не симпатичен тот факт, когда человек начинает постоянно ботанствовать и усложнять свою жизнь только, чтобы показать что он такой крутой и может вывести любую формулу сам.\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eЗАЧЕМ тогда надо решать что то ДО этого?\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eЕсли он вывел формулу - он её понял, а не тупо вызубрил.\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003exxx, ты не прав.\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eЗубрить нужно ОБЖ и прочие важные науки.\u003cbr /\u003e\u003cbr /\u003e yyy\u003cbr /\u003eА точные науки надо понимать.\u003cbr /\u003e\u003cbr /\u003e xxx\u003cbr /\u003eТак никто не спорит!\u003cbr /\u003e...\u003cbr /\u003e\u003cbr /\u003eСвоё мнение озвучил \u003ca href\u003d\"http://codeforces.ru/blog/entry/441#comment-6114\"\u003eтут\u003c/a\u003e.\u003cbr /\u003eХочется услышать мнения сообщества по поводу ЕГЭ.\u003cbr /\u003eТех, кто писал раньше, писал только что, напишет в будущем.\u003cbr /\u003eТет, кто, возможно, готовил задания (если таковые имеются).\u003cbr /\u003e\u003cbr /\u003eСпасибо всем заранее.\u003c/div\u003e","tags":["егэ","образование","школа"]}}