{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1264717330,"rating":0,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1264746100,"id":1,"title":"What is Codeforces?","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003cdiv\u003e   \u003cimg src\u003d\"/predownloaded/6f/cb/6fcb7ddba0d5d427e558bfa0570ffdf734c6d488.png\" style\u003d\"float: left;margin: 1.0em;max-width: 100.0%;max-height: 100.0%;\" /\u003e   \u003cdiv\u003eI noticed long ago, that all the websites about computer     programming contests work on Web 1.0 principles. But the 21st     century has come, the 30th International Programming Contest took     place, and Google celebrated its 10th anniversary. Something has to     be done! As Software-as-a-Service is conquering the world, contests     administrators are still copying tests into judge systems. Something     has to be done!\u003c/div\u003e   \u003cdiv\u003e  \u003c/div\u003e   \u003cdiv\u003eCodeforces\u0027 aim is to offer you a convenient platform to     organize, run and discuss programming contests. It will be a bit of     a social network website, more than a news portal and more than an     online judge. Being absolutely independent from me, you will be able     to organize and run a contest. You will decide on your own if to     make it open to the whole world or if it will be a contest for your     University only. And if you\u0027re not interested in this, you might     discuss the news in the contest world - read/write blogs, discuss     topics, and support your dearest and nearest.\u003c/div\u003e   \u003cdiv\u003e \u003c/div\u003e   \u003cdiv\u003eMoreover, I plan to run regular contests according to new and     interesting rules. Closer to the end of February I will be able to     run the first beta-contests.\u003c/div\u003e   \u003cdiv\u003e \u003c/div\u003e   \u003cdiv\u003eBut it\u0027s about the future, and now I suggest to go to Harbin     together with the Saratov State University team. I will be writing a     blog about our trip. I hope it will be interesting.\u003c/div\u003e   \u003cdiv\u003e \u003c/div\u003e   \u003cdiv\u003eFor sure, you will find out, that many important features are     missing there. It\u0027s because we\u0027re still working on it. Be patient,     please. I will be glad to read your comments about what and how     should be done. I can\u0027t promise that I\u0027ll be working on the system     during the trip, but I\u0027ll go on working when we come back.\u003c/div\u003e   \u003cdiv\u003e     \u003cbr /\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e","tags":["graphs"]}}