{"status":"OK","result":{"originalLocale":"en","allowViewHistory":false,"creationTimeSeconds":1269896790,"rating":6,"authorHandle":"hadi","modificationTimeSeconds":1270002311,"id":228,"title":"Monty Hall Problem","locale":"en","content":"\u003cdiv class\u003d\"ttypography\"\u003eA good grasp of (discrete) probability is often necessary to do good at programming contests. Last year, while reading a book about the great mathematician \u003ca href\u003d\"http://en.wikipedia.org/wiki/Paul_Erd%C5%91s\"\u003ePaul Erd\u003c/a\u003e\u003cspan style\u003d\"visibility: visible;\"\u003e\u003cspan style\u003d\"visibility: visible;\"\u003e\u003ca href\u003d\"http://en.wikipedia.org/wiki/Paul_Erd%C5%91s\"\u003eős\u003c/a\u003e I read about a probability puzzle posed by \u003ca href\u003d\"http://en.wikipedia.org/wiki/Marilyn_vos_Savant\"\u003eMarylin vos Savant\u003c/a\u003e in a magazine. The puzzle is:\u003cbr /\u003e\u003cbr /\u003e\u0026quot;\u003c/span\u003e\u003c/span\u003e\u003ci\u003eSuppose you\u0027re on a game show, and you\u0027re given the choice of three  doors: Behind one door is a car; behind the others, goats. You pick a  door, say No. 1, and the host, who knows what\u0027s behind the doors, opens  another door, say No. 3, which has a goat. He then says to you, \u0026quot;Do you  want to pick door No. 2?\u0026quot; Is it to your advantage to switch your choice?\u003c/i\u003e\u0026quot;\u003cbr /\u003e\u003cbr /\u003e\u003cb\u003eUPD.\u003c/b\u003e The above statement has some errors. See SkidanovAlex\u0027s comments.\u003cbr /\u003e \u003cbr /\u003eWell, apparently my probability skills weren\u0027t good enough as I answered it incorrectly :-) But probably it\u0027s not something to worry about, as many PhD\u0027s and mathematicians didn\u0027t answer it correctly, and weren\u0027t convinced when they heard the correct answer.\u003cbr /\u003e\u003cbr /\u003eDo you think you know the answer? Check the correct answer at \u003ca href\u003d\"http://en.wikipedia.org/wiki/Monty_Hall_problem\"\u003ethe wikipedia entry for this problem\u003c/a\u003e.\u003cbr /\u003e\u003cbr /\u003eI also heard about the problem previously from my friend, \u003ca href\u003d\"http://yaserzt.com/blog/\"\u003eYaser Zhian\u003c/a\u003e. But I thought he was wrong when he tried to convince me.\u003cbr /\u003e\u003cbr /\u003eI asked this puzzle from some friends, and only one of them answered it correctly: \u003ca href\u003d\"http://sarrafi.org/\"\u003emy smart friend, Arman Sarrafi\u003c/a\u003e.\u003c/div\u003e","tags":["probability","puzzle"]}}