{"status":"OK","result":{"originalLocale":"ru","allowViewHistory":false,"creationTimeSeconds":1276672834,"rating":1,"authorHandle":"MikeMirzayanov","modificationTimeSeconds":1276673994,"id":461,"title":"Летняя школа СГУ \u0026quot;Сазанка 2010\u0026quot; - 2","locale":"ru","content":"\u003cdiv class\u003d\"ttypography\"\u003e\u003ch1\u003eЛетняя студенческая школа по программированию\u003c/h1\u003e \u003ch2\u003eВторое информационное сообщение\u003c/h2\u003e \u003cp\u003e За период предварительной регистрации мы получили большое количество заявок. Спасибо за проявленный интерес.  Мы очень рады, что школа находит свою аудиторию. \u003c/p\u003e \u003cp\u003e С другой стороны, так как количество заявок в три раза превышает наши возможности по размещению, мы не в состоянии пригласить всех желающих. При составлении списков участников летней школы были учтены различные критерии: соответствие уровня команды учебной программе, возраст членов команды, география и др. Заметим, что мы смогли увеличить число приглашенных участников по сравнению с прошлым годом. Мы очень надеемся, что школа станет традиционной, расширится, и в будущем мы сможем приглашать большее число участников. \u003c/p\u003e \u003cp\u003e Приглашенные команды: \u003c/p\u003e\u003cul\u003e \u003cli\u003e          Петрозаводский ГУ (Басунков, Федулин, Филиппов) \u003c/li\u003e\u003cli\u003e          МГТУ им. Баумана (Верхоглядов, Акользин, Егурнов) \u003c/li\u003e\u003cli\u003e          МФТИ (состав уточняется) \u003c/li\u003e\u003cli\u003e          МАИ (Зернин, Колесник, Кирилишин) \u003c/li\u003e\u003cli\u003e          СпбГУ (Карпов, Соколов, Ненашев) \u003c/li\u003e\u003cli\u003e          Пермский ГУ (Акимов, Шафер, Ошеров) \u003c/li\u003e\u003cli\u003e          Московский ГУ (Золотов, Броварь, Таболин) \u003c/li\u003e\u003cli\u003e          Российско-Армянский (славянский) ГУ (состав уточняется) \u003c/li\u003e\u003cli\u003e          Ярославский ГУ (Делюкин, Быкова, Нефедов) \u003c/li\u003e\u003c/ul\u003e    \u003cp\u003e Индивидуальные участники: \u003c/p\u003e\u003cul\u003e \u003cli\u003e          Астраханский ГУ (Горбачев) \u003c/li\u003e\u003cli\u003e          УрГУ (Мухаметьянов) \u003c/li\u003e\u003cli\u003e          СпбГУ (Белоус) \u003c/li\u003e\u003cli\u003e          Ковровская ГТА (Фомин) \u003c/li\u003e\u003cli\u003e          Тюменский ГУ (Красноперов) \u003c/li\u003e\u003cli\u003e          ИжГТУ (Гатин) \u003c/li\u003e\u003c/ul\u003e  \u003cp\u003e Руководители (тренера) вышеперечисленных команд и участников должны подтвердить приглашение \u003cb\u003eдо 26 июня\u003c/b\u003e по электронной  почте \u003cimg src\u003d\"http://acm.sgu.ru/sazanka-2010/mirzayanovmr-email.png\" style\u003d\"max-width: 100.0%;max-height: 100.0%;\" /\u003e \u003c/p\u003e \u003cp\u003e Если планируется безналичный перевод, то пришлите запрос на оформление счета. В случае если какая-либо команда (участник) не пришлет подтверждения, то она будет заменена в списке другой командой. Как только будут готовы дополнительные документы (договор, акт выполненных работ), мы опубликуем их на сайте. \u003c/p\u003e  \u003cp\u003e Руководитель Центра олимпиадной подготовки программистов\u003cbr /\u003e Саратовского государственного университета,\u003cbr /\u003e тренер команд.\u003cbr /\u003e М.Р. Мирзаянов,\u003cbr /\u003e 16 июня 2010 г. \u003c/p\u003e  \u003cp\u003e P.S. Так как количество заявок в несколько раз превышает количество участников, то нами решалась сложная задача утверждения состава школы. Были учтены различные критерии, о которых написано выше. Просьба подойти с пониманием и не поднимать дискуссий по этому вопросу. Спасибо. \u003c/p\u003e\u003c/div\u003e","tags":["летняя школа","сазанка","саратов"]}}